[{"date": "2023-09-25T23:51:43+00:00", "title": "Nvidia outperforms amidst AI hype, Microsoft faces challenges", "content": "In the wake of artificial intelligence (AI) leading stock market trends this year, businesses continue to establish infrastructures to accommodate large language models and other AI processes. Nvidia (NASDAQ:NVDA), a renowned chip manufacturer, has surpassed Wall Street's expectations in its last two earnings reports, experiencing significant sales growth due to generative AI. The company's revenue has seen an unprecedented surge from negative growth in the first quarter to a 101% increase. This growth exceeds its peak during the crypto boom, with even higher revenue expected in the third quarter of 2023.\n\nHowever, there are indications that the narrative of AI leading stock market trends may be overinflated. One such indication is the fluctuating traffic on ChatGPT, an AI chatbot that sparked interest in generative AI. Although traffic seems to be recovering now that schools have reopened, the platform experienced a drop in usage during the summer, suggesting its popularity was driven primarily by students seeking homework assistance.\n\nSpeculation is also circulating that Microsoft (NASDAQ:MSFT) is reducing orders for Nvidia H100 AI chips due to slowing traffic on ChatGPT and less-than-anticipated interest in Microsoft 365 Copilot. These rumors remain unverified but suggest that the enthusiasm surrounding AI might be exaggerated.\n\nMicrosoft, which invested $13 billion in OpenAI—the creator of ChatGPT—may now be facing challenges. CEO Satya Nadella previously fueled excitement around generative AI, claiming it would revolutionize search engines. However, since launching its ChatGPT-powered version of Bing, there has been little change in search engine dynamics. Google (NASDAQ:GOOGL) continues to dominate the market and generate substantial profits.\n\nInvestors are cautioned to temper their expectations surrounding AI. While AI's potential is undeniable, the widespread adoption of these new tools will take time. For instance, the internet and smartphones took several years to become mainstream. Investors are advised to avoid overhype in the AI sector, focusing instead on diversification, value consideration, and patience. While there could be many significant winners in the AI industry, it will likely take years for these gains to materialize.\n\nStory continues\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.\n\nRelated Articles\n\nNvidia outperforms amidst AI hype, Microsoft faces challenges\n\nChina's e-commerce discount race to the bottom puts incumbents under pressure\n\nFord says 'significant gaps' remain in UAW labor contract talks", "link": "https://finance.yahoo.com/news/nvidia-outperforms-amidst-ai-hype-235143566.html", "symbols": ["GOOGL.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.039, "neu": 0.832, "pos": 0.129}}, {"date": "2023-09-25T22:00:19+00:00", "title": "Interest Rates Were Held Steady Last Week: Here Are 3 Stocks to Buy Now", "content": "Feeling Fed fatigue? In the last year, stocks have been highly reactive to the Federal Reserve’s monetary policy shifts, which have overshadowed other economic factors. For many in the financial markets, the resulting volatility caused a fair share of ulcers that investors may be looking forward to moving past.\n\nWith the Fed’s decision last week to hold rates steady, it appears there’s now some clarity around where interest rates will be for some time. Assuming nothing big breaks (many thought the regional banking crisis was it last year), investors have to gauge how to play the market. And if something does break, which stocks won’t break investors’ bank accounts?\n\nHere are three stocks to buy that I think fit the profile, given these recent developments.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nNvidia (NVDA) Nvidia corporation (NVDA) logo displayed on smartphone with stock market chart background. Nvidia is a global leader in artificial intelligence hardware.\n\nSource: Evolf / Shutterstock.com\n\nNvidia (NASDAQ:NVDA) achieved record data center revenue, surging 171% year-over-year, driven by strong demand from major tech giants for its high-performance chips.\n\nDespite recent stock pullbacks, concerns of fading AI enthusiasm, and potential short-term weakness, NVDA might rally again. AI’s future impact, as per sell-side predictions, could significantly boost NVDA’s profits in the coming years, making it a key chip stock. TradeSmith’s volatility index for NVDA stands at 45.51%, indicating high risk.\n\nNvidia’s technology finds practical applications, like WPP’s content engine using Nvidia Omniverse and the partnership with Snowflake for chatbot and data tasks. As cloud providers upgrade for AI and accelerated computing, Nvidia’s cost-effective and efficient solutions make it a valuable AI stock.\n\nThis isn’t a cheap stock by any means. But for those seeking to invest before interest rates potentially come down again (likely next year), NVDA stock is at least one to keep on the radar.\n\nJPMorgan Chase (JPM) Chase Bank logo and storefront\n\nSource: Daryl L / Shutterstock.com\n\nJPMorgan Chase (NYSE:JPM), a banking titan, boasts a year-to-date return of roughly 7%, solidifying its status as a top financial services stock. In Q2 2023, the company reported a remarkable net income of $14.5 billion, surpassing market forecasts, with diluted earnings per share at $4.75.\n\nStory continues\n\nThe bank’s net income margin stood at an impressive 35%, well above its usual 25%. Zacks awarded JPM stock a top “Momentum Style Score of A,” and in Q2, it attracted significant institutional interest, with 1,808 institutions increasing their stakes and 1,641 reducing theirs. Despite these positive factors, its forward price-earnings ratio remains low at 10-times.\n\nAdditionally, JPMorgan has found a way to capitalize on regional bank vulnerabilities, particularly related to 2025 commercial mortgage maturities that may trigger defaults. That has rightly prompted investors to put their capital to work in top-tier institutions like JPMorgan.\n\nLithium Americas (LAC) smartphone with logo of Canadian company Lithium Americas Corp on screen\n\nSource: Wirestock Creators / Shutterstock.com\n\nLithium Americas (NYSE:LAC) presents a hidden gem in the growth stock universe despite a 31% dip over the last year.\n\nLAC, indirectly tied to the electric vehicle (EV) industry, is set to unlock value by splitting its U.S. and Argentina businesses. The Thacker Pass project and a major lithium discovery in Oregon-Nevada border volcanoes offer substantial cash flow potential.\n\nThe drop is mainly linked to short-term lithium price fluctuations. However, this offers a prime chance to invest, as LAC stock is positioned for significant gains. The company’s split into two entities is approved and could unlock value soon.\n\nFor those bullish on the potential for commodity prices to rise (as the U.S. dollar potentially declines when interest rates peak), this is an intriguing play. At its current valuation, I think LAC stock is among the best ways to play the long-term secular bull trends in the EV market.\n\nOn the date of publication, Chris MacDonald did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nChris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post Interest Rates Were Held Steady Last Week: Here Are 3 Stocks to Buy Now appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/interest-rates-were-held-steady-220019772.html", "symbols": ["JPM.US", "LAC.US", "NVDA.US", "WUC1.F"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.027, "neu": 0.83, "pos": 0.143}}, {"date": "2023-09-25T21:06:17+00:00", "title": "Getty Images partnering with Nvidia over AI image generator", "content": "Getty Images (GETY) will be partnering with chipmaker Nvidia (NVDA) to build out its own AI-powered image generator. Yahoo Finance's Diane King Hall, Josh Schafer, and Pras Subramanian take a look back on Getty's lawsuit against AI art generator Stability AI and what the stock image supplier's pivot in the artificial intelligence space could mean.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/getty-images-partnering-nvidia-over-210617702.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0.025, "neu": 0.935, "pos": 0.04}}, {"date": "2023-09-25T20:05:00+00:00", "title": "Should You Buy the Dip in AI Stocks &amp; ETFs?", "content": "(1:30) - Will Arm Holdings PLC Be A Significant Player In AI? (4:35) - Breaking Down Nvidia and AMD’s Impact On The AI Industry (9:00) - Do Semiconductors Have Even More Upside For Investors? (11:00) - Are Software Stocks The Next Big Play Into The AI Industry? (14:00) - Spear Alpha ETF: SPRX (21:50) - Episode Roundup: NVDA, AMD, ZS, S, SNOW, MRVVL, ARM Podcast@Zacks.com\n\nIn this episode of ETF Spotlight, I speak with Ivana Delevska, Founder and CIO of Spear Invest, about investing in AI and other innovative technologies, and the Spear Alpha ETF SPRX, one of the best-performing actively managed ETFs this year.\n\nInvestors continue to seek AI-exposed companies beyond NVIDIA NVDA, which is already up about 200% this year. SPRX invests in companies benefiting from AI, Enterprise Digitalization, Automation, and Robotics.\n\nThere was a lot of hype surrounding Arm's ARM IPO, primarily due to its positioning as an AI play and its partnership with NVIDIA. The shares of the British chip designer surged on debut but have since fallen and are now trading close to the IPO price.\n\nNVIDIA remains a top holding in SPRX because Ivana believes that the initial surge was driven by oversold conditions and hype. As we progress further into the cycle, the world's most valuable chipmaker has the earnings power to sustain the hype.\n\nZscaler ZS should be able to maintain a 30%+ topline growth rate for the next decade, as its products are in the early stages of adoption, according to Spear. Enterprise spending experienced a downturn but is beginning to bottom out.\n\nIvana also likes AMD AMD, SnowflakeSNOW and Marvell MRVL.  Tune in to the podcast to learn more.\n\nMake sure to be on the lookout for the next edition of ETF Spotlight and also make sure to subscribe! If you have any comments or questions, please email podcast@zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nStory continues\n\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nARM Holdings PLC Sponsored ADR (ARM): Free Stock Analysis Report\n\nMarvell Technology, Inc. (MRVL) : Free Stock Analysis Report\n\nSnowflake Inc. (SNOW) : Free Stock Analysis Report\n\nZscaler, Inc. (ZS) : Free Stock Analysis Report\n\nSpear Alpha ETF (SPRX): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/buy-dip-ai-stocks-etfs-200500097.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.007, "neu": 0.825, "pos": 0.168}}, {"date": "2023-09-25T18:48:00+00:00", "title": "What AMD, Intel, and Nvidia Stock Investors Should Know About Recent AI Updates", "content": "Advanced Micro Devices continues to make advances in its most profitable segment, the embedded market.\n\nContinue reading", "link": "https://finance.yahoo.com/m/b87e597b-147c-3412-9946-05644110f5e3/what-amd%2C-intel%2C-and-nvidia.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.633, "neg": 0, "neu": 0.744, "pos": 0.256}}, {"date": "2023-09-25T16:50:00+00:00", "title": "This Growth Stock Could 10X in 10 Years", "content": "This red-hot stock has been a big winner over the past decade with an eye-popping jump of more than 100x.\n\nContinue reading", "link": "https://finance.yahoo.com/m/b527afaf-8d59-3854-9950-230beff7f59e/this-growth-stock-could-10x.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.586, "neg": 0, "neu": 0.84, "pos": 0.16}}, {"date": "2023-09-25T16:30:00+00:00", "title": "Microsoft Could Be Making a Big Change and AI Investors Aren't Going To Like It", "content": "Artificial intelligence (AI) has dominated the narrative in the stock market this year. It's a big reason why stocks have rebounded even as interest rates have moved higher, and why the Nasdaq Composite is up 27% this year. ChatGPT, the AI chatbot that kicked off the frenzy around generative AI, saw traffic decline this summer, a sign that a significant percentage of its usage came from students looking for homework help.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d970bc1b-07a0-327c-9bd2-01cbe3abe2d1/microsoft-could-be-making-a.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.807, "neg": 0.03, "neu": 0.834, "pos": 0.136}}, {"date": "2023-09-25T14:02:38+00:00", "title": "September’s 7 Most Controversial AI Stocks: Buy or Bail?", "content": "AI stocks are controversial for multiple reasons. One of the most obvious factors is that AI poses a threat in many ways. It threatens the job security of various jobs, poses a potential challenge to human intelligence, and presents many other issues. So, it’s certainly bound to cause controversy and spark interesting discussions.\n\nHowever, the AI stocks discussed here are also controversial because investors are beginning to question their valuations. The markets collectively pause to digest the massive run-up and value increases this year. Thus, much of the controversy simply refers to whether a given share is likely to be readjusted downward. Let’s look at those angles.\n\nSymbiotic (SYM)  AI stocks to buy now, Graphic of letters \"AI\" in bold font surrounded by circle of tech symbols in purple and blue against a dark background. ai stocks to buy\n\nSource: shutterstock.com/Tex vector\n\nSymbiotic (NASDAQ:SYM) is an automation firm that leverages AI and robotics to rebuild the traditional warehouse. From the human-centered perspective, it is very easy to see why it is a controversial company and stock. AI clearly threatens the livelihood of workers who engage in warehouse work, and few things are as controversial as that.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nOf course, Wall Street is less interested in that consideration and more interested in the value of the shares. I fully expect that Symbiotic continue to experience a correction through September. Investors are less interested in notions like that Walmart (NYSE:WMT) is invested in the company and more interested in bare financial truths.\n\nThe company has experienced tremendous growth – 77% in Q2 – but that is slowing. The company firm gave guidance that its top-line results should be flat between Q2 and Q3. That’s not the same as year-over-year growth, but it still matters. Further, Symbiotic’s losses nearly doubled in H1, reaching $162 million. Economic reality is meeting the AI hype, and Symbiotic’s price-to-book ratio is a great indicator for those looking to get into the pure numerical arguments against buying it.\n\nStory continues\n\nPalantir (PLTR) Palantir Technologies (PLTR) logo seen on billboard, known as Palantir is a public American company that specializes in big data analytics.\n\nSource: Poetra.RH / Shutterstock.com\n\nInvesting in Palantir (NYSE:PLTR) stock means putting one’s capital behind a firm that is heavily involved in data analytics and the U.S. Defense sector. Volumes upon volumes of books, text, conversation, and more have centered on that topic and will undoubtedly continue to spark controversy. Add AI to the mix, and it becomes much more so.\n\nAgain, though, we’re more interested in the valuation controversy regarding Palantir than anything else. I don’t think Palantir will fall below $14 anytime soon. That’s roughly the level at which Wall Street has pegged its share value. However, shares have risen just above that level based on excitement around AI. In this case, though, the excitement was warranted. Palantir reported its third consecutive quarter of GAAP net income-based profitability. AI has helped it get to that point.\n\nBecause of that, I don’t expect investors to pull their capital out of Palantir in droves. It may have received attention due to its AI presence, but its raw fundamental strengths also substantiate it as a business. Don’t invest if you have qualms about it’s business; that’s fine. However, it isn’t overvalued by much, if at all.\n\nBroadcom (AVGO) broadcom (AVGO) logo outside office building\n\nSource: Sasima / Shutterstock.com\n\nBroadcom (NASDAQ:AVGO) is a chip stock, which makes it inherently interesting in 2023. Anything and everything related to AI has received attention, with many shares growing rapidly. Broadcom has grown as well, rocketing from $550 to $850 year-to-date.\n\nMost of those gains occurred in late May when Nvidia announced it was on track to reach $11 billion in revenues. Broadcom provides software to the semiconductor industry, which boomed on the secular opportunity.\n\nBuy Broadcom. For one, it isn’t overpriced based on its price-to-earnings ratio over the past decade. It’s also a highly profitable firm in a highly booming industry with stable fundamentals. Broadcom isn’t going to blow investors away with skyrocketing sales. Instead, it will steadily grow while providing substantial dividend income and rewarding shareholders through buybacks. It looks like Broadcom will succeed in its bid for VMWare (NYSE:VMW), which should only make it stronger and more attractive.\n\nNvidia (NVDA) Nvidia corporation (NVDA) logo displayed on smartphone with stock market chart background. Nvidia is a global leader in artificial intelligence hardware.\n\nSource: Evolf / Shutterstock.com\n\nThe story of Nvidia (NASDAQ:NVDA) stock and its success in 2023 has been told and retold many times. I won’t bore you with a retelling of it. Instead, I’ll jump directly into my thoughts about its price over the next month or so.\n\nNvidia won’t be trading at levels lower than $450 in a month. Yes, Nvidia shares have faced a correction through the first few weeks of September. That’s undeniable. However, investors should ask themselves what has precipitated that correction. It’s certainly not results. The number $13.5 billion says more than I ever could in a few paragraphs concerning its results. The firm has only exceeded expectations.\n\nInstead, the correction has been triggered by the fear that Nvidia, as the leader, has become massively overpriced. It isn’t. Nvidia’s current price-to-earnings ratio is nowhere near as high as it has been at previous peaks during the past decade. Investors can’t reasonably argue that Nvidia was more promising in the past than it is now.\n\nC3.ai (AI) AI stocks an intelligent robot figure representing ai stocks, investing for the next decade. Artificial Intelligence Stocks\n\nSource: Shutterstock\n\nOn the other hand, investors should expect C3.ai (NYSE:AI) stock to continue to fall. The enterprise AI firm has been one of the greatest beneficiaries of AI’s emergence in 2023.\n\nHowever, all of the capital that flowed into the firm would have been better placed elsewhere. In other words, don’t expect the current capital outflows to stop anytime soon.\n\nInvestors should not buy C3.ai right now because The company isn’t going to achieve what it previously said it would. The company withdrew previous guidance that it would reach profitability by the end of the year.\n\nInstead, C3.ai is investing cash toward lead generation and sales efforts. The company is right to note that a great opportunity lies ahead regarding enterprise AI applications. It is forging ahead and seeking to plant its flag in that fertile ground. However, it will still be viewed as overpriced, given that the prospect of profitability has been removed for 2023.\n\nMicrosoft (MSFT) ChatGPT logo seen on the smartphone, Microsoft (MSFT) logo seen on the laptop. Microsoft Copilot\n\nSource: Ascannio / Shutterstock.com\n\nDon’t expect Microsoft (NASDAQ:MSFT) stock to suffer in September even as headlines of daily tech sell-offs continue. Even if shares fall below some arbitrary figure, say $320, they will only go up over time.\n\nMicrosoft is on track to grow by roughly 10% this year and then approximately 15% next year. The latter figure is near the firm’s most recent 3-year revenue growth figures. Thus, it’s reasonable to expect that the Microsft of today will continue to be the Microsoft of tomorrow: A strong stock overall.\n\nMicrosoft grew by 8% in the most recent reporting period. That aligns with the growth I referred to for this year overall. Additionally, the firm’s net income is improving faster than top-line results. The 21% increase in net income suggests strong management. A million things could be written about Microsoft, and most of them point to the idea that it is only getting better as time goes on.\n\nAlphabet (GOOG, GOOGL) Alphabet Inc. (GOOG, GOOGL) and Google logos seen displayed on a smartphone\n\nSource: IgorGolovniov / Shutterstock.com\n\nBig-tech stocks like Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL) will always remain controversial. Most of that controversy stems from Google’s collection of data and the use thereof. Much has been written about it, and more will come. I don’t expect much to change. The company tracks you and me, gets fined nearly $400 million, and continues its business.\n\nLet’s be realistic. It’s a bump in the road, a hiccup, and ultimately, a penalty that the firm would rather avoid. That said, Google is very much willing to pay that fine again and again. The value of that data far outstrips the cost of the penalty. If it didn’t, this wouldn’t happen over and over. Don’t be surprised when the next scandal arises concerning Google’s data collection practices and the application of AI to that data.\n\nAm I saying I know of anything concrete in that regard? No. I’m simply connecting the dots. As an investment, GOOG stock is extraordinarily solid. Realistically, it’s only going to lose value for a long time if a monumental anti-monopoly case emerges. That too is unlikely, given how important the firm is economically.\n\nOn the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nAlex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post September’s 7 Most Controversial AI Stocks: Buy or Bail? appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/september-7-most-controversial-ai-140238230.html", "symbols": ["AI.US", "AVGO.US", "AVGO34.SA", "MSFT.US", "NVDA.US", "PLTR.US", "PTX.F", "SYM.US", "VMW.US", "WMT.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.042, "neu": 0.812, "pos": 0.146}}, {"date": "2023-09-25T13:57:08+00:00", "title": "Citi strategists highlight growth stocks amid rising bond yields", "content": "Monday's market saw the Russell 1000 Growth Index, which includes high-growth companies such as Microsoft (NASDAQ:MSFT) and Nvidia (NASDAQ:NVDA), continue a recent trend of decline. The index has experienced a 6% decrease from its peak in late July. Despite this, the index has managed to maintain a year-to-date gain of 24%, driven by investor interest in artificial intelligence and increased earnings estimates.\n\nThe dip in growth stocks is partly attributable to rising bond yields. The 10-year Treasury yield has been on an upward trajectory, reducing the value of future profits. This trend is particularly significant for growth companies whose valuation often hinges on profits expected to be realized in future years.\n\nHowever, if bond yields cease to rise, some growth stocks could appear increasingly attractive. A halt in yield increases might stabilize valuations and potentially lead to stock price increases over time.\n\nCiti's strategists have identified several such growth stocks that have become more appealing during the recent downturn. They selected stocks that have fallen more than 10% from their annual highs and whose free-cash-flow estimates have been raised by analysts since the end of March. Furthermore, these companies need to have five-year free-cash-flow estimates exceeding their current implied market capitalizations. This could suggest that these companies' cash flow potentials are being undervalued by investors.\n\nAmong the identified stocks are Paycom (NYSE:PAYC) Software, MongoDB (NASDAQ:MDB), Rockwell Automation (NYSE:ROK), Las Vegas Sands (NYSE:LVS), Bruker (NASDAQ:BRKR), DraftKings (NASDAQ:DKNG), and Lockheed Martin (NYSE:LMT). Lam Research (NASDAQ:LRCX), a provider of equipment for chip manufacturers, also emerged as a promising option. Its stock has dropped 14% from its annual high, but its free-cash-flow estimates have surged almost 24% since March. This is largely due to an anticipated increase in demand for chip manufacturing equipment as artificial intelligence needs grow within the cloud business sector.\n\nStory continues\n\nPinterest (NYSE:PINS) also caught strategists' attention. Despite a 12% decrease from its annual peak, Pinterest's free-cash-flow estimates have risen slightly since March. While advertising spending has slowed, the social media platform expects sales growth of nearly 20% per year as it monetizes its overseas user base, which could lead to significant profit margin expansion.\n\nOther promising stocks include Intuitive Surgical (NASDAQ:ISRG), whose share price has fallen 18% from its annual high due to concerns over new weight-loss drugs potentially reducing the need for bariatric surgeries. However, the company has stated that these surgeries only contribute a small percentage of its total revenue.\n\nChipotle Mexican Grill (NYSE:CMG) also made the list, with its stock down about 13% from its annual high. Despite this, free-cash-flow estimates have risen around 8% since March. The fast-food chain has consistently exceeded profit forecasts and is expected to maintain annual sales growth in the low teens, reaching over $14 billion by 2026.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.\n\nRelated Articles\n\nCiti strategists highlight growth stocks amid rising bond yields\n\nExplainer-Is the Hollywood writers' strike over?\n\nConservative activist uses Civil War-era law to challenge US corporate diversity", "link": "https://finance.yahoo.com/news/citi-strategists-highlight-growth-stocks-135708360.html", "symbols": ["BRKR.US", "CMG.US", "DKNG.US", "ISRG.US", "IUI1.F", "LMT.US", "LRCX.US", "LVS.US", "MDB.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.02, "neu": 0.846, "pos": 0.134}}, {"date": "2023-09-25T13:40:08+00:00", "title": "Is NVIDIA (NVDA) Stock Outpacing Its Computer and Technology Peers This Year?", "content": "The Computer and Technology group has plenty of great stocks, but investors should always be looking for companies that are outperforming their peers. Is Nvidia (NVDA) one of those stocks right now? Let's take a closer look at the stock's year-to-date performance to find out.\n\nNvidia is one of 633 individual stocks in the Computer and Technology sector. Collectively, these companies sit at #9 in the Zacks Sector Rank. The Zacks Sector Rank includes 16 different groups and is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors.\n\nThe Zacks Rank emphasizes earnings estimates and estimate revisions to find stocks with improving earnings outlooks. This system has a long record of success, and these stocks tend to be on track to beat the market over the next one to three months. Nvidia is currently sporting a Zacks Rank of #1 (Strong Buy).\n\nOver the past three months, the Zacks Consensus Estimate for NVDA's full-year earnings has moved 45.6% higher. This means that analyst sentiment is stronger and the stock's earnings outlook is improving.\n\nOur latest available data shows that NVDA has returned about 184.7% since the start of the calendar year. At the same time, Computer and Technology stocks have gained an average of 33.2%. As we can see, Nvidia is performing better than its sector in the calendar year.\n\nPalo Alto Networks (PANW) is another Computer and Technology stock that has outperformed the sector so far this year. Since the beginning of the year, the stock has returned 63.8%.\n\nIn Palo Alto Networks' case, the consensus EPS estimate for the current year increased 37.1% over the past three months. The stock currently has a Zacks Rank #2 (Buy).\n\nLooking more specifically, Nvidia belongs to the Semiconductor - General industry, a group that includes 8 individual stocks and currently sits at #84 in the Zacks Industry Rank. This group has gained an average of 106.8% so far this year, so NVDA is performing better in this area.\n\nStory continues\n\nIn contrast, Palo Alto Networks falls under the Internet - Software industry. Currently, this industry has 148 stocks and is ranked #84. Since the beginning of the year, the industry has moved +44.1%.\n\nInvestors with an interest in Computer and Technology stocks should continue to track Nvidia and Palo Alto Networks. These stocks will be looking to continue their solid performance.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nPalo Alto Networks, Inc. (PANW) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/nvidia-nvda-stock-outpacing-computer-134008092.html", "symbols": ["5AP.F", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.011, "neu": 0.861, "pos": 0.128}}, {"date": "2023-09-25T13:33:00+00:00", "title": "5 Tech Stocks That More Than Doubled in the First Nine Months", "content": "Technology has turned out to be the most profitable sector so far this year, driven by the artificial intelligence (AI) boom, easing inflation and a surge in “magnificent seven.” Bets that the Fed will soon end its tightening policy have also driven the sector higher. However, the hopes faded in recent months with the expectation of higher rates for longer than expected, pushing the sector down.\r\n\r\nThe decline seems short-lived per Wedbush analyst Dan Ives who believes that the technology sector is poised to weather a prolonged phase of increased interest rates. Ives eyes the \"biggest tech revolution in 30 years\" on the horizon, with the new tech bull market kicking off.\r\n\r\nAmid this, we have highlighted five stocks that have been leading the sector higher so far this year. Most interestingly, these stocks have a solid Zacks Rank #1 (Strong Buy) or 2 (Buy), suggesting their outperformance in the month ahead as well. These are Applied Optoelectronics, Inc. AAOI, Arlo Technologies, Inc. ARLO, Super Micro Computer, Inc. SMCI, Nvidia NVDA and Vertiv Holdings Co VRT. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nThe AI mania will continue to accelerate and provide a boost to tech stocks. The global digital shift has enhanced e-commerce for everything, ranging from remote working to entertainment and shopping, thereby bolstering strength in the sector. The rapid adoption of cloud computing, big data, the Internet of Things, wearables, VR headsets, drones, virtual reality, machine learning, digital communication, blockchain and 5G technology should continue to fuel a rally.\r\n\r\nAdditionally, any prospective reductions in interest rates – with the market forecasting at least two for the next year – coupled with the ongoing rise of AI will act as a major tailwind. Higher spending across software, semiconductors and digital media consumer sectors will further provide a boost to the sector.\r\n\r\nFurther, the tech titans have strong balance sheets, durable revenue streams and robust profit margins, making them attractive investments. They are better positioned to withstand a possible economic downturn and have demonstrated improved cost discipline.\r\n\r\nWe have profiled the stocks below:\r\n\r\nApplied Optoelectronics designs, develops and manufactures advanced optical devices, packaged optical components, optical subsystems, laser transmitters and fiber optic transceivers. With a market cap of $318.9 million, the stock has skyrocketed 407%.\r\n\r\nApplied Optoelectronics has an estimated earnings growth rate of 48.51% for this year. It has a Zacks Rank #2 and a Growth Score of A.\r\n\r\nArlo Technologies' product design, wireless connectivity, cloud infrastructure and cutting-edge AI capabilities focus on delivering a seamless, smart home experience. It has an estimated earnings growth of 428.6% for this year and has a market cap of $955.6 million. The stock has surged more than 189%\r\n\r\nArlo Technologies has a Zacks Rank #2 and a Growth Score of A.\r\n\r\nSuper Micro designs, develops, manufactures and sells energy-efficient, application-optimized server solutions based on the x86 architecture. With a market cap of $12.5 billion, the company has an estimated earnings growth of 31.6% for the fiscal year ending June 2024.\r\n\r\nSuper Micro has risen 187% and has a Zacks Rank #1.\r\n\r\nNvidia is the worldwide leader in visual computing technologies and the inventor of graphic processing unit or GPU. The stock has jumped nearly 185% so far this year. It has an estimated growth of 219.5% for the fiscal year ending January 2024.\r\n\r\nNvidia has a Zacks Rank #1 and a Growth Score of A.\r\n\r\nVertiv Holdings provides digital infrastructure and continuity solutions. It offers hardware, software, analytics and ongoing services. It has an estimated earnings growth of 200% for this year and a market cap of $13.9 billion.\r\n\r\nThis Zacks Rank #1 stock is up nearly 167% so far this year and has a Growth Score of B.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nSuper Micro Computer, Inc. (SMCI) : Free Stock Analysis Report\n\nApplied Optoelectronics, Inc. (AAOI) : Free Stock Analysis Report\n\nArlo Technologies, Inc. (ARLO) : Free Stock Analysis Report\n\nVertiv Holdings Co. (VRT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/5-tech-stocks-more-doubled-133300088.html", "symbols": ["2VI.F", "ARLO.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "VRT.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0, "neu": 0.835, "pos": 0.165}}, {"date": "2023-09-25T13:00:04+00:00", "title": "3 High-Quality Stocks to Buy on the Dip According to AI", "content": "This article is an excerpt from the InvestorPlace Digest newsletter. To get news like this delivered straight to your inbox, click here.\n\nThe timpani, surprisingly, is one of the most challenging orchestral instruments to play. Though these kettle drums seem as straightforward as hitting a piñata, the 140-pound vessels are actually the heart of most orchestral pieces.\n\nWith their perfect sense of timing, top percussionists can guide an entire orchestra, even without a conductor on stage. Their rhythm drives the entire ensemble forward.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nBut get the timing wrong, and even the New York Philharmonic can sound like an amateur band. There’s a reason why the highest-paid non-principal musician in the Boston Symphony Orchestra, in 2018 at least, was a timpanist.\n\nThe same is true for investing in blue-chip stocks. These dependable companies seem almost magical to portfolios; $1,000 invested in Home Depot (NYSE:HD) in 1990 would be worth almost $2 million today. But buying at the wrong moment can be a minor disaster. A company like Home Depot might only return 5% or 15% per year, so market corrections can take years to recover from. Home Depot itself took over 10 years to dig out of a 60% share decline in 2000.\n\nJust like playing the drums, timing is everything when it comes to buying blue-chip stocks.\n\nNowhere is this clearer than in stocks today. This year, the Dow Jones Industrial Average, an index of conservative U.S. companies, has risen just 4.2%, underperforming the Nasdaq Composite index’s 30.2% return by an enormous margin.\n\nEven worse, many of the Dow Jones’ constituents have seen shares fall, just as the U.S. economy surges ahead. Investors see high-growth stocks like Nvidia (NASDAQ:NVDA) returning 200% in less than a year and are selling off their more conservative holdings to get a piece. Shares of blue-chip Nike (NYSE:NKE) are down 20% this year, and those of Walgreens Boots Alliance (NASDAQ:WBA) have collapsed 40%.\n\nStory continues\n\nSo, how can investors know when to jump back into blue-chip stocks?\n\nIntroducing TradeSmith’s Intelligent Algorithms\n\nThat’s where quantitative tools like those at our partner, TradeSmith, come in. Many stocks follow identifiable patterns, and artificial intelligence (AI)-based tools are excellent at sniffing these out.\n\nFor instance, we know that certain sectors respond differently to market cycles. Utility stocks do better during contractions, while financials outperform during expansions. Meanwhile, consumer durable stocks often ignore cycles entirely. Walmart (NYSE:WMT) stock actually rose in 2008 as cash-strapped consumers traded down.\n\nAll these insights are neatly encapsulated in a formula by TradeSmith’s system. VQ% Formula as a function of alpha, beta, sigmal and V\n\nAs TradeSmith CEO Keith Kaplan explains, this “magic formula” is a measure of historical and recent volatility – or risk – in a stock, fund, or crypto. And that measurement can help investors predict not only which stocks will rise… but also when it can happen.\n\nLater this week, Eric Fry will sit down with Keith for the 11X Stock Market Accelerator Summit to help readers better understand how the system works, and why these “intelligent algorithms” outperform the market by such a wide margin. You can save your spot for that event – on Wednesday, September 27, at 8 p.m. Eastern – by going here.\n\nAnd to get you started, here are three blue-chip stocks that TradeSmith’s system now recommends you buy before they resurge.\n\nHigh-Quality Stocks to Buy the Dip: Honeywell (HON) Honeywell (HON) logo on front of glass building\n\nSource: josefkubes / Shutterstock.com\n\nShares of industrial giant Honeywell International (NASDAQ:HON) fell double digits this summer after the firm announced Q2 earnings that only met Wall Street expectations. Investors were expecting a massive earnings beat, and Honeywell’s 2-cent outperformance wasn’t good enough. Ordinarily, such a drawdown could take years for Honeywell to recover from, given the stock’s historically slow growth.\n\nA recent uptick in Honeywell’s share price, however, has now landed the Indiana-based firm on TradeSmith’s radar. According to the quantitative system, Honeywell’s shares could surge to $225 by next July, a 15% return. That would give the blue-chip industrial one of the highest upsides of any conservative stock.\n\nInvestorPlace.com writer Omor Ibne Ehsan agrees. In a recent briefing, he writes how Honeywell’s balance sheet is “rock-solid” and that shares are undervalued.\n\nDespite near-term macro concerns, Honeywell’s leadership sees strength ahead. Commercial flight activity continues to recover, fueling aerospace demand. Energy, non-residential construction, and pent-up infrastructure investment provide additional tailwinds. At 20-times earnings, HON stock offers reasonable value. The company’s defensive attributes combined with its upside potential check all the blue-chip boxes.\n\nThese predictions are also supported by fundamental analysis. According to a three-stage discounted cash flow (DCF) model, Honeywell’s shares are likely worth $220 to $230 thanks to its consistent cash flows and diversification across multiple industrial sectors. The company also has a strong history of deploying capital. Now that TradeSmith’s system has identified an ideal entry point, conservative investors should take note.\n\n2. Leidos Holdings (LDOS) Leidos (LDOS) logo on the side of an office building\n\nSource: Jer123 / Shutterstock.com\n\nLeidos Holdings (NYSE:LDOS) is one of the most undervalued blue-chip stocks on my radar today. The defense company trades at under 14X forward price-to-earnings, despite consistently achieving 20% return on equity (ROE). My valuation systems show that shares could be worth as much as 60% higher by 2026. The only reason I’ve stayed away is because Leidos has a history as a “value trap,” a case where shares remain constantly underpriced.\n\nTradeSmith’s formulas now see this “trap” disappearing. The quantitative system now believes that shares could rise to $110 in the coming fourth quarter, 18% upside from current levels. That’s an enormous upside for a stock that currently sits in the bottom 2% of companies based on implied volatility. (In other words, 98% of companies have more volatile stock prices.) An 18% price jump would also bring Leidos more in line with competitors from a relative valuation standpoint.\n\nIan Cooper also finds Leidos a compelling buy. In an update this week, the InvestorPlace.com writer notes how strong earnings and guidance from Leidos’ management should push shares higher:\n\nIn its most recent quarter, the company posted Q2 2023 EPS of $1.80, which beat expectations by 23 cents. Revenue of $3.8 billion, up 7.7% YOY, beat expectations by $70 million. Net bookings totaled $2.9 billion in the quarter, representing a book-to-bill ratio of 0.8… In addition, the company raised revenue guidance from a range of $14.9 billion to $15.2 billion from $14.7 billion to $15.1 billion.\n\nEssentially, Leidos continues to march ahead with growth and profitability, regardless of the discount that its shares typically trade at. Analysts expect a constant 5% increase in annual revenues, which will translate into 10% improvements in earnings per share through 2026. Bolt-on acquisitions, like Leidos’ 2022 purchase of Australian-based Cobham Special Mission, also add to upside potential.\n\nThough Leidos has long traded like a value trap, TradeSmith’s system now believes that a turnaround will soon get underway for this blue-chip stock.\n\n3. Goldman Sachs (GS) In this photo illustration the Goldman Sachs Group (GS) logo displayed on a smartphone screen and a stock market graph in the background\n\nSource: rafapress / Shutterstock.com\n\n2022 was an understandably awful year for Goldman Sachs Group (NYSE:GS). The IPO market fizzled, profits slumped, and the company was forced into multiple rounds of layoffs. We haven’t seen this many Goldman Sachs cuts since the 2008 financial crisis.\n\nFundamental-based investors have been slow to jump back in. Bank valuations are dependent on the health of the economies they service, and the U.S. economy has been on shaky ground for much of this year.\n\nTradeSmith’s quantitative system now suggests that it’s time to revisit Wall Street’s golden child. According to the system’s estimates, shares of Goldman Sachs could rise to $400 by Q2 next year. That’s a 20% upside from current levels.\n\nA recent improvement in the IPO market could be a factor, as InvestorPlace.com Larry Ramer notes in an article this week:\n\nCEO David Solomon said in a Sept. 12 interview that the performance of capital markets is rebounding. That’s certainly very positive news for Goldman, which makes most of its money from handling deals in those markets.\n\nThese deals include the blockbuster listings from Arm Holdings (NASDAQ:ARM) and Instacart (NASDAQ:CART) – a company that turned its founder into an overnight billionaire.\n\nStabilizing interest rates are another tailwind. Companies tend to be more willing to go public during stable financial environments, and a pause in rate hikes in 2024 will give Goldman the environment it needs to succeed.\n\nFinally, Goldman’s self-enforced reorganization will help slim down the firm just in time for a market recovery. The company’s efficiency ratio, a measure of costs, ballooned from 53.8% to 65.8% in 2022, far higher than its 60% target rate. (As a reminder, high efficiency ratios are worse for banks.) Analysts now believe that efficiency ratios can improve to 63.6% next year, which will send net income up 35% to $12.3 billion.\n\nWhen Timing Is Everything\n\nWhen I started my investment career, many investors had given up on the idea of market timing. The “random walk” theory was all the rage, and indexing was the “smart” way to invest. Even Warren Buffett’s halo was beginning to fade.\n\nIf you can’t beat the market, why not settle for average?\n\nBut the 2008 financial crisis changed all that. Suddenly, the importance of market timing came roaring back. Those who had avoided the rich valuations leading up to the financial crisis were rewarded with incredible deals by the time March 2009 rolled around. Even Buffett would use the period to scoop up discounted shares of Bank of America (NYSE:BAC), Goldman Sachs, and other cheaply priced blue-chip stocks.\n\nThe trick, of course, is knowing that emotions matter in the stock market. A 20% share decline doesn’t happen in a vacuum. And no amount of fundamental analysis can tell you if a blue-chip stock will rise or fall over the next month.\n\nThat’s where AI comes in. These systems are perfect for sniffing out patterns, just like the ones seen in the 2008 drawdowns. AI doesn’t carry the same emotional biases that we do, and they don’t get tired after sifting through millions of data points.\n\nAnd so, on Wednesday, September 27, at 8 p.m. Eastern, InvestorPlace’s Eric is sitting down with Keith to unveil powerful AI-based technology that gives ordinary investors a real opportunity to make 11X more than they usually would on every stock, ETF, or fund they own. Sign up to reserve your spot here.\n\nAfter checking out Eric and Keith’s 11X Stock Market Accelerator Summit on Wednesday, I look forward to seeing you back here next Sunday.\n\nAs of this writing, Tom Yeung did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nTom Yeung is a market analyst and portfolio manager of the Omnia Portfolio, the highest-tier subscription at InvestorPlace. He is the former editor of Tom Yeung’s Profit & Protection, a free e-letter about investing to profit in good times and protecting gains during the bad.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 3 High-Quality Stocks to Buy on the Dip According to AI appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-high-quality-stocks-buy-130004456.html", "symbols": ["ARM.US", "BAC.US", "CART.US", "GS.US", "HD.MX", "HD.US", "HDI.F", "HDI.XETRA", "HOME34.SA", "HON.MX", "HON.US", "HONB34.SA", "LDOS.US", "NKE.US", "NVDA.US", "S6IA.F", "WBA.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.036, "neu": 0.828, "pos": 0.136}}, {"date": "2023-09-25T12:38:00+00:00", "title": "Zacks.com featured highlights include NVIDIA, iRadimed, Perdoceo Education and Axcelis Technologies", "content": "For Immediate Release\n\nChicago, IL – September 25, 2023 – Stocks in this week’s article are NVIDIA NVDA, iRadimed IRMD, Perdoceo Education PRDO and Axcelis Technologies ACLS.\n\n4 Top Profitable Stocks to Invest In Using Net Income Ratio\n\nInvestors should use the concept of accounting ratios to evaluate a company's profitability. After all, they always seek a profitable company over a loss-making one. They also look for companies that offer sturdy returns even after meeting all operating and non-operating costs.\n\nThere are a variety of profitability ratios, from which we have chosen the most successful and frequently used profitability metric to determine the bottom-line performance of a company.\n\nTo that end, NVIDIA, iRadimed, Perdoceo Education and Axcelis Technologies have been selected as the top picks with a high net income ratio.\n\nNet Income Ratio\n\nThe net income ratio gives us the exact profitability level of a company. It reflects the percentage of net income to total sales revenues. Using the net income ratio, one can determine a company's effectiveness in meeting operating and non-operating expenses from revenues. A higher net income ratio usually implies a company's ability to generate ample revenues and successfully manage all business functions.\n\nHere are four of the 12 stocks that qualified for the screening:\n\nNVIDIA is the worldwide leader in visual computing technologies and the inventor of the graphic processing unit. The 12-month net profit margin of NVDA is 31.6%.\n\niRadimed engages in developing, manufacturing, marketing and distributing magnetic resonance imaging compatible products. The 12-month net profit margin of IRMD is 24.5%.\n\nPerdoceo Education provides educational services. The 12-month net profit margin of PRDO is 17.5%.\n\nAxcelis Technologies is a leading producer of ion implantation equipment used in the fabrication of semiconductors. The 12-month net profit margin of ACLS is 20.2%.\n\nYou can get the rest of the stocks on this list by signing up now for your 2-week free trial to the Research Wizard and start using this screen in your own trading. Further, you can also create your own strategies and test them first before taking the investment plunge.\n\nStory continues\n\nThe Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.\n\nClick here to sign up for a free trial to the Research Wizard today.\n\nFor the rest of this Screen of the Week article please visit Zacks.com at: https://www.zacks.com/stock/news/2154052/4-top-profitable-stocks-to-invest-in-using-net-income-ratio\n\nDisclosure: Officers, directors and/or employees of Zacks Investment Research may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material. An affiliated investment advisory firm may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material.\n\nAbout Screen of the Week\n\nZacks.com created the first and best screening system on the web earning the distinction as the \"#1 site for screening stocks\" by Money Magazine.  But powerful screening tools is just the start. That is why Zacks created the Screen of the Week to highlight profitable stock picking strategies that investors can actively use.\n\nStrong Stocks that Should Be in the News\n\nMany are little publicized and fly under the Wall Street radar. They're virtually unknown to the general public. Yet today's 220 Zacks Rank #1 \"Strong Buys\" were generated by the stock-picking system that has more than doubled the market from 1988 through 2016. Its average gain has been a stellar +25% per year. See these high-potential stocks free >>.\n\nFollow us on Twitter:  https://www.twitter.com/zacksresearch\n\nJoin us on Facebook:  https://www.facebook.com/ZacksInvestmentResearch\n\nZacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.\n\nContact: Jim Giaquinto\n\nCompany: Zacks.com\n\nPhone: 312-265-9268\n\nEmail: pr@zacks.com\n\nVisit: https://www.zacks.com/\n\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performancefor information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nAxcelis Technologies, Inc. (ACLS) : Free Stock Analysis Report\n\niRadimed Corporation (IRMD) : Free Stock Analysis Report\n\nPerdoceo Education Corporation (PRDO) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/zacks-com-featured-highlights-nvidia-123800344.html", "symbols": ["ACLS.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "XXA1.F"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.008, "neu": 0.859, "pos": 0.133}}, {"date": "2023-09-25T12:01:14+00:00", "title": "These Are The 12 Stocks Driving The S&amp;P 500 Higher In 2023", "content": "The S&P 500 is up 12.5% so far in 2023, even with the market correction. But an equal-weight ETF is up just 1%. Nvidia leads the index's big winners.\n\nContinue reading", "link": "https://finance.yahoo.com/m/025e3cbd-3485-3d11-b4f5-b15e79aa9521/these-are-the-12-stocks.html", "symbols": ["5AP.F", "ABNB.US", "CCL.LSE", "CCL.US", "CUK.US", "CUKPF.US", "CVC1.F", "FB2A.F", "FB2A.XETRA", "GE.MX", "GE.SW", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "GSPC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0, "neu": 0.906, "pos": 0.094}}, {"date": "2023-09-25T11:00:15+00:00", "title": "7 Blue-Chip Stocks That Deserve a Spot on Your Q4 Buy List", "content": "There’s nothing wrong with taking a flyer on an up-and-coming stock. Sometimes penny stocks can work, but a good portfolio likely has its fair share of great blue-chip stocks as well to provide a stable foundation.\n\nBlue-chip stocks are those that belong to companies that are among the clear leaders in their industries and sectors, with a solid position, if not a dominant competitive advantage.\n\nThey almost always are large-cap stocks because they’ve matured enough to have a market capitalization of at least $10 billion.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nBlue-chip stocks are also doing well financially, either through stock performance, revenue or profitability. And they have sterling reputations, built on the quality of their products and investor confidence in company mission and management.\n\nI used the Portfolio Grader to identify some great blue-chip stocks as we barrel into the fourth quarter of 2023.\n\nUnited Airlines (UAL) The side of a United Airlines (UAL) plane with \"united\" written above passenger windows. Represents airline stocks.\n\nSource: travelview / Shutterstock.com\n\nUnited Airlines (NASDAQ:UAL) is one of the biggest commercial airlines in the world. It has a market cap of more than $14 billion.\n\nIt’s also among the leaders in market share in the U.S.\n\nRevenue for the second quarter was $14.18, an increase of 17% from a year ago. Income for the quarter was $1.08 billion, or $5.03 per share. United Airlines also reported averaging more than 2,400 flights per day in the quarter, which is a new high for the company.\n\nUAL also increased its full-year guidance, now projecting earnings per share in a range from $11 to $12.\n\nThe stock fell this summer as fuel prices rose and analysts began worrying that would cut into Q3 profitability. But if you’re a long-term investor, you have to like the potential of UAL and what appears to be an attractive price. The forward price-to-earnings ratio is less than 4.\n\nUAL stock shows a gain of 16% in 2023 and has a “B” rating in the Portfolio Grader, making it one of the best blue-chip stocks to buy now.\n\nStory continues\n\nAlphabet (GOOG,GOOGL) Closeup logo of Google.com website on an iPhone on wooden table. GOOG stock and Google layoffs\n\nSource: Koshiro K / Shutterstock.com\n\nAny list of the top blue-chip stocks has to include Alphabet (NASDAQ:GOOG,NASDAQ:GOOGL). The owner of the Google search engine, YouTube, Waze driving app, Fitbit fitness trackers and Waymo self-driving cars has a market cap of $1.6 trillion.\n\nIt’s best known for Google, of course. Google enjoys a global market share of nearly 92%. Its dominance is so complete, in fact, that competitors complain it uses unfair tactics such as exclusionary contracts to maintain a monopoly. That issue is currently being debated in court in Washington, D.C.\n\nYes, investors should keep an eye on the trial, and I wouldn’t be surprised to see GOOGL stock sink a bit during the trial. But I’m also confident that Alphabet’s Google will maintain its dominance and superior market share for a long time.\n\nAlphabet is also working generative AI into its products, the most recent being Bard Extensions.\n\nThis is something like a chatbot for your Google account that will use generative AI to answer questions using information from Gmail, Google Docs, Google Maps and other extensions.\n\nRevenue for the second quarter was $74.6 billion, up 7% from a year ago. More than $42 billion of that came from Google search revenue.\n\nGOOGL is up 47% in 2023 and gets a “B” rating in the Portfolio Grader.\n\nExxon Mobil (XOM) Exxon Retail Gas Location\n\nSource: Jonathan Weiss / Shutterstock.com\n\nFor a long time, Exxon Mobil (NYSE:XOM) has been one of my favorite oil and gas stocks. The company is massive, with a market cap of nearly $460 billion, making it the biggest energy company in the U.S.\n\nThe stock itself had an up-and-down 2023, currently showing only a 4% gain for the year. And second-quarter earnings raised some concerns among investors because profits were down 56% from a year ago.\n\nThat was because of the price of oil, of course. When oil prices go up, so do Exxon’s revenues and profitability. And the price of oil topped $100 in 2022, which meant massive profits that are challenging to duplicate in 2023. Especially when the price of oil fell below $70 in the second quarter.\n\nBut look at where we are now. The price of gas is back on the rise as Saudi Arabia cuts production. JPMorgan projects that oil could return to $120 per barrel. While that would be bad for your wallet as you’re filling up the gas tank, it will also put Exxon in a position to return to near-record profitability.\n\nXOM stock has a “B” rating in the Portfolio Grader.\n\nMcDonald’s (MCD) McDonald's golden arches\n\nSource: Vytautas Kielaitis / Shutterstock\n\nIf you’re looking for a market leader in the restaurant business, the conversation starts and ends with McDonald’s (NYSE:MCD).\n\nFrom its modest beginning in 1940 in Berardino, California, McDonald’s revolutionized fast food and the restaurant franchise model by figuring out how to mass-produce food on the cheap.\n\nIt was the first to figure out how to replicate the process so customers would find the same experience and quality no matter in any McDonald’s location.\n\nToday, McDonald’s has more than 38,000 locations in 100 countries. Revenue in the second quarter was up 14% to $6.47 billion, while net income of $2.31 billion was up 94% from a year ago. EPS of $3.15 was an increase of 97% from a year ago.\n\nMcDonald’s also gives you the added bonus of offering a dividend – currently, the yield is just over 2%.\n\nMCD stock is up 3% in 2023 and gets a “B” rating in the Portfolio Grader.\n\nIntel (INTC) The Intel logo in blue on a black screen.\n\nSource: Kate Krav-Rude / Shutterstock.com\n\nI’m impressed that Intel’s (NASDAQ:INTC) turnaround has been so effective that it’s now getting a good grade in the Portfolio Grader.\n\nJust this summer INTC was languishing with a failing grade after two consecutive quarters of losses.\n\nBut in the second quarter, Intel showed some progress. It returned to profitability by posting net income of $1.5 billion, or 35 cents per share. That was an improvement from a quarterly loss of $454 million in the second quarter of 2022.\n\nIntel’s turnaround was in part because it cut $1.7 billion in costs as part of its goal to trim expenses by $3 billion this year. Overall, the company is looking to be leaner by saving $10 billion annually by 2025.\n\nThat helped gross margins increase to 40% in the second quarter, beating Intel’s projections of 37.5%.\n\nIntel has high hopes for its Gaudi 2 chip for AI applications, saying it matches up well to competitors in certain tasks. It also plans to release its next-generation Gaudi 3 chip in 2024.\n\nThe turnaround isn’t over, but it’s time to show Intel some respect. INTC stock gets a “B” rating in the Portfolio Grader.\n\nNvidia (NVDA) Closeup of mobile phone screen with logo lettering of nvidia corporation on computer keyboard. NVDA stock.\n\nSource: Shutterstock\n\nAny progress that Intel is going to make brings Nvidia (NASDAQ:NVDA) into the conversation.\n\nNvidia continues to be my No. 1 pick in the semiconductor space. It’s also a massively successful blue-chip stock, with a market cap that soared over the $1 trillion mark this year.\n\nNvidia reigns supreme because we are living in an age where generative AI is wildly popular, and developers are working overtime to work AI technology into most tech products.\n\nNvidia makes the chips that are required for generative AI, with a dominant market share of 80% to 95% of the AI computing market. It had spectacular Q2 numbers, beating expectations.\n\nNvidia issued third-quarter guidance for $16 billion in revenue because it’s making money at a ridiculous rate. I’m betting on it to hit that number again. NVDA stock is up 190% and has an “A” rating in the Portfolio Grader.\n\nApple (AAPL) Close-up of Apple (AAPL) retail store Logo in Honolulu at the Ala Moana Center. Advertising the latest generation of the ipad, iphones, and ipods with a Retina display.\n\nSource: Eric Broder Van Dyke / Shutterstock.com\n\nApple (NASDAQ:AAPL) is simply the biggest company in the world, with a market cap of more than $2.7 trillion. The maker of smartphones, tablets and computers saw its stock rise 33% in 2023.\n\nOn Sept. 12, the company released its newest lineup: the iPhone 15, iPhone 15 Plus, iPhone 15 Pro and iPhone 15 Pro Max. It also released its Apple Watch Series 9, Apple Watch Ultra 2, and second-generation AirPods Pro.\n\nPre-orders of Apple’s new iPhone 15 are strong, particularly in the massive China market. Morgan Stanley says the lead time for the iPhone 15 Pro Max is five to six weeks, which is the longest wait time for an Apple smartphone in seven years.\n\n“While it’s far too early to call the cycle, these data points are encouraging,” Morgan Stanley analysts said.\n\nApple’s iPhone cycles can be a huge windfall for the company. Wedbush Securities analyst Dan Ives says he thinks the iPhone will push AAPL stock up to $240 per share over the next 12 months.\n\nAAPL stock has a “B” rating in the Portfolio Grader.\n\nOn the date of publication, Louis Navellier had long positions in NVDA, GOOG and XOM. Louis Navellier did not have (either directly or indirectly) any other positions in the securities mentioned in this article.\n\nThe InvestorPlace Research Staff member primarily responsible for this article had a long position in AAPL. The staff member did not hold (either directly or indirectly) any other positions in the securities mentioned in this article.\n\nLouis Navellier, who has been called “one of the most important money managers of our time,” has broken the silence in this shocking “tell all” video… exposing one of the most shocking events in our country’s history… and the one move every American needs to make today.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 7 Blue-Chip Stocks That Deserve a Spot on Your Q4 Buy List appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-blue-chip-stocks-deserve-110015503.html", "symbols": ["AAPL.US", "INTC.US", "MCD.MX", "MCD.US", "MCDC34.SA", "MDO.F", "MDO.XETRA", "NVDA.US", "UAL.MX", "UAL.US", "UAL1.F", "XOM.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.038, "neu": 0.826, "pos": 0.136}}, {"date": "2023-09-25T10:43:00+00:00", "title": "1 Artificial Intelligence Growth Stock to Buy Now With More Upside Than Nvidia, According to Wall Street", "content": "This longtime user of AI technology is a niche leader, and Wall Street analysts are predicting significant upside over the coming 12 months.\n\nContinue reading", "link": "https://finance.yahoo.com/m/b0654f7a-c4ec-3aac-bb09-8fac8572df83/1-artificial-intelligence.html", "symbols": ["3E2.F", "ETSY.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0, "neu": 0.927, "pos": 0.073}}, {"date": "2023-09-25T09:50:00+00:00", "title": "3 Artificial Intelligence (AI) Stocks That Could Soar More Than Nvidia, According to Wall Street", "content": "None of these stocks have outperformed Nvidia so far this year. But the next 12 months could be a different story.\n\nContinue reading", "link": "https://finance.yahoo.com/m/28f34475-bc16-34f2-862e-a9b56ee31d1c/3-artificial-intelligence.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "SDGR.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-09-25T09:31:00+00:00", "title": "It's Time to Buy Coca-Cola Stock", "content": "Indeed, much of the market's gains have been driven by big tech and a huge rise in Tesla's (NASDAQ: TSLA) stock price. Alphabet (NASDAQ: GOOG)(NASDAQ: GOOGL), Microsoft (NASDAQ: MSFT), Nvidia (NASDAQ: NVDA), and Tesla shares, for instance, have risen 48%, 32%, 184%, and 100%, respectively, year to date. One stock worth a closer look as the rest of the market flocks to tech is Coca-Cola (NYSE: KO).\n\nContinue reading", "link": "https://finance.yahoo.com/m/a70c60a3-0900-3c3a-80dd-98ea12bbd7c9/it%27s-time-to-buy-coca-cola.html", "symbols": ["CCC3.F", "CCC3.XETRA", "COCA34.SA", "GOOG.US", "GOOGL.US", "GSPC.INDX", "IXIC.INDX", "KO.MX", "KO.US", "MSFT.US", "NVDA.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.848, "neg": 0, "neu": 0.847, "pos": 0.153}}, {"date": "2023-09-25T09:21:00+00:00", "title": "Which High-Profile Stock-Split Stock Is the Cheapest? Get Ready to Be Shocked...", "content": "Among Nvidia, Amazon, DexCom, Shopify, Alphabet, Tesla, Palo Alto Networks, Monster Beverage, and Novo Nordisk, there's one clear-cut stock-split stock that's notably cheaper than the rest.\n\nContinue reading", "link": "https://finance.yahoo.com/m/10f5a2d0-c3cd-36bf-92f7-3074b602e2fd/which-high-profile.html", "symbols": ["307.F", "5AP.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "NONOF.US", "NOVA.F", "NOVC.F", "NOVC.XETRA"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0, "neu": 0.941, "pos": 0.059}}, {"date": "2023-09-25T07:00:47+00:00", "title": "Amazon to invest up to $4bn in AI start-up Anthropic", "content": "Amazon plans to invest up to $4bn in artificial intelligence start-up Anthropic, as the big tech group steps up its rivalry with Microsoft, Google and Nvidia to persuade AI companies to use its technology. The deal, announced on Monday, will see Amazon invest an initial $1.25bn for a minority stake in Anthropic. It is a bid to forge a close relationship with a prominent AI start-up akin to Microsoft’s alliance with OpenAI, the group behind ChatGPT.\n\nContinue reading", "link": "https://finance.yahoo.com/m/38fedfd5-fd39-349e-808e-fc4cc6b370c3/amazon-to-invest-up-to-%244bn.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NVD.F"], "tags": [], "sentiment": {"polarity": 0.778, "neg": 0, "neu": 0.888, "pos": 0.112}}, {"date": "2023-09-25T06:15:50+00:00", "title": "Amazon to invest up to $4 billion in Anthropic amid AI arms race", "content": "Investing.com -- Amazon (NASDAQ:AMZN) said on Monday that it is aiming to invest up to $4 billion in artificial intelligence group Anthropic, as the tech giant looks to bolster its position in the corporate arms race over nascent AI technology.\n\nUnder the terms of the agreement, Amazon will place an intial investment of $1.25B in Anthropic for a minority stake in the rival to ChatGPT-maker OpenAI, according to multiple media sources. The figure could then expand to $4B depending on certain conditions. Anthropic will then have access to Amazon's cloud computing platform to help optimize its AI systems, known as large language models.\n\nAnthropic garnered a valuation of almost $5B in its last funding round earlier this year, the Financial Times reported, citing a source familiar with the matter.\n\n“We have tremendous respect for Anthropic’s team and foundation models, and believe we can help improve many customer experiences, short and long-term, through our deeper collaboration,” said Amazon Chief Executive Officer Andy Jassy in a statement.\n\nThe move is the latest sign that Amazon, one of the technology sector's biggest players, is becoming increasingly focused on building out its generative AI offerings. Along with Anthropic's chatbot, Amazon is also trying to brand its Inferentia and Trainium AI chips as possible alternatives to popular processors made by Nvidia (NASDAQ:NVDA).\n\nShares in Amazon were slightly higher in U.S. premarket trading.\n\nRelated Articles\n\nAmazon to invest up to $4 billion in Anthropic amid AI arms race\n\nGoldman, HSBC join forces with other banks on client disclosures\n\nSoftBank Corp to raise $800 million from bond-type shares in Japan first", "link": "https://finance.yahoo.com/news/amazon-invest-4-billion-anthropic-061550715.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0, "neu": 0.825, "pos": 0.175}}, {"date": "2023-09-25T00:52:40+00:00", "title": "Betting Big: 3 AI Stocks Primed for a Breakout", "content": "Technology stocks have made a strong comeback in 2023. For year-to-date, the Standards and Practices (S&P) 500 Information Technology index has surged by 33%. Within the broader technology sector, AI stock have witnessed a massive rally. This is sparking people to seek out AI stocks to buy now.\n\nHowever, even with multi-year industry tailwinds, it’s unrealistic to expect that stocks continue to move parabolic. We expect intermediate corrections followed by a potentially bigger rally. Some of the best AI stock to buy now have taken a breather after a big surge. I believe this presents a good opportunity to accumulate.\n\nIn terms of importance, it’s estimated that the total economic impact of AI to the global economy is likely to be $15.7 trillion by 2030. With impact across sectors, tech stocks are positioned for big gains from AI. Given this outlook, I believe that AI stocks to buy now can deliver multibagger returns in the next five years.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLet’s discuss the reasons to be bullish on these AI stocks.\n\nC3.ai (AI) AI text on smartphone against background of green stock chart. Profit growth, share price, business success, investment and trading in artificial intelligence concept. AI stocks to buy\n\nSource: Sergio Photone / Shutterstock.com\n\nC3.ai (NYSE:AI) stock had surged to highs of $48.9 earlier this year. A sharp correction has ensued with AI stock currently trading at $25.70. I believe that this is a good opportunity to accumulate for a reversal rally. It’s worth noting that AI stock has a short interest that’s currently 36% of free-float. I would not be surprised if there is a massive short squeeze rally.\n\nAs an overview, C3.ai is an enterprise AI application software company. For Q2 2023, C3 reported revenue of $72.4 million with subscription revenue accounting for 85% of total revenue.\n\nThe company has guided for annual revenue of $295 to $320 million. However, loss from operations is guided at $85 million (mid-range). I believe that as subscription (recurring) revenue swells, C3 will be positioned for margin improvement.\n\nIt’s worth noting that for year-to-date, C3.ai has closed 12 generative AI agreements. Furthermore, the company has a pipeline of more than 140 “qualified C3 Generative AI enterprise opportunities.” This provides growth visibility for the coming year and beyond.\n\nStory continues\n\nNvidia (NVDA) Nvidia corporation (NVDA) logo displayed on smartphone with stock market chart background. Nvidia is a global leader in artificial intelligence hardware.\n\nSource: Evolf / Shutterstock.com\n\nWhen it comes to the best AI stocks to buy, Nvidia (NASDAQ:NVDA) is the first name that comes to mind. After surging to highs of $502, NVDA stock has corrected to current levels of $410. In my view, gradual accumulation can be considered and investors can average down if there is further downside.\n\nHowever, there is little doubt that Nvidia has a big addressable market and the company is positioned to benefit from the growth in AI. To put things into perspective, Nvidia’s executive Manuvir Das believes that the AI market is potentially worth $600 billion.\n\nIn a recent development, Reliance Industries and Nvidia have partnered to advance AI in India. The company has also partnered with Tata Group to build large scale AI infrastructure in India. The point I want to make is that Nvidia is tapping new markets with big growth potential. Inroads into India will also help Nvidia hedge the risk related to China.\n\nUpstart Holdings (UPST) Person holding smartphone with logo of U.S. fintech company Upstart Network Inc. (UPST) on screen in front of website. Focus on phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nUpstart Holdings (NASDAQ:UPST) stock had recently gone ballistic and traded at highs of $72.5. However, a deep correction followed and UPST stock trades at $27. The price action makes UPST stock like a meme stock. However, the fundamentals are getting better and I am bullish on the business. It’s also worth noting that with short interest of 36%, the stock is among the short squeeze rally candidates.\n\nIn terms of business, Upstart is a cloud-based artificial intelligence lending platform in the United States. The objective is to ease access to credit and at the same time, lower the risk for banks. The company already has 2.4 million customers and 100 partner banks. With a total addressable market of $4 trillion in annual loan origination, Upstart has ample room for growth.\n\nFor Q2 2023, Upstart reported revenue and adjusted EBITDA of $135.8 million and $11 million respectively. An important point to note is that the contributing margin has improved by 2,000 basis points on a year-on-year basis to 67%. The company also achieved positive cash flow in Q2. With financial positives and a big addressable market, I remain bullish on UPST stock.\n\nOn the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post Betting Big: 3 AI Stocks Primed for a Breakout appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/betting-big-3-ai-stocks-005240009.html", "symbols": ["AI.US", "NVDA.US", "UPST.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.018, "neu": 0.862, "pos": 0.12}}, {"date": "2023-09-25T00:00:00+00:00", "title": "September&#039;s 7 Most Controversial AI Stocks: Buy or Bail?", "content": "Some of these AI stocks are controversial and that means you should consider selling them before market sentiment turns sour.", "link": "https://investorplace.com/2023/09/septembers-7-most-controversial-ai-stocks-buy-or-bail/", "symbols": ["AI.US", "AVGO.US", "GOOG.US", "GOOGL.US", "MSFT.US", "NVDA.US", "PLTR.US"], "tags": [], "sentiment": {"polarity": -0.202, "neg": 0.087, "neu": 0.913, "pos": 0}}, {"date": "2023-09-25T00:00:00+00:00", "title": "3 Artificial Intelligence (AI) Stocks That Could Soar More Than Nvidia, According to Wall Street", "content": "None of these stocks have outperformed Nvidia so far this year. But the next 12 months could be a different story.", "link": "https://www.fool.com/investing/2023/09/25/artificial-intelligence-ai-stocks-soar-nvidia/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-09-25T00:00:00+00:00", "title": "What AMD, Intel, and Nvidia Stock Investors Should Know About Recent AI Updates", "content": "Advanced Micro Devices continues to make advances in its most profitable segment, the embedded market.", "link": "https://www.fool.com/investing/2023/09/25/what-amd-intel-and-nvidia-stock-investors-should-k/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0.633, "neg": 0, "neu": 0.716, "pos": 0.284}}, {"date": "2023-09-25T00:00:00+00:00", "title": "This Growth Stock Could 10X in 10 Years", "content": "This red-hot stock has been a big winner over the past decade with an eye-popping jump of more than 100x.", "link": "https://www.fool.com/investing/2023/09/25/this-growth-stock-could-10x-in-10-years/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0.586, "neg": 0, "neu": 0.826, "pos": 0.174}}, {"date": "2023-09-25T00:00:00+00:00", "title": "7 Blue-Chip Stocks That Deserve a Spot on Your Q4 Buy List", "content": "It's great to mix up your holdings, but you should always make sure you have a group of great blue-chip stocks to anchor your portfolio.", "link": "https://investorplace.com/market360/2023/09/7-blue-chips-that-deserve-a-spot-on-your-q4-buy-list/", "symbols": ["AAPL.US", "GOOG.US", "GOOGL.US", "INTC.US", "MCD.US", "NVDA.US", "UAL.US", "XOM.US"], "tags": [], "sentiment": {"polarity": 0.903, "neg": 0, "neu": 0.653, "pos": 0.347}}, {"date": "2023-09-25T00:00:00+00:00", "title": "Ticking Time Bombs: 7 S&amp;P 500 Stocks to Dump Before the Damage Is Done", "content": "S&amp;P 500 stocks are sliding as rates promise to remain higher for longer - and these seven stocks stand to lose the most. ", "link": "https://investorplace.com/2023/09/ticking-time-bombs-7-sp-500-stocks-to-dump-before-the-damage-is-done/", "symbols": ["ABNB.US", "ADBE.US", "BBY.US", "MU.US", "NFLX.US", "NVDA.US", "O.US"], "tags": [], "sentiment": {"polarity": -0.103, "neg": 0.108, "neu": 0.8, "pos": 0.092}}, {"date": "2023-09-25T00:00:00+00:00", "title": "Interest Rates Were Held Steady Last Week: Here Are 3 Stocks to Buy Now", "content": "Here are three stocks to buy for investors concerned about the evolving interest rate environment in the market right now.", "link": "https://investorplace.com/2023/09/interest-rates-were-held-steady-last-week-here-are-3-stocks-to-buy-now/", "symbols": ["JPM.US", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.459, "neg": 0, "neu": 0.864, "pos": 0.136}}, {"date": "2023-09-24T11:50:00+00:00", "title": "2 Hypergrowth Stocks to Buy in 2023 and Beyond", "content": "Finding companies that are growing fast and have the potential to go the distance in your portfolio can be much more challenging. For years, Nvidia's graphics processing units (GPUs) were best known for their capabilities for gaming. The company's processors then caught investors' attention for their use in cloud computing, and now it's becoming clear that Nvidia's GPUs will help power the technological shift toward artificial intelligence (AI).\n\nContinue reading", "link": "https://finance.yahoo.com/m/9d9b8c3b-3510-354d-9ec9-f5b6e7306f9b/2-hypergrowth-stocks-to-buy.html", "symbols": ["MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.935, "neg": 0, "neu": 0.798, "pos": 0.202}}, {"date": "2023-09-24T11:18:00+00:00", "title": "Nvidia, Amazon, and Alphabet Announced 3 Key Artificial Intelligence (AI) Developments Last Week You May Have Missed", "content": "Artificial intelligence (AI) has been all the rage this year, with the biggest names in technology all getting in on the action. Helping spark the AI gold rush in 2023 are recent developments in the field of generative AI, which can create original output, handle repetitive tasks, conduct research, and even write code. Business executives are scrambling to implement this technology, which promises vast productivity gains, saving companies time and money.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4f1bb319-d6ff-373d-a587-b2cab2c89a0b/nvidia%2C-amazon%2C-and-alphabet.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.84, "neg": 0.065, "neu": 0.742, "pos": 0.193}}, {"date": "2023-09-24T11:10:00+00:00", "title": "1 Super Stock Just 28% Away From Joining Apple, Microsoft, Amazon, Alphabet, and Nvidia in the $1 Trillion Club", "content": "Artificial intelligence is driving a new growth phase for the world's largest social media company.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a8a57694-8bdd-368c-b1d8-5919dddbc7bb/1-super-stock-just-28%25-away.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "FB2A.F", "FB2A.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US"], "tags": [], "sentiment": {"polarity": 0.691, "neg": 0, "neu": 0.711, "pos": 0.289}}, {"date": "2023-09-24T10:00:00+00:00", "title": "2 AI Chip Stocks to Buy Not Named Nvidia", "content": "AMD and Qualcomm may not be growing at the same pace as Nvidia. But investors may have punished these stocks a bit too much.\n\nContinue reading", "link": "https://finance.yahoo.com/m/68c621b2-d666-31e5-8043-6c5450eec477/2-ai-chip-stocks-to-buy-not.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "FB2A.F", "FB2A.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "QCI.F", "QCI.XETRA", "QCOM.MX", "QCOM.US"], "tags": [], "sentiment": {"polarity": -0.495, "neg": 0.155, "neu": 0.845, "pos": 0}}, {"date": "2023-09-24T00:00:00+00:00", "title": "3 Chip Stocks Crushing the Market With More Room to Run", "content": "These top chip stocks to buy have crushed the market thus far this year and, despite a dip, could have more room to run from here.", "link": "https://investorplace.com/2023/09/3-chip-stocks-crushing-the-market-with-more-room-to-run/", "symbols": ["AMD.US", "INTC.US", "NVDA.US"], "tags": [], "sentiment": {"polarity": -0.25, "neg": 0.101, "neu": 0.833, "pos": 0.065}}, {"date": "2023-09-24T00:00:00+00:00", "title": "Betting Big: 3 AI Stocks Primed for a Breakout", "content": "These are the best AI stocks to buy now for multibagger returns as they represent innovation-driven companies with growth potential", "link": "https://investorplace.com/2023/09/betting-big-3-ai-stocks-primed-for-a-breakout/", "symbols": ["AI.US", "NVDA.US", "UPST.US"], "tags": [], "sentiment": {"polarity": 0.778, "neg": 0, "neu": 0.726, "pos": 0.274}}, {"date": "2023-09-24T00:00:00+00:00", "title": "2 Hypergrowth Stocks to Buy in 2023 and Beyond", "content": "Artificial intelligence is on a hypergrowth trajectory. These companies are riding it.", "link": "https://www.fool.com/investing/2023/09/24/2-hypergrowth-stocks-to-buy-in-2023-and-beyond/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0, "neu": 0.763, "pos": 0.237}}, {"date": "2023-09-23T18:00:40+00:00", "title": "Hidden Gems: 3 AI Stocks Flying Under the Radar", "content": "While the hype may have died down, artificial intelligence (AI) is still the leading catalyst in the technology space.\n\nGrand View Research forecasts that the market for AI will reach nearly $2 trillion by 2030, and nearly every major tech company is racing to integrate generative AI into their products. While its still early, clear winners have emerged in the sector. Stocks that are most closely associated with and exposed to AI have seen share prices explode this year, doubling and even tripling.\n\nHowever, other options remain available to investors who may have missed the boat on the obvious AI stocks, such as the following three that are flying under the radar.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nAmazon (AMZN) Closeup of the Amazon logo at Amazon campus in Palo Alto, California. The Palo Alto location hosts A9 Search, Amazon Web Services, and Amazon Game Studios teams. AMZN stock\n\nSource: Tada Images / Shutterstock.com\n\nAmazon (NASDAQ:AMZN) is launching a “smarter and more conversational” version of its popular Alexa voice assistant, powered by AI.\n\nThe company has said that it hopes the newly revamped Alexa assistant will boost the its position within the AI sector. AMZN currently lies low compared to rivals such as Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL).\n\nThe new AI feature being added to Alexa is called “Let’s Chat”. Amazon says it should be available to consumers before the year-end holidays. Similar to ChatGPT and other generative AI chatbots, Alexa will be able to compose and send emails and other text messages.\n\nAmazon engineers and programmers say they hope to use generative AI to optimize, improve and integrate the company’s suite of smart home products. Those include cameras, alarms, and thermostats. AMZN stock is up 50% year to date (YTD).\n\nAdvanced Micro Devices (AMD) Sign of AMD office in Markham, Ontario, Canada. Advanced Micro Devices, Inc. is an American multinational semiconductor company.\n\nSource: JHVEPhoto / Shutterstock.com\n\nMicrochip and semiconductor company Advanced Micro Devices (NASDAQ:AMD) doesn’t get nearly as much attention for its AI space as its rival Nvidia (NASDAQ:NVDA).\n\nYet AMD is making aggressive moves to become a leading supplier of the chips and semiconductors that power advanced AI applications. In June of this year, Advanced Micro Devices introduced a new AI microchip called the “MI300X”. It rivals the most advanced chip from Nvidia. AMD plans to begin shipping to customers by year’s end.\n\nStory continues\n\nThe company’s new MI300X chip has been designed specifically for large language models and other generative AI applications. The chip uses up to 192 gigabits of memory, which means it can accommodate bigger AI models than rival chips.\n\nIn contrast, Nvidia’s H100 chip supports only 120 gigabits of memory. Advanced Micro Devices is also developing its own software for its AI applications called “ROCm”. Impressively, AMD stock is up 50% YTD.\n\nAdobe (ADBE) Website of Adobe (ADBE) Firefly seen in an iPhone. In Mar 2023 Adobe announced the beta launch of its new generative AI model Firefly.\n\nSource: Koshiro K / Shutterstock.com\n\nAdobe’s (NASDAQ:ADBE) recent earnings print was all about the software company’s new suite of generative AI products.\n\nDays prior to its public report, Adobe unveiled several new AI tools and enhancements for its various consumer products. The company shared that its AI products are already helping to bolster its earnings. In fact, the company reports a profit of $4.09 a share for its fiscal third quarter, beating Wall Street expectations of $3.98 a share.\n\nAdobe executives say the company is now looking to raise prices on its AI applications. They plan to increase prices by 8% to 10% for its creative cloud plans starting on November 1.\n\nThis past spring, Adobe launched its Firefly suite of AI tools that includes a popular text-to-image feature. During its recent earnings call with analysts and media, Adobe said so far this year, its customers have produced more than two billion images using Firefly products. ADBE stock is up 52% in 2023.\n\nOn the date of publication, Joel Baglole held long positions in GOOGL and NVDA. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post Hidden Gems: 3 AI Stocks Flying Under the Radar appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/hidden-gems-3-ai-stocks-180040490.html", "symbols": ["ADB.F", "ADBE.US", "ADBE34.SA", "AMD.US", "AMZN.US", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.029, "neu": 0.858, "pos": 0.113}}, {"date": "2023-09-23T11:41:00+00:00", "title": "Missed Out on Nvidia's Skyrocketing Trillion-Dollar AI Run? Here's My Best AI Chip Stock to Buy Now and Hold Forever.", "content": "A sectorwide frenzy for artificial intelligence (AI) stocks is driving many stocks through the ceiling. In particular, chip designer Nvidia (NASDAQ: NVDA) has joined the exclusive club of trillion-dollar market caps by more than tripling its stock price in the last 52 weeks. This doesn't look like the best time to put new money into Nvidia, though.\n\nContinue reading", "link": "https://finance.yahoo.com/m/86c9ba00-6d35-3c41-a333-092267f849f9/missed-out-on-nvidia%27s.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "NXPI.US", "VNX.F"], "tags": [], "sentiment": {"polarity": 0.724, "neg": 0.057, "neu": 0.809, "pos": 0.134}}, {"date": "2023-09-23T10:30:00+00:00", "title": "Got $1,500? You Can Confidently Add These 3 Stocks to Your Portfolio.", "content": "A sleep-well-at-night (SWAN) strategy for stock picking is a goal for many long-term investors. Free cash flow, dividends, or buybacks, and operations in secular growth industries are three things to look for in these stocks. If you have $1,500 in an investment account, whether from dividends, selling a winner or cutting losses on a loser (it happens), or monthly deposits adding up, these stocks may be an excellent place to invest for the long term.\n\nContinue reading", "link": "https://finance.yahoo.com/m/abe04825-4810-35ea-ad68-d07aa929f69e/got-%241%2C500%3F-you-can.html", "symbols": ["3V64.F", "3V64.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TEXA34.SA", "TII.F", "TXN.US", "V.MX", "V.US", "VISA34.SA"], "tags": [], "sentiment": {"polarity": 0.778, "neg": 0.087, "neu": 0.759, "pos": 0.154}}, {"date": "2023-09-23T09:50:00+00:00", "title": "Which Top Artificial Intelligence (AI) Stock Could Make Investors the Most Money This Decade? Here's Why It Just Might Be Google.", "content": "Which top AI stock could make investors the most money this decade? Several top AI stocks are legitimately in the running to make the most money during the new version of the Roaring Twenties. Tesla (NASDAQ: TSLA) especially stands out because of its big head start.\n\nContinue reading", "link": "https://finance.yahoo.com/m/065f053d-795a-3d0f-b2f0-46fea79dd2dd/which-top-artificial.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "FB2A.F", "FB2A.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0, "neu": 0.927, "pos": 0.073}}, {"date": "2023-09-23T00:00:00+00:00", "title": "Got $1,500? You Can Confidently Add These 3 Stocks to Your Portfolio.", "content": "Here is a high-quality mix that will let you sleep well at night.", "link": "https://www.fool.com/investing/2023/09/23/got-1500-you-can-confidently-add-these-3-stocks-to/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0.273, "neg": 0, "neu": 0.84, "pos": 0.16}}]