[{"date": "2023-05-23T19:38:04+00:00", "title": "Dow futures tick higher, Intuit falls 4.9% after earnings", "content": "Investing.com - U.S. stock futures were trading slightly higher during Tuesday's evening deals, following a negative session among benchmark averages amid ongoing debt-ceiling negotiations and quarterly earnings results.\n\nBy 7:15pm ET (11:15pm GMT) Dow Jones Futures, S&P 500 Futures and Nasdaq 100 Futures were trading 0.1% higher apiece.\n\nAnalyze Q1 earnings results with InvestingPro.\n\nIn extended deals, Intuit (NASDAQ:INTU) dipped 4.9%, reporting Q3 EPS of $8.92 versus $8.49 expected on revenues of $6.02 billion versus $6.09 billion expected.\n\nUrban Outfitters (NASDAQ:URBN) lifted 9.3% after the company reported Q1 EPS of $0.56 versus $0.36 expected, while revenue was reported at $1.11 billion versus $1.09 billion expected.\n\nPalo Alto Networks (NASDAQ:PANW) added 4%, reporting Q3 EPS of $1.10 versus $0.93 expected on revenues of $1.7 billion versus $1.72 billion expected.\n\nAgilent Technologies (NYSE:A) fell 7.3% after the company reported Q2 EPS of $1.27 versus $1.26 expected, while revenue came in at $1.72 billion versus $1.67 billion expected.\n\nAhead in Wednesday's session, investors will be looking towards FOMC meeting minutes and a speech from Treasury Secretary Yellen, while earnings is set to continue with companies including NVIDIA Corporation (NASDAQ:NVDA), American Eagle Outfitters Inc (NYSE:AEO , Snowflake Inc (NYSE:SNOW) and Kohl’s Corp (NYSE:KSS)scheduled to release results.\n\nDuring Tuesday's trade, the Dow Jones Industrial Average fell 231.1 points or 0.7% to 33,055.5, the S&P 500 lost 47.1 points or 1.1% to 4,145.6 and the NASDAQ Composite fell 160.5 points or 1.3% to 12,560.3.\n\nOn the bond markets, United States 10-Year rates were at 3.698%.\n\nRelated Articles\n\nDow futures tick higher, Intuit falls 4.9% after earnings\n\nNetflix expands password sharing crackdown around the world\n\nUBS in talks with Swiss authorities over Credit Suisse deal protections", "link": "https://finance.yahoo.com/news/dow-futures-tick-higher-intuit-193804920.html", "symbols": ["A.US", "AG8.F", "INTU.US", "KSS.US", "NVDA.US", "PANW.US", "SNOW.US", "URBN.US"], "tags": [], "sentiment": {"polarity": 0.527, "neg": 0.021, "neu": 0.939, "pos": 0.04}}, {"date": "2023-05-23T19:00:00+00:00", "title": "NVIDIA Collaborates With Microsoft to Accelerate Enterprise-Ready Generative AI", "content": "SEATTLE, May  23, 2023  (GLOBE NEWSWIRE) -- Microsoft Build -- NVIDIA today announced that it is integrating its NVIDIA AI Enterprise software into Microsoft’s Azure Machine Learning to help enterprises accelerate their AI initiatives.\n\nThe integration will create a secure, enterprise-ready platform that enables Azure customers worldwide to quickly build, deploy and manage customized applications using the more than 100 NVIDIA AI frameworks and tools that come fully supported in NVIDIA AI Enterprise, the software layer of NVIDIA’s AI platform.\n\n“With the coming wave of generative AI applications, enterprises are seeking secure accelerated tools and services that drive innovation,” said Manuvir Das, vice president of enterprise computing at NVIDIA. “The combination of NVIDIA AI Enterprise software and Azure Machine Learning will help enterprises speed up their AI initiatives with a straight, efficient path from development to production.”\n\nNVIDIA AI Enterprise on Azure Machine Learning will also provide access to the highest-performance NVIDIA accelerated computing resources to speed the training and inference of AI models.\n\n“Microsoft Azure Machine Learning users come to the platform expecting the highest performing, most secure development platform available,” said John Montgomery, corporate vice president of AI platform at Microsoft. “Our integration with NVIDIA AI Enterprise software allows us to meet that expectation, enabling enterprises and developers to easily access everything they need to train and deploy custom, secure large language models.”\n\nWith Azure Machine Learning, developers can easily scale applications, from tests to massive deployments, while using Azure Machine Learning data encryption, access control and compliance certifications to meet security and compliance with their organizational policies requirements. NVIDIA AI Enterprise complements Azure Machine Learning with secure, production-ready AI capabilities and includes access to NVIDIA experts and support.\n\nNVIDIA AI Enterprise includes over 100 frameworks, pretrained models and development tools, such as NVIDIA RAPIDS™ for accelerating data science workloads. NVIDIA Metropolis accelerates vision AI model development, and NVIDIA Triton Inference Server™ supports enterprises in standardizing model deployment and execution.\n\nAvailability \r\nThe NVIDIA AI Enterprise integration with Azure Machine Learning is available in a limited technical preview in the NVIDIA community registry.\n\nNVIDIA AI Enterprise is also available on Azure Marketplace, providing businesses worldwide with expanded options for fully secure and supported AI development and deployment.\n\nAdditionally, the NVIDIA Omniverse Cloud™ platform-as-a-service is now available on Microsoft Azure as a private offer for enterprises. Omniverse Cloud provides developers and enterprises with a full-stack cloud environment to design, develop, deploy and manage industrial metaverse applications at scale.\n\nAbout NVIDIA\r\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling the creation of the industrial metaverse. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/.\n\nFor further information, contact:\r\nAnna Kiachian\r\nNVIDIA Corporation\r\n+1-650-224-9820\r\nakiachian@nvidia.com\n\nCertain statements in this press release including, but not limited to, statements as to: the benefits, impact and availability of NVIDIA’s products and technologies, including NVIDIA AI Enterprise, NVIDIA RAPIDS, NVIDIA Metropolis, NVIDIA Triton Inference Server and NVIDIA Omniverse Cloud; NVIDIA’s collaboration with Microsoft, including the benefits and impact thereof; and the coming wave of generative AI applications and enterprises seeking secure accelerated tools and services that drive innovation are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances.\n\n© 2023 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, NVIDIA RAPIDS, NVIDIA Omniverse and NVIDIA Triton Inference Server are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice.", "link": "https://www.globenewswire.com/news-release/2023/05/23/2674741/0/en/NVIDIA-Collaborates-With-Microsoft-to-Accelerate-Enterprise-Ready-Generative-AI.html", "symbols": ["NVDA.US"], "tags": ["ARTIFICIAL INTELLIGENCE", "MACHINE LEARNING", "NASDAQ:NVDA", "NVIDIA CORPORATION", "PRODUCT / SERVICES ANNOUNCEMENT", "SOFTWARE"], "sentiment": {"polarity": 0.992, "neg": 0.016, "neu": 0.901, "pos": 0.083}}, {"date": "2023-05-23T17:00:00+00:00", "title": "Dell Technologies and NVIDIA Introduce Project Helix for Secure, On-Premises Generative AI", "content": "LAS VEGAS, May 23, 2023 /PRNewswire/ -- DELL TECHNOLOGIES WORLD -- Dell Technologies logo\n\nNews summary\n\nProject Helix makes it easy for enterprises to build and deploy trustworthy generative AI Dell and NVIDIA infrastructure and software include built-in data security for on-premises generative AI applications\n\nFull story\n\nDell Technologies (NYSE: DELL) and NVIDIA (NASDAQ: NVDA) announce a joint initiative to make it easier for businesses to build and use generative AI models on-premises to quickly and securely deliver better customer service, market intelligence, enterprise search and a range of other capabilities.\n\nProject Helix will deliver a series of full-stack solutions with technical expertise and pre-built tools based on Dell and NVIDIA infrastructure and software. It includes a complete blueprint to help enterprises use their proprietary data and more easily deploy generative AI responsibly and accurately.\n\n\"Project Helix gives enterprises purpose-built AI models to more quickly and securely gain value from the immense amounts of data underused today,\" said Jeff Clarke, vice chairman and co-chief operating officer, Dell Technologies. \"With highly scalable and efficient infrastructure, enterprises can create a new wave of generative AI solutions that can reinvent their industries.\"\n\n\"We are at a historic moment, when incredible advances in generative AI are intersecting with enterprise demand to do more with less,\" said Jensen Huang, founder and CEO, NVIDIA. \"With Dell Technologies, we've designed extremely scalable, highly efficient infrastructure that enables enterprises to transform their business by securely using their own data to build and operate generative AI applications.\"\n\nProject Helix simplifies enterprise generative AI deployments with a tested combination of optimized hardware and software, all available from Dell. This delivers the power to convert enterprise data into smarter, higher value outcomes, while maintaining data privacy. These solutions will help companies quickly deploy customized AI applications that drive trusted decisions from their own data to grow and scale their businesses.\n\nBlueprint for on-premises generative AI\n\nProject Helix will support the complete generative AI lifecycle – from infrastructure provisioning, modeling, training, fine-tuning, application development and deployment, to deploying inference and streamlining results. The validated designs help enterprises quickly build on-premises generative AI infrastructure at scale.\n\nDell PowerEdge servers, such as the PowerEdge XE9680 and PowerEdge R760xa, are optimized to deliver performance for generative AI training and AI inferencing. The combination of Dell servers with NVIDIA® H100 Tensor Core GPUs and NVIDIA Networking form the infrastructure backbone for these workloads. Customers can pair this infrastructure with resilient and scalable unstructured data storage, including Dell PowerScale andDell ECS Enterprise Object Storage.\n\nWith all Dell Validated Designs, customers can use the enterprise features of Dell server and storage software, with observability through Dell CloudIQ software. Project Helix also includes NVIDIA AI Enterprise software to provide tools for customers as they move through the AI lifecycle. NVIDIA AI Enterprise includes more than 100 frameworks, pretrained models and development tools such as the NVIDIA NeMo™ large language model framework and NeMo Guardrails software for building topical, safe and secure generative AI chatbots.\n\nProject Helix includes security and privacy built into foundational components, such as Secured Component Verification. Protecting data on-premises reduces inherent risk and helps companies meet regulatory requirements.\n\n\"Companies are eager to explore the opportunities that generative AI tools enable for their organizations, but many aren't sure how to get started,\" said Bob O'Donnell, president and chief analyst, TECHnalysis Research. \"By putting together a complete hardware and software solution from trusted brands, Dell Technologies and NVIDIA are offering enterprises a head start to building and refining AI-powered models that can leverage their own company's unique assets and create powerful, customized tools.\"\n\nAvailability Dell Validated Designs based on the Project Helix initiative will be available through traditional channels and APEX flexible consumption options, beginning in July 2023.\n\nAdditional Resources\r\nLearn more about AI at Dell Technologies.\n\nAbout Dell Technologies Dell Technologies (NYSE: DELL) helps organizations and individuals build their digital future and transform how they work, live and play. The company provides customers with the industry's broadest and most innovative technology and services portfolio for the data era.\n\nAbout NVIDIA Since its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company's invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling the creation of the industrial metaverse. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information athttps://nvidianews.nvidia.com/.\n\nCertain statements in this press release including, but not limited to, statements as to: the benefits, impact, performance, features and availability of our products, collaborations, services, and technologies, including Project Helix, H100 Tensor Core GPUs, NVIDIA Networking, NVIDIA AI Enterprise, NeMo, and NeMo Guardrails; the benefits, impact, performance, features, and availability of NVIDIA's joint initiative with Dell Technologies; advances in generative AI intersecting with enterprise demand to do more with less are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances.\n\nCopyright © 2023 Dell Inc. or its subsidiaries. All Rights Reserved. Dell Technologies and Dell are trademarks of Dell Inc. or its subsidiaries. NVIDIA, the NVIDIA logo and NeMo are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. NVIDIA Logo Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/dell-technologies-and-nvidia-introduce-project-helix-for-secure-on-premises-generative-ai-301831442.html\n\nSOURCE Dell Technologies", "link": "https://finance.yahoo.com/news/dell-technologies-nvidia-introduce-project-170000260.html", "symbols": ["12DA.F", "DELL.US", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.016, "neu": 0.868, "pos": 0.116}}, {"date": "2023-05-22T21:46:49+00:00", "title": "Is It Time to Sell Nvidia Stock? NVDA Stock Analysis and Earnings Preview", "content": "Nvidia stock has skyrocketed nearly 300% from its October lows. What should investors expect with earnings around the corner?\n\nContinue reading", "link": "https://finance.yahoo.com/m/02d038d7-a2ec-36ff-9340-2f3905371246/is-it-time-to-sell-nvidia.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": -0.202, "neg": 0.083, "neu": 0.917, "pos": 0}}, {"date": "2023-05-22T21:43:25+00:00", "title": "Billionaire Ken Griffin’s 2023 Portfolio: Top 15 Stock Picks", "content": "In this piece, we will take a look at the top fifteen stocks in billionaire Ken Griffin's 2023 portfolio. For more stocks, head on over to Billionaire Ken Griffin's 2023 Portfolio: Top 5 Stock Picks.\n\nThe stock market crash of 2022 hammered several major hedge funds. One of the biggest funds that bled capital last year is Chase Coleman and Feroze Dewan's Tiger Global. According to Insider Monkey's research, the hedge fund's portfolio as of the first quarter of 2023 was worth a respectable $10.9 billion. Sounds respectable right? After all, it's more money than most of us will likely ever see in our lifetimes (never say never?). Well, you won't think it's a lot of money when you consider the same hedge fund's portfolio by the end of 2022's first quarter. Back then, the portfolio was worth a whopping $26.6 billion, implying that in just a year, Tiger Global's portfolio has been cut by more than half.\n\nAnother star that crashed last year was Catherine Wood's Ark Investment. Ark is known for obsessing over high growth technology companies, and these are precisely the ones that didn't see any love from the stock market last year. And the turbulence in these areas has also hammered Ark's portfolio. This portfolio, which was worth $23.9 billion by the end of Q1 2022 is currently worth $14.5 billion. Cumulatively speaking, data from LCH Investments - called the fund of funds - shows that the industry lost $208 billion last year and nearly one tenth of this was simply due to Tiger Global.\n\nHowever, not all funds were losers in 2022. The best performing hedge fund during the year was Ken Griffin's Citadel Investments. Citadel made $16 billion last year, nearly twice what the second best performing hedge fund D.E. Shaw Group made. So, undoubtedly, Citadel is the king of the hedge fund world right now. This strong performance made Citadel's founder and owner Mr. Ken Griffin not only one of the richest hedge fund managers in the world but also one of the richest people on the planet. Data from Forbes Magazine shows that Mr. Griffin's current net worth sits at a cool $32.3 billion - making him one of the fifty richest folks all around. Quite an achievement, we'd say, and one that becomes even more impressive when you consider the history of his fortunes. This is due to the fact that as recently as 2020, the billionaire's net worth stood at $12 billion. Looking at this, it would appear as if while the world is up in flames, Mr. Griffin knows how to hold his ground and do what he's best at doing i.e. making cold, hard cash.\n\nStory continues\n\nThe billionaire is an alumnus of Harvard University, and he has been investing since his time at college. He set up Citadel just a year after graduating from university, and would soon go on to make high double digit returns. So naturally, his perspective on how to deal with losses and navigate through adversity is nothing less of a goldmine. Well, lucky for us, Mr. Griffin offered some gems during a fireside chat at the Yale School of Management in April 2023, where he shared:\n\nWell there's a little saying, a little quip that I like to make. History is written by the winners. Right. So the wonderful history of Citadel is how we're the most profitable hedge fund of all time. The chapter of how we were on the verge of going business in '08 is now like a footnote in that book. All right. That's a very important note. It is now all been an easy march to success. It's had, you know, I think have the interesting position in life I probably lost, my team has probably lost more money that perhaps any other firm in existence. We just happened to have made more money [LAUGHS] than almost any other firm in existence. And it's the net that everyone talks about. I mean there's years when our lost are. . are. . .hundreds of billions of dollars, I don't know if it's hundreds, it's over a hundred, maybe hundreds. It's numbers are incomprehensible, right. So, number is all my losses are my tuition, I have the most expensive education in American history. And a number of my colleagues have education that are becoming competitively - expensive.\n\nAnd I think it's very important, that like, we, in some sense you have have to have a moment of levity, okay? If every time you lost money, you got depressed and angry and you couldn't deal with it, you'd just have a very short career. you'd just have a very short career. So you need to be able to take a step back and go, 'it's a tuition bill I paid.' And it doesn't mean that you don't think very long and hard about what went wrong. But you have to keep it in perspective.\n\nIn '08 that tuition bill almost became getting expelled from school. Because we were, we lost half of our equity in sixteen weeks, in a firm that had never had a double digit draw down in twenty years. The only reason we survived, and there's a number of reason, but the principle reason we survived is when long term capital failed 1998, I went and met with a number of senior people that worked at Long Term Capital. Why did I do this? What was my agenda? I wanted to understand how does a firm that loses 90% of its equity in a levered financial services industry, still stay in business? Like if you ask me that's one of the greatest accomplishments of all time, was that they lost 90% of their equity before they lost control of their business in a financial services, in a levered financial services company. And much of what we learned from how they survived that was actually fundamentally existentially important to our ability to withstand the turmoil of 2008. So there's a very important lesson here, which is not only due to want to learn from your mistakes, you would want to learn from other people's mistakes. They're much cheaper tuition bills.\n\nLearning from others is central to Mr. Griffin's philosophy. But what if you could learn from him? That's what we will do in this article. Let's take a look at some of Ken Griffin's favorite stocks, out of which some notable ones are Adobe Inc. (NASDAQ:ADBE), NVIDIA Corporation (NASDAQ:NVDA), and Meta Platforms, Inc. (NASDAQ:META). Billionaire Ken Griffin's 2023 Portfolio: Top Stock Picks\n\nKen Griffin of Citadel Investment Group\n\nOur Methodology\n\nTo determine which stocks are on Ken Griffin and Citadel Investments' radar, we took a look at the hedge fund's filings for the first quarter of 2023. Out of these, the call options, put options, and investments in exchange traded funds have been omitted and the resulting top fifteen stocks are listed below. Finally, one thing to keep in mind when reading this list is that Mr. Griffin has increased his stakes in most of these companies by hundreds of percent, indicating that he continues to be bullish on most of these stocks.\n\nBillionaire Ken Griffin's 2023 Portfolio: Top 15 Stock Picks\n\n15. ResMed Inc. (NYSE:RMD)\n\nCitadel Investments' Q1 2023 Stake: $460 million\n\nResMed Inc. (NYSE:RMD) is a medical instruments company headquartered in San Diego, California. The firm makes and sells a variety of products such as diagnostics devices and dental equipment.\n\nBy the end of last year's fourth quarter, 34 of the 943 hedge funds part of Insider Monkey's database had held a stake in ResMed Inc. (NYSE:RMD). The firm's largest hedge fund investor after Citadel as of March 2023 is Brandon Haley's Holocene Advisors with a $142 million stake.\n\nNVIDIA Corporation (NASDAQ:NVDA), Adobe Inc. (NASDAQ:ADBE), and Meta Platforms, Inc. (NASDAQ:META) are met by ResMed Inc. (NYSE:RMD) in the list of Ken Griffin's top 2023 investments.\n\n14. Walmart Inc. (NYSE:WMT)\n\nCitadel Investments' Q1 2023 Stake: $463 million\n\nWalmart Inc. (NYSE:WMT) is one of the world's largest retailers in terms of both its stores and the number of employees. The firm is based in Bentonville, Arkansas.\n\nInsider Monkey took a look at 943 hedge fund portfolios for last year's December quarter and discovered that 66 had invested in Walmart Inc. (NYSE:WMT). Ken Fisher's Fisher Asset Management is its largest investor through a $1.2 billion investment.\n\n13. FedEx Corporation (NYSE:FDX)\n\nCitadel Investments' Q1 2023 Stake: $467 million\n\nFedEx Corporation (NYSE:FDX) is a courier and logistics and transportation company. The firm has tens of thousands of vehicles and hundreds of service centers in its portfolio.\n\n48 of the 943 hedge funds part of Insider Monkey's database had bought FedEx Corporation (NYSE:FDX)'s shares. The firm's second largest investor in Q1 2023 is  since it owns Peter Rathjens, Bruce Clarke, and John Campbell's Arrowstreet Capital shares that are worth $454 million.\n\n12. DexCom, Inc. (NASDAQ:DXCM)\n\nCitadel Investments' Q1 2023 Stake: $469 million\n\nDexCom, Inc. (NASDAQ:DXCM) is another medical devices company that is also based in San Diego, California. The firm makes and sells glucose monitoring systems.\n\nAs of December 2022, 70 of the 943 hedge funds profiled by Insider Monkey had invested in the firm. DexCom, Inc. (NASDAQ:DXCM)'s largest shareholder after Citadel is Paul Marshall and Ian Wace's Marshall Wace LLP with a $343 million stake.\n\n11. Humana Inc. (NYSE:HUM)\n\nCitadel Investments' Q1 2023 Stake: $494 million\n\nHumana Inc. (NYSE:HUM) is a healthcare plan provider. It provides supplemental benefit plans, healthcare plans, and insurance products among other services.\n\nAfter digging through 943 hedge funds for their fourth quarter of 2022 investments, Insider Monkey found out that 67 had held a stake in Humana Inc. (NYSE:HUM). The firm's largest investor in Q1 2023 was Rajiv Jain's GQG Partners with a $1 billion investment.\n\n10. Visa Inc. (NYSE:V)\n\nCitadel Investments' Q1 2023 Stake: $507 million\n\nVisa Inc. (NYSE:V) is a financial services firm headquartered in San Francisco, California. It provides payment cards, data analytics products, and other services.\n\nInsider Monkey's December quarter of 2022 study of 943 hedge fund portfolios discovered 177 investors in the firm. Visa Inc. (NYSE:V)'s largest shareholder is Chris Hohn's TCI Fund Management through a massive $4.3 billion stake.\n\n9. The Cigna Group (NYSE:CI)\n\nCitadel Investments' Q1 2023 Stake: $507 million\n\nThe Cigna Group (NYSE:CI) is a healthcare plan provider based in Bloomfield, Connecticut. It provides healthcare plans, insurance coverage, and other products.\n\n76 of the 943 hedge funds profiled by Insider Monkey had bought The Cigna Group (NYSE:CI)'s shares as of last year's final quarter. As of March 2023, Larry Robbins's Glenview Capital is its largest investor after Citadel since it owns 1.8 million shares that are worth $472 million.\n\n8. Intel Corporation (NASDAQ:INTC)\n\nCitadel Investments' Q1 2023 Stake: $561 million\n\nIntel Corporation (NASDAQ:INTC) is the largest chip manufacturer in the world. The firm is based in Santa Clara, California.\n\nAfter scouring through 943 hedge funds for last year's fourth quarter, Insider Monkey found out that 62 had bought a stake in the firm. Intel Corporation (NASDAQ:INTC)'s largest hedge fund shareholder is Peter Rathjens, Bruce Clarke, and John Campbell's Arrowstreet Capital with a $700 million stake.\n\n7. Palo Alto Networks, Inc. (NASDAQ:PANW)\n\nCitadel Investments' Q1 2023 Stake: $591 million\n\nPalo Alto Networks, Inc. (NASDAQ:PANW) is a cybersecurity firm that provides firewalls, threat protection, malware, and other products. It is headquartered in Santa Clara, California.\n\n85 of the 943 hedge funds part of Insider Monkey's December 2022 database had invested in Palo Alto Networks, Inc. (NASDAQ:PANW). In the next quarter, Palo Alto Networks, Inc. (NASDAQ:PANW)'s second largest investor was David Blood and Al Gore's Generation Investment Management with a $517 million investment.\n\n6. AT&T Inc. (NYSE:T)\n\nCitadel Investments' Q1 2023 Stake: $631 million\n\nAT&T Inc. (NYSE:T) is a telecommunications service provider that offers internet and cellular coverage among other products. It operates out of Dallas, Texas.\n\nAfter looking at 943 hedge fund shareholdings, Insider Monkey was able to sift out 55 investors in the firm in Q4 2022. AT&T Inc. (NYSE:T)'s second largest hedge fund investor is Israel Englander's Millennium Management with a $374 million stake.\n\nAdobe Inc. (NASDAQ:ADBE), AT&T Inc. (NYSE:T), NVIDIA Corporation (NASDAQ:NVDA), and Meta Platforms, Inc. (NASDAQ:META) are some of billionaire Ken Griffin's top stocks for 2023.\n\nClick to continue reading and see Billionaire Ken Griffin's 2023 Portfolio: Top 5 Stock Picks.\n\nSuggested Articles:\n\n11 Stocks with Heavy Insider Buying 10 Large-Cap Stocks with Insider Buying 15 Stocks Warren Buffett Sold\n\nDisclosure: None. Billionaire Ken Griffin's 2023 Portfolio: Top 15 Stock Picks is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/billionaire-ken-griffin-2023-portfolio-214325855.html", "symbols": ["3V64.F", "3V64.XETRA", "5AP.F", "ADB.F", "ADBE.US", "ADBE34.SA", "CGN.F", "CI.US", "DC4.F", "DXCM.US", "FDX.F", "FDX.MX", "FDX.US", "FDX.XETRA", "HUM.F", "HUM.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.037, "neu": 0.874, "pos": 0.089}}, {"date": "2023-05-22T18:21:00+00:00", "title": "22 Stocks That Aren’t Nvidia to Play the AI Boom", "content": "Investors are on the hunt for ways to play the artificial-intelligence software trend. Wall Street offers up a host of stocks.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1d09642b-7d9f-358a-9806-66d9a25f7d8d/22-stocks-that-aren%E2%80%99t-nvidia.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0, "neu": 0.897, "pos": 0.103}}, {"date": "2023-05-22T18:09:00+00:00", "title": "Nvidia Might Have Some Bad News on Gaming. Buy the Stock Anyway?", "content": "The chip maker is getting a vote of confidence from KeyBanc Capital Markets for its long-term commitment to AI apps.\n\nContinue reading", "link": "https://finance.yahoo.com/m/45edcd26-ed22-39c1-9bc5-6cfeb2aeca34/nvidia-might-have-some-bad.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.71, "neg": 0, "neu": 0.763, "pos": 0.237}}, {"date": "2023-05-22T17:45:00+00:00", "title": "3 Tech Stocks That Could Turn $1,000 into $10,000 by 2030", "content": "Most of the tech stocks that were amidst a selloff at the same time last year have rallied impressively in 2023. The two biggest tech companies are close to surpassing their peaks back in 2021, while others like Meta Platforms (NASDAQ:META) and Netflix (NASDAQ:NFLX) have more than doubled their value from their troughs. Nvidia (NASDAQ:NVDA) has nearly tripled its value since October. These tech giants are only some of the best tech stocks to buy now.\n\nOf course, not all tech stocks were blessed with a rally. Companies that failed to cost-cut their way to profitability continue to trade at depressed levels, even with promising growth prospects. I believe taking advantage of the myopia and snapping up some of these shares will lead to excellent ROI in a multi-year timeframe.\n\nHere are three of the best tech stocks to buy now:\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nSnap Inc (SNAP) The Snapchat and Instagram apps on displayed on an iPhone, which sits on a gray background.\n\nSource: BigTunaOnline / Shutterstock\n\nSnap Inc (NYSE:SNAP) currently offers a buy point that’s too compelling to ignore. It peaked near $83 back in 2021, and it is very unlikely that the company will fail to surpass this peak by 2030, considering the room for growth.\n\nFor starters, let’s talk about what went wrong here. The bearish sentiment behind SNAP stock is due to the company’s weak financials in the near term. Social media companies like Snapchat rely primarily on advertising revenue, which slumped considerably after the boom in 2021. However, it has returned to a more sustainable trajectory which Snapchat’s financials will also follow.\n\nThat’s not all. Snapchat is yet to fully maximize its ad potential. Facebook’s average revenue per user is $9.62 worldwide, while Snapchat’s is just $2.58. This is the primary metric the company needs to work on to reverse the sentiment, and it will not be too hard to do so if the ad market cooperates. At the same time, Snapchat’s daily active user base has been growing at a blistering speed and is at 383 million compared to 218 million in the pre-pandemic period.\n\nMy point is that its current financials shouldn’t bear too much weight right now. I’m confident the company can pull off strong growth by 2030 by adjusting its ARPU. The ad market’s bounce will also take some patience, but it will inevitably happen. Further, catalysts like a TikTok ban (a real possibility by 2030) will considerably boost Snapchat.\n\nAll things considered, SNAP is one of the best tech stocks to buy now, and a steal in my book.\n\nUnity Software (U) In this photo illustration Unity Software Inc. (U stock) logo is seen on a mobile phone and a computer screen.\n\nSource: viewimage / Shutterstock.com\n\nUnity Software (NYSE:U) specializes in video game software development. The stock has continued to languish near the $30 level, but I believe the bottom is in. There are several reasons to believe that the stock could rally much higher.\n\nUnity has shown strong sales growth, with revenue increasing by 56% year-over-year in Q1 2023, and revenue is estimated to hit $2.6 billion by the end of 2024. This growth is likely to continue as Unity’s game development engine remains the most popular tool for game developers, even with the Unreal Engine making some ground regarding higher-end games.\n\nMoreover, if Unity’s financials remain consistent, the stock could very well see a 10x price appreciation by 2030. The gaming industry will only keep growing in the long run, with Gen Z and Gen Alpha getting more and more sway over the market. Thus, U is among the best tech stocks to buy now as there’s little downside risk with substantial upside potential.\n\nLuminar Technologies (LAZR) Luminar (LAZR stock) sign with greenery around it\n\nSource: JHVEPhoto/shutterstock.com\n\nLuminar Technologies (NASDAQ:LAZR) is a tech company that will benefit from the ongoing electric vehicle boom. EVs are the future, whether it may take 10 or 20 years, and EV companies are increasingly embracing LiDAR technology for self-driving cars.\n\nLuminar specializes in the tech, considered superior to what EVs currently use today. Self-driving cars use other sensors to see, notably radars and cameras, but laser vision is hard to match. Radars are reliable but don’t offer the resolution needed to pick out arms and legs. Cameras deliver the detail but require machine-learning software to translate 2D images into 3D understanding. Thus, I am confident that LiDAR is going to gain significant traction by 2030.\n\nIn fact, we are already seeing the adoption of LiDAR by companies like Volvo (OTCMKTS:VLVLY) and Xpeng (NYSE:XPEV). This has translated into strong sales growth for Luminar, which aims to grow its revenue by triple digits every year for the next five years.\n\nOn the date of publication, Omor Ibne Ehsan did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live The Best $1 Investment You Can Make Today Wall Street Titan: Here’s My #1 Stock for 2023 It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 3 Tech Stocks That Could Turn $1,000 into $10,000 by 2030 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-tech-stocks-could-turn-174500550.html", "symbols": ["1SI.F", "1SI.XETRA", "LAZR.US", "META.US", "NFLX.US", "NVDA.US", "SNAP.US", "U.US", "XPEV.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.027, "neu": 0.834, "pos": 0.14}}, {"date": "2023-05-22T17:34:26+00:00", "title": "Nvidia Partner Among 5 Semiconductor Stocks Etching Bases And Buy Zones", "content": "After Nvidia partner ASML posted a 180% spike in earnings, ASML stock has gapped up into buy range with rising relative strength.\n\nContinue reading", "link": "https://finance.yahoo.com/m/dbc7b414-a275-30d5-a65a-11b07dd89f21/nvidia-partner-among-5.html", "symbols": ["ACLS.US", "AMAT.MX", "AMAT.US", "AP2.F", "AP2.XETRA", "ASME.F", "ASME.XETRA", "ASML.AS", "ASML.US", "ASMLF.US", "LAR.F", "LRCX.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "XXA1.F"], "tags": [], "sentiment": {"polarity": 0.494, "neg": 0, "neu": 0.873, "pos": 0.127}}, {"date": "2023-05-22T17:34:26+00:00", "title": "ASML Among 5 Semiconductor Stocks Etching Bases And Buy Zones", "content": "After Nvidia partner ASML posted a 180% spike in earnings, ASML stock has gapped up into buy range with rising relative strength.\n\nContinue reading", "link": "https://finance.yahoo.com/m/dbc7b414-a275-30d5-a65a-11b07dd89f21/asml-among-5-semiconductor.html", "symbols": ["ASMLF.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.494, "neg": 0, "neu": 0.873, "pos": 0.127}}, {"date": "2023-05-22T17:30:00+00:00", "title": "Nvidia Stock Has Risen on AI. How It’s Taking On Intel and AMD in Supercomputers.", "content": "Nvidia said a new supercomputer will be based on its Grace CPU Superchip, marking a push into an area dominated by Intel and AMD.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f4d08313-dc0d-32f4-b2dc-2e1a3ee033eb/nvidia-stock-has-risen-on-ai..html", "symbols": ["INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0, "neu": 0.891, "pos": 0.109}}, {"date": "2023-05-22T16:55:00+00:00", "title": "Nvidia Stock: Take a Profit on AI Strength Into Earnings", "content": "Here's how to play the recent strength in artificial intelligence names ahead of Nvidia earnings on May 24.\n\nContinue reading", "link": "https://finance.yahoo.com/m/22bbb096-34b8-36e2-ad15-37c89bba22aa/nvidia-stock%3A-take-a-profit.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.827, "neg": 0, "neu": 0.661, "pos": 0.339}}, {"date": "2023-05-22T16:48:20+00:00", "title": "Intel gives details on future AI chips as it shifts strategy", "content": "By Stephen Nellis\n\n(Reuters) - Intel Corp on Monday provided a handful of new details on a chip for artificial intelligence (AI) computing it plans to introduce in 2025 as it shifts strategy to compete against Nvidia Corp and Advanced Micro Devices Inc.\n\nAt a supercomputing conference in Germany on Monday, Intel said its forthcoming \"Falcon Shores\" chip will have 288 gigabytes of memory and support 8-bit floating point computation. Those technical specifications are important as artificial intelligence models similar to services like ChatGPT have exploded in size, and businesses are looking for more powerful chips to run them.\n\nThe details are also among the first to trickle out as Intel carries out a strategy shift to catch up to Nvidia, which leads the market in chips for AI, and AMD, which is expected to challenge Nvidia's position with a chip called the MI300.\n\nIntel, by contrast, has essentially no market share after its would-be Nvidia competitor, a chip called Ponte Vecchio, suffered years of delays.\n\nIntel on Monday said it has nearly completed shipments for Argonne National Lab's Aurora supercomputer based on Ponte Vecchio, which Intel claims has better performance than Nvidia's latest AI chip, the H100.\n\nBut Intel's Falcon Shores follow-on chip won't be to market until 2025, when Nvidia will likely have another chip of its own out.\n\nJeff McVeigh, interim head of Intel's accelerated computing systems and graphics group, said the company is taking time to rework the chip after giving up its prior strategy of combining graphics processing units (GPUs) with its central processing units (CPUs).\n\n\"While we aspire to have the best CPU and the best GPU in the market, it was hard to say that one vendor at one time was going to have the best combination of those,\" McVeigh told Reuters. \"If you have discrete offerings, that allows you at the platform level to choose both between the ratio as well as the vendors.\"\n\n(Reporting by Stephen Nellis in San Francisco; Editing by Bill Berkrot)", "link": "https://finance.yahoo.com/news/intel-gives-details-future-ai-164820076.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.019, "neu": 0.864, "pos": 0.117}}, {"date": "2023-05-22T16:45:00+00:00", "title": "CORRECTED-Intel gives details on future AI chips as it shifts strategy", "content": "(Corrects McVeigh title in paragraph 7 to reflect he is no longer interim leader of Intel super computing chip group)\n\nBy Stephen Nellis\n\nMay 22 (Reuters) - Intel Corp on Monday provided a handful of new details on a chip for artificial intelligence (AI) computing it plans to introduce in 2025 as it shifts strategy to compete against Nvidia Corp and Advanced Micro Devices Inc.\n\nAt a supercomputing conference in Germany on Monday, Intel said its forthcoming \"Falcon Shores\" chip will have 288 gigabytes of memory and support 8-bit floating point computation. Those technical specifications are important as artificial intelligence models similar to services like ChatGPT have exploded in size, and businesses are looking for more powerful chips to run them.\n\nThe details are also among the first to trickle out as Intel carries out a strategy shift to catch up to Nvidia, which leads the market in chips for AI, and AMD, which is expected to challenge Nvidia's position with a chip called the MI300.\n\nIntel, by contrast, has essentially no market share after its would-be Nvidia competitor, a chip called Ponte Vecchio, suffered years of delays.\n\nIntel on Monday said it has nearly completed shipments for Argonne National Lab's Aurora supercomputer based on Ponte Vecchio, which Intel claims has better performance than Nvidia's latest AI chip, the H100.\n\nBut Intel's Falcon Shores follow-on chip won't be to market until 2025, when Nvidia will likely have another chip of its own out.\n\nJeff McVeigh, corporate vice president of Intel's super compute group, said the company is taking time to rework the chip after giving up its prior strategy of combining graphics processing units (GPUs) with its central processing units (CPUs).\n\n\"While we aspire to have the best CPU and the best GPU in the market, it was hard to say that one vendor at one time was going to have the best combination of those,\" McVeigh told Reuters. \"If you have discrete offerings, that allows you at the platform level to choose both between the ratio as well as the vendors.\" (Reporting by Stephen Nellis in San Francisco; Editing by Bill Berkrot)", "link": "https://finance.yahoo.com/news/intel-gives-details-future-ai-164500301.html", "symbols": ["INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.99, "neg": 0.024, "neu": 0.847, "pos": 0.13}}, {"date": "2023-05-22T16:35:13+00:00", "title": "What's Going On With NVIDIA Stock Today", "content": "Nvidia Corp (NASDAQ: NVDA) has announced a pact with Rolls Royce Holdings Plc(OTC: RLLCF) and Classiq to design jet engines using quantum computing.\n\nThe companies used quantum-computing technologies to introduce computation fluid dynamics in operating jet engines.\n\nLeveraging Nvidia Corp's quantum-computing platform, the companies simulated the world's largest quantum-computing circuit for computational fluid dynamics to develop jet engines.\n\nThe circuit was built using NVIDIA A100 Tensor Core GPUs.\n\n\"Designing jet engines, which are one of the most complicated devices on earth, is expensive and computationally challenging,\" said Ian Buck, vice president of Hyperscale and HPC at Nvidia Corp.\n\nNvidia Corp's quantum computing platform gives Rolls-Royce a potential path to tackle these problems while accelerating its research of more efficient jet engines.\n\nNvidia Corp also announced plans to build a new lab with the Jülich Supercomputing Centre (JSC) at Forschungszentrum Jülich (FZJ).\n\nBased on the NVIDIA quantum computing platform, the lab will feature a classical-quantum supercomputer in partnership with ParTec AG, Munich.\n\nAlso Read:Nvidia Analyst Lifts Price Target Ahead Of Q1 Results: 'Should Warrant A Meaningful Premium vs Semiconductor Peers'\n\nThe company is scheduled to report first-quarter results On May 24 after the market close. The chipmaker is widely expected to report earnings per share of $0.91, with revenues of $6.51 billion.\n\nPrice Action: NVDA shares traded higher by 0.42% at $313.95 on the last check Monday.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article What's Going On With NVIDIA Stock Today originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/whats-going-nvidia-stock-today-163513759.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "RLLCF.US", "RR.LSE", "RRU.F", "RYCEF.US", "RYCEY.US"], "tags": [], "sentiment": {"polarity": 0.971, "neg": 0.009, "neu": 0.887, "pos": 0.103}}, {"date": "2023-05-22T16:11:00+00:00", "title": "Beyond Nvidia: Wall Street Offers Other Ways To Play AI", "content": "Investors are on the hunt for ways to play the artificial-intelligence software trend. Wall Street offers up a host of stocks.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1d09642b-7d9f-358a-9806-66d9a25f7d8d/beyond-nvidia%3A-wall-street.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0, "neu": 0.897, "pos": 0.103}}, {"date": "2023-05-22T15:15:00+00:00", "title": "Nvidia ETFs Look Strong Ahead of Q1 Earnings", "content": "Graphics chipmaker Nvidia NVDA is set to release first-quarter fiscal 2024 results on May 24, after market close. Nvidia stock has more than doubled in value this year, rising about 114%. This is much higher than the industry average of 43.7%.\r\n\r\nThe outperformance is expected to continue if the chipmaker comes up with an earnings beat in its Q1 report. Additionally, Wall Street analysts have turned more bullish ahead of the chipmaker’s quarterly earnings report. Given this, ETFs having the largest allocation to Nvidia could make compelling plays ahead of its earnings report. These include AXS Esoterica NextG Economy ETF WUGI, Pacer Data and Digital Revolution ETF TRFK, VanEck Vectors Semiconductor ETF SMH, The Spear Alpha ETF SPRX and Global X Robotics & Artificial Intelligence ETF BOTZ.\n\nEarnings Whispers\n\nNvidia currently has a Zacks Rank #3 (Hold) and an Earnings ESP of +2.43%. According to our methodology, the combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 increases the chances of an earnings beat. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\r\n\r\nThis videogame-gear specialist saw no earnings estimate revision over the past 30 days for the first quarter of fiscal 2024. Nvidia’s earnings surprise history is not impressive. It delivered a negative earnings surprise of 3.20%, on average, in the last four quarters. Nvidia is expected to post earnings and revenue decline of 32.3% and 21.5%, respectively, for the to-be-reported quarter.\r\n\r\nThe Zacks Consensus Estimate for the average target price is $279.19, with nearly 81% of the analysts giving a Strong Buy or a Buy rating ahead of NVDA earnings.\n\nWhat’s Hot?\n\nThe chipmaker is at the center of the Artificial Intelligence (AI) feeding frenzy, which is making Wall Street bullish on the semiconductor specialist ahead of its earnings. The couple of the analysts — Oppenheimer and Susquehanna — raised the price targets for the stock. Analysts are optimistic about Nvidia AI-geared graphics processing units.\r\n\r\nPer the yahoo finance article, hedge funds have increased exposure to NVDA as the chipmaker continues to win large-volume orders for its AI chips and growing GPU order momentum in the gaming market (read: Guide to Artificial Intelligence ETFs).\r\n\r\nFor the first quarter of fiscal 2024, the graphics chipmaker expects revenues of around $6.5 billion, plus or minus 2%. Nvidia believes demand for its artificial intelligence and data-center chips will remain strong though it continues to struggle with a slowdown in the personal computer market.\n\nStory continues\n\nETFs in Focus\n\nLet’s delve into each ETF below:\r\n\r\nAXS Esoterica NextG Economy ETF (WUGI)\r\n\r\nAXS Esoterica NextG Economy ETF is an actively managed ETF that invests in stocks of companies that benefit from the ever-evolving digital economy. It holds 29 stocks in the basket, with Nvidia occupying the top position at 14.4%. AXS Esoterica NextG Economy ETF has key holdings in electronic compo-semiconductor, computer software and applications software.\r\n\r\nAXS Esoterica NextG Economy ETF has accumulated $18.2 million in its asset base and charges 75 bps in fees per year. It trades in an average daily volume of 2,000 shares.\r\n\r\nPacer Data and Digital Revolution ETF (TRFK)\r\n\r\nPacer Data and Digital Revolution ETF aims to offer investors exposure to the globally listed stocks and depositary receipts of data and digital revolution companies. It follows the Pacer Data Transmission and Communication Revolution Index, holding 80 stocks in its basket. Out of these, Nvidia is the top firm, accounting for a 10.5% share. Semiconductors take the largest share at 33.7%, while communication equipment and system software round off the next two spots.\r\n\r\nPacer Data and Digital Revolution ETF debuted in June last year and has accumulated $1.1 million in its asset base. It has an expense ratio of 0.60%. TRFK trades in a meager volume of under 1000 shares per day on average.\r\n\r\nVanEck Vectors Semiconductor ETF (SMH)\r\n\r\nVanEck Vectors Semiconductor ETF offers exposure to the companies involved in semiconductor production and equipment. SMH follows the MVIS US Listed Semiconductor 25 Index, which tracks the most-liquid companies in the industry based on market capitalization and trading volume. VanEck Vectors Semiconductor ETF holds 25 stocks in its basket, with Nvidia occupying the top position at 14.5% (read: Insights Into 13F Filings: ETFs to Bet Like Billionaires). \r\n\r\nVanEck Vectors Semiconductor ETF has managed assets worth $8 billion and charges 35 bps in annual fees and expenses. SMH is heavily traded with a volume of 7.5 million shares per day and has a Zacks ETF Rank #2 (Buy) with a High risk outlook.\r\n\r\nThe Spear Alpha ETF (SPRX)\r\n\r\nThe Spear Alpha ETF is an actively managed fund that invests in companies poised to benefit from breakthrough trends in industrial technology. The ETF’s objective is to find underappreciated opportunities across different industrial supply chains that are beneficiaries of secular themes such as enterprise digitalization, automation & robotics, artificial intelligence, environmental focus and decarbonization, photonics and additive manufacturing, and space exploration. The Spear Alpha ETF holds 23 stocks in its basket, with Nvidia taking the second spot at a 9.7% share.\r\n\r\nThe Spear Alpha ETF has accumulated $4 million in its asset base and charges 75 bps in annual fees. It trades in an average daily volume of 4,000 shares.\r\n\r\nGlobal X Robotics & Artificial Intelligence ETF (BOTZ)\r\n\r\nGlobal X Robotics & Artificial Intelligence ETF follows the Indxx Global Robotics & Artificial Intelligence Thematic Index, which seeks investment in companies that stand to benefit from the increased adoption and utilization of robotics and AI, including those involved with industrial robotics and automation, non-industrial robots and autonomous vehicles (read: Artificial Intelligence ETF Hits New 52-Week High).\r\n\r\nGlobal X Robotics & Artificial Intelligence ETF has 44 stocks in its basket, with NVIDIA occupying the second spot with a 9.7% share. The ETF has AUM of $1.8 billion and an average daily volume of 670,000 shares. It charges 69 bps in annual fees.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nVanEck Semiconductor ETF (SMH): ETF Research Reports\n\nGlobal X Robotics & Artificial Intelligence ETF (BOTZ): ETF Research Reports\n\nAXS Esoterica NextG Economy ETF (WUGI): ETF Research Reports\n\nSpear Alpha ETF (SPRX): ETF Research Reports\n\nPacer Data and Digital Revolution ETF (TRFK): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/nvidia-etfs-look-strong-ahead-151500717.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.029, "neu": 0.842, "pos": 0.129}}, {"date": "2023-05-22T15:11:00+00:00", "title": "Nvidia Could Miss on Gaming, but Buy the Stock Anyway. Here’s Why.", "content": "The chip maker is getting a vote of confidence from KeyBanc Capital Markets for its long-term commitment to AI apps.\n\nContinue reading", "link": "https://finance.yahoo.com/m/45edcd26-ed22-39c1-9bc5-6cfeb2aeca34/nvidia-could-miss-on-gaming%2C.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.71, "neg": 0, "neu": 0.763, "pos": 0.237}}, {"date": "2023-05-22T14:39:42+00:00", "title": "Semiconductors: Nvidia is best performing S&amp;P 500 stock in 2023", "content": "KeyBanc Capital Markets Equity Research Analyst John Vinh and Interactive Brokers Chief Strategist Steve Sosnick join Yahoo Finance Live to discuss the performance of Nvidia stock, as the company has been rated the best performing on S&P 500 this year.", "link": "https://finance.yahoo.com/video/semiconductors-nvidia-best-performing-p-143942418.html", "symbols": ["0R2T.LSE", "GSPC.INDX", "MTE.F", "MTE.XETRA", "MU.MX", "MU.US", "MUTC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.751, "neg": 0, "neu": 0.856, "pos": 0.144}}, {"date": "2023-05-22T14:31:00+00:00", "title": "Factors to Note Ahead of Intuit's (INTU) Q3 Earnings Release", "content": "Intuit INTU is scheduled to report third-quarter fiscal 2023 results on May 23.\n\nThe company projects fiscal third-quarter revenues to grow year over year in the 8-9% range. The Zacks Consensus Estimate for revenues is pegged at $6.09 billion, indicating year-over-year growth of 8.1%.\n\nOn a non-GAAP basis, Intuit anticipates earnings per share in the range of $8.42-$8.49. The consensus mark for earnings is pegged at $8.45 per share, suggesting a year-over-year rise of 10.5%.\n\nIntuit Inc. Price and EPS Surprise Intuit Inc. Price and EPS Surprise\n\nIntuit Inc. price-eps-surprise | Intuit Inc. Quote\n\nKey Factors at Play\n\nThe gradual recovery in Small Business and Self-Employed is expected to have contributed to the top line in the quarter under review. The Zacks Consensus Estimate for Small Business’ quarterly revenues is pegged at $1.94 billion. In the last quarter, the business unit grew 20%, driven by solid customer growth in QuickBooks Online payroll, Mailchimp and QuickBooks Online payments.\n\nIntuit’s fiscal third-quarter revenues are likely to have witnessed solid growth in the Online Ecosystem, driven by an expanding subscriber base for Quickbooks Online and ARPC. The Zacks Consensus Estimate for total Online Ecosystem’s revenues is pegged at $1.44 billion for the quarter under review, indicating a 21.1% rise from the prior year's reported figure. The consensus mark for Quickbooks Online’s revenues is pegged at $715 million, suggesting a 23.7% year-over-year improvement. The Online Ecosystem is likely to have boosted overall sales in the third quarter.\n\nThe solid momentum of INTU’s leading product, QuickBooks Capital and improving customer retention rates are anticipated to have acted as tailwinds in the fiscal third quarter.\n\nIn the fiscal third quarter, new customer addition and extension filers are likely to boost revenues from the company’s Consumer tax business. The Zacks Consensus Estimate for the Consumer tax business’ revenues is pegged at $3.52 billion, higher than the year-ago quarter’s reported figure of $3.24 billion.\n\nStory continues\n\nHowever, due to the ongoing macroeconomic volatility, Intuit business partners have been pulling back from extending their credit, risking credit performance deterioration in the near term. This is expected to have led to lower Credit Karma revenues in the quarter to be reported. The business unit contributed $375 million to INTU’s second-quarter fiscal 2023 total revenues. The Zacks Consensus Estimate for Credit Karma’s third-quarter revenues is pegged at $377 million, indicating a year-over-year decline of 19.4%.\n\nWhat Our Model Says\n\nOur proven model does not conclusively predict an earnings beat for Intuit this season. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the chances of an earnings beat. However, that’s not the case here.\n\nINTU has an Earnings ESP of 0.00% and a Zacks Rank #3 at present. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nStocks With the Favorable Combination\n\nPer our model, HP HPQ, NVIDIA Corporation NVDA and Ulta Beauty ULTA have the right combination of elements to post an earnings beat in the upcoming releases.\n\nCurrently, HP has an Earnings ESP of +1.85% and carries a Zacks Rank #2. The company is scheduled to report its second-quarter fiscal 2023 results on May 30. HPQ’s earnings surpassed the Zacks Consensus Estimate in each of the trailing four quarters, delivering an average earnings surprise of 1.1%. You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nThe Zacks Consensus Estimate for HP’s fiscal second-quarter earnings is 76 cents per share, indicating a year-over-year decline of 29.6%. The company is estimated to report revenues of $13.07 billion, which suggests a drop of 20.7% from the year-ago quarter.\n\nNVIDIA has an Earnings ESP of +2.43% and carries a Zacks Rank #3 at present. The company is scheduled to report its first-quarter fiscal 2024 results on May 24. The company’s earnings surpassed the Zacks Consensus Estimate in two of the trailing four quarters, missing twice, the average surprise being negative 3.2%.\n\nThe Zacks Consensus Estimate for NVDA’s fiscal first-quarter earnings is pegged at 92 cents per share, indicating a 32.4% drop from the year-ago quarter’s $1.36. The consensus mark for revenues is $6.51 billion, suggesting a year-over-year decrease of 21.5%.\n\nUlta Beauty has an Earnings ESP of +0.66% and carries a Zacks Rank #3 at present. The company is set to report first-quarter fiscal 2024 results on May 25. ULTA’s earnings beat the Zacks Consensus Estimate in each of the trailing four quarters, the average surprise being 26.2%.\n\nThe Zacks Consensus Estimate for ULTA’s quarterly earnings is pegged at $6.81 per share, suggesting a year-over-year increase of 8.1%. Its quarterly revenues are estimated to increase 11.5% year over year to $2.62 billion.\n\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHP Inc. (HPQ) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nIntuit Inc. (INTU) : Free Stock Analysis Report\n\nUlta Beauty Inc. (ULTA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/factors-note-ahead-intuits-intu-143100559.html", "symbols": ["34U.F", "INTU.US", "ITU.F", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "ULTA.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.016, "neu": 0.865, "pos": 0.119}}, {"date": "2023-05-22T14:13:19+00:00", "title": "AI predicted to be next big tech boom by Goldman Sachs", "content": "Interactive Brokers Chief Strategist Steve Sosnick joins Yahoo Finance Live to discuss AI profit within the next decade, predicted by Goldman Sachs.", "link": "https://finance.yahoo.com/video/ai-predicted-next-big-tech-141319137.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MI", "GOOG.MX", "GOOG.US", "GOOGL.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.44, "neg": 0, "neu": 0.879, "pos": 0.121}}, {"date": "2023-05-22T13:42:47+00:00", "title": "Why Micron Tech Stock Is Trading Lower Monday", "content": "Micron Technology, Inc (NASDAQ: MU) stock is trading lower Monday after China banned some of its product sales after a seven-week investigation into Micron. The Cyberspace Administration of China flagged serious cybersecurity issues posed by Micron products and potential risk to the country's key information supply chains, Financial Times reports. The regulator urged domestic firms that provide \"key information infrastructure\" to stop buying from Micron. Also Read:Alibaba's Cloud Business Spinoff - What's Going On With Alibaba Stock Friday Mainland China and Hong Kong accounted for 25% of Micron's $30.8 billion in revenue in 2022. Last October, Washington introduced expansive chip export controls, and the Netherlands and Japan have since followed. The U.S. also prohibited Nvidia Corp (NASDAQ: NVDA) from exporting H100, its state-of-the-art GPU for generative AI training, to China. Analysts said Micron is an obvious first target for Beijing as competitors' chips from South Korean rivals Samsung Electronics Co, Ltd (OTC: SSNLF) and SK Hynix could easily replace the former. In April, the White House asked South Korea to urge its chipmakers not to fill any market gap in China if they restricted Micron products. Beijing's ruling follows the G7's stark denunciation of China during the annual meeting of global leaders in Hiroshima. Analysts warned against a domino effect from Chinese companies that did not provide \"critical information infrastructure\" to seek to eliminate Micron from their supply chains. Price Action: MU shares traded lower by 4.77% at $64.92 premarket on the last check Monday. Photo via Wikimedia Commons\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Why Micron Tech Stock Is Trading Lower Monday originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/why-micron-tech-stock-trading-134247544.html", "symbols": ["MTE.F", "MTE.XETRA", "MU.MX", "MU.US", "MUTC34.SA", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.643, "neg": 0.055, "neu": 0.876, "pos": 0.069}}, {"date": "2023-05-22T13:05:48+00:00", "title": "The 3 Best Momentum Stocks to Buy in May 2023", "content": "Momentum stocks are securities that are rising fast and seeing their gains accelerate. This is often because a given stock has one or more catalysts that have led to a rally in its share price. Catalysts can include strong earnings, regulatory approval of a new product or service, a sizable stake taken by a notable investor. Additionally, there can be hype surrounding a particular economic sector, company or product that’s driving investor demand.\n\nNotably, momentum typically indicates underlying strength in a stock. For investors, there is nothing better than when a stock they own builds momentum and the share price continues to rise. However, it is important to stay on top of such stocks. Often times, momentum can quickly dissipate. Circumstances can change, and a single bad earnings report can lead to a quick selloff. Thus, the goal is to ride momentum stocks for as long as possible. Investors need to remember to take profits, and exit such positions accordingly.\n\nWith that said, here are the three best momentum stocks to buy in May 2023.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nCOF Capital One $97.93 NVDA Nvidia $312.64 LLY Eli Lilly $442.38\n\nCapital One (COF) A street view of a Capital One (COF) bank location in New York City.\n\nSource: Northfoto / Shutterstock.com\n\nWarren Buffett still has a lot of sway. This is evident in the share price of Capital One Financial Corp. (NYSE:COF), the company that is best known for its credit cards, but also functions as a full-service bank. COF stock has gained 10% since it was disclosed in a regulatory filing on May 15 that Buffett opened a new position in the stock during this year’s first quarter. Through his holding company, Berkshire Hathaway (NYSE:BRK-B), Buffett bought 9.92 million shares of Capital One, worth about $950 million.\n\nNews that Buffett has invested in COF stock led it to rebound from levels near its 52-week low. Like most bank stocks, Capital One had been dragged lower in recent months following the high-profile failures of several regional U.S. lenders. However, the stock now appears to have wind in its sales and is climbing higher.\n\nIncidentally, Buffett wasn’t the only well-known investor to buy Capital One stock in Q1. It was also disclosed that Michael Burry of The Big Short fame also opened a new position in COF stock in the first three months of the year.\n\nNvidia (NVDA) Nvidia (NVDA) logo on phone screen stock image.\n\nSource: sdx15 / Shutterstock.com\n\nUp 120% in less than five months, shares of microchip and semiconductor company Nvidia (NASDAQ:NVDA) look unstoppable right now. The company is riding momentum around both artificial intelligence and cloud computing, with analysts noting that Nvidia’s chips are essential for both industries. NVDA stock has been gathering steam in the lead-up to its next quarterly earnings print scheduled for May 24. Demand for its chips among A.I. firms and cloud computing servers is expected to lead the company to revise its outlook for the year higher.\n\nInvestment bank Oppenheimer & Co. (NYSE:OPY) recently maintained its buy rating and increased its price target on NVDA stock to $350 a share from $300, noting that AI momentum is likely to continue for the foreseeable future. The company is doing its best to capitalize on the hype surrounding artificial intelligence, as well as strong demand for cloud computing.\n\nThe big question now is whether Nvidia’s upcoming earnings will be able to match the red hot expectations of analysts and investors. I think more upside could be on the horizon, if investors continue to look for ways to play this incredible trend.\n\nEli Lilly (LLY) Eli Lilly and Company World Headquarters. Lilly makes Medicines and Pharmaceuticals XI\n\nSource: Jonathan Weiss / Shutterstock.com\n\nShares of pharmaceutical giant Eli Lilly (NYSE:LLY) have gained nearly 50% over the last 12 months. This includes a 20% gain so far this year.\n\nMomentum has been building behind LLY stock due to expectations for its weight loss drug called Tirzepatide. Speculation is that the U.S. Food and Drug Administration (FDA) will approve the medication for widespread use by year’s end. Most analysts expect Tirzepatide, which is also called Mounjaro, to be the next blockbuster pharmaceutical. Some are going so far as to predict that it will become the best-selling medication of all time.\n\nEli Lilly is pulling out all the stops to prepare for FDA approval of Tirzepatide, expanding its existing manufacturing capacity and investing in advertising campaigns. Tirzepatide has already been approved for use as a diabetes treatment, and its approval for weight loss is viewed by many as inevitable, potentially giving Eli Lilly a windfall in new sales. The most recent data from clinical trials of the drug have been very encouraging, leading investors to pile into LLY stock before it potentially skyrockets.\n\nOn the date of publication, Joel Baglole held long positions in NVDA and LLY. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live The Best $1 Investment You Can Make Today Wall Street Titan: Here’s My #1 Stock for 2023 It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post The 3 Best Momentum Stocks to Buy in May 2023 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-best-momentum-stocks-buy-130548943.html", "symbols": ["CAON34.SA", "CFX.F", "COF.MX", "COF.US", "LILY34.SA", "LLY.F", "LLY.MX", "LLY.US", "LLY.XETRA", "NVDA.US", "OPY.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.033, "neu": 0.843, "pos": 0.125}}, {"date": "2023-05-22T12:32:00+00:00", "title": "Why NVIDIA (NVDA) Might Surprise This Earnings Season", "content": "Investors are always looking for stocks that are poised to beat at earnings season and NVIDIA Corporation NVDA may be one such company. The firm has earnings coming up pretty soon, and events are shaping up quite nicely for their report.\n\nThat is because NVIDIA is seeing favorable earnings estimate revision activity as of late, which is generally a precursor to an earnings beat. After all, analysts raising estimates right before earnings — with the most up-to-date information possible — is a pretty good indicator of some favorable trends underneath the surface for NVDA in this report.\n\nIn fact, the Most Accurate Estimate for the current quarter is currently at 94 cents per share for NVDA, compared to a broader Zacks Consensus Estimate of 92 cents per share. This suggests that analysts have very recently bumped up their estimates for NVDA, giving the stock a Zacks Earnings ESP of +2.43% heading into earnings season.\n\nNVIDIA Corporation Price and EPS Surprise NVIDIA Corporation Price and EPS Surprise\n\nNVIDIA Corporation price-eps-surprise | NVIDIA Corporation Quote\n\nWhy is this Important?\n\nA positive reading for the Zacks Earnings ESP has proven to be very powerful in producing both positive surprises, and outperforming the market. Our recent 10-year backtest shows that stocks that have a positive Earnings ESP and a Zacks Rank #3 (Hold) or better show a positive surprise nearly 70% of the time, and have returned over 28% on average in annual returns (see more Top Earnings ESP stocks here).\n\nGiven that NVDA has a Zacks Rank #3 and an ESP in positive territory, investors might want to consider this stock ahead of earnings. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nClearly, recent earnings estimate revisions suggest that good things are ahead for NVIDIA, and that a beat might be in the cards for the upcoming report.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nStory continues\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/why-nvidia-nvda-might-surprise-123200397.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0, "neu": 0.811, "pos": 0.189}}, {"date": "2023-05-22T12:30:00+00:00", "title": "Play the AI Trend, but Don't Get Caught Up in the Hype", "content": "Artificial intelligence should benefit companies for years, but it's unrealistic to think it will be the elixir to head off a recession or cure inflation.\n\nContinue reading", "link": "https://finance.yahoo.com/m/62389794-307f-32b0-b73d-b019c2999eb5/play-the-ai-trend%2C-but-don%27t.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": -0.166, "neg": 0.12, "neu": 0.748, "pos": 0.132}}, {"date": "2023-05-22T12:26:04+00:00", "title": "Nvidia stock is trading on 'heroic' valuations amid its 2023 eruption: strategist", "content": "Nvidia (NVDA) stock has become a Wall Street darling again, but with that love comes a whole lot of expectation.\n\nShares of the chip giant have exploded 115% year to date, dusting the Nasdaq Composite's seemingly paltry 20% gain. The company's stock is leading the pack among well-known chip-makers: AMD (AMD) shares are up 63% on the year, Intel (INTC) has advanced 14%, and Qualcomm (QCOM) shares have actually lost 3.6%.\n\nThe stock has even outperformed mighty Apple's (AAPL) 35% appreciation.\n\n\"Nvidia is trading on heroic valuations which time will tell if they are justified,\" quipped Deutsche Bank strategist Jim Reid in a client note Monday.\n\nTo Reid's point, Nvidia's valuation clearly puts the stock in priced-for-perfection territory.\n\nThe stock trades on a forward price-to-earnings multiple of 63 times, according to Yahoo Finance data. By comparison, the S&P 500 trades on a forward price-to-earnings multiple of 18.8 times.\n\nIn effect, investors are banking on Nvidia to grow its future earnings by more than three times the rate of the S&P 500.\n\nThat's a tall order.\n\nOn a trailing 12-month basis, Nvidia's stock trades on an exorbitant 117 times enterprise value to EBITDA (earnings before interest, taxes, depreciation and amortization) multiple. Zooming in on the trailing price-to-sales ratio, investors are greeted with a lofty 27 times multiple.\n\nOut of the 57 sell-side analysts that cover Nvidia, 77% rate the stock a buy. There are zero sell ratings on Nvidia's stock on Wall Street.\n\nSo why the major optimism on Nvidia? Look no further than what Nvidia is building on the supercomputing and AI fronts. Microchip and Nvidia logo displayed on a phone screen are seen in this multiple exposure illustration photo taken in Krakow, Poland on April 10, 2023. (Photo by Jakub Porzycki/NurPhoto via Getty Images)\n\nMonday brought news out of Germany, where Reuters reported the company unveiled a new supercomputer in partnership with Hewlett Packard Enterprise (HPE) at a supercomputing conference. The computer — called Isambard 3 — is based on Nvidia's new high-powered Grace CPU chips.\n\nThe Grace CPU chips take aim at similar ones offered by AMD and Intel.\n\nStory continues\n\nMeantime, OpenAI's popular generative AI platform ChatGPT was developed using Nvidia GPUs.\n\nAnd at its GTC conference in March, Nvidia showed off a host of solutions for training and deploying complex models inherent to generative AI.\n\n“We are seeing an acceleration in demand,” Nvidia founder and CEO Jensen Huang told Yahoo Finance Live. “We’re seeing an acceleration of demand for our DGX AI supercomputers. We’re seeing an acceleration of demand for inference, because of generative AI.”\n\nWall Street's read is that Nvidia is a \"one-stop solution provider\" for all things tied to the hot generative AI movement, potentially leading to bumper profits well into the future.\n\n\"With leading silicon (GPU/DPU/Networking), hardware/software platforms, and a strong ecosystem, Nvidia is well-positioned to continue to benefit from major secular trends in AI, high performance computing, gaming, and autonomous vehicles, in our view,\" JP Morgan analyst Harlan Sur wrote in a research note.\n\nAdded Sur: \"Bottom line: Nvidia continues to be 1-2 steps ahead of its competitors in accelerated computing silicon/systems, software, and ecosystems.\"\n\nThese Nvidia bulls will be put to the test this week on two fronts.\n\nThe company's AI technology is rumored to be on display at Microsoft's (MSFT) three-day developer conference that kicks off mid-week. And earnings are out after the close of trading on Wednesday.\n\nThere is some chatter on the Street that no matter what Nvidia does this week, a pause in the stock price may be warranted due to those aforementioned heroic valuations.\n\nWarns Bank of America analyst Vivek Arya: \"Post-earnings volatility [on Nvidia] it to be expected given sky-high expectations and the stock's 97% return year to date (vs. Philadelphia Semiconductor Index up 18%).\"\n\nBrian Sozzi is Yahoo Finance's Executive Editor. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn. Tips on the banking crisis? Email brian.sozzi@yahoofinance.com\n\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/nvidia-stock-is-trading-on-heroic-valuations-amid-its-2023-eruption-strategist-122604952.html", "symbols": ["0R2T.LSE", "2HP.F", "A1MD34.SA", "AAPL.MX", "AAPL.US", "AAPL34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "APC.F", "APC.XETRA", "HPE.US", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "MSF.F", "MSF.XETRA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.026, "neu": 0.849, "pos": 0.125}}, {"date": "2023-05-22T12:16:38+00:00", "title": "Dow Jones Futures Rise: Biden-McCarthy Debt-Ceiling Talks Loom; China Move Hits Micron", "content": "President Biden and House Speaker McCarthy hold debt-ceiling talks today. Micron fell on new China sanctions, with other chip stocks down.\n\nContinue reading", "link": "https://finance.yahoo.com/m/765e91cc-2fea-32ae-b5f6-edac603f628f/dow-jones-futures-rise%3A.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-05-22T12:00:51+00:00", "title": "How Much $10,000 Invested In Meta's IPO 11 Years Ago Is Worth Now", "content": "Sorry you didn't invest in Meta Platforms' initial public offering 11 years ago? Don't be. You probably did much better on other S&P 500 stocks.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4cbe02ee-070a-307e-80ab-94fa309cbb9c/how-much-%2410%2C000-invested-in.html", "symbols": ["FB2A.F", "FB2A.XETRA", "MHL.F", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "SPGI.US"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0.045, "neu": 0.856, "pos": 0.099}}, {"date": "2023-05-22T12:00:28+00:00", "title": "Does NVIDIA (NASDAQ:NVDA) Have A Healthy Balance Sheet?", "content": "The external fund manager backed by Berkshire Hathaway's Charlie Munger, Li Lu, makes no bones about it when he says 'The biggest investment risk is not the volatility of prices, but whether you will suffer a permanent loss of capital.' So it seems the smart money knows that debt - which is usually involved in bankruptcies - is a very important factor, when you assess how risky a company is. As with many other companies NVIDIA Corporation (NASDAQ:NVDA) makes use of debt. But should shareholders be worried about its use of debt?\n\nWhy Does Debt Bring Risk?\n\nDebt and other liabilities become risky for a business when it cannot easily fulfill those obligations, either with free cash flow or by raising capital at an attractive price. If things get really bad, the lenders can take control of the business. However, a more common (but still painful) scenario is that it has to raise new equity capital at a low price, thus permanently diluting shareholders. Of course, debt can be an important tool in businesses, particularly capital heavy businesses. When we examine debt levels, we first consider both cash and debt levels, together.\n\nCheck out our latest analysis for NVIDIA\n\nHow Much Debt Does NVIDIA Carry?\n\nThe chart below, which you can click on for greater detail, shows that NVIDIA had US$11.0b in debt in January 2023; about the same as the year before. However, its balance sheet shows it holds US$13.3b in cash, so it actually has US$2.34b net cash. debt-equity-history-analysis\n\nHow Healthy Is NVIDIA's Balance Sheet?\n\nZooming in on the latest balance sheet data, we can see that NVIDIA had liabilities of US$6.56b due within 12 months and liabilities of US$12.5b due beyond that. On the other hand, it had cash of US$13.3b and US$3.83b worth of receivables due within a year. So its liabilities total US$1.96b more than the combination of its cash and short-term receivables.\n\nHaving regard to NVIDIA's size, it seems that its liquid assets are well balanced with its total liabilities. So while it's hard to imagine that the US$773.2b company is struggling for cash, we still think it's worth monitoring its balance sheet. Despite its noteworthy liabilities, NVIDIA boasts net cash, so it's fair to say it does not have a heavy debt load!\n\nStory continues\n\nIt is just as well that NVIDIA's load is not too heavy, because its EBIT was down 44% over the last year. Falling earnings (if the trend continues) could eventually make even modest debt quite risky. The balance sheet is clearly the area to focus on when you are analysing debt. But it is future earnings, more than anything, that will determine NVIDIA's ability to maintain a healthy balance sheet going forward. So if you want to see what the professionals think, you might find this free report on analyst profit forecasts to be interesting.\n\nBut our final consideration is also important, because a company cannot pay debt with paper profits; it needs cold hard cash. While NVIDIA has net cash on its balance sheet, it's still worth taking a look at its ability to convert earnings before interest and tax (EBIT) to free cash flow, to help us understand how quickly it is building (or eroding) that cash balance. Over the last three years, NVIDIA recorded free cash flow worth a fulsome 82% of its EBIT, which is stronger than we'd usually expect. That positions it well to pay down debt if desirable to do so.\n\nSumming Up\n\nWe could understand if investors are concerned about NVIDIA's liabilities, but we can be reassured by the fact it has has net cash of US$2.34b. The cherry on top was that in converted 82% of that EBIT to free cash flow, bringing in US$3.8b. So we don't have any problem with NVIDIA's use of debt. The balance sheet is clearly the area to focus on when you are analysing debt. However, not all investment risk resides within the balance sheet - far from it. Be aware that  NVIDIA is showing  3 warning signs in our investment analysis, you should know about...\n\nWhen all is said and done, sometimes its easier to focus on companies that don't even need debt. Readers can access a list of growth stocks with zero net debt100% free, right now.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nJoin A Paid User Research Session\r\nYou’ll receive a US$30 Amazon Gift card for 1 hour of your time while helping us build better investing tools for the individual investors like yourself. Sign up here", "link": "https://finance.yahoo.com/news/does-nvidia-nasdaq-nvda-healthy-120028366.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.112, "neu": 0.733, "pos": 0.155}}, {"date": "2023-05-22T11:22:00+00:00", "title": "Micron (MU) Faces Restrictions for Selling Products in China", "content": "Micron Technology MU has been imposed with a trade restriction by the Cyberspace Administration of China on selling its products in key domestic industries on national security concerns. In a statement, China’s cybersecurity regulator revealed that the U.S.-based memory chipmaker has failed to pass a cybersecurity review, which it had initiated in late March 2023.\n\nThe development can be seen as a retaliatory action by the Chinese government against the U.S. government’s increasing restrictions on Chinese access to critical and more advanced semiconductor technology.\n\nIn October 2022, the United States imposed an export ban on certain advanced chips that are used in data centers for artificial intelligence, data analytics and computing applications. Over the past few months, the Netherlands and Japan also joined the United States to restrict China from making advanced chips.\n\nMicron Technology, Inc. Price and Consensus Micron Technology, Inc. Price and Consensus\n\nMicron Technology, Inc. price-consensus-chart | Micron Technology, Inc. Quote\n\nThe tit-for-tat actions could jeopardize Micron’s prospects, which are already facing the brunt of the weak demand for its memory chips. Chip sales in China make up approximately 11% of Micron’s total revenues.\n\nIn late March, Micron reported weaker-than-expected financial results in the second quarter of fiscal 2023. The company reported a non-GAAP loss of $1.91 per share, which was significantly higher than the Zacks Consensus Estimate of a loss of 67 cents. The bottom line compared unfavorably with the prior-year quarter’s earnings of $2.14 per share.\n\nThe quarterly revenues of Micron plunged 53% year over year to $3.69 billion, which missed the consensus mark of $3.76 billion. The rapidly weakening consumer demand and substantial customer inventory adjustments across end markets amid macroeconomic uncertainty were the main reasons behind the dismal quarterly performance.\n\nThe memory chip maker has offices in Shanghai and Shenzhen and a chip packaging facility in the city of Xian. In early 2022, Micron announced that it would shut down DRAM design operations at its Shanghai facility by the end of the year. The move was seen as a strategic shift from the manufacturing of chips back to the United States amid mounting trade tensions between the United States and China.\n\nStory continues\n\nMU is not the only semiconductor company that has been impacted by the tech war between the world’s two largest economies. On Aug 31, 2022, NVIDIA Corporation NVDA disclosed that the U.S. government informed it on Aug 26 about imposing a new licensing requirement, effective immediately, for its A100, A100X and forthcoming H100 integrated circuit sales in China and Russia. The government also banned NVIDIA from exporting DGX or any other systems that incorporate A100 or H100 integrated circuits.\n\nThe new licensing requirements will also be implied for any future chip designs developed by NVIDIA that have a threshold greater than or equivalent to A100. Additionally, any systems developed in the future incorporating the aforementioned types and thresholds will fall under export restrictions.\n\nZacks Rank & Stocks to Consider\n\nCurrently, Micron and NVIDIA each carry a Zacks Rank #3 (Hold). Shares of MU and NVDA have rallied 36.4% and 114%, respectively, year to date (YTD).\n\nSome better-ranked stocks from the broader technology sector are Meta Platforms META and Manhattan Associates MANH, each sporting a sport a Zacks Rank #1 (Strong Buy). You can see the complete list of today's Zacks #1 Rank stocks here.\n\nThe Zacks Consensus Estimate for Meta's second-quarter 2023 earnings has been revised 43 cents northward to $2.87 per share in the past 30 days. For 2023, earnings estimates have been revised 15.2% upward to $12.04 per share in the past 30 days.\n\nMeta’s earnings beat the Zacks Consensus Estimate twice in the preceding four quarters while missing the same on two occasions, the average surprise being 15.5%. Shares of META have surged 104.2% YTD.\n\nThe Zacks Consensus Estimate for Manhattan Associates' second-quarter 2023 earnings has been revised upward by a couple of cents to 72 cents per share for the past 30 days. For 2023, earnings estimates have moved upward by 17 cents to $2.87 per share in the past 30 days.\n\nManhattan Associates' earnings beat the Zacks Consensus Estimate in the preceding four quarters, the average surprise being 33.6%. Shares of MANH have soared 45.9% YTD.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMicron Technology, Inc. (MU) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nManhattan Associates, Inc. (MANH) : Free Stock Analysis Report\n\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/micron-mu-faces-restrictions-selling-112200446.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.977, "neg": 0.062, "neu": 0.842, "pos": 0.096}}, {"date": "2023-05-22T11:00:49+00:00", "title": "7 High-Reward Stocks Riding the Crypto Boom", "content": "Crypto stocks are loaded with uncertainty, and if there’s one thing markets hate, it’s uncertainty. Until there’s a resolution over the debt debacle, we’ll see even more uncertainty.\n\nAll of which could be even more devastating to major indices, cryptocurrencies and crypto stocks.\n\nMore than likely, we’ll see an 11th-hour deal. Unfortunately, until that happens, a lot of investors will remain on the sidelines.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nOnce there’s a resolution, we’ll see a sharp rally, says JPMorgan, which should carry over into crypto stocks, including those on this list.\n\nMSTR MicroStrategy $288.28 BITS Global X Blockchain & Bitcoin Strategy ETF $33.09 BITO Pro Shares Bitcoin Strategy ETF $15.53 NVDA Nvidia $312.64 RIOT Riot Platforms $11.08 MARA Marathon Digital $9.18 SOFI SoFi $4.93\n\nMicroStrategy (MSTR) A chart of the MicroStrategy logo with a Bitcoin\n\nSource: JOCA_PH / Shutterstock.com\n\nMicroStrategy (NASDAQ:MSTR) just bought another 1,045 Bitcoin in late March, early April for about $29.3 million in cash.\n\nThat now brings the company’s total BTC holdings to 140,000 BTC, which is worth about $3.9 billion. In short, a good deal of MSTR’s financial success is tied to BTC.\n\nLook at recent earnings for proof. Earlier this month, MSTR posted an EPS of $31.79, as compared to a year-earlier loss of $11.58.\n\nIts Bitcoin-buying strategy has only increased the demand for shares of MSTR along the way. If Bitcoin can eventually revisit prior highs, MSTR could offer substantial upside opportunity.\n\nGlobal X Blockchain & Bitcoin Strategy ETF (BITS) Crypto coins on a phone screen showing stats for various cryptocurrencies.. best cryptos\n\nSource: Chinnapong / Shutterstock\n\nWith an expense ratio of 0.65%, the Global X Blockchain & Bitcoin Strategy ETF (NASDAQ:BITS) invests in both crypto and crypto-related companies.\n\nThe last time I mentioned BITS, it traded at around $29.90 on March 26.  It’s now up to $33.08 after testing an April high of $37.33.\n\nProShares Bitcoin Strategy ETF (BITO) Various cryptocurrency coins. Cryptos. Cryptocurrencies representing 3AC Crypto., ARBK Stock. cheap cryptos to buy on the rebound\n\nSource: Wit Olszewski / Shutterstock\n\nWe can also look at the Pro Shares Bitcoin Strategy ETF (NYSEARCA:BITO). With an expense ratio of 0.95%, the ETF tracks the performance of spot bitcoin and was the first bitcoin-linked ETF launched in the U.S.\n\nIt is also the world’s largest and most actively traded cryptocurrency ETF, according to ProShares.\n\nSince bottoming out around $11.50 in March, the ETF is back up to $15.46. It tested a high of $17.94 in April.\n\nNvidia (NVDA) Nvidia (NVDA) logo and sign on headquarters. Blurred foreground with green trees\n\nSource: Michael Vi / Shutterstock.com\n\nNvidia (NASDAQ:NVDA) provides the hardware to mine cryptocurrencies, which could fuel even more upside in the tech stock on a crypto recovery.\n\nWith its AI dominance, and market share in gaming, data centers, and robotics, NVDA should see strong, durable growth for years.\n\nOppenheimer just increased its target price on NVDA to $350 from $300.  Susquehanna raised its NVDA target to $350 from $310. Truist raised its target to $322 from $289 a share.\n\nAccording to Barron’s, the firms’ confidence comes from the development of new AI tools, and the growing need for AI-geared GPUs.\n\nI’m expecting even more upside in NVDA, as we near company earnings on May 24. I also believe we’ll see a beat on the top and bottom line, with raised guidance, which could send the NVDA to higher highs. Stay tuned for that. A lot of eyeballs will be on its earnings.\n\nRiot Platforms (RIOT) Bitcoin miners in large farm. ASIC mining equipment on stand racks mine cryptocurrency in steel container. Blockchain techology application specific integrated circuit datacenter. Server room lights. SOS Stock\n\nSource: Artie Medvedev / Shutterstock.com\n\nAs Bitcoin increases in value, miners like Riot Platforms (NASDAQ:RIOT) benefit. In fact, taking Bitcoin’s lead this year, RIOT exploded from about $3.30 to $11.07. From here, I’d like to see it closer to $23, which it tested in early 2022.\n\nWhile the company’s first-quarter total revenue dropped to $73.2 million from $79.8 million year over year, that was to be expected. Especially when the price of Bitcoin falls 44% year over year, as well.\n\nHowever, as Bitcoin regains even more lost ground, so should RIOT. Even better, in April, the company produced another 639 Bitcoin, an increase of 26% year over year. Also, as of April 30, RIOT now owns about 7,112 BTC, which carries a current value of about $191 million.\n\nMarathon Digital (MARA) Marathon Oil gas station carport on sunny day with blue sky background\n\nSource: Jonathan Weiss/shutterstock.com\n\nAnother mining stock to consider is Marathon Digital (NASDAQ:MARA). Along with RIOT and Bitcoin, MARA is waiting for something to happen with the debt ceiling issue.\n\nIf we can get a resolution soon, MARA could break from consolidation, with the potential to run back to $16 a share, in my opinion.\n\nRecent earnings were okay. While it posted a net loss of $7.2 million, or five cents a share, it was better than its year-earlier loss of $12.9 million, or a 12-cent loss.\n\nRevenues were $51.1 million, which was slightly below year-earlier revenue of $51.7 million.  Unfortunately, a 74% increase in BTC production was offset by lower BTC prices in the latest quarter.\n\nSoFi (SOFI) the Social Finance (SoFi stock) logo is displayed on a smartphone.\n\nSource: rafapress / Shutterstock.com\n\nSoFi (NASDAQ:SOFI) also has exposure to cryptocurrencies. Aside from crypto, there’s a lot to like here.\n\nFor one, after getting crushed over the last year, CEO Anthony Noto just bought another 1.13 million shares for about $5 million.  He paid between $4.36 and $4.58 for shares between Dec. 9 and 13, 2022.\n\nOn May 4, he bought another 50,000 shares. Then, on May 5, he picked up another 30,000.\n\nAll as the SOFI stock climbs higher after the company posted respectable earnings. Just last week, SOFI beat revenue and EPS. Revenue came in at $460.16 million. EPS was a loss of five cents. Meanwhile, analysts were looking for revenue of $441 million and an EPS loss of seven cents. This is definitely one of the crypto stocks to keep your eye on.\n\nOn the date of publication, Ian Cooper did not have (either directly or indirectly) any positions in the securities mentioned. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nIan Cooper, a contributor to InvestorPlace.com, has been analyzing stocks and options for web-based advisories since 1999.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live The Best $1 Investment You Can Make Today Wall Street Titan: Here’s My #1 Stock for 2023 It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 7 High-Reward Stocks Riding the Crypto Boom appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-high-reward-stocks-riding-110049902.html", "symbols": ["BITS.US", "MARA.US", "MIGA.F", "MSTR.US", "NVDA.US", "RIOT.US", "SOFI.US"], "tags": [], "sentiment": {"polarity": 0.978, "neg": 0.059, "neu": 0.851, "pos": 0.091}}, {"date": "2023-05-22T10:50:00+00:00", "title": "Everyone Is Talking About This Stock. Is It a Good Long-Term Option?", "content": "2023 isn't even halfway over, and already Nvidia (NASDAQ: NVDA) has added more than $400 billion in market value as the stock has more than doubled this year. Nvidia has been on a steady upward trajectory for one simple reason: AI. It's arguably the stock with the most to gain from the boom in artificial intelligence (AI) that was sparked by the launch of ChatGPT last November, and that's why everyone is talking about it.\n\nContinue reading", "link": "https://finance.yahoo.com/m/41fc568f-6049-3cb6-a9a8-535e3c40f10d/everyone-is-talking-about.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.801, "neg": 0.024, "neu": 0.866, "pos": 0.11}}, {"date": "2023-05-22T09:50:00+00:00", "title": "Are AI Stocks in a Bubble That's About to Burst?", "content": "Are AI stocks in a bubble that's about to burst? The definition of a stock market bubble is \"a significant run-up in stock prices without a corresponding increase in the value of the businesses they represent.\" Bubbles are typically caused by overexuberant speculation about future share price growth with little regard to business fundamentals.\n\nContinue reading", "link": "https://finance.yahoo.com/m/abc847d7-4d14-31c9-9ab0-0c79fd6b7543/are-ai-stocks-in-a-bubble.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AI.US", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "FB2A.F", "FB2A.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "MSF.F", "MSF.XETRA", "MSFT.MX"], "tags": [], "sentiment": {"polarity": 0.766, "neg": 0.024, "neu": 0.822, "pos": 0.154}}, {"date": "2023-05-22T06:00:00+00:00", "title": "NVIDIA Grace Drives Wave of New Energy-Efficient Arm Supercomputers", "content": "HAMBURG, Germany, May  21, 2023  (GLOBE NEWSWIRE) -- ISC—NVIDIA today announced a supercomputer built on the NVIDIA Grace™ CPU Superchip, adding to a wave of new energy-efficient supercomputers based on the Arm® Neoverse™ platform.\n\nThe Isambard 3 supercomputer to be based at the Bristol & Bath Science Park, in the U.K., will feature 384 Arm-based NVIDIA Grace CPU Superchips to power medical and scientific research, and is expected to deliver 6x the performance and energy efficiency of Isambard 2, placing it among Europe’s most energy-efficient systems.\n\nIt will achieve about 2.7 petaflops of FP64 peak performance and consume less than 270 kilowatts of power, ranking it among the world’s three greenest non-accelerated supercomputers. The project is being led by the University of Bristol, as part of the research consortium the GW4 Alliance, together with the universities of Bath, Cardiff and Exeter.\n\nIsambard 3 joins a growing wave of NVIDIA Arm-based supercomputers around the world, with additional systems that include GPUs being built at the Swiss National Supercomputing Centre and the Los Alamos National Laboratory in the U.S.\n\n“As climate change becomes an increasingly existential problem, it’s vital for computing to embrace energy-efficient technologies,” said Ian Buck, vice president of hyperscale and HPC at NVIDIA. “NVIDIA is working alongside the Arm Neoverse ecosystem to provide a path forward for the creation of more energy-efficient supercomputing centers, driving important breakthroughs in scientific and industrial research.”\n\n“From climate change to medicine, supercomputing is already enabling academic and industry leaders to take on some of the world’s biggest challenges,” said Mohamed Awad, senior vice president and general manager of infrastructure at Arm. “Expanding on important areas of research requires a level of performance and energy efficiency that Arm Neoverse uniquely delivers, and through our collaboration with NVIDIA, we’re proud to bring this to life in the Isambard 3 system.”\n\nIsambard 3 to Supercharge Breakthroughs in Life Science, Medicine, More\r\nIsambard 3, to be built by Hewlett Packard Enterprise, will enable Europe’s scientific research community to supercharge breakthroughs in AI, life sciences, medical, astrophysics and biotech. It will be able to create detailed models of exceptionally complex structures, such as wind farms and fusion reactors, to help researchers unlock new advances in clean and green energy.\n\nThe Arm-based NVIDIA Grace-powered system will also continue Isambard 2’s work of simulating molecular-level mechanisms to better understand Parkinson’s disease and find new treatments for osteoporosis and COVID-19. These compute-intensive applications benefit from the highest-performing cores, highest memory bandwidth and the optimal memory capacity per core provided by Grace.\n\n“Isambard 3’s application performance efficiency of up to 6x its predecessor, which rivals many of the 50 fastest TOP500 systems, will provide scientists with a revolutionary new supercomputing platform to advance groundbreaking research,” said Simon McIntosh-Smith, principal investigator for the Isambard project and professor of HPC at the University of Bristol. “The Arm-based NVIDIA Grace CPU enables the breakthrough energy efficiency required to push the boundaries of scientific discovery and solve some of humanity’s most difficult challenges.”\n\nOnce the system goes into production in spring 2024, Bristol expects the number of registered users to increase significantly beyond the current 800.\n\nAccelerating Scientific Discovery\r\nNVIDIA’s accelerated computing platform comprises NVIDIA H100 Tensor Core GPUs, NVIDIA Grace CPU Superchips, NVIDIA Grace Hopper™ Superchips, NVIDIA Quantum-2 InfiniBand networking and a full suite of NVIDIA AI and HPC software.\n\nLearn more about NVIDIA’s accelerated computing platform for HPC at ISC.\n\nAbout NVIDIA\r\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling the creation of the industrial metaverse. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/.\n\nFor further information, contact:\r\nAlex Shapiro\r\nNVIDIA Corporation\r\n+1-415-608-5044\r\nashapiro@nvidia.com\n\nCertain statements in this press release including, but not limited to, statements as to: the benefits, impact, performance, features and availability of our products, collaborations, services and technologies, including NVIDIA Grace CPU Superchip, Isambard 3 and Isambard 2 supercomputers, NVIDIA H100 Tensor Core GPUs, NVIDIA Grace Hopper Superchips, NVIDIA Quantum-2 InfiniBand, NVIDIA AI, the Arm ecosystem and HPC software; our collaborations with the UK Research Alliance, the Bristol & Bath Science Park, the University of Bristol, GW4 Alliance, University of Bath, University of Cardiff, University of Exeter, Swiss National Supercomputing Centre, Los Alamos National Laboratory and Hewlett Packard Enterprise and the benefits, impact, performance, features, and availability thereof; the growing wave of NVIDIA Arm-based supercomputers around the world; climate change becoming an increasingly existential problem and embracing energy-efficient technologies being vital; working alongside the Arm ecosystem to provide a path forward for the creation of more energy-efficient supercomputing centers, driving important breakthroughs in scientific and industrial research; and energy efficiency being crucial for designing supercomputers that will propel innovation and help humanity are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances.\n\n© 2023 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, NVIDIA Grace and NVIDIA Grace Hopper are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice.\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/a4c5e55f-3970-41e3-83ee-8fa19a674922", "link": "https://www.globenewswire.com/news-release/2023/05/22/2673001/0/en/NVIDIA-Grace-Drives-Wave-of-New-Energy-Efficient-Arm-Supercomputers.html", "symbols": ["NVDA.US"], "tags": ["ISAMBARD", "ISC", "NASDAQ:NVDA", "NVIDIA CORPORATION", "NVIDIA GRACE CPU", "PRODUCT / SERVICES ANNOUNCEMENT", "SUPERCOMPUTING", "TRADE SHOW"], "sentiment": {"polarity": 0.997, "neg": 0.017, "neu": 0.878, "pos": 0.105}}, {"date": "2023-05-22T06:00:00+00:00", "title": "NVIDIA, Rolls-Royce and Classiq Announce Quantum Computing Breakthrough for Computational Fluid Dynamics in Jet Engines", "content": "HAMBURG, Germany, May  21, 2023  (GLOBE NEWSWIRE) -- ISC—NVIDIA, Rolls-Royce and Classiq, a quantum software company, today announced a quantum computing breakthrough aimed at bringing ever-increasing efficiency to jet engines.\n\nUsing NVIDIA’s quantum computing platform, the companies have designed and simulated the world’s largest quantum computing circuit for computational fluid dynamics (CFD) — a circuit that measures 10 million layers deep with 39 qubits. By using GPUs, Rolls-Royce is preparing for a quantum future despite the limitations of today’s quantum computers, which only support circuits a few layers deep.\n\nRolls-Royce plans to use the new circuit on its journey to quantum advantage in CFD for modeling the performance of jet engine designs in simulations that use both classical and quantum computing methods.\n\nSuch breakthroughs are important to Rolls-Royce, a world leader in the aviation industry, in its work to build state-of-the-art jet engines that support the energy transition with more sustainable aviation.\n\n“Designing jet engines, which are one of the most complicated devices on earth, is expensive and computationally challenging,” said Ian Buck, vice president of hyperscale and HPC at NVIDIA. “NVIDIA’s quantum computing platform gives Rolls-Royce a potential path to tackle these problems head-on while accelerating its research and future development of more efficient jet engines.”\n\n“Applying both classical and quantum computing methods directly to the challenge of designing jet engines will help us accelerate our processes and perform more sophisticated calculations,” said Leigh Lapworth, computational science fellow at Rolls-Royce.\n\nRolls-Royce and its partner, Israel-based Classiq, designed the circuit using Classiq’s synthesis engine and then simulated it using NVIDIA® A100 Tensor Core GPUs. The speed and scale of the process was made possible by NVIDIA cuQuantum, a software development kit that includes optimized libraries and tools to speed up quantum computing workflows.\n\nNVIDIA Grace Hopper Accelerates Quantum Computing\r\nNVIDIA offers a unified computing platform for speeding breakthroughs in quantum research and development across disciplines. The NVIDIA Grace Hopper Superchip, which combines the groundbreaking performance of NVIDIA Hopper™ architecture GPUs with the versatility of the NVIDIA Grace CPUs, is ideally designed for giant-scale quantum simulation workloads.\n\nAdditionally, its high-speed, low-latency NVIDIA NVLink®-C2C interconnect makes classical systems built with the superchip optimally suited to link to quantum processors, or QPUs. With a total 600GB of fast-accessible memory per node, Grace Hopper enables the quantum ecosystem to push these simulations to an even larger scale.\n\nA strategic bridge to the quantum future, Grace Hopper powers DGX™ Quantum, the world’s first GPU-accelerated quantum computing system combining quantum computing with state-of-the-art classical computing. NVIDIA also provides developers with NVIDIA CUDA® Quantum, a robust open-source programming model that links GPUs and QPUs.\n\nNVIDIA’s Quantum Ecosystem Expands\r\nA vast array of the world’s quantum computing research now runs on NVIDIA GPUs.\n\nThe Jülich Supercomputer Centre, one of Europe’s largest facilities for quantum computing, also announced at ISC plans to build a quantum computing lab with NVIDIA, highlighting the growing importance of hybrid quantum-classical computing systems. The lab will also help developers advance the field of quantum computing with tools like CUDA Quantum.\n\nAdditionally, ORCA Computing is the latest QPU builder to integrate CUDA Quantum, combining its photonic quantum computer with GPUs for machine learning. TensorFlow Quantum and TorchQuantum — two popular quantum machine learning frameworks — now also integrate cuQuantum. The majority of the world’s quantum computing software today supports GPU acceleration with the NVIDIA quantum platform.\n\nLearn more about the NVIDIA quantum computing platform at ISC.\n\nAbout NVIDIA\r\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling the creation of the industrial metaverse. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/.\n\nFor further information, contact:\r\nAlex Shapiro\r\nNVIDIA Corporation\r\n+1-415-608-5044\r\nashapiro@nvidia.com\n\nCertain statements in this press release including, but not limited to, statements as to: the benefits, impact, performance, features and availability of our products, collaborations, services, and technologies, including NVIDIA’s quantum computing platform, NVIDIA GPUs including NVIDIA A100 Tensor Core GPUs, NVIDIA cuQuantum, NVIDIA Grace Hopper Superchips, NVIDIA Hopper architecture GPUs, NVIDIA Grace CPUs, NVIDIA NVLink-C2C interconnect, DGX Quantum and NVIDIA CUDA Quantum; our collaborations with Rolls-Royce, Classiq, Jülich Supercomputer Centre and ORCA Computing, and the benefits, impact, features and availability thereof; the expensive and computationally challenging nature of designing jet engines; a vast array of the world’s quantum computing research now running on NVIDIA GPUs; and the majority of the world’s quantum computing software today supporting GPU acceleration with the NVIDIA quantum platform are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances.\n\n© 2023 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, NVIDIA Grace, NVIDIA Grace Hopper, NVIDIA DGX, NVLink and CUDA are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice.\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/89b21561-aa34-4f47-84c4-27e132cb8a4d", "link": "https://www.globenewswire.com/news-release/2023/05/22/2673003/0/en/NVIDIA-Rolls-Royce-and-Classiq-Announce-Quantum-Computing-Breakthrough-for-Computational-Fluid-Dynamics-in-Jet-Engines.html", "symbols": ["NVDA.US"], "tags": ["ISC", "NASDAQ:NVDA", "NVIDIA CORPORATION", "NVIDIA CUQUANTUM", "PARTNERSHIPS", "PRODUCT / SERVICES ANNOUNCEMENT", "QUANTUM COMPUTING", "TRADE SHOW"], "sentiment": {"polarity": 0.997, "neg": 0.013, "neu": 0.894, "pos": 0.093}}, {"date": "2023-05-22T06:00:00+00:00", "title": "NVIDIA, Rolls-Royce and Classiq Announce Quantum Computing Breakthrough for Computational Fluid Dynamics in Jet Engines", "content": "NVIDIA\n\nWorld’s Largest Quantum Circuit for Industrial Simulation to Advance Development of Quantum Computing in Aerospace\n\nRolls-Royce Jet Engine NVIDIA’s quantum computing platform is helping Rolls-Royce explore how future hybrid supercomputers can bring ever-increasing efficiency to jet engines.\n\nHAMBURG, Germany, May 21, 2023 (GLOBE NEWSWIRE) -- ISC—NVIDIA, Rolls-Royce and Classiq, a quantum software company, today announced a quantum computing breakthrough aimed at bringing ever-increasing efficiency to jet engines.\n\nUsing NVIDIA’s quantum computing platform, the companies have designed and simulated the world’s largest quantum computing circuit for computational fluid dynamics (CFD) — a circuit that measures 10 million layers deep with 39 qubits. By using GPUs, Rolls-Royce is preparing for a quantum future despite the limitations of today’s quantum computers, which only support circuits a few layers deep.\n\nRolls-Royce plans to use the new circuit on its journey to quantum advantage in CFD for modeling the performance of jet engine designs in simulations that use both classical and quantum computing methods.\n\nSuch breakthroughs are important to Rolls-Royce, a world leader in the aviation industry, in its work to build state-of-the-art jet engines that support the energy transition with more sustainable aviation.\n\n“Designing jet engines, which are one of the most complicated devices on earth, is expensive and computationally challenging,” said Ian Buck, vice president of hyperscale and HPC at NVIDIA. “NVIDIA’s quantum computing platform gives Rolls-Royce a potential path to tackle these problems head-on while accelerating its research and future development of more efficient jet engines.”\n\n“Applying both classical and quantum computing methods directly to the challenge of designing jet engines will help us accelerate our processes and perform more sophisticated calculations,” said Leigh Lapworth, computational science fellow at Rolls-Royce.\n\nRolls-Royce and its partner, Israel-based Classiq, designed the circuit using Classiq’s synthesis engine and then simulated it using NVIDIA® A100 Tensor Core GPUs. The speed and scale of the process was made possible by NVIDIA cuQuantum, a software development kit that includes optimized libraries and tools to speed up quantum computing workflows.\n\nStory continues\n\nNVIDIA Grace Hopper Accelerates Quantum Computing\r\nNVIDIA offers a unified computing platform for speeding breakthroughs in quantum research and development across disciplines. The NVIDIA Grace Hopper Superchip, which combines the groundbreaking performance of NVIDIA Hopper™ architecture GPUs with the versatility of the NVIDIA Grace CPUs, is ideally designed for giant-scale quantum simulation workloads.\n\nAdditionally, its high-speed, low-latency NVIDIA NVLink®-C2C interconnect makes classical systems built with the superchip optimally suited to link to quantum processors, or QPUs. With a total 600GB of fast-accessible memory per node, Grace Hopper enables the quantum ecosystem to push these simulations to an even larger scale.\n\nA strategic bridge to the quantum future, Grace Hopper powers DGX™ Quantum, the world’s first GPU-accelerated quantum computing system combining quantum computing with state-of-the-art classical computing. NVIDIA also provides developers with NVIDIA CUDA® Quantum, a robust open-source programming model that links GPUs and QPUs.\n\nNVIDIA’s Quantum Ecosystem Expands\r\nA vast array of the world’s quantum computing research now runs on NVIDIA GPUs.\n\nThe Jülich Supercomputer Centre, one of Europe’s largest facilities for quantum computing, also announced at ISC plans to build a quantum computing lab with NVIDIA, highlighting the growing importance of hybrid quantum-classical computing systems. The lab will also help developers advance the field of quantum computing with tools like CUDA Quantum.\n\nAdditionally, ORCA Computing is the latest QPU builder to integrate CUDA Quantum, combining its photonic quantum computer with GPUs for machine learning. TensorFlow Quantum and TorchQuantum — two popular quantum machine learning frameworks — now also integrate cuQuantum. The majority of the world’s quantum computing software today supports GPU acceleration with the NVIDIA quantum platform.\n\nLearn more about the NVIDIA quantum computing platform at ISC.\n\nAbout NVIDIA\r\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling the creation of the industrial metaverse. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/.\n\nFor further information, contact:\r\nAlex Shapiro\r\nNVIDIA Corporation\r\n+1-415-608-5044\r\nashapiro@nvidia.com\n\nCertain statements in this press release including, but not limited to, statements as to: the benefits, impact, performance, features and availability of our products, collaborations, services, and technologies, including NVIDIA’s quantum computing platform, NVIDIA GPUs including NVIDIA A100 Tensor Core GPUs, NVIDIA cuQuantum, NVIDIA Grace Hopper Superchips, NVIDIA Hopper architecture GPUs, NVIDIA Grace CPUs, NVIDIA NVLink-C2C interconnect, DGX Quantum and NVIDIA CUDA Quantum; our collaborations with Rolls-Royce, Classiq, Jülich Supercomputer Centre and ORCA Computing, and the benefits, impact, features and availability thereof; the expensive and computationally challenging nature of designing jet engines; a vast array of the world’s quantum computing research now running on NVIDIA GPUs; and the majority of the world’s quantum computing software today supporting GPU acceleration with the NVIDIA quantum platform are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances.\n\n© 2023 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, NVIDIA Grace, NVIDIA Grace Hopper, NVIDIA DGX, NVLink and CUDA are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice.\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/89b21561-aa34-4f47-84c4-27e132cb8a4d", "link": "https://finance.yahoo.com/news/nvidia-rolls-royce-classiq-announce-060000128.html", "symbols": ["NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.012, "neu": 0.895, "pos": 0.093}}, {"date": "2023-05-22T06:00:00+00:00", "title": "NVIDIA, Jülich Supercomputing Centre and ParTec to Build Quantum Computing Lab", "content": "NVIDIA\n\nMajor Collaboration to Fuel Research on NVIDIA-Accelerated Systems Running HPC and Quantum Computing Workloads\n\nJülich Supercomputing Centre OpenSuperQ Quantum Computer A new lab at the Jülich Supercomputing Centre will feature a classical-quantum supercomputer based on the NVIDIA quantum computing platform.\n\nHAMBURG, Germany, May 21, 2023 (GLOBE NEWSWIRE) -- ISC—In a major step forward for the field of hybrid quantum-classical computing, NVIDIA today announced plans to build a new lab with the Jülich Supercomputing Centre (JSC) at Forschungszentrum Jülich (FZJ) that will feature a classical-quantum supercomputer in partnership with ParTec AG, Munich, based on the NVIDIA® quantum computing platform.\n\nFZJ, one of the largest interdisciplinary research centers in Europe, will host the lab as part of the Jülich UNified Infrastructure for Quantum Computing (JUNIQ) to run high-performance and low-latency quantum-classical computing workloads. JUNIQ is currently using the JUWELS booster system with 3,744 NVIDIA A100 Tensor Core GPUs for quantum computing simulations.\n\nThe NVIDIA quantum computing platform enables tight integration of quantum and classical computing through the open-source CUDA®Quantum programming model and world-class simulation through the NVIDIA cuQuantum software development kit.\n\nJSC plans to use a phased approach to test the system and will use the NVIDIA CUDA Quantum programming model to program quantum processors and integrate them within the Jülich exascale modular supercomputing architecture.\n\n“Unifying quantum computing and GPU supercomputing is a key part of enabling the scientific breakthroughs of tomorrow,” said Timothy Costa, director of HPC and quantum at NVIDIA. “NVIDIA’s collaboration with innovators such as the Jülich Supercomputing Centre and ParTec represents an important milestone for quantum-classical computing, making it accessible to countless new researchers and bringing the first quantum-accelerated supercomputer one step closer.”\n\n“Hybrid quantum-classical systems are bringing quantum computing closer to reality to solve complex problems that classical computing alone is unable to do,” said Kristel Michielsen, head of the quantum information processing group at JSC. “By partnering with NVIDIA on the modular quantum computing laboratory, JSC’s researchers can make unprecedented strides in chemistry and material sciences that drive broader, transformative progress across science disciplines and industries.”\n\nStory continues\n\n“ParTec has a long history as a driving force in developing the Modular Supercomputing Architecture with its world-class ParaStation Modulo software enabling hybrid, modular computing,” said Bernhard Frohwitter, CEO of ParTec AG. “Quantum computers will be an essential element of any future heterogeneous supercomputer. This development will open totally new possibilities.”\n\nLearn more about the NVIDIA quantum computing platform at ISC.\n\nAbout Jülich Supercomputing Centre at Forschungszentrum Jülich\r\nThe Jülich Supercomputing Centre at Forschungszentrum Jülich has been operating the first German supercomputing centre since 1987, and with the Jülich Institute for Advanced Simulation it is continuing the long tradition of scientific computing at Jülich. At the time being, JSC operates one of the most powerful supercomputers in Europe, JUWELS, and with JUNIQ the first European infrastructure for quantum computing.\n\nAbout ParTec AG\r\nParTec designs, builds and supports purpose-built modular supercomputers. As a hardware-agnostic system provider, ParTec AG works with leading technology companies, integrating a broad range of products and technologies of different origin and maturity into modular systems solutions, including novel computing technologies like quantum computing. The foundation of ParTec’s approach is the Modular Supercomputing Architecture with ParaStation Modulo software as a novel heterogeneous system design for high-performance computing. Visit us at www.par-tec.com.\n\nAbout NVIDIA\r\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling the creation of the industrial metaverse. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/.\n\nFor further information, contact:\n\nAlex Shapiro\r\nNVIDIA Corporation\r\n+1-415-608-5044\r\nashapiro@nvidia.com\n\nRegine Panknin\r\nJülich Supercomputing Centre at Forschungszentrum Jülich\r\nr.panknin@fz-juelich.de\n\nAnja Frohwitter\r\nParTec\r\npresse@par-tec.com\n\nCertain statements in this press release including, but not limited to, statements as to: the benefits and impact of NVIDIA’s products and technologies, including the NVIDIA quantum computing platform, the NVIDIA CUDA Quantum programming model and the NVIDIA cuQuantum software development kit; NVIDIA’s collaboration with JSC, including the benefits and impact thereof; unifying quantum computing and GPU supercomputing being a key part of enabling the scientific breakthroughs of tomorrow; and NVIDIA’s collaboration with innovators such as the Jülich Supercomputing Centre and ParTec representing an important milestone for quantum-classical computing, making it accessible to countless new researchers and bringing the first quantum-accelerated supercomputer one step closer are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances.\n\n© 2023 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo and CUDA are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice.\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/31f16b1b-64c0-47da-8a8f-20edad70bf13", "link": "https://finance.yahoo.com/news/nvidia-j-lich-supercomputing-centre-060000266.html", "symbols": ["NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.98, "neg": 0.015, "neu": 0.933, "pos": 0.052}}, {"date": "2023-05-22T06:00:00+00:00", "title": "NVIDIA, Jülich Supercomputing Centre and ParTec to Build Quantum Computing Lab", "content": "HAMBURG, Germany, May  21, 2023  (GLOBE NEWSWIRE) -- ISC—In a major step forward for the field of hybrid quantum-classical computing, NVIDIA today announced plans to build a new lab with the Jülich Supercomputing Centre (JSC) at Forschungszentrum Jülich (FZJ) that will feature a classical-quantum supercomputer in partnership with ParTec AG, Munich, based on the NVIDIA® quantum computing platform.\n\nFZJ, one of the largest interdisciplinary research centers in Europe, will host the lab as part of the Jülich UNified Infrastructure for Quantum Computing (JUNIQ) to run high-performance and low-latency quantum-classical computing workloads. JUNIQ is currently using the JUWELS booster system with 3,744 NVIDIA A100 Tensor Core GPUs for quantum computing simulations.\n\nThe NVIDIA quantum computing platform enables tight integration of quantum and classical computing through the open-source CUDA®Quantum programming model and world-class simulation through the NVIDIA cuQuantum software development kit.\n\nJSC plans to use a phased approach to test the system and will use the NVIDIA CUDA Quantum programming model to program quantum processors and integrate them within the Jülich exascale modular supercomputing architecture.\n\n“Unifying quantum computing and GPU supercomputing is a key part of enabling the scientific breakthroughs of tomorrow,” said Timothy Costa, director of HPC and quantum at NVIDIA. “NVIDIA’s collaboration with innovators such as the Jülich Supercomputing Centre and ParTec represents an important milestone for quantum-classical computing, making it accessible to countless new researchers and bringing the first quantum-accelerated supercomputer one step closer.”\n\n“Hybrid quantum-classical systems are bringing quantum computing closer to reality to solve complex problems that classical computing alone is unable to do,” said Kristel Michielsen, head of the quantum information processing group at JSC. “By partnering with NVIDIA on the modular quantum computing laboratory, JSC’s researchers can make unprecedented strides in chemistry and material sciences that drive broader, transformative progress across science disciplines and industries.”\n\n“ParTec has a long history as a driving force in developing the Modular Supercomputing Architecture with its world-class ParaStation Modulo software enabling hybrid, modular computing,” said Bernhard Frohwitter, CEO of ParTec AG. “Quantum computers will be an essential element of any future heterogeneous supercomputer. This development will open totally new possibilities.”\n\nLearn more about the NVIDIA quantum computing platform at ISC.\n\nAbout Jülich Supercomputing Centre at Forschungszentrum Jülich\r\nThe Jülich Supercomputing Centre at Forschungszentrum Jülich has been operating the first German supercomputing centre since 1987, and with the Jülich Institute for Advanced Simulation it is continuing the long tradition of scientific computing at Jülich. At the time being, JSC operates one of the most powerful supercomputers in Europe, JUWELS, and with JUNIQ the first European infrastructure for quantum computing.\n\nAbout ParTec AG\r\nParTec designs, builds and supports purpose-built modular supercomputers. As a hardware-agnostic system provider, ParTec AG works with leading technology companies, integrating a broad range of products and technologies of different origin and maturity into modular systems solutions, including novel computing technologies like quantum computing. The foundation of ParTec’s approach is the Modular Supercomputing Architecture with ParaStation Modulo software as a novel heterogeneous system design for high-performance computing. Visit us at www.par-tec.com.\n\nAbout NVIDIA\r\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling the creation of the industrial metaverse. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/.\n\nFor further information, contact:\n\nAlex Shapiro\r\nNVIDIA Corporation\r\n+1-415-608-5044\r\nashapiro@nvidia.com\n\nRegine Panknin\r\nJülich Supercomputing Centre at Forschungszentrum Jülich\r\nr.panknin@fz-juelich.de\n\nAnja Frohwitter\r\nParTec\r\npresse@par-tec.com\n\nCertain statements in this press release including, but not limited to, statements as to: the benefits and impact of NVIDIA’s products and technologies, including the NVIDIA quantum computing platform, the NVIDIA CUDA Quantum programming model and the NVIDIA cuQuantum software development kit; NVIDIA’s collaboration with JSC, including the benefits and impact thereof; unifying quantum computing and GPU supercomputing being a key part of enabling the scientific breakthroughs of tomorrow; and NVIDIA’s collaboration with innovators such as the Jülich Supercomputing Centre and ParTec representing an important milestone for quantum-classical computing, making it accessible to countless new researchers and bringing the first quantum-accelerated supercomputer one step closer are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances.\n\n© 2023 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo and CUDA are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice.\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/31f16b1b-64c0-47da-8a8f-20edad70bf13", "link": "https://www.globenewswire.com/news-release/2023/05/22/2673002/0/en/NVIDIA-J%C3%BClich-Supercomputing-Centre-and-ParTec-to-Build-Quantum-Computing-Lab.html", "symbols": ["NVDA.US"], "tags": ["ISC", "JüLICH SUPERCOMPUTING CENTRE", "NASDAQ:NVDA", "NVIDIA CORPORATION", "PARTNERSHIPS", "PRODUCT / SERVICES ANNOUNCEMENT", "QUANTUM COMPUTING", "TRADE SHOW"], "sentiment": {"polarity": 0.98, "neg": 0.016, "neu": 0.93, "pos": 0.054}}, {"date": "2023-05-22T06:00:00+00:00", "title": "NVIDIA Grace Drives Wave of New Energy-Efficient Arm Supercomputers", "content": "NVIDIA\n\nUK Research Alliance, GW4, Building 6x More Energy-Efficient Supercomputer for Climate Science, Medical Research and More\n\nIsambard 3 Supercomputer The Isambard 3 supercomputer, to be based at the Bristol & Bath Science Park, will feature 384 Arm-based NVIDIA Grace CPU Superchips to power medical and scientific research.\n\nHAMBURG, Germany, May 21, 2023 (GLOBE NEWSWIRE) -- ISC—NVIDIA today announced a supercomputer built on the NVIDIA Grace™ CPU Superchip, adding to a wave of new energy-efficient supercomputers based on the Arm® Neoverse™ platform.\n\nThe Isambard 3 supercomputer to be based at the Bristol & Bath Science Park, in the U.K., will feature 384 Arm-based NVIDIA Grace CPU Superchips to power medical and scientific research, and is expected to deliver 6x the performance and energy efficiency of Isambard 2, placing it among Europe’s most energy-efficient systems.\n\nIt will achieve about 2.7 petaflops of FP64 peak performance and consume less than 270 kilowatts of power, ranking it among the world’s three greenest non-accelerated supercomputers. The project is being led by the University of Bristol, as part of the research consortium the GW4 Alliance, together with the universities of Bath, Cardiff and Exeter.\n\nIsambard 3 joins a growing wave of NVIDIA Arm-based supercomputers around the world, with additional systems that include GPUs being built at the Swiss National Supercomputing Centre and the Los Alamos National Laboratory in the U.S.\n\n“As climate change becomes an increasingly existential problem, it’s vital for computing to embrace energy-efficient technologies,” said Ian Buck, vice president of hyperscale and HPC at NVIDIA. “NVIDIA is working alongside the Arm Neoverse ecosystem to provide a path forward for the creation of more energy-efficient supercomputing centers, driving important breakthroughs in scientific and industrial research.”\n\n“From climate change to medicine, supercomputing is already enabling academic and industry leaders to take on some of the world’s biggest challenges,” said Mohamed Awad, senior vice president and general manager of infrastructure at Arm. “Expanding on important areas of research requires a level of performance and energy efficiency that Arm Neoverse uniquely delivers, and through our collaboration with NVIDIA, we’re proud to bring this to life in the Isambard 3 system.”\n\nStory continues\n\nIsambard 3 to Supercharge Breakthroughs in Life Science, Medicine, More\r\nIsambard 3, to be built by Hewlett Packard Enterprise, will enable Europe’s scientific research community to supercharge breakthroughs in AI, life sciences, medical, astrophysics and biotech. It will be able to create detailed models of exceptionally complex structures, such as wind farms and fusion reactors, to help researchers unlock new advances in clean and green energy.\n\nThe Arm-based NVIDIA Grace-powered system will also continue Isambard 2’s work of simulating molecular-level mechanisms to better understand Parkinson’s disease and find new treatments for osteoporosis and COVID-19. These compute-intensive applications benefit from the highest-performing cores, highest memory bandwidth and the optimal memory capacity per core provided by Grace.\n\n“Isambard 3’s application performance efficiency of up to 6x its predecessor, which rivals many of the 50 fastest TOP500 systems, will provide scientists with a revolutionary new supercomputing platform to advance groundbreaking research,” said Simon McIntosh-Smith, principal investigator for the Isambard project and professor of HPC at the University of Bristol. “The Arm-based NVIDIA Grace CPU enables the breakthrough energy efficiency required to push the boundaries of scientific discovery and solve some of humanity’s most difficult challenges.”\n\nOnce the system goes into production in spring 2024, Bristol expects the number of registered users to increase significantly beyond the current 800.\n\nAccelerating Scientific Discovery\r\nNVIDIA’s accelerated computing platform comprises NVIDIA H100 Tensor Core GPUs, NVIDIA Grace CPU Superchips, NVIDIA Grace Hopper™ Superchips, NVIDIA Quantum-2 InfiniBand networking and a full suite of NVIDIA AI and HPC software.\n\nLearn more about NVIDIA’s accelerated computing platform for HPC at ISC.\n\nAbout NVIDIA\r\nSince its founding in 1993, NVIDIA (NASDAQ: NVDA) has been a pioneer in accelerated computing. The company’s invention of the GPU in 1999 sparked the growth of the PC gaming market, redefined computer graphics, ignited the era of modern AI and is fueling the creation of the industrial metaverse. NVIDIA is now a full-stack computing company with data-center-scale offerings that are reshaping industry. More information at https://nvidianews.nvidia.com/.\n\nFor further information, contact:\r\nAlex Shapiro\r\nNVIDIA Corporation\r\n+1-415-608-5044\r\nashapiro@nvidia.com\n\nCertain statements in this press release including, but not limited to, statements as to: the benefits, impact, performance, features and availability of our products, collaborations, services and technologies, including NVIDIA Grace CPU Superchip, Isambard 3 and Isambard 2 supercomputers, NVIDIA H100 Tensor Core GPUs, NVIDIA Grace Hopper Superchips, NVIDIA Quantum-2 InfiniBand, NVIDIA AI, the Arm ecosystem and HPC software; our collaborations with the UK Research Alliance, the Bristol & Bath Science Park, the University of Bristol, GW4 Alliance, University of Bath, University of Cardiff, University of Exeter, Swiss National Supercomputing Centre, Los Alamos National Laboratory and Hewlett Packard Enterprise and the benefits, impact, performance, features, and availability thereof; the growing wave of NVIDIA Arm-based supercomputers around the world; climate change becoming an increasingly existential problem and embracing energy-efficient technologies being vital; working alongside the Arm ecosystem to provide a path forward for the creation of more energy-efficient supercomputing centers, driving important breakthroughs in scientific and industrial research; and energy efficiency being crucial for designing supercomputers that will propel innovation and help humanity are forward-looking statements that are subject to risks and uncertainties that could cause results to be materially different than expectations. Important factors that could cause actual results to differ materially include: global economic conditions; our reliance on third parties to manufacture, assemble, package and test our products; the impact of technological development and competition; development of new products and technologies or enhancements to our existing product and technologies; market acceptance of our products or our partners' products; design, manufacturing or software defects; changes in consumer preferences or demands; changes in industry standards and interfaces; unexpected loss of performance of our products or technologies when integrated into systems; as well as other factors detailed from time to time in the most recent reports NVIDIA files with the Securities and Exchange Commission, or SEC, including, but not limited to, its annual report on Form 10-K and quarterly reports on Form 10-Q. Copies of reports filed with the SEC are posted on the company's website and are available from NVIDIA without charge. These forward-looking statements are not guarantees of future performance and speak only as of the date hereof, and, except as required by law, NVIDIA disclaims any obligation to update these forward-looking statements to reflect future events or circumstances.\n\n© 2023 NVIDIA Corporation. All rights reserved. NVIDIA, the NVIDIA logo, NVIDIA Grace and NVIDIA Grace Hopper are trademarks and/or registered trademarks of NVIDIA Corporation in the U.S. and other countries. Other company and product names may be trademarks of the respective companies with which they are associated. Features, pricing, availability and specifications are subject to change without notice.\n\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/a4c5e55f-3970-41e3-83ee-8fa19a674922", "link": "https://finance.yahoo.com/news/nvidia-grace-drives-wave-energy-060000163.html", "symbols": ["NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.016, "neu": 0.882, "pos": 0.102}}, {"date": "2023-05-21T22:51:38+00:00", "title": "Dow Jones Futures Fall On Stalled Debt-Ceiling Talks; Nvidia Key For Market Rally", "content": "The S&P 500 and Nasdaq hit 2023 highs last week, but it's a narrow market rally. Nvidia earnings and debt-ceiling talks are key.\n\nContinue reading", "link": "https://finance.yahoo.com/m/765e91cc-2fea-32ae-b5f6-edac603f628f/dow-jones-futures-fall-on.html", "symbols": ["DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-05-21T19:16:04+00:00", "title": "Dow futures trade lower, debt ceiling remains in focus", "content": "Investing.com - U.S. stock futures were trading lower during Sunday evening as traders monitored continuing debt ceiling negotiations in the U.S., with President Joe Biden and House Speaker Kevin McCarthy scheduled to continue talks later in Monday's session.\n\nBy 7:0.5pm ET (11:05pm GMT) Dow Jones Futures and S&P 500 Futures were down 0.2% apiece while Nasdaq 100 Futures eased 0.1%.\n\nIn the week ahead, market participants will be looking towards building permits, preliminary manufacturing and services PMIs, new home sales, FOMC meeting minutes, GDP, pending home sales, PCE price index, Michigan consumer expectations and sentiment as well as speeches from Bullard, Logan, Barkin, Bostic, Yellen and Collins.\n\nAmong earnings, companies including Zoom Video Communications Inc (NASDAQ:ZM), Lowe’s Companies Inc (NYSE:LOW), Intuit Inc (NASDAQ:INTU), Palo Alto Networks Inc (NASDAQ:PANW), BJs Wholesale Club Holdings Inc (NYSE:BJ), Dell Technologies Inc (NYSE:DELL), NVIDIA Corporation (NASDAQ:NVDA), Snowflake Inc (NYSE:SNOW), and Costco Wholesale Corp (NASDAQ:COST) are set to release results throughout the week.\n\nDuring Friday's trade, the Dow Jones Industrial Average lost 199.3 points or 0.3% to 33,426.6, the S&P 500 lost 6.1 points or 0.1% to 4,192 while the NASDAQ Composite lost 30.9 points or 0.2% to 12,657.9. For the week, the Dow and added 0.3%, while the S&P 500 and NASDAQ lifted 1.5% and 3.8% respectively to close near to near 9-month highs.\n\nOn the bond markets, United States 10-Year lifted to 9-week highs of 3.678%.\n\nRelated Articles\n\nDow futures trade lower, debt ceiling remains in focus\n\nChina fails Micron's products in security review, bars some purchases\n\nInstagram back up after global outage affecting thousands of users", "link": "https://finance.yahoo.com/news/dow-futures-trade-lower-debt-191604833.html", "symbols": ["BJ.US", "COST.US", "DELL.US", "DJI.INDX", "GSPC.INDX", "INTU.US", "IXIC.INDX", "LOW.US", "NVDA.US", "PANW.US", "SNOW.US", "ZM.US"], "tags": [], "sentiment": {"polarity": -0.735, "neg": 0.068, "neu": 0.889, "pos": 0.043}}, {"date": "2023-05-21T16:15:00+00:00", "title": "Better Buy: Apple vs. Nvidia", "content": "Apple and Nvidia lead multiple high-growth markets, making their stocks attractive investments right now.\n\nContinue reading", "link": "https://finance.yahoo.com/m/85b2b8c2-e9bf-3d23-861b-832de19a4abd/better-buy%3A-apple-vs.-nvidia.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.44, "neg": 0, "neu": 0.838, "pos": 0.162}}, {"date": "2023-05-21T15:04:07+00:00", "title": "3 Breakout Growth Stocks You Can Buy and Hold for the Next Decade", "content": "Let's face it: 2023 has been all about the growth stocks. If you need proof, compare the year-to-date performances of the Vanguard Growth ETF and the Vanguard Value ETF. With that in mind, let's have a look at three growth stocks that have been doing well in the near term that are also long-term buy-and-hold candidates: CrowdStrike Holdings (NASDAQ: CRWD), Align Technology (NASDAQ: ALGN), and Nvidia (NASDAQ: NVDA).\n\nContinue reading", "link": "https://finance.yahoo.com/m/3d403a2a-7f2c-3ae0-8763-68968bb87d4f/3-breakout-growth-stocks-you.html", "symbols": ["45C.F", "AFW.F", "ALGN.US", "CRWD.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.883, "neg": 0, "neu": 0.839, "pos": 0.161}}, {"date": "2023-05-21T13:25:05+00:00", "title": "TipRanks ‘Perfect 10’ List: 2 Stocks That Will Benefit Most From ChatGPT’s Meteoric Growth (Besides Microsoft)", "content": "AI – artificial intelligence – has been stirring up the tech pot in recent times. With the release of ChatGPT, and the explosion of AI-powered natural language into the realm of online search, content creation, and even picture editing, it’s become clear that AI is the next frontier of the tech space.\n\nA sudden boom of this sort will always bring opportunities with it. New jobs and new products, of course – but also renewed opportunities in the stock market. Companies related to AI, either directly or through connections to high-profile applications such as ChatGPT, will find or forge new paths, and they’ll be hungry for investors.\n\nInvestors, however, will need to take care in choosing where to put their funds. Some AI-related firms are more equal than others, and some careful sorting is in order before buying in. That brings us to the Smart Score, the AI-powered tool from TipRanks that collects and collates all the data on more than 8,400 publicly traded equities, and rates them according to 8 factors that are strongly correlated with future outperformance. The combined score is given according to a simple linear scale, 1 to 10, with a ‘perfect 10’ indicating a stock that clearly deserves a closer look.\n\nSo let’s look up some AI stocks according to their Smart Scores – the combination of a Perfect 10 with a strong connection to AI/ChatGPT should make a solid starting point for today’s tech investments. Here are two such stocks, presented along with comments from the Wall Street analysts.\n\nPerion Network, Ltd. (PERI)\n\nWe’ll start with Perion Network, an innovative leader in the global digital advertising business. The company focuses on increasing engagement for its clients, through ad search, social media, and video/CTV content, and estimates its potential market as $300 billion or more. That’s not peanuts, so a big opportunity there for Perion.\n\nThe company is already part of a strategic relationship with Microsoft and its Bing search engine, and that leads to its direct AI connection. Microsoft has publicly gone big on AI and ChatGPT as the base for improving and upgrading Bing; Perion and Bing work together in a strategic partnership for search engine advertising. In fact, Perion’s earnings show a strong correlation with  Bing’s user numbers – and the integration of ChatGPT into Bing has already had a strong effect on Perion’s financial results.\n\nStory continues\n\nThat was visible in Perion’s last quarterly report, for 1Q23 – the first full quarter after the release of ChatGPT. The company showed a 16% year-over-year increase in total revenue, jumping from $125.3 million to $145.2 million. This total included y/y increases of 16% in ‘display advertising revenue’ and 15% in ‘search advertising revenue.’ At the bottom line, Perion’s non-GAAP net income grew 44% y/y, to reach $29.9 million; this gave an EPS figure of 60 cents per share, up 36% from the 44 cents reported in the year-ago quarter.\n\nIn addition to solid y/y growth, the company’s results also came in higher than expected. Perion’s revenue total beat the forecast by $3.8 million, and the non-GAAP EPS was 10 cents higher than the estimates.\n\nVideo revenue provided a large share of Perion’s growth, with a 26% y/y increase. Vid revenue made up 44% of the total display advertising revenue, an increase from the 41% in the prior-year quarter. This growth was supported by a 63% y/y increase in the number of video platform publishers.\n\nTurning to PERI’s Smart Score, we find that Perion checks nearly all the boxes. The stock has sound technical and fundamental factors, but the biggest boost comes from the sentiment measures. The financial bloggers are 100% positive on PERI, compared to a 67% sector average;  the news sentiment is 100% positive, as well; the crowd wisdom on PERI registers ‘very positive,’ as individual investors have increased their holdings in the shares by 42% in the last 30 days. And, of the hedge funds tracked by TipRanks, PERI holdings were up more than 344,000 shares last quarter. This all adds up to a Perfect 10.\n\nThe Street’s analysts are also bullish. Needham’s Laura Martin, an expert in the tech sector, sums up the prospects for Perion: “Of all the public AdTech companies, PERI has the most near-term upside from ChatGPT because it distributes Bing (owned by Microsoft) in 60 countries, including the US, Canada, India, UK, etc. In 1Q23, PERI reported nearly 30mm monetized searches per day, out of a total of 150mm searches. PERI gets a rev share of the Bing ad revs from its clients in these countries. In 1Q23, PERI reported that 45% of its total revs were from its Bing search affiliates, up 15% y/y.”\n\nMartin’s comments back up her Buy rating on the stock, while her $42 price target indicates her confidence in a 37% share appreciation over the next 12 months. (To watch Martin’s track record, click here.)\n\nThere are 5 recent analyst reviews on Perion and they break down 4 to 1 in favor of Buy over Hold, to give the stock its Strong Buy consensus rating. The shares are currently trading for $30.63 and the $40.20 average price target implies a one-year upside potential of 31%. (See Perion’s stock forecast.)\n\nNvidia Corporation (NVDA)\n\nFor the second stock on our list, we’ll shift gears slightly and look at one of the leaders in the world’s semiconductor chip industry. Nvidia has built a solid reputation in the graphics processing unit (GPU) segment, and holds approximately 70% market share in these high-end chips. The strong market share in GPUs has benefited Nvidia greatly in recent years; GPUs are in high demand from both professional graphic designers and serious online gamers. In addition, GPU’s high computing capacity has found application in AI and machine learning systems, as well as data processing, ‘smart’ home and city technology, and IoT.\n\nThat’s the good news. The bad news is that, post-pandemic, Nvidia’s gaming segment slid through much of fiscal year 2023, hurting the company’s revenues and earnings. In the most recent quarter, the company did report a rebound in gaming, and importantly, it detailed ongoing moves into the AI sector, making the company well-positioned to benefit from this secular trend.\n\nIn the fiscal year 2023, which ended on January 29 of this calendar year, the company reported a top line of $26.97 billion, essentially flat from the $26.91 billion reported in fiscal 2022. Nvidia’s sales growth dropped off starting in the second fiscal quarter, and in the last reported quarter, fiscal 4Q23, the company’s top line of $6.05 billion, was down 21% y/y. At the bottom line, the non-GAAP EPS was reported at 88 cents, compared to $1.32 in the prior-year period. It should be noted, however, that both the top-and bottom-line results beat expectations.\n\nOn the AI side, Nvidia has made its AI platform available as a cloud offering in partnership with leading cloud software providers, including Microsoft and Google. AI chips feature prominently in Nvidia’s data center business, which is responsible for the bulk of revenue – and saw an 11% increase y/y to $3.62 billion in FQ4. The automotive and robotics segment of Nvidia’s business, which is also tied to AI and includes cloud access, showed gains y/y, growing 135% from fiscal 4Q22 to reach $294 million.\n\nInvestors have bought into the NVDA AI story, and the shares are up by 114% year-to-date. This jibes well with the strong sentiment factors in the ‘Perfect 10’ Smart Score. Nvidia scores high on blogger sentiment (71% positive), on crown wisdom (holdings up 5.6% in the last 30 days), and on news sentiment (97% positive). The hedges increased their shares in Nvidia by 2.5 million last quarter, a clear sign of confidence.\n\nSo, it’s no wonder that this stock caught the attention of HSBC analyst Frank Lee, who is somewhat taken aback by the opportunity at play. He writes, “We’re shocked by Nvidia’s pricing power on AI chips that we see driving earnings upside, higher valuation… Given the aggressive rollout of ChatGPT by Microsoft as well as other AI initiatives from US and Chinese cloud service providers, we expect AI GPUs could contribute additional revenue of USD5.2bn and USD11.1bn in FY1/24e and FY1/25e… We also acknowledge further re-rating potential on Nvidia’s market dominance (>80% market share) and the fact that it is a prime beneficiary of the AI trend.”\n\nLee goes on to rate NVDA as a Buy, and he sets a $355 price target to suggest a 13% upside in the coming months. (To watch Lee’s track record, click here.)\n\nOf the 37 recent analyst reviews on file for NVDA, 29 are to Buy and 8 are to Hold – for a Strong Buy consensus rating. The shares’ rapid increase this year, however, has pushed the trading price above the average price forecast; Nvidia is trading for $312.64, but the analysts’ average price prediction currently stands at $296.29. (See Nvidia’s stock forecast.)\n\nTo find good ideas for stocks trading at attractive valuations, visit TipRanks’Best Stocks to Buy, a newly launched tool that unites all of TipRanks’ equity insights.\n\nDisclaimer: The opinions expressed in this article are solely those of the featured analysts. The content is intended to be used for informational purposes only. It is very important to do your own analysis before making any investment.", "link": "https://finance.yahoo.com/news/tipranks-perfect-10-list-2-132505637.html", "symbols": ["IW2.F", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PERI.TA", "PERI.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.011, "neu": 0.827, "pos": 0.162}}, {"date": "2023-05-21T13:23:38+00:00", "title": "Dow Jones Futures Loom As Debt-Ceiling Fears Grow; Nvidia Earnings Key For Market Rally", "content": "The S&P 500 and Nasdaq are at 2023 highs, but market leadership is narrow. Nvidia earnings are key. Debt-ceiling talks resumed.\n\nContinue reading", "link": "https://finance.yahoo.com/m/765e91cc-2fea-32ae-b5f6-edac603f628f/dow-jones-futures-loom-as.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-05-21T13:00:41+00:00", "title": "Debt ceiling drama, retail earnings, Fed Minutes: What to know this week", "content": "Debt ceiling deliberations, more retail earnings, and the minutes from the Federal Reserve's latest meeting await investors as highlights in the week ahead.\n\nHouse Speaker Kevin McCarthy (R-Calif.) said Saturday discussions over the debt ceiling wouldn't resume until President Biden returns from his trip to Japan for a G-7 meeting. On Sunday before departing the G-7, Biden called the GOP's debt-ceiling stance \"unacceptable,\" adding it was \"time for the other side to move from their extreme positions.\" This as Treasury Secretary Janet Yellen's June 1 \"X-date\" looms.\n\nOn Friday, the two parties put talks on pause, raising doubts about the near-term potential for a deal and sending markets lower.\n\nAll three major indexes still finished the week with gains, however, notably the Nasdaq, which rose more than 3%.\n\nThe Nasdaq and S&P 500 had their best week since March and their highest weekly close since August 2022. Year to date, the Nasdaq is up more than 20%, while the S&P 500 has risen more than 9%; the Dow Jones Industrial Average is just barely clinging to gains for the year.\n\nStocks were encouraged last week after earnings from the retail sector struck a cautious tone on consumer spending for the year, but didn't sound alarms on a full-on recession quite yet.\n\nIn the week ahead, results from Dollar General (DG), Costco (COST), and BJ's (BJ) will offer further insights on the health of the consumer. Walmart's results (WMT) hinted at the benefits to some retailers from wealthier consumers trading down to save money as inflation pressures household budgets.\n\n\"We've seen transactions at Walmart, at Target, at TJX, at Ross positive year over year, which suggests that there is some trade down coming into the value side of the equation as some of those mainstream consumers make different choices,\" Bernstein retail analyst Aneesha Sherman told Yahoo Finance Live on Friday. \"And that's what some of the new data is showing that wasn't the case last year. So for value retail, I think it's a positive.\"\n\nStory continues\n\nOn the tech front, Nvidia (NVDA), which has seen its stock more than 100% this year, is expected to report earnings on Wednesday.\n\nOn the economic data front, investors will look for further hints on the Fed's path forward as investors prep for the end of the central bank's most aggressive rate hiking campaign since the early '80s.\n\nOn Thursday, the second estimate of first quarter GDP will offer a look at growth in the first quarter and another check on the central bank's preferred inflation gauge, the Personal Consumption Expenditures (PCE) price index, for Q1.\n\nEconomists expect \"core\" PCE — which strips out the more volatile costs of food and energy — rose 4.9% on an annual basis in the first quarter, unchanged from the first reading; \"core\" PCE is expected to have risen 0.3% in April, a monthly increase unchanged from March.\n\nBut the debt ceiling will remain the biggest factor for investors until a resolution on the current negotiations can be reached.\n\nTraditionally, markets have been more volatile as the \"X-date\" — or the date at which the US would default on its obligations — nears, with the possibility of default weighing on markets most in the two weeks before this date. U.S. President Joe Biden and Indonesia's President Joko Widodo attend a Partnership for Global Infrastructure and Investment event during the G7 summit, at the Grand Prince Hotel in Hiroshima, Japan, May 20, 2023. REUTERS/Jonathan Ernst\n\n\"If the X-date is crossed without a formal default, we see the drop in Q2 deepening a further 5% to 3750, but proving temporary,\" UBS's global economics and strategy team wrote in a note to clients on Friday.\n\n\"A 1-week period of no coupon payment and default would trigger up to a 20% drop in stocks towards 3,400, and keep them suppressed at those low levels through Q3 before making a partial recovery towards 3.800 by year end. The very unlikely scenario of a month long non payment of coupon would not only cause an immediate drop of up to 30% in stocks, it would also see a very weak recovery.\"\n\nThe S&P 500 closed at 4,191 on Friday.\n\nDebt ceiling discussions will also take a bigger place in the investor conversation going forward as this week wraps up earnings season.\n\nEntering Friday, 94% of the S&P 500 had reported earnings. On average, companies have been beating estimates by 6.5%, per Evercore ISI, while reporting an earnings decline for the second straight quarter.\n\nStill, stocks are up since the start of the first quarter earning season and the much discussed looming recession hasn't impacted markets yet.\n\n“In thinking about the timing of a Recession, the Consumer remains key,” Julian Emmanuel, who leads Evercore ISI's equity and portfolio strategy, wrote in a note to clients on Friday.\n\n\"A resilient Consumer was largely the theme in 1Q results, though Banks and Retailers bookending Earnings Season did note some deceleration later in the quarter. Waning momentum could put renewed pressure on estimates in line with historical revision trends.\"\n\nWeekly Calendar\n\nMonday\n\nEconomic data: No notable economic data set for release.\n\nEarnings: Ryanair (RYAAY), Zoom (ZM)\n\nTuesday\n\nEconomic data: S&P Global US manufacturing PMI, May, preliminary reading (50.0 expected, 50.2 previously); S&P Global US Services PMI, May, preliminary reading (53.6 previously); New home sales, April (660,000 annualized rate expected, 683,000 previously); New home sales, month-over-month, April (-3.4% expected, +9.6% previously);\n\nEarnings:  Autozone(AZO), BJ's Wholesale Club (BJ), Dick's Sporting Goods (DKS), Intuit (INTU), Lowe's (L), Willams & Sonoma (WSM), Palo Alto Networks (PANW), Toll Brothers (TOL), Urban Outfitters (URBN)\n\nWednesday\n\nEconomic data: MBA Mortgage Applications (-5.7% previously); FOMC minutes\n\nEarnings: Abercrombie & Fitch (ANF), BMO (BMO), e.l.f. Beauty (ELF), Kohl's (KSS), Nvidia (NVDA), Petco (WOOF), Red Robin (RRGB), Snowflake (SNOW)\n\nThursday\n\nEconomic data: Initial jobless claims (250,000 expected, 242,000 prior); First quarter GDP, second estimate (+1.1% annualized rate expected, +1.1% previously)\n\nEarnings: Autodesk (ADSK), Best Buy (BBY), Burlington (BURL), Build-A-Bear (BLDR), Costco (COST), Deckers Outdoor (DECK), Dollar Tree (DLTR), Gap (GPS), Marvell (MRVL), Medtronic (MDT), Ralph Lauren (RL), RH (RH), Ulta Beauty (ULTA), TD Bank (TD), Workday (WDAY)\n\nFriday\n\nEconomic data:  Personal Income, month-over-month, April (+0.4% expected, +0.3% previously); Personal Spending, month-over-month, April (+0.4% expected, 0% previously); PCE Deflator, month-over-month, April (+0.3% expected,+ 0.1% previously); PCE Deflator, year-over-year, April (+4.6% expected, 4.6% previously); University of Michigan consumer sentiment, May, final reading (58.0 expected, 57.7 previously)\n\nEarnings: Big Lots (BIG)\n\nJosh is a reporter for Yahoo Finance.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/debt-ceiling-drama-retail-earnings-fed-minutes-what-to-know-this-week-130041592.html", "symbols": ["8BJ.F", "BJ.US", "COST.MX", "COST.US", "COWC34.SA", "CTO.F", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "WALM34.SA", "WMT.F", "WMT.MX", "WMT.US", "WMT.XETRA"], "tags": [], "sentiment": {"polarity": 0.913, "neg": 0.054, "neu": 0.886, "pos": 0.06}}, {"date": "2023-05-21T12:02:00+00:00", "title": "3 Companies That Could Be Worth $1 Trillion by 2027", "content": "In August 2018, Apple became the first company to reach a $1 trillion market capitalization. Today, just four other companies also have valuations above that level: Microsoft, Saudi Aramco, Alphabet, and Amazon. Nvidia (NASDAQ: NVDA) is the world's leading provider of high-performance graphics processing units (GPUs).\n\nContinue reading", "link": "https://finance.yahoo.com/m/860b7673-eefb-3a4b-8023-4a6fa2b848ad/3-companies-that-could-be.html", "symbols": ["FB2A.F", "FB2A.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0, "neu": 0.941, "pos": 0.059}}, {"date": "2023-05-21T11:45:00+00:00", "title": "Tech Earnings Watch: Snowflake, Nvidia, Palo Alto Networks Headline Earnings Calendar", "content": "Snowflake stock rallied Thursday after a published report said the company is considering an acquisition in the AI space.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e4d1b588-73d4-3750-85ca-95c4a34a280d/tech-earnings-watch%3A.html", "symbols": ["5AP.F", "5Q5.F", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US", "SNOW.US", "W7D.F", "WDAY.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-05-21T09:30:00+00:00", "title": "Investors Seek Protection in Case of Debt-Ceiling Debacle", "content": "Many are pulling cash from stock funds and seeking safety in Treasurys that don’t mature for several years.\n\nContinue reading", "link": "https://finance.yahoo.com/m/bdddedfc-f996-314b-9633-84b481b787f0/investors-seek-protection-in.html", "symbols": ["LOW.US", "LOWC34.SA", "LWE.F", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.681, "neg": 0, "neu": 0.763, "pos": 0.237}}]