[{"date": "2023-10-17T23:49:35+00:00", "title": "UPDATE 1-Nvidia details advanced AI chips blocked by new export controls", "content": "(Recasts and updates throughout)\n\nBy Max A. Cherney and Stephen Nellis\n\nOct 17 (Reuters) - Nvidia said on Tuesday that new U.S. export restrictions will block sales of two high-end artificial intelligence chips it created for the Chinese market and that one of its top-of-the-line gaming chips will also be blocked.\n\nNvidia, in a filing late on Tuesday, disclosed the impact from the restrictions, which seek to stop Beijing from receiving cutting-edge U.S. technologies to strengthen its military.\n\nThe new restrictions will also affect rival chips produced by Advanced Micro Devices and Intel, according to analysts.\n\nIn its filing, Nvidia said two of its modified advanced AI chips - the A800 and H800 - both of which it created for the Chinese market to comply with previous export rules, would be blocked for sale under the new rules. One of the company's top-of-the-line gaming chips will be restricted, as will the L40S chip, which it announced in August, it said.\n\nNvidia declined to comment beyond the filing.\n\nChips being built by Intel and Advanced Micro Devices that aim to compete with Nvidia will also be impacted. Dylan Patel, chief analyst at SemiAnalysis, said Intel's Gaudi 2 chip, which it began selling in China in July, will be banned under the new rules. Intel built a specific version of the chip to comply with last year's rules, the company has said in the past.\n\nIntel declined to comment on the Gaudi 2 chip and said it was assessing the new rules.\n\nAMD's current AI chip, the MI250, may be captured by the tightened controls, according to an analysis from Bernstein analyst Stacy Rasgon. And it's likely that AMD's forthcoming MI300 chip will be captured by the new rules, Patel said.\n\nAMD declined to comment.\n\nAccording to Nvidia's filing, the company may be forced to move some business operations out of countries that are in the purview of U.S. export curbs after the Biden administration on Tuesday expanded restrictions on export of certain high-end technology.\n\nThe chipmaker said the new rules may impact its ability to complete the development of certain products in a timely manner, support existing customers of those products, or supply customers of those products outside the affected regions. (Reporting by Yuvraj Malik in Bengaluru and Max A. Cherney in San Francisco; Editing by Sriraj Kalluvila and Leslie Adler)", "link": "https://finance.yahoo.com/news/1-nvidia-details-advanced-ai-234935080.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0.048, "neu": 0.892, "pos": 0.06}}, {"date": "2023-10-17T22:12:46+00:00", "title": "Nvidia details advanced AI chips blocked by new export controls", "content": "By Max A. Cherney and Stephen Nellis\n\n(Reuters) -Nvidia said on Tuesday that new U.S. export restrictions will block sales of two high-end artificial intelligence chips it created for the Chinese market and that one of its top-of-the-line gaming chips will also be blocked.\n\nNvidia, in a filing late on Tuesday, disclosed the impact from the restrictions, which seek to stop Beijing from receiving cutting-edge U.S. technologies to strengthen its military.\n\nThe new restrictions will also affect rival chips produced by Advanced Micro Devices and Intel, according to analysts.\n\nIn its filing, Nvidia said two of its modified advanced AI chips - the A800 and H800 - both of which it created for the Chinese market to comply with previous export rules, would be blocked for sale under the new rules. One of the company's top-of-the-line gaming chips will be restricted, as will the L40S chip, which it announced in August, it said.\n\nNvidia declined to comment beyond the filing.\n\nChips being built by Intel and Advanced Micro Devices that aim to compete with Nvidia will also be impacted. Dylan Patel, chief analyst at SemiAnalysis, said Intel's Gaudi 2 chip, which it began selling in China in July, will be banned under the new rules. Intel built a specific version of the chip to comply with last year's rules, the company has said in the past.\n\nIntel declined to comment on the Gaudi 2 chip and said it was assessing the new rules.\n\nAMD's current AI chip, the MI250, may be captured by the tightened controls, according to an analysis from Bernstein analyst Stacy Rasgon. And it's likely that AMD's forthcoming MI300 chip will be captured by the new rules, Patel said.\n\nAMD declined to comment.\n\nAccording to Nvidia's filing, the company may be forced to move some business operations out of countries that are in the purview of U.S. export curbs after the Biden administration on Tuesday expanded restrictions on export of certain high-end technology.\n\nThe chipmaker said the new rules may impact its ability to complete the development of certain products in a timely manner, support existing customers of those products, or supply customers of those products outside the affected regions.\n\n(Reporting by Yuvraj Malik in Bengaluru and Max A. Cherney in San Francisco; Editing by Sriraj Kalluvila and Leslie Adler)", "link": "https://finance.yahoo.com/news/nvidia-may-forced-shift-countries-221246629.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0.049, "neu": 0.89, "pos": 0.061}}, {"date": "2023-10-17T22:11:03+00:00", "title": "Nvidia may be forced to shift out of some countries after new US export curbs", "content": "Oct 17 (Reuters) - Nvidia said it may be forced to move some business operations out of countries that are in the purview of U.S. export curbs after the Biden administration on Tuesday expanded its restrictions on export of certain high-end technology.\n\nThe chipmaker also said the new rules may impact its ability to complete the development of certain products in a timely manner, support existing customers of those products, or supply customers of those products outside the affected regions.\n\nUnder the expanded curbs, which go into effect in 30 days, the U.S. has now restricted a broader swathe of advanced chips and chipmaking tools to a greater number of countries including Iran and Russia, and blacklisted Chinese chip designers Moore Threads and Biren.\n\n(Reporting by Yuvraj Malik in Bengaluru; Editing by Sriraj Kalluvila)", "link": "https://finance.yahoo.com/news/nvidia-may-forced-shift-countries-221103406.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.7, "neg": 0.051, "neu": 0.844, "pos": 0.105}}, {"date": "2023-10-17T20:55:20+00:00", "title": "S&amp;P 500 Gains and Losses Today: Chipmaker Shares Drop Amid Tightening Export Rules", "content": "The S&P 500 dipped 0.01% on Tuesday, Oct. 17, 2023, as news that retail sales jumped more than expected in September renewed concerns about more Fed rate hikes.\n\nContinue reading", "link": "https://finance.yahoo.com/m/64dda596-e7ac-3ea0-bdf4-dcabecb731ca/s%26p-500-gains-and-losses.html", "symbols": ["0QF.F", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "MRNA.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "VFC.US", "VFP.F"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-17T20:41:28+00:00", "title": "Dow Jones Futures: Market Rally Rangebound As Jordan Loses Speaker Vote; Here Comes Tesla", "content": "The stock market rally is stuck in a range with Treasury yields surging and Jim Jordan losing a vote to be House speaker. Tesla earnings loom.\n\nContinue reading", "link": "https://finance.yahoo.com/m/7f632c25-d177-3741-9bba-0342620b54b9/dow-jones-futures%3A-market.html", "symbols": ["DJI.INDX", "FICO.US", "FRI.F", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.572, "neg": 0.215, "neu": 0.726, "pos": 0.059}}, {"date": "2023-10-17T20:30:42+00:00", "title": "Stock Market Closes Mixed But Small Caps Rally; Nvidia Falls 4.7%", "content": "The major stock market indexes closed barely mixed Tuesday. Nvidia shares eased from larger losses on new U.S. trade restrictions with China. The Nasdaq fared the worst and dipped 0.3% in the stock market today.\n\nContinue reading", "link": "https://finance.yahoo.com/m/37be4c05-53e3-3667-b33f-4e6aaa680b17/stock-market-closes-mixed-but.html", "symbols": ["2WY.F", "BZF1.F", "DJI.INDX", "GSPC.INDX", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "VMW.US", "WH.US"], "tags": [], "sentiment": {"polarity": -0.527, "neg": 0.154, "neu": 0.747, "pos": 0.1}}, {"date": "2023-10-17T20:12:15+00:00", "title": "Stock Market Today: Spiking Treasury Yields Keep Pressure on Stocks", "content": "Closeup of black stock chart with orange moving average and red and green volume bars.\n\nStocks were notably lower in early trading Tuesday as investors took in the latest retail sales data and another batch of bank earnings. The main indexes managed to pare most of these losses by the close, though, even as Treasury yields spiked.\n\nAhead of the opening bell, data from the Census Bureau showed retail sales rose 0.7% from August to September, more than economists were expecting. Excluding auto sales, retail sales were up 0.6%.\n\n\"Retail sales defied expectations with a large September gain, putting consumer spending on very strong footing entering into Q4,\" says Jonathan Millar, senior U.S. economist at Barclays. \"The latest print comes on top of a series of stronger-than-expected readings for nearly all major indicators since the September Federal Open Market Committee meeting,\" Millar adds.\n\nStill, according to CME Group, futures traders are pricing in an 88% chance the Fed will keep interest rates unchanged at its upcoming meeting, slightly higher than the 87% probability from one week ago.\n\nBank stocks mixed after earnings\n\nOn the earnings front, Bank of America (BAC, +2.3%) and Bank of New York Mellon (BK, +3.8%) closed higher after both financial firms reported higher-than-expected third-quarter earnings.\n\nDow stockGoldman Sachs (GS), on the other hand, fell 1.6% after earnings. The big bank said Q3 earnings were down 36% year-over-year to $5.47 per share, though this was still more than analysts were anticipating. Revenue of $11.8 billion also beat estimates.\n\nNvidia sheds $53 billion in market cap\n\nNvidia (NVDA) was another notable decliner today, with the semiconductor stock slumping 4.7% after the U.S. said it will expand restrictions on sales of artificial intelligence (AI) chips to China. While shares finished well off their session lows after a company spokesperson said that Nvidia doesn't \"expect a near-term meaningful impact\" on financial results, today's slide still chopped $53 billion from the trillion-dollar chipmaker's market cap.\n\nStory continues\n\nAlso in single-stock news, VF Corp (VFC) surged 14.0% after The Wall Street Journal indicated activist investor Engaged Capital is building a stake in the North Face parent. The report suggests Engaged wants to help VFC cut unnecessary costs and potentially shake up the board of directors.\n\nIt's been a rough stretch for VFC stock, which is down 33% for the year-to-date. Off the price charts, the retailer slashed its dividend in February, though at 7.4%, it remains one of the highest yielding dividend stocks in the S&P 500.\n\nAs for the major indexes, the rate-sensitive Nasdaq Composite was the worst performer – shedding 0.3% to 13,533 as yields on the 2-year and 10-year Treasuries headed back toward levels not seen in nearly two decades. The broader S&P 500 ended marginally lower at 4,373, while the blue chip Dow Jones Industrial Average eked out a 0.04% gain to 33,997.\n\nRelated content\n\nWhen Is the Next CPI Report? When Is the Next Fed Meeting? Is It a Good Time to Cash In Your I Bonds?", "link": "https://finance.yahoo.com/news/stock-market-today-spiking-treasury-201215830.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "VFC.US", "VFP.F"], "tags": [], "sentiment": {"polarity": 0.979, "neg": 0.038, "neu": 0.873, "pos": 0.089}}, {"date": "2023-10-17T20:11:10+00:00", "title": "Nvidia Stock Tumbles On New U.S. Trade Restrictions With China", "content": "Nvidia stock fell after the U.S. Commerce Department tightened its restrictions on the export of AI chips to China.\n\nContinue reading", "link": "https://finance.yahoo.com/m/32a4e320-1846-3571-84bb-30796bafb960/nvidia-stock-tumbles-on-new.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-17T20:07:27+00:00", "title": "Biden admin. expands curbs on shipments of AI chips to China", "content": "Chipmaker stocks like Nvidia (NVDA) are under pressure as the Biden administration announced that it would tighten its restrictions around exporting artificial intelligence chips to China. The restrictions are part of a broader effort from the White House to restrict China's military from gaining an advantage with AI. The restrictions only apply to the most advanced chips while most semiconductors will remain unrestricted, according to Commerce Secretary Gina Raimondo.\n\nBernstein Managing Director Stacy Rasgon joins Yahoo Finance to break down the news and what it will mean for chip-making companies. Rasgon explains that for most chip companies, current regulations \"don't have any near-term impact, and that's because demand is off the charts,\" but in the long-term \"the China TAM [total addressable market] may likely be impaired.\"\n\nClick here to watch the full interview on the Yahoo Finance YouTube page or you can watch this full episode of Yahoo Finance Live here.\n\nVideo Transcript\n\nJULIE HYMAN: Chip stocks under pressure, following the announcement of tougher rules on exports to China. The Biden administration expanding its curbs to prevent China, as well as Iran and Russia, from getting the upper hand in AI technology, and potentially using it to strengthen their militaries. Joining us now is Stacy Rasgon, who's Bernstein Research Senior Analyst.\n\nAnd Stacy, it's good to see you. I can think of no one better than to help us figure out what this all means. And you were doing that in your note that you put out today in the wake of this being released, trying to figure out what the effect is going to have. What's the bottom line? What do investors need to know?\n\nSTACY RASGON: Yeah. So it looks to me-- and again, this is our first early read. This thing is 300 pages long. So we do the best we could.\n\nHowever, it looks to me that most of the current mainstream data center GPUs that are getting sold into China are likely to come underneath a control regime. They're going to be subject to export controls. And likely, sales will be curtailed, unless and until the company can get a license to ship. And frankly, I wouldn't hold my breath on that.\n\nStory continues\n\nSo parts that NVIDIA has been shipping, actually, that were workarounds from some of the controls that were put on last year. They brought in products that were specific for the China market, that were designed to come in underneath the control thresholds a year ago. These new regulations close some of those workarounds and loopholes, and block off sales of that.\n\nSo I do think the stuff that NVIDIA has been selling into China as well as, frankly, even parts from Intel and AMD. It's not like they're selling any. But if you look at the specifications of those parts, they're not going to sell any into China. Those are going to come under the controlled regime as well.\n\nJOSH LIPTON: So Stacy, let me ask you this. This is what NVIDIA is saying, in response to this. Given the demand worldwide for our products, we don't expect a near-term meaningful impact on our financial results.\n\nSo maybe, that gives comfort to some traders, Stacy. But let's say you're an investor, and you're listening to this. Should you be concerned about what this is going to mean long-term for NVIDIA?\n\nSTACY RASGON: Well, sure. So you're right. They don't have any near-term impact. And that's because demand is off the charts.\n\nAnd the stuff that they were selling into China was almost the same as what they were selling elsewhere. There were only some few minor tweaks. And so, they can redirect that stuff. There's plenty of demand. Their backlogs are very high.\n\nBut long-term, yeah. Look, even the company themselves. NVIDIA has come out and said, if this stuff continues, that over the long term, the China TAM will likely be impaired. And I think that is the case. Now my own opinion, though, is that was-- is going to happen, anyway.\n\nSo let's imagine a scenario where these control thresholds, they're getting lowered today. Let's say that they were not lowered. Fine. They're never going to raise them, though. They're never-- as far as I can tell, the US government is never going to make it easier to ship stuff into China.\n\nBest case, these thresholds stay where they are. And the gap over time between what is legal to sell in China versus the rest of the world is going to get bigger and bigger and bigger and bigger, as we go along. And eventually, the stuff-- even the stuff they're selling today would be noncompetitive in anyway.\n\nSo my own opinion is that the China TAM for this is likely already to have been impaired. The question is, is this going to happen quickly or slowly? Looks like it's probably happening quicker. Maybe that's a good thing. You can rip the Band-Aid off.\n\nI do believe that over the long term, the overall opportunity is still very large, with or without China. But yeah. It's not like it's a positive. It's not.", "link": "https://finance.yahoo.com/video/biden-admin-expands-curbs-shipments-200727576.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.034, "neu": 0.875, "pos": 0.091}}, {"date": "2023-10-17T19:58:00+00:00", "title": "Nvidia Stock Takes a Hit Amid China Restriction News - Time to Buy the Dip?", "content": "This year’s leading stock, Nvidia NVDA took a hit Tuesday in trading after the Biden administration announced plans to halt semiconductor shipments to China. Is this sell-off an opportunity to pick up shares at a discount?\n\nEven after a nearly four-month consolidation, Nvidia is still the top performing stock in the S&P 500. And after breaking out from a descending wedge two weeks ago, looks to be staging a buyable pullback. Furthermore, Nvidia enjoys a Zacks Rank #1 (Strong Buy) rating, reflecting upward trending earnings revisions, and boosting near-term stock performance expectations.\n\nWith a critical level of support at $400, this looks like a good buying opportunity given the risk reward setup. TradingView\n\nImage Source: TradingView\n\nBiden Cuts Off China\n\nThe Biden administration announced its decision to stop shipments of advanced artificial intelligence chips, specifically those designed by Nvidia and other companies, to China. This move is part of a broader effort to prevent Beijing from accessing state-of-the-art U.S. technology that could enhance its military capabilities. These new regulations will further limit the export of advanced chips and tools associated with chipmaking to countries including Iran and Russia.\n\nNvidia, a leading AI chip designer, reported its compliance with the new regulations and does not foresee an immediate significant financial impact. However, its shares dropped by -5%, and other chipmakers like Advanced Micro Devices AMD and Intel INTC also experienced stock declines.\n\nIndustry Leader\n\nAfter releasing its Artificial Intelligence infrastructure products earlier this year, Nvidia has set itself apart from the industry. Now years ahead of the competition regarding its AI hardware and software, Nvidia stock has far outperformed competitors Intel and Advanced Mico Devices, as well as the industry.\n\nAlthough Intel has struggled in recent years, it has been receiving some earnings estimates upgrades, boosting the stock to a Zacks Rank #2 (Buy) rating. However, AMD has not convinced analysts to revise it earning higher as it currently has a Zacks Rank #3 (Hold) rating, indicating mixed earnings revisions.\n\nStory continues Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nBottom Line\n\nWhile many traders have been shaken out of their position on this surprising news, Nvidia still looks appealing at these levels. Furthermore, with the final quarter of the year often showing a strong bullish tendency, I would expect the market’s leading name to finish the year with a bang.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nIntel Corporation (INTC) : Free Stock Analysis Report\n\nAdvanced Micro Devices, Inc. (AMD) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/nvidia-stock-takes-hit-amid-195800450.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.029, "neu": 0.823, "pos": 0.148}}, {"date": "2023-10-17T19:02:48+00:00", "title": "Nvidia Stock Pulls Back Further After AI Chip Curbs — Is It A Buy?", "content": "Nvidia, a giant in data centers and gaming, is supercharging investor interest in artificial intelligence. Is Nvidia stock a buy amid new AI chip curbs? Nvidia leads in artificial intelligence (AI) chips, but competition is rising.\n\nContinue reading", "link": "https://finance.yahoo.com/m/ded6b0a1-015a-3584-9e8d-cd3c12535718/nvidia-stock-pulls-back.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.625, "neg": 0, "neu": 0.844, "pos": 0.156}}, {"date": "2023-10-17T18:56:30+00:00", "title": "Factbox-How the US will cut off China from more AI chips", "content": "By Stephen Nellis\n\n(Reuters) - The Biden administration on Tuesday issued a sweeping update to restrictions on exporting advanced artificial intelligence to China and other countries.\n\nThe measures are designed to prevent China from acquiring the cutting-edge chips needed to develop AI technologies such as large language models, which power applications such as ChatGPT but that U.S. officials say also have military uses that present a national security threat.\n\nHere is a closer look at how the Biden administration is tightening the rules.\n\nCAPTURING MORE CHIPS\n\nThe original rules last year restricted chips if they met a two-pronged test for how much computing power the chips contained and how fast they could talk to other chips. Those measures were considered important because AI systems require chaining together thousands of chips at time to chew through huge troves of data.\n\nNvidia , the top AI chip supplier, responded by creating chips that stayed just under the communication limits for the Chinese market but that still proved useful for AI work.\n\nOn Tuesday, U.S. officials said they would focus on computing power alone, which has the effect of controlling a broader range of chips - including Nvidia's recent creations for China.\n\nThe new rules also require chip companies to notify U.S. authorities when they are selling chips that fall just below the restriction limits so that officials can track whether those chips are being used in large quantities for AI work.\n\nCLOSING 'CHIPLET' LOOPHOLES\n\nAnother issue that U.S. regulators sought to address is a new technology known as \"chiplets\" in which smaller sections of a chip are joined together to form a full chip. Analysts had expressed concern that Chinese firms could use such technology to acquire chiplets that stayed within the legal limits but that could later be assembled in secret into a larger chip that would break the rules.\n\nThe new rules imposed a \"performance density\" limitation that aims at preventing such workarounds.\n\nStory continues\n\nBLACKLISTING CHINA'S NVIDIA CHALLENGERS\n\nChip industry watchers believe that if U.S. AI chips are banned in China, Chinese firms will seek to fill the void in the market.\n\nOn Tuesday, U.S. officials added two leading Chinese chip startups, Biren and Moore Threads, to a U.S. trade blacklist. Both Biren and Moore Threads were co-founded by former Nvidia employees in China and were believed to be China's leading candidates to produce domestic alternatives to Nvidia's chips.\n\nTheir addition to what is known as an entity list could hobble the startups because it cuts them off from having their chips manufactured by Taiwan Semiconductor Manufacturing Co or other leading chipmakers that use U.S. equipment.\n\nRED FLAGS FOR CHIP FACTORIES\n\nThe U.S. said that any chip that contains 50 billion or more transistors, the tiny switches at the heart of all computing chips, and uses what is called high bandwidth memory, presents a \"red flag\" an exporter should consider when deciding if they need a license to ship goods to China. That threshold would encompass nearly all advanced AI chips and is aimed at helping chip factories spot efforts to work around the rules.\n\nEXPANDED REACH\n\nU.S. officials expanded the license requirements for exporting advanced chips from China and Macau to all 22 countries on which the U.S. maintains an arms control embargo. The officials also extended the controls to any company whose ultimate parent company is headquartered in one those countries in an effort to prevent offshore subsidiaries from buying up banned chips.\n\n(Reporting by Stephen Nellis in San Francisco; Editing by Marguerita Choy)", "link": "https://finance.yahoo.com/news/factbox-us-cut-off-china-185630010.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.956, "neg": 0.047, "neu": 0.871, "pos": 0.082}}, {"date": "2023-10-17T18:30:00+00:00", "title": "Nvidia’s AI Backlog Will Spare Pain From China Bans—For Now", "content": "Everyone wants Nvidia’s latest chips. Such restrictions have been [in place for awhile](https://www.wsj.com/articles/latest-u-s-chip-curbs-deliver-setback-to-chinas-ai-ambitions-11662037050?mod=article_inline), but the latest rules are designed to close loopholes that let companies like Nvidia still sell top-of-the-line chips [with some performance modifications](https://www.wsj.com/articles/nvidias-close-call-was-too-close-11662463980).\n\nContinue reading", "link": "https://finance.yahoo.com/m/cf7e3aa9-5a51-33fb-b6d5-6e2dfe9c1ea5/nvidia%E2%80%99s-ai-backlog-will.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "AVGO.US", "AVGO34.SA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.502, "neg": 0, "neu": 0.917, "pos": 0.083}}, {"date": "2023-10-17T18:29:04+00:00", "title": "The 7 Top Growth Stocks You Can’t Ignore Today", "content": "The last two years have been tough for fast-growing stocks. Inflation and Covid-19 have really shaken things up. But the market is getting much better as we move into 2023. Many growth stocks are selling at cheaper prices if we look at their P/E ratios. This is a good sign for investors looking for growth stocks to buy.\n\nSo what makes now a good time to look at growth stocks? Experts are saying that the growth stock companies in the S&P 500 are expected to raise their profits by around 8.3% each year for the next five years, which is a wave of relief for long-time investors.\n\nAlso, around the globe, central banks are adjusting their regulations to support economic recovery. This could mean that obtaining loans may become more accessible, which usually signals positive growth prospects for various industries.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nSo, it is now time for investors to step in and invest in growth stocks that can deliver substantial earnings growth in the upcoming years. Here are the top 7 growth stocks that you can’t ignore.\n\nAlphabet (GOOG, GOOGL)\n\nSource: rvlsoft / Shutterstock.com\n\nWith technical advancement and the commitment to research and development, Alphabet is the leading company in the AI world. It never disappoints its shareholders, and it remains a solid bet for both long-term stability and potentially high returns.\n\nAlphabet’s stock price has soared by a huge 50% this year. That’s a lot better than the general stock market, which has grown by just 15%. The company earned $1.44 per share in the second quarter of this year and expected the same amount in the third quarter. Analysts are calling for 7.7% revenue growth this year and 11.4% revenue growth in 2024.\n\nFor now, I believe it is an opportune time to invest in Alphabet, as the stock is well-positioned for potential gains in the coming year.\n\nNvidia (NVDA)\n\nSource: Poetra.RH / Shutterstock.com\n\nNvidia (NASDAQ:NVDA) Nvidia, a leading player in the AI chip market, has been experiencing a significant boom in sales. The company is estimated to sell over half of a million of its high-end GPUs in 2023.\n\nStory continues\n\nThe company earned revenue of $6.7 billion, up 3% from a year ago in the second quarter of 2023. Analysts at Goldman Sachs have a price target of $800 on NVDA stock, representing potential upside of nearly 100% from current levels. Goldman Sachs believes that Nvidia is well-positioned to benefit from a number of long-term trends, such as the growth of gaming, artificial intelligence, and self-driving cars.\n\nNvidia has a solid history of being both innovative and profitable. However, PC and gaming markets have cooled down a bit since the pandemic, and the crash in the cryptocurrency market did affect graphics card sales. But Nvidia stood firm regardless, and now the company is in a strong position for the long run.\n\nSo, if you’re thinking about where to invest, NVDA stock is definitely worth considering.\n\nAmazon (AMZN)\n\nSource: Mike Mareen / Shutterstock.com\n\nAmazon (NASDAQ:AMZN) is widely recognized as the platform for e-commerce and continues to be a hugely profitable entity. But this is a down period for Amazon. Its stock dipped 5% over the past month, creating an opportunity to buy Amazon stock.\n\nDespite a brief slowdown, its online store sales have picked up again with a 7% increase, and reported $134.4 billion in revenue for Q2. For the third quarter, Amazon expects sales of between $138 billion and $143 billion, or growth of between 9% and 13%. Analysts were expecting revenue of $138.25 billion, according to Refinitiv.\n\nFurthermore, PandaForecast.com predicts Amazon’s stock will climb to $146 in the first half of next year and end the year around $206.58. Despite some challenges, Amazon’s adaptability and growth make it an interesting option for potential investors.\n\nTesla (TSLA)\n\nSource: Arina P Habich / Shutterstock.com\n\nTesla (NASDAQ:TSLA) is a leading company in the world of electric vehicles. But 2022 was not a great year for Tesla. Its stock was down due to many factors, including inflation. However, thus far in 2023, Tesla shares are up nearly 140%.\n\nIn the second quarter, Tesla produced 479,700 cars and delivered 466,140 of them, resulting in a substantial $21.3 billion in revenue, a 46% increase from the previous year. When factoring in revenue from solar panels and batteries, its total revenue reached $24.9 billion, marking a 47% rise.\n\nHowever, Tesla faced a problem in the third quarter. It delivered 435,000 cars, slightly below expectations. Tesla attributed this to a brief production line pause for upgrades. However, it remains committed to its goal of delivering 1.8 million cars by year-end. This makes it a great growth stock to buy for investors.\n\nNetflix (NFLX)\n\nSource: izzuanroslan / Shutterstock.com\n\nNetflix (NASDAQ:NFLX), the biggest name in the streaming world, has approximately 240 million paid subscribers. Despite this impressive number, there’s still significant room for growth, considering there are around 500 million homes in the U.S. equipped with smart TVs.\n\nIn the first half of 2023, Netflix showed a strong performance. The company generated total revenue of nearly $8.19 billion in the second quarter of 2023, an increase from about $7.97 billion in the corresponding quarter of 2022. This continued growth is indicative of Netflix’s formidable presence in the market.\n\nHowever, it’s worth noting that there has been a slowdown in new user acquisition. Despite this, existing subscribers are using the service more frequently, which is positively impacting Netflix’s bottom line.\n\nAccording to Seeking Alpha, “Netflix’s third-quarter 2023 revenue is expected to be in the range of $8.46 billion to $8.66 billion, up 8.9% year-over-year and 3% higher than analysts’ expectations for the previous quarter.”\n\nFurthermore, Netflix has implemented some strategies to boost its subscribers and manage costs. One of the major operations is a password-sharing crackdown. Investors will be anticipating an update on this during its Q3 report.\n\nBlock (SQ)\n\nSource: Sergei Elagin / Shutterstock.com\n\nBlock (NYSE:SQ), formerly recognized as Square, offers an extensive portfolio of financial services, ranging from Cash App to point-of-sale solutions. It also anticipated significant changes in consumers’ preference for digital payments, online shopping, and increasing comfort with cryptocurrencies such as Bitcoin (BTC-USD), and positioned itself early in the market.\n\nThe company has performed very well in the second quarter of 2023, with a net revenue of $5.53 billion.\n\nFuture growth is expected to be driven by a number of factors, including the continued growth of digital payments, the increasing popularity of cryptocurrency, and the expansion of Block’s Cash App and Square ecosystems.\n\nSalesforce (CRM)\n\nSource: Sundry Photography / Shutterstock.com\n\nSalesforce (NYSE:CRM) is a rapidly growing, cloud-based customer relationship management software company that has demonstrated a strong growth trajectory with a compound annual revenue growth (CAGR) of 29% over the past 10 years. Salesforce holds nearly 20% of the market. Its solid standing suggests a bright future, further backed by estimates of annual growth in earnings by 32.2% and revenue by 10%.\n\nOver 150,000 big companies, like those in the Fortune 500, are showing trust in Salesforce. It is acquiring and partnering with other companies to add to its arsenal, making it even more of a powerhouse.\n\nFurthermore, Salesforce’s early 2023 update was packed with numerous new features that can help businesses cut costs. With these updates, Salesforce has become a more attractive option for companies looking to step up their game.\n\nOn the date of publication, Nauman Khan did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nNauman Khan is a dedicated stock investor with a strong passion for the financial markets, specializing in fashion, sports, and technology stocks. His commitment lies in providing expert guidance to fellow investors, assisting them in making well-informed investment decisions. Nauman holds a Bachelor’s degree in Accounting and Finance from Bahria University.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post The 7 Top Growth Stocks You Can’t Ignore Today appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-top-growth-stocks-t-182904824.html", "symbols": ["AMZN.US", "CRM.US", "FOO.F", "FOO.XETRA", "NFLX.US", "NVDA.US", "SQ.US", "SSFO34.SA", "TSLA.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.018, "neu": 0.822, "pos": 0.159}}, {"date": "2023-10-17T18:15:55+00:00", "title": "Dow Jones Tech Titan Microsoft Eyes New Buy Point; Nvidia Stock Breaks Key Level On AI Chip Ban", "content": "Dow Jones tech titan Microsoft shows a new buy point, while Nvidia stock broke below a key level on an expanded AI chip ban.\n\nContinue reading", "link": "https://finance.yahoo.com/m/85924503-03ca-3ae8-8606-610212cd0c9a/dow-jones-tech-titan.html", "symbols": ["DJI.INDX", "FICO.US", "FRI.F", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PAE.F", "PCAR.US"], "tags": [], "sentiment": {"polarity": -0.751, "neg": 0.225, "neu": 0.775, "pos": 0}}, {"date": "2023-10-17T18:05:00+00:00", "title": "Rebel's Edge - October 17: $NVDA, $GS, $NTCT and Penn State vs Ohio State", "content": "Jon and Pete Najarian join forces to discuss and debate their favorite topics, including the hottest stock-specific news and sports!\n\nContinue reading", "link": "https://finance.yahoo.com/m/3bd7b0a1-5085-32e7-a3a9-6d9408c5807e/rebel%27s-edge-october-17%3A.html", "symbols": ["NSZ.F", "NTCT.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.67, "neg": 0, "neu": 0.785, "pos": 0.215}}, {"date": "2023-10-17T17:53:08+00:00", "title": "Nvidia Stock Falls After U.S. Restricts Chip Exports", "content": "Nvidia stock was falling after the Biden administration said it would clamp down on exports of artificial intelligence chips to China. Nvidia stock was down 4.9% to $438.60. It was on pace for its largest percent decrease since May 31, when it fell 5.\n\nContinue reading", "link": "https://finance.yahoo.com/m/8b0dbe0b-5f6b-3c2e-bd83-3501adecc540/nvidia-stock-falls-after-u.s..html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.361, "neg": 0.033, "neu": 0.903, "pos": 0.064}}, {"date": "2023-10-17T17:51:00+00:00", "title": "Why Nvidia, Intel, Broadcom, and Other Artificial Intelligence (AI) Semiconductor Stocks Crumbled Tuesday Morning", "content": "Regulators announced a limit that could hurt AI chip sales. If this seems like an eerie case of déjà vu, there's a reason for that.\n\nContinue reading", "link": "https://finance.yahoo.com/m/09a1ad8d-5b93-3ec4-8dbe-d1f48b062bcc/why-nvidia%2C-intel%2C-broadcom%2C.html", "symbols": ["2330.TW", "AVGO.US", "AVGO34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TSFA.F", "TSFA.STU", "TSM.US", "TSMC34.SA", "TSMN.MX"], "tags": [], "sentiment": {"polarity": -0.71, "neg": 0.204, "neu": 0.796, "pos": 0}}, {"date": "2023-10-17T16:25:00+00:00", "title": "ADTRAN's (ADTN) Preliminary Q3 Results Show a Top-Line Decline", "content": "ADTRAN, Inc. ADTN recently issued preliminary third-quarter 2023 results. These initial unaudited financial metrics provide valuable insight into the company’s business operations and market trends for the September quarter.\r\n\r\nDuring the quarter, ADTRAN witnessed solid customer addition in the U.S. and European markets, backed by its comprehensive product portfolio. Despite these gains, the company’s net sales were adversely affected by foreign exchange fluctuations owing to its international footprint. A stronger U.S. dollar particularly impacted sales generated outside the United States.\n\nFor the third quarter, the company expects revenues to be $272.3 million. The preliminary figure is lower than the company’s guidance range of $275-305 million. Against the backdrop of a volatile economic environment, cautious capital spending from customers and inventory adjustments had an impact on the top line.\r\n\r\nThe conservative capital spending behavior of consumers resulted in a GAAP operating loss of $82.1 million with a negative operating margin of 30.2% during the quarter. For the third quarter, ADTRAN had earlier estimated the non-GAAP operating margin within the range of -5% to 0% of revenues. Per the preliminary results, the third quarter tally for non-GAAP operating margin is expected at -1.9% or an operating loss of $5,111 million. This figure aligns with the higher end of the company's expectations, supported by improved operational efficiency and a higher non-GAAP gross margin.\r\n\r\nTo successfully navigate through the current uncertain situation, ADTRAN is taking initiatives to better align its operating model. Management remains optimistic about the company's ability to capitalize on a potential return to normalize spending behavior owing to its broad portfolio and diverse market presence.\r\n\r\nADTRAN continues to benefit from solid demand trends of its network solutions, driven by the accelerated expansion of fiber-to-the-home networks, upgrades to in-home Wi-Fi connectivity and the adoption of cloud-based automation tools. The company’s end-to-end solutions simplify the deployment of fiber-based broadband services and provide a better customer experience.\r\n\r\nIt is focused on being a top global supplier of access infrastructure and related value-added solutions from the Cloud Edge to the Subscriber Edge through a broad portfolio of flexible hardware and software network solutions. These products enable a seamless transition to the fully converged, scalable, highly automated, cloud-controlled voice, data, Internet and video networks of the future.\r\n\r\nADTRAN expects solid traction in its domestic markets for ultra-broadband and fiber-to-the-home solutions, along with Software-Defined access and Ethernet passive optical network solutions. The company also anticipates a pickup in capital spending in Tier-1, Tier-2 and regional service provider market segments. Its global leadership in software-defined access is likely to ensure a steady stream of revenues as it helps clients reduce costs and accelerate service delivery and deployment.\r\n\r\nThe stock has lost 63% in the past year against the industry’s growth of 24.9%.\n\nStory continues Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nADTRAN carries a Zacks Rank #3 (Hold).\n\nStocks to Consider\n\nUbiquiti Inc. UI, carrying a Zacks Rank #2 (Buy), is a key pick in the broader industry. Headquartered in New York, it offers a comprehensive portfolio of networking products and solutions for service providers and enterprises at disruptive prices. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nUbiquiti boasts a proprietary network communication platform that is well-equipped to meet end-market customer needs. In addition, it is committed to reducing operational costs by using a self-sustaining mechanism for rapid product support and dissemination of information by leveraging the strength of the Ubiquiti Community.\r\n\r\nNVIDIA Corporation NVDA, currently sporting a Zacks Rank #1, delivered an earnings surprise of 9.79%, on average, in the trailing four quarters. In the last reported quarter, it pulled off an earnings surprise of 29.19%.\r\n\r\nNVIDIA is the worldwide leader in visual computing technologies and the inventor of the graphic processing unit or GPU. Over the years, the company’s focus has evolved from PC graphics to artificial intelligence-based solutions that now support high-performance computing, gaming and virtual reality platforms.\r\n\r\nArista Networks, Inc. ANET, presently carrying a Zacks Rank #2, is likely to benefit from strong momentum and diversification across its top verticals and product lines. The company has a software-driven, data-centric approach to help customers build their cloud architecture and enhance their cloud experience. Arista has delivered an earnings surprise of 12.8%, on average, in the trailing four quarters.\r\n\r\nIt holds a leadership position in 100-gigabit Ethernet switching share in port for the high-speed data center segment. Arista is increasingly gaining market traction in 200 and 400-gig high-performance switching products and is well-positioned for healthy growth in the data-driven cloud networking business with proactive platforms and predictive operations.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nADTRAN Holdings, Inc. (ADTN) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nArista Networks, Inc. (ANET) : Free Stock Analysis Report\n\nUbiquiti Inc. (UI) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/adtrans-adtn-preliminary-q3-results-162500912.html", "symbols": ["117.F", "ADTN.US", "ANET.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.031, "neu": 0.82, "pos": 0.149}}, {"date": "2023-10-17T16:13:31+00:00", "title": "Stock Market Today: Dow ekes out gain, but rising Treasury yields stifle upside", "content": "Investing.com -- The Dow eked out a gain Tuesday, but upside momentum was stifled by a jump in Treasury yields following stronger retail sales data that underscored ongoing strength in the economy, stoking fresh fears about another Federal Reserve rate hike before year end.\n\nThe Dow Jones Industrial Average rose 0.04% or 13 points, the Nasdaq fell 0.3%, and the S&P 500 fell 0.01%.\n\nTreasury yields surge as retail sales top estimates\n\nTreasury yields continued their surge higher, with the yield on the 2-year treasury rising to a 17-year high after better-than-expected retail sales pointed to ongoing economic strength, suggested the Fed still has more work to do.\n\nRetail sales rose 0.7% last month, markedly beating economists’ forecast for a 0.3% rise. The retail sales control group – which has a larger impact on U.S. GDP – rose 0.6% well above expectations for a 0.1% rise.\n\nWhile a November rate hike remained low at 10%, the odds of a December hike jumped to 42% from 26% the prior week, according to Investing.com’s Fed Rate Monitor Tool.\n\nBank of America impresses on earnings stage, but Goldman falters\n\nBank of America Corp (NYSE:BAC) reported quarterly results that topped Wall Street, sending its share more than 2% higher.\n\nGoldman Sachs’ Q3 earnings, however, missed estimates amid losses from its real investment and Greensky fintech business.\n\nThe bank suffered a $358 million write down on its real estate investment as the sector has come under pressure from a sharp surge in interest rates.\n\nJohnson and Johnson, Lockheed Martin deliver earnings beat\n\nJohnson&Johnson (NYSE:JNJ) upgraded its annual guidance on performance after reporting quarterly results that beat on the top and bottom lines, but the pharmaceutical company’s stock closed about 1% lower.\n\nThe company now sees annual sales in a range of $83.6 to $84 billion from a prior estimate of $83.2 billion to $84 billion, with adjusted EPS forecast between $10.07 and $10.13 from $10.00 to $10.10\n\nStory continues\n\nLockheed Martin (NYSE:LMT) closed flat as the defense company’s third-quarter results topped analyst estimates, though concerns about the impact of delivery delays for its F-35 jets weighed.\n\nNvidia leads chips lower as U.S. looks to tightened restrictions on chip exports to China\n\nNVIDIA Corporation (NASDAQ:NVDA) fell more than 4% to lead the broader chip sector lower following a Bloomberg report that the U.S. is restricting the sale of semicondutors that the chipmaker designed for the Chinese market.\n\nThe tighter restrictions would now include Nvidia’s A800 and H800 chips, the lower performance GPUs, that Nvidia devised after the initial U.S. exports last October.\n\nThe expanded curbs come as the U.S. aims to curb loopholes that allowed Chinese firms to evade export controls introduce last year by routing chip shipments through other nations.\n\nNvidia said, however, that it doesn’t expect a “near -term meaningful impact” from the expanded exports curbs on its financial results.\n\nRelated Articles\n\nStock Market Today: Dow ekes out gain, but rising Treasury yields stifle upside\n\nCitadel Securities, trade body sue US SEC over consolidated audit trail\n\nGoldman profit tops estimates as dealmaking cushions hit from GreenSky, real estate", "link": "https://finance.yahoo.com/news/stock-market-today-dow-ekes-161331047.html", "symbols": ["BAC.US", "DJI.INDX", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.972, "neg": 0.072, "neu": 0.811, "pos": 0.116}}, {"date": "2023-10-17T16:12:24+00:00", "title": "3 Tremendous Stock-Split Stocks for the Q4 Rebound", "content": "Investors love stock splits. Although they’re technically a non-event, a stock split is seen as a bullish indicator. They indicate management is confident in the company’s future growth prospects. Making the stock more affordable and liquid means shares will be available to more people.\n\nOf course, stock splits are meaningless in terms of the company. Shareholders end up with 12 slices of pizza instead of six. They have two $5 bills in their wallet instead of a $10 bill. Rearranging the number of shares and their price tells you nothing about the business.\n\nStill, since Nvidia (NASDAQ:NVDA) reignited the stock split market by splitting its shares 4-for-1 in July 2021, a number of other big-name companies also split their shares. Most are handily beating the S&P 500 since the date of the split. A few, like Tesla (NASDAQ:TSLA), are significantly underperforming the index.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThree stock-split stocks that divvied up their shares over the past year or so still have tremendous value to unlock for shareholders. If the stock market rebounds in the fourth quarter as some analysts suggest, these are companies you want to buy now.\n\nPalo Alto Networks (PANW)\n\nSource: Sundry Photography / Shutterstock.com\n\nAccording to virtual private network (VPN) provider SurfShark, since 2021 the number of cybercrime victims increased 16-fold to 91 victims every hour. The cost of cybercrime increased an eye-bleeding 570 times, hitting $1.2 million per hour. Like death and taxes, hackers apparently will always be with us.\n\nThat gives Palo Alto Networks (NASDAQ:PANW) a target-rich environment to sell its products protecting data. It’s certainly finding an audience of willing customers. Fiscal year 2023 revenue soared 25% to $6.9 billion and it turned a $267 million net loss in 2022 into a $440 million profit this year.\n\nBillings grew 23% to $9.2 billion as Palo Alto Networks develops new and innovative platforms to drive annual recurring revenue (ARR). Its Cortex platform is an artificial intelligence-driven service for threat detection and prevention. It achieved $1 billion in ARR in the fiscal third quarter. Its secure access service edge platform just achieved ARR of $1 billion in the fourth quarter. Growth in ARR indicates customers like what they’re getting and are coming back for more.\n\nStory continues\n\nPalo Alto Networks split its stock 3-for-1 in Sept. 2022. Since then shares grew 43% compared to a 10% gain by the S&P 500. The stock is up 87% this year alone. With an unending need for its services, the sky is truly the limit for this cybersecurity leader.\n\nAmazon (AMZN)\n\nSource: Ken Wolter / Shutterstock.com\n\nAmazon (NASDAQ:AMZN) hasn’t quite run away with it in the same way since its 20-for-1 stock split in June 2022. Shares are only 9% higher since then versus a 6% gain for the broad market index. Still, the online retailer is among the stock split stocks worth buying.\n\nObviously, its internet retailing operations are top notch. It just completed its Prime Big Deal Days and it outpaced last year’s event. According to Amazon, Prime members bought over 150 million items from third-party sellers, a 50% increase from last year.\n\nYet the numbers also show consumers are feeling the pinch of persistent inflation. Data analytics firm Numerator says 60% of the items purchased were for less than $20 while just 4% were for more than $100.\n\nBut Amazon is integral to the economy. It accounts for nearly 40% of all online retail sales in the U.S. It does face some headwinds from federal regulators suing the retailer for various alleged trade practices, but it’s not enough of a concern to sink the company.\n\nInvestors should note the real growth opportunity is in its cloud-based business, Amazon Web Services. Long the profit center of Amazon, AWS represents 16% of total revenue, but 84% of total operating profits.\n\nAWS is also the leading cloud services operation globally with a 30% share of the market, according to Canalys. AI could push that higher. With AWS more critical to Amazon’s operating cash flows, which rocketed 74% higher during the period, there’s plenty of growth still to come for the retail behemoth.\n\nCopart (CPRT)\n\nSource: Shutterstock\n\nAuto auction operator Copart (NASDAQ:CPRT) is a different kind of used car dealer. Unlike many dealers that buy their vehicles from the public, some 83% of Copart’s sellers are insurance companies. Other sellers include banks, finance companies, charities, and fleet operators. And most of the vehicles it acquires are typically damaged and considered a total loss by the insurers.\n\nYou might not think that would be a viable business, but Copart’s is booming. Revenue jumped 10.5% in FY2023 to $3.9 billion with net profits rocketing 32% higher to $84 million.\n\nThis comes even though market conditions aren’t ideal for used cars. Prices remain stubbornly high. Although that can mean higher profits per vehicle, it also makes insurance companies reluctant to declare a vehicle a total loss. Fortunately, the peak of the market seems to have passed.\n\nKelley Blue Book says used car prices fell 1% in August, with the average reaching $26,251. That’s still historically high and KBB sees it remaining so for some time. Used car prices lag those of new cars. So even as new car prices have returned to last year’s levels, used car prices will take some time to fall.\n\nThat means Copart has some important tailwinds building behind it. It split its stock 2-for-1 in August. Shares are up 3% since then compared to a 5% drop by the S&P 500. With Wall Street looking for earnings to grow 22% a year for the next five years, this is an opportune time to buy into this used car auction house. That makes CPRT a definite contender when it comes to stock split stocks to buy now.\n\nOn the date of publication, Rich Duprey did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nRich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 3 Tremendous Stock-Split Stocks for the Q4 Rebound appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-tremendous-stock-split-stocks-161224783.html", "symbols": ["5AP.F", "AMZN.US", "CO6.F", "CPRT.US", "NVDA.US", "PANW.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.039, "neu": 0.848, "pos": 0.113}}, {"date": "2023-10-17T16:07:03+00:00", "title": "Markets Mixed at Midday as Booming Retail Sales Raise Interest Rate Hike Fears", "content": "U.S. equities were mixed at midday on Tuesday, Oct. 17, 2023 following a report showing retail sales jumped well above expectations in September, raising concerns of more Fed interest rate hikes ahead to fight inflation.\n\nContinue reading", "link": "https://finance.yahoo.com/m/95c8a2c8-8384-31f2-a3b9-df0c11d469a3/markets-mixed-at-midday-as.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "VFC.US", "VFP.F"], "tags": [], "sentiment": {"polarity": 0.417, "neg": 0.063, "neu": 0.805, "pos": 0.131}}, {"date": "2023-10-17T16:03:05+00:00", "title": "AI raised Big Tech market caps by $2.4 trillion since last year: Report", "content": "Artificial intelligence trends have helped boost Big Tech valuations by $2.4 trillion year-over-year, according to a report by Accel Analysis. Yahoo Finance Live anchors Rachelle Akuffo and Akiko Fujita examine what comes next for tech stocks after AI hype trends translate into mass adoption and revenue drivers.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nVideo Transcript\n\nRACHELLE AKUFFO: Artificial intelligence was the new buzzword this year, but it also seems to have given tech giants a huge boost. According to a new report from Accel, AI helped big tech up its market cap by $2.4 trillion in the last year, with companies, including Apple, Amazon, and Microsoft, and Nvidia, of course, seeing their values jump by an average of 36% year over year.\n\nAnd of course, we mentioned Nvidia there-- clearly the big winner of the year as soon as all of this came out. But then you saw every company coming out with some sort of strategy to say that, oh, we're including AI. Even if it wasn't proven yet, it was enough to lift some of these tech stocks.\n\nAKIKO FUJITA: Yeah. Nvidia shares up more than 200% on the year. When you look at some of the other big tech names, we are averaging roughly 36%. But it's worth noting that the first half of the year was about the hype. The latter half, really, is about, well, where exactly is the revenue?\n\nAnd we have seen companies, those valuations, start to come down a little because they haven't necessarily been able to prove out their strategy of that revenue pouring in right away. Nvidia is a different case, because we have seen really strong numbers coming through from there. But you could point to even a name like ARM.\n\nYou look at that roughly $5 billion IPO, so much excitement initially around its potential for AI. But since then, we have seen Wall Street turn a little more cautious on the name because they haven't seen that strategy pan out. So, yes, AI still very much in focus-- companies certainly honing in on the potential opportunity there.\n\nBut we have seen the exuberance pull back just a little because investors are saying, well, show me the money, right? I mean, show me where exactly that revenue is coming in from-- a story, of course, we're continuing to follow there.", "link": "https://finance.yahoo.com/video/ai-raised-big-tech-market-160305991.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MI", "GOOG.MX", "GOOG.US", "GOOGL.US"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.004, "neu": 0.86, "pos": 0.137}}, {"date": "2023-10-17T15:51:32+00:00", "title": "Jim Cramer’s 10 Best AI Stocks", "content": "In this article, we will take a look at Jim Cramer's 10 best AI stocks. To see more such companies, go directly to Jim Cramer's 5 Best AI Stocks.\n\nJim Cramer made some important comments earlier this year when he talked about the importance of investing in individual stocks. There has been a rise popularity of investing in index funds over the past few years. Beginner investors often get advised that investing in individual names is too risky and they are far better off investing in broader market funds. Cramer said in his program that while he recommends investing in index funds, he also urges investors to invest in individual stocks if they really want to make money in the stock market. But Cramer said investing in individual stocks requires care and deep study. In the same program Jim Cramer talked about the importance of investing in AI stocks and named some big companies working on AI products, including Meta Platforms.\n\nAI's GoPro Moment?\n\nJim Cramer is also deeply aware of the hype around AI and how companies are excessively using the AI buzzword to boost their stock prices and rally investors. About a month ago, Jim Cramer on his program wondered whether AI was about to have its “GoPro moment,” drawing a comparison between the hype GoPro enjoyed during its early days and the AI boom of today. Cramer said that there was a time when GoPro stock touched high $90s before tumbling and plunging to new lows and today the stock is trading in single digits ($2.82 as of October 16, to be exact). Cramer said that “I have to find out” when companies would stop rolling out AI stories to boost their stock prices.\n\nOur Methodology\n\nFor this article we went through several programs of Jim Cramer and picked AI stocks he’s bullish on. With each stock we have linked to the video in which Cramer talked about the company in question. Some top names Cramer likes include Microsoft Corporation (NASDAQ:MSFT), Alphabet Inc. (NASDAQ:GOOG) and NVIDIA Corporation (NASDAQ:NVDA).\n\nStory continues Jim Cramer's Best AI Stocks\n\nJim Cramer's 10 Best AI Stocks\n\n10. Broadcom Inc. (NASDAQ:AVGO)\n\nNumber of Hedge Fund Holders: 72\n\nJim Cramer in a program earlier this year said Broadcom Inc. (NASDAQ:AVGO) has got the “mojo” when it comes to AI. Cramer specifically likes Broadcom Inc. (NASDAQ:AVGO)’s partnership with Google to provide AI chips. However, a report from The Information in September, citing sources familiar with the matter, said Google wants to cut its reliance on Broadcom Inc. (NASDAQ:AVGO) for AI-accelerating TPU chips as early as 2027.\n\nJim Cramer also said that Broadcom Inc. (NASDAQ:AVGO) is “not an expensive stock.” He also referred to price target upgrades and bullish ratings on Broadcom Inc. (NASDAQ:AVGO) from BMO, JPMorgan and Evercore.\n\nClearBridge Multi Cap Growth Strategy made the following comment about Broadcom Inc. (NASDAQ:AVGO) in its Q2 2023 investor letter:\n\n“While the ClearBridge Multi Cap Growth Strategy has limited mega cap exposure, which has been a recent headwind to relative performance, we own several companies that stand to benefit from the explosive growth in generative AI. These holdings play key roles in building out the necessary infrastructure and helping customers leverage capabilities enabled by this emerging technology.\n\nSemiconductor and software solutions provider Broadcom Inc. (NASDAQ:AVGO), for example, is an important supplier of networking chips that power ethernet switches and routers for connectivity between AI servers. The company sees quarterly revenue from this part of their business exceeding $1 billion in their fiscal third quarter, on a trajectory toward doubling over the course of the year.”\n\n9. Oracle Corporation (NYSE:ORCL)\n\nNumber of Hedge Fund Holders: 84\n\nIn the “Lightning Round” on his program on CNBC, Jim Cramer, a couple of months ago, answering a question about Oracle Corporation (NYSE:ORCL), recommended investors to buy more ORCL stock. Cramer pointed to Oracle Corporation (NYSE:ORCL)’s quarterly earnings earlier this year and the stock’s relative underperformance after that. Cramer at the time said that “right here” is when you should buy Oracle Corporation (NYSE:ORCL). Cramer said by right here he meant $113, $112, $110. As of October 16 Oracle Corporation (NYSE:ORCL) is trading at $108. Cramer also believes Oracle is the “star of the show” in AI.\n\nAs of the end of the second quarter of 2023, 84 hedge funds out of the 910 hedge funds tracked by Insider Monkey had stakes in Oracle Corporation (NYSE:ORCL). The biggest hedge fund stakeholder of Oracle Corporation (NYSE:ORCL) during this period was Jean-Marie Eveillard’s First Eagle Investment Management which owns a $2.2 billion stake in the company.\n\nLike ORCL, Cramer also loves Microsoft Corporation (NASDAQ:MSFT), Alphabet Inc. (NASDAQ:GOOG) and NVIDIA Corporation (NASDAQ:NVDA).\n\nOracle Corporation (NYSE:ORCL)’s CTO Larry Ellison in an earnings call earlier this year talked about AI opportunities for Oracle and said:\n\n“Well, you can’t build any of these AI models without enormous amounts of training data. So if anything, what AI — generative AI has shown that the big issue about training one of these models is just getting that — this vast amount of data ingested into your GPU supercluster. It is a huge data problem in the sense you need so much data. To train — OpenAI to train ChatGPT 3.5, they read the entire public Internet, they read all of Wikipedia, they read everything, they ingested everything. And to specialize, and you take something like ChatGPT 4.0 and you want to specialize it, you need specialized training data from electronic health records to help doctors diagnose and treat cancer, let’s say, and we are partners.\n\nImaging for example, that is ingesting huge amounts of image data to train their AI models. We have our own — another partner of ours in AI, ingesting huge amounts of electronic health records to train their models. AI doesn’t work without getting access to and ingesting enormous amounts of data. So in terms of a shift away from data or a change in gravities at AI, AI is utterly dependent upon vast amounts of training data. Trillions of elements went into building ChatGPT 3.5, multiple times that for ChatGPT 4.0 because you have to deal with all the image data and ingest all of that to train image recognition. So we think this is very good for our database business, and Oracle’s new Vector database will contain highly-specialized training data like electronic health records, while keeping that data anonymized and private, yet still training the specialized models that can help doctors improve their diagnostic capability and their treatment prescriptions for cancer and heart disease and all sorts of other diseases.\"\n\nRead the full earnings call transcript here.\n\nOakmark Global Fund made the following comment about Oracle Corporation (NYSE:ORCL) in its Q3 2023 investor letter:\n\n“Oracle Corporation (NYSE:ORCL) (U.S.), a global software company, was the Fund’s top contributor for the fiscal year, with its share price rising primarily after reporting its fiscal fourth-quarter results. More recently, Oracle announced fiscal first-quarter results, which were in line with consensus expectations. The drivers of the core business are performing well, in our view, and management expressed confidence that annual revenue growth will accelerate as planned based on demand trajectory and its strong bookings trends. For the quarter, total revenue increased 8% in constant currency (9% reported), and operating income grew 12% with margins showing improvement. Cloud and support revenue grew 11% in constant currency, powered by Fusion +20% and Netsuite +21%. The “strategic back office cloud” is now up to $6.9 billion in run-rate revenue. Infrastructure cloud and support revenue grew 14% in constant currency, powered by infrastructure cloud services +72% ex-legacy hosting services to $5.6 billion in run-rate revenue. Momentum is continuing to build as Oracle signed several deals for its cloud business greater than $1 billion in total value during the quarter and booked an additional $1.5 billion in the first week of the second quarter. We continue to believe Oracle is an attractive holding and undervalued due to our perception of its intrinsic value.”\n\n8. Adobe Inc. (NASDAQ:ADBE)\n\nNumber of Hedge Fund Holders: 109\n\nJim Cramer said in a program that Adobe is using the best use of AI and Adobe Inc. (NASDAQ:ADBE) is more responsive than any other company when it comes to AI.\n\nAnalysts are praising Adobe Inc. (NASDAQ:ADBE)’s AI features across the board. Baird recently said it is “incrementally positive” on Adobe Inc. (NASDAQ:ADBE)’s artificial intelligence strategy and leadership position.\n\n“We expect the product roadmap to continually evolve over time with additional GenAI announcements, Baird’s Rob Oliver and Patrick Schulz, who have a $540 price target on Adobe, said.\n\n7. Advanced Micro Devices, Inc. (NASDAQ:AMD)\n\nNumber of Hedge Fund Holders: 112\n\nEarlier this year Jim Cramer said that he’s been recommending Advanced Micro Devices, Inc. (NASDAQ:AMD) since the stock was trading at $5. Cramer praised Advanced Micro Devices, Inc. (NASDAQ:AMD)’s latest AI chips announcements and said that it was bad news for China since Chinese semiconductor companies seem to be struggling to keep up with innovation and American companies won’t be allowed to export AI chips to China.\n\nIn May 2023, Cramer also talked about Advanced Micro Devices, Inc. (NASDAQ:AMD)’s partnership with Microsoft for AI chips and said the deal could have major implications.\n\nIn May, Bloomberg reported that Microsoft was joining hands with Advanced Micro Devices, Inc. (NASDAQ:AMD) to help the semiconductor firm expand into AI, where Nvidia currently dominates.\n\nArtisan Global Opportunities Fund made the following comment about Advanced Micro Devices, Inc. (NASDAQ:AMD) in its Q2 2023 investor letter:\n\n“Among our top contributors were Advanced Micro Devices, Inc. (NASDAQ:AMD), NU Holdings and Netflix. AMD’s data center CPUs are used in the cloud service provider (CSP) servers. In addition to the broader secular tailwind from cloud adoption, the company has a performance and pricing advantage over Intel, which we believe will enable it to continue capturing market share. However, the recent stock price rally was due to growing excitement around the company’s AI exposure. It will launch its new MI300 graphics processing unit (GPU) chip later this year to compete against the dominant market leader NVIDIA. Similar to its approach that won market share from Intel within the CPU market, AMD’s product will aim to provide similar performance at a more attractive price. AMD is already working with Microsoft and Meta, while Amazon publicly stated that it is evaluating AMD’s inferencing chips. Using assumptions around the total GPU market size, potential market share gains and price points, our research indicates this could be a $20 billion opportunity for AMD. That would nearly double its revenue. While the company has not historically missed many deadlines, there is execution risk as it works to manufacture and distribute these complex chips at scale, which, combined with an elevated valuation after the stock’s strong performance run, led us to trim the position.”\n\n6. Salesforce, Inc. (NYSE:CRM)\n\nNumber of Hedge Fund Holders: 122\n\nJim Cramer in September interviewed Salesforce, Inc. (NYSE:CRM)’s CEO Marc Benioff at Salesforce’s Dreamforce, where the company revealed several AI offerings. Benioff highlighted the role of Slack, which Salesforce, Inc. (NYSE:CRM) acquired for about $27.7 billion, when it comes to AI.\n\n“The big news is Slack is really starting to wake up with its own AI. It holds so much data for our customers. I think Slack is going to be the promise of AI for a lot of our most important customers. If you go talk to any of these great, new AI companies they are all Slack-first companies; they all built their product with Slack.”\n\nCramer is bullish on Salesforce, Inc. (NYSE:CRM). His charitable trust has a position in Salesforce, Inc. (NYSE:CRM). Cramer recently said during his program that Salesforce, Inc. (NYSE:CRM) will have a “dynamite” 2024.\n\nHarding Loevner Global Equity Strategy made the following comment about Salesforce, Inc. (NYSE:CRM) in its Q2 2023 investor letter:\n\n“Salesforce, Inc. (NYSE:CRM), a company we’ve owned since 2019, recently added ChatGPT-like capabilities onto its existing Al module, Einstein, to support its internal sales efforts and customer-facing software. For example, Einstein GPT can help generate marketing emails tailored to specific clients by using Salesforce’s customer database and past email correspondence to learn the most effective approach for each client. Einstein GPT is also different from off-the-shelf LLMS in three important ways: It keeps personal identifiable information private and secure, compared with external tools that retain anything a user enters. It employs the latest data in Salesforce’s system, as opposed to the sometimes-stale public data that train generic models. And generative Al capabilities can be integrated with other Salesforce offerings; the company has already introduced Slack GPT and Tableau GPT, Al-equipped versions of its workplace collaboration and analytics tools.”\n\nSome other stocks Cramer likes because of their AI potential include Microsoft Corporation (NASDAQ:MSFT), Alphabet Inc. (NASDAQ:GOOG) and NVIDIA Corporation (NASDAQ:NVDA).\n\nClick to continue reading and see Jim Cramer's 5 Best AI Stocks.\n\nSuggested articles:\n\n12 Best Upwork Alternatives for Freelancers and Employers Top 20 Countries With Most Natural Resources in the World 23 High-Paying Trade and Vocational Jobs in 2023\n\nDisclosure: None. Jim Cramer's 10 Best AI Stocks is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/jim-cramer-10-best-ai-155132343.html", "symbols": ["A1MD34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "ADB.F", "ADBE.US", "ADBE34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "AVGO.US", "AVGO34.SA", "CRM.US", "FOO.F"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.015, "neu": 0.866, "pos": 0.119}}, {"date": "2023-10-17T15:36:57+00:00", "title": "Why Nvidia, AMD, Intel, and Other Semiconductor Stocks Are Down After New AI Regulation Announcement", "content": "In today's video, I discuss recent updates affecting Nvidia (NASDAQ: NVDA) and other semiconductor stocks. Check out the short video to learn more, consider subscribing, and click the special offer link below.\n\nContinue reading", "link": "https://finance.yahoo.com/m/bb3528be-5c1d-3b32-942d-21c0f141cea5/why-nvidia%2C-amd%2C-intel%2C-and.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.402, "neg": 0, "neu": 0.922, "pos": 0.078}}, {"date": "2023-10-17T15:02:16+00:00", "title": "S&amp;P 500 falls as Nvidia slip, rising yields overshaddow quarterly earnings", "content": "Investing.com -- The S&P 500 fell Tuesday as investor sentiment was soured by Nvidia-led weakness in chip stocks and a jump in Treasury yields following stronger retail sales data that boosted bets on a Fed rate hike by year end.\n\nThe Dow Jones Industrial Average fell 0.3% or 100 points, the Nasdaq gained 0.5%, and the S&P 500 fell 0.4%.\n\nTreasury yields surge as retail sales top estimates\n\nTreasury yields continued their surge higher, with the yield on the 2-year treasury rising to a 17-year high after better-than-expected retail sales pointed to ongoing economic strength, suggested the Fed still has more work to do.\n\nRetail sales rose 0.7% last month, markedly beating economists’ forecast for a 0.3% rise. The retail sales control group – which has a larger impact on U.S. GDP – rose 0.6% well above expectations for a 0.1% rise.\n\nWhile a November rate hike remained low at 10%, the odds of a December hike jumped to 42% from 26% the prior week, according to Investing.com’s Fed Rate Monitor Tool.\n\nBank of America impresses on earnings stage, but Goldman falters\n\nBank of America Corp (NYSE:BAC) reported quarterly results that topped Wall Street, sending its share more than 2% higher.\n\nGoldman Sachs’ Q3 earnings, however, missed estimates amid losses from its real investment and Greensky fintech business.\n\nThe bank suffered a $358 million write down on its real estate investment as the sector has come under pressure from a sharp surge in interest rates.\n\nJohnson and Johnson, Lockheed Martin deliver earnings beat\n\nJohnson&Johnson (NYSE:JNJ) upgraded its annual guidance on performance after reporting quarterly results that beat on the top and bottom lines, but the pharmaceutical company’s stock was 1% lower.\n\nThe company now sees annual sales in a range of $83.6 to $84 billion from a prior estimate of $83.2 billion to $84 billion, with adjusted EPS forecast between $10.07 and $10.13 from $10.00 to $10.10\n\nLockheed Martin (NYSE:LMT) fell nearly 1% as the defense company’s third-quarter results topped analyst estimates, though concerns about the impact of delivery delays for its F-35 jets weighed.\n\nStory continues\n\nNvidia leads chips lower as U.S. looks to tightened restrictions on chip exports to China\n\nNVIDIA Corporation (NASDAQ:NVDA) fell more than 5% to lead the broader chip sector lower following a Bloomberg report that the U.S. is restricting the sale of semicondutors that the chipmaker designed for the Chinese market.\n\nThe tighter restrictions would now include Nvidia’s A800 and H800 chips, the lower performance GPUs, that Nvidia devised after the initial U.S. exports last October.\n\nThe expanded curbs come as the U.S. aims to curb loopholes that allowed Chinese firms to evade export controls introduce last year by routing chip shipments through other nations.\n\nNvidia said, however, that it doesn’t expect a “near -term meaningful impact” from the expanded exports curbs on its financial results.\n\nRelated Articles\n\nMicrosoft in talks to sign on Amazon as customer in $1 billion cloud tools deal - Insider\n\nUS Companies Rush IPO Filings Amid Looming Government Shutdown", "link": "https://finance.yahoo.com/news/p-500-falls-nvidia-slip-150216989.html", "symbols": ["BAC.US", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA", "NVDA.US"], "tags": [], "sentiment": {"polarity": -0.815, "neg": 0.067, "neu": 0.868, "pos": 0.064}}, {"date": "2023-10-17T14:39:33+00:00", "title": "Dollar Tree, Tesla recall, Nvidia and chip stocks: Trending Tickers", "content": "Dollar Tree (DLTR) shares are on the move this morning after Goldman Sachs analysts upgraded the discount store to \"Buy.\" Tesla (TSLA) recalls 55,000 Model Y EVs on issues to its warning lights, set to resolve the issue with an over-the-air fix.\n\nNvidia (NVDA) and other chipmaker stocks, such as Intel (INTC) and Advanced Micro Devices (AMD), are sliding this morning on the Biden administration's new export restrictions targeting China's ability to purchase new AI chips.\n\nYahoo Finance Live examines these stocks trending in the morning session and President Biden's tightening China policies.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/dollar-tree-tesla-recall-nvidia-143933368.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "DJI.INDX", "DLTR.MX", "DLTR.US", "DT3.F", "GSPC.INDX", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.691, "neg": 0.02, "neu": 0.903, "pos": 0.077}}, {"date": "2023-10-17T14:33:00+00:00", "title": "Nvidia Stock Tumbles as U.S. Tightens Restrictions on AI Chip Exports to China", "content": "The Biden administration is tightening its restriction on exports of artificial intelligence chips to China.\n\nContinue reading", "link": "https://finance.yahoo.com/m/42d94d55-cbb6-392b-a9b5-37a3cc2adcfb/nvidia-stock-tumbles-as-u.s..html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.25, "neg": 0.104, "neu": 0.743, "pos": 0.153}}, {"date": "2023-10-17T14:31:00+00:00", "title": "Nvidia tumbles, leading chip stocks lower, on new US-China export restrictions", "content": "The U.S. tightened the rules that ban the export of key AI technologies to China, sending chip stocks sharply lower in early trading.\n\nContinue reading", "link": "https://finance.yahoo.com/m/570adaba-7890-390a-861b-11d1bd4b6a74/nvidia-tumbles%2C-leading-chip.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": -0.7, "neg": 0.201, "neu": 0.799, "pos": 0}}, {"date": "2023-10-17T14:11:53+00:00", "title": "11 Best Quantum Computing Stocks To Buy Now", "content": "In this article, we discuss 11 best quantum computing stocks to buy now. If you want to skip our detailed discussion on the quantum computing industry, head directly to 5 Best Quantum Computing Stocks To Buy Now.\n\nThe International Data Corporation (IDC) released its second projection for the global quantum computing market on August 17, 2023. It anticipates that customer spending on quantum computing will increase from $1.1 billion in 2022 to $7.6 billion by 2027, demonstrating a 48.1% compound annual growth rate over the forecast period. This updated forecast is considerably lower than IDC's earlier quantum computing prediction from 2021. Many factors have negatively impacted customer spending in the short-term, including slower progress in quantum hardware development, the emergence of alternative technologies like generative AI offering more immediate benefits, as well as higher interest rates and the possibility of a recession. IDC believes that the quantum computing market will continue to experience slow growth until there is a significant breakthrough in quantum hardware development that delivers a quantum advantage. In the meantime, most growth will be driven by improvements in quantum computing infrastructure and platforms and the rise of performance-intensive computing tasks suitable for quantum technology. IDC also expects investments in the quantum computing market to grow at a compound annual growth rate of 11.5% from 2023 to 2027, amounting to approximately $16.4 billion by the end of 2027.\n\nOn September 13, 2023, D-Wave Quantum Inc. (NYSE:QBTS)’s CEO, Alan Baratz, joined Bloomberg Television to discuss the potential of quantum computing, the rivalry between the United States and China in this domain, and the significant impact of artificial intelligence (AI) on this field. Ed Ludlow, co-host of Bloomberg Technology, commented that there is a mistaken belief that quantum computing is primarily in the theoretical realm and has not yet made a tangible technological impact. To this, Baratz replied:\n\nStory continues\n\n“You’re absolutely right. Most people in the industry are saying that quantum computing is years away from commercial reality but at D-Wave we took a very different approach to quantum computing, one that has allowed us to deliver commercial quantum computers today. In fact, we’ve been delivering them for almost two years now. We have over sixty commercial customers that are leveraging our quantum computer to see improved performance and a broad array of business applications.”\n\nSimilarly, a UK startup, Phasecraft Ltd., which originated from University College London and the University of Bristol, secured £13 million in funding in August 2023. They aim to create algorithms specifically designed for quantum devices like those developed by Google and IBM. While they're developing proof-of-concept products for a UK government institution, Phasecraft’s focus is on advancing software for future quantum processors and accelerating research into components for electric batteries and solar panels.\n\nQuantum computing is quickly taking the world by storm. While Alphabet and IBM are in a competitive race to develop a dependable quantum computer, major financial institutions such as JPMorgan Chase & Co. (NYSE:JPM) and Visa Inc. (NYSE:V) are investigating potential applications for it. In the financial sector, machine learning algorithms are expected to enhance tasks like fraud detection in transactions, portfolio optimization, and options pricing, as stated by Marco Pistoia, who oversees JPMorgan's global technology applied research group. In the field of medicine, Moderna, Inc. (NASDAQ:MRNA) and IBM joined forces in April 2023 to leverage generative artificial intelligence and quantum computing in order to enhance mRNA technology, which is the fundamental technology behind Moderna's highly successful COVID vaccine. Moderna CEO Stephane Bancel commented:\n\n“We are excited to partner with IBM to develop novel AI models to advance mRNA science, prepare ourselves for the era of quantum computing, and ready our business for these game-changing technologies.”\n\nSome of the best quantum computing stocks to invest in include NVIDIA Corporation (NASDAQ:NVDA), Microsoft Corporation (NASDAQ:MSFT), and Alphabet Inc. (NASDAQ:GOOG).\n\nOur Methodology\n\nWe selected the following quantum computing stocks based on the hedge fund sentiment toward each stock. We have assessed the hedge fund sentiment from Insider Monkey’s database of 910 elite hedge funds tracked as of the end of the second quarter of 2023. The list is arranged in ascending order of the number of hedge fund investors in each firm. 11 Best Quantum Computing Stocks To Buy Now\n\nCredit: IBM\n\nBest Quantum Computing Stocks To Buy Now\n\n11. Quantum Computing Inc. (NASDAQ:QUBT)\n\nNumber of Hedge Fund Holders: 2\n\nQuantum Computing Inc. (NASDAQ:QUBT), a company specializing in nanophotonics-based quantum technology, provides cost-effective commercial solutions. It delivers quantum capabilities while requiring minimal training, consuming low power, and without any specific environmental prerequisites. On September 5, Quantum Computing Inc. (NASDAQ:QUBT) announced a strategic partnership and collaboration agreement with Assured Cyber Protection (Recyber), an AI-driven cybersecurity firm. The primary aim of this agreement is to align their efforts in promoting and providing their respective cybersecurity technologies and products.\n\nAccording to Insider Monkey’s second quarter database, Israel Englander’s Millennium Management and Matthew Hulsizer’s PEAK6 Capital Management held stakes in Quantum Computing Inc. (NASDAQ:QUBT), collectively amounting to $166,669.\n\n10. D-Wave Quantum Inc. (NYSE:QBTS)\n\nNumber of Hedge Fund Holders: 10\n\nD-Wave Quantum Inc. (NYSE:QBTS) is a Canadian company that offers quantum computing systems, software, and services, including the fifth-generation quantum computer called Advantage, the Ocean suite of open-source Python tools, and the cloud-based Leap service. They also provide a professional service, D-Wave Launch, guiding enterprises through quantum implementation. D-Wave Quantum Inc. (NYSE:QBTS) is one of the best quantum computing stocks to monitor. In the second quarter of fiscal year 2023, D-Wave Quantum Inc. (NYSE:QBTS) recorded bookings of $2.5 million, marking a notable increase of $1.5 million, which corresponds to a 146% rise when compared to the $1.0 million in bookings during the same period in fiscal 2022. This signifies D-Wave's fifth consecutive quarter of year-over-year growth in bookings.\n\nAccording to Insider Monkey’s Q2 data, D-Wave Quantum Inc. (NYSE:QBTS) was part of 10 hedge fund portfolios, compared to 9 funds in the preceding quarter.\n\nLike NVIDIA Corporation (NASDAQ:NVDA), Microsoft Corporation (NASDAQ:MSFT), and Alphabet Inc. (NASDAQ:GOOG), D-Wave Quantum Inc. (NYSE:QBTS) is one of the best quantum computing stocks to monitor.\n\n180 Degree Capital made the following comment about D-Wave Quantum Inc. (NYSE:QBTS) in its second quarter 2023 investor letter:\n\n“D-Wave Quantum Inc. (NYSE:QBTS): QBTS reported weak results for the first quarter and a new debt facility from its largest shareholder for up to $50 million, with $15 million drawn initially and the next tranches available if the company achieves certain milestones. After selling off materially following earnings, QBTS appears to be the beneficiary of interest in AI-related stocks, and its stock price increased dramatically from the lows following earnings. With the stock above $1/share, QBTS now has access to its equity facility from Lincoln Park Capital. For the quarter, QBTS increased NAV by $0.11, or $1.2 million.”\n\n9. Rigetti Computing, Inc. (NASDAQ:RGTI)\n\nNumber of Hedge Fund Holders: 13\n\nRigetti Computing, Inc. (NASDAQ:RGTI) develops quantum computers and superconducting quantum processors. The company’s Quantum Computing as a Service platform is adaptable for public, private, or hybrid clouds. They provide platforms, research tools, and software used in benchmarking, chemical simulation, education/entertainment, machine learning, and optimization. Rigetti Computing, Inc. (NASDAQ:RGTI) is one of the top quantum computing stocks to buy.\n\nOn September 19, Rigetti Computing (NASDAQ:RGTI) announced a five-year contract with the Air Force Research Lab Information Directorate, providing quantum foundry services to their researchers. This contract enables AFRL to utilize Rigetti Computing (NASDAQ:RGTI)’s fabrication and manufacturing capabilities to create tailored quantum systems.\n\nAccording to Insider Monkey’s second quarter database, 13 hedge funds were bullish on Rigetti Computing (NASDAQ:RGTI), with combined stakes worth $2.3 million. Israel Englander’s Millennium Management is the largest stakeholder of the company, with 1 million shares worth $1.2 million.\n\n8. IonQ, Inc. (NYSE:IONQ)\n\nNumber of Hedge Fund Holders: 19\n\nIonQ, Inc. (NYSE:IONQ) is a Maryland-based company that specializes in creating versatile quantum computing systems. They offer access to quantum computers with a range of qubit capabilities. The company makes access to its quantum computers through cloud platforms, such as Amazon Web Services’ Amazon Braket, Microsoft's Azure Quantum, and Google's Cloud Marketplace, as well as through its cloud service. IonQ, Inc. (NYSE:IONQ) is one of the leading quantum computing stocks to invest in.\n\nOn September 28, IonQ, Inc. (NYSE:IONQ) announced that it has strengthened its partnership with the Air Force Research Lab by providing two trapped-ion quantum computing systems based on barium. According to the agreement, IonQ will install and set up these systems at the Air Force Research Lab's facility in Rome, New York. IonQ, Inc. (NYSE:IONQ) also reported booking $28 million in the second quarter of 2023.\n\nAccording to Insider Monkey’s second quarter database, 19 hedge funds were bullish on IonQ, Inc. (NYSE:IONQ), same as the prior quarter.\n\n7. Booz Allen Hamilton Holding Corporation (NYSE:BAH)\n\nNumber of Hedge Fund Holders: 25\n\nBooz Allen Hamilton Holding Corporation (NYSE:BAH) provides a wide range of consulting, technology, and digital solutions to government, corporate, and nonprofit clients globally. The company specializes in artificial intelligence services, including machine learning, predictive modeling, automation, decision analytics, and quantum computing. It is one of the top quantum computing stocks to monitor. On October 3, Bank of America analysts upgraded Booz Allen Hamilton Holding Corporation (NYSE:BAH) to Buy from Neutral, noting that the company is expected to experience growth as government agencies aim to update and modernize their technology infrastructure.\n\nAccording to Insider Monkey’s second quarter database, Israel Englander’s Millennium Management is the leading position holder in the company, with 694,859 shares worth $77.5 million.\n\nBaron Asset Fund made the following comment about Booz Allen Hamilton Holding Corporation (NYSE:BAH) in its second quarter 2023 investor letter:\n\n“We re-initiated a position in Booz Allen Hamilton Holding Corporation (NYSE:BAH), the premier provider of outsourced civil and military consulting services to the federal government. We believe that Booz’s consultants (65% of whom possess security clearances) are best in class at tackling sensitive and high priority cybersecurity, intelligence, defense, and spending efficiency projects for various government agencies. Under longtime CEO Horacio Rozanski, the company has thoughtfully invested in AI, cybersecurity, software, and other advanced technologies. It had remained ahead of its peers and is an important partner providing the government mission-critical and highly technical solutions. In addition, Booz is the largest single provider of AI services to the federal government, which we believe will be a source of ongoing, outsized growth.\n\nWe believe the ongoing U.S. military rivalry with Russia and China will provide a tailwind for increased defense budget growth and enhance the demand for Booz’s services. Booz expects to continue outgrowing its consulting peers by 2% to 4% annually, translating to mid- to high single-digit organic revenue growth that will be enhanced by targeted acquisitions. We expect improved pricing realizations and gradually increased margins as well.”\n\n6. International Business Machines Corporation (NYSE:IBM)\n\nNumber of Hedge Fund Holders: 51\n\nInternational Business Machines Corporation (NYSE:IBM) offers integrated solutions and services globally. IBM Quantum offers a range of quantum computing systems with different numbers of qubits and capabilities. Qiskit Runtime, IBM’s quantum computing service and programming model, significantly enhances performance for complex tasks, sometimes achieving a 120-fold acceleration compared to earlier models. On October 5, BoFA kept a Buy rating on International Business Machines Corporation (NYSE:IBM) stock, noting that it possesses a defensive portfolio, a strong dividend yield, and an AI portfolio that is not fully recognized or valued by the market.\n\nAccording to Insider Monkey’s second quarter database, 51 hedge funds were bullish on International Business Machines Corporation (NYSE:IBM), compared to 49 funds in the prior quarter. Paul Marshall and Ian Wace’s Marshall Wace LLP is a prominent stakeholder of the company, with 1.2 million shares worth $162.5 million.\n\nIn addition to NVIDIA Corporation (NASDAQ:NVDA), Microsoft Corporation (NASDAQ:MSFT), and Alphabet Inc. (NASDAQ:GOOG), International Business Machines Corporation (NYSE:IBM) is one of the best quantum computing stocks to watch.\n\nHere is what Diamond Hill Capital said about International Business Machines Corporation (NYSE:IBM) in its Q4 2022 investor letter:\n\n“New positions initiated in Q4 included shorts International Business Machines Corporation (NYSE:IBM), Acushnet Holdings (GOLF) and elf Beauty (ELF). Since diversified information technology company IBM’s 2019 acquisition of Red Hat, the company has aggressively pursued a hybrid cloud strategy. Though IBM and its new management team have made solid progress on this pivot, we believe the company still meaningfully lags the cloud hyperscalers and other cloud-native companies. Management has also laid out aggressive long-term targets for revenue growth and free cash flow, both of which we believe the company will struggle to achieve as it faces intense competition in its hybrid cloud business and structural headwinds in the company’s legacy businesses.”\n\nClick to continue reading and see 5 Best Quantum Computing Stocks To Buy Now.\n\nSuggested articles:\n\n14 Best SaaS Stocks To Buy Now Jim Simons Stock Portfolio: Top 10 Stock Picks 13 Technology Stocks To Buy That Are Too Cheap To Ignore\n\nDisclosure: None. 11 Best Quantum Computing Stocks To Buy Now is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/11-best-quantum-computing-stocks-141153960.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "BAH.US", "BZ9.F", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "IBM.F", "IBM.LSE", "IBM.MX", "IBM.US", "IBM.XETRA", "IONQ.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.016, "neu": 0.841, "pos": 0.142}}, {"date": "2023-10-17T14:11:17+00:00", "title": "Nvidia, Chip Stocks Drop After U.S. Curbs Exports", "content": "Shares of Nvidia and other semiconductor stocks dropped Tuesday after the U.S. said it would would [significantly constrict exports](https://www.wsj.com/tech/u-s-tightens-curbs-on-ai-chip-exports-to-china-widening-rift-with-u-s-businesses-3b9983df) of artificial-intelligence chips, making it harder for U.\n\nContinue reading", "link": "https://finance.yahoo.com/m/01fbd201-9be5-350b-8d80-daff539577cc/nvidia%2C-chip-stocks-drop.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "AVGO.US", "AVGO34.SA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.927, "pos": 0.073}}, {"date": "2023-10-17T13:50:17+00:00", "title": "Dow Jones Drops After Strong Retail Sales; Tesla Stock Slides On Recall; Nvidia Dives On AI Chip Ban", "content": "The Dow Jones dropped Tuesday after strong U.S. retail sales data. Tesla stock fell after recalling nearly 55,000 vehicles.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f16458d8-6155-304e-9d78-55ae3465715f/dow-jones-drops-after-strong.html", "symbols": ["DJI.INDX", "FB2A.F", "FB2A.XETRA", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.511, "neg": 0, "neu": 0.858, "pos": 0.142}}, {"date": "2023-10-17T13:47:47+00:00", "title": "US tightens rules on AI chip sales to China in blow to Nvidia", "content": "The Biden administration is tightening export controls for cutting-edge artificial intelligence chips, in an update to existing rules that will severely limit the ability of Nvidia and other manufacturers to sell high-performance semiconductors to China. The US commerce department on Tuesday extended the sweeping export controls that were first introduced in October 2022, in an effort to reflect technological advances and also to make it harder for companies to find ways to work around the restrictions. Commerce secretary Gina Raimondo said the goal of the update was to curb China’s access to advanced chips that “could fuel breakthroughs in artificial intelligence and sophisticated computers” that are critical for the Chinese military.\n\nContinue reading", "link": "https://finance.yahoo.com/m/05efa77b-9087-3127-ae02-602fa142c8d9/us-tightens-rules-on-ai-chip.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.832, "neg": 0.042, "neu": 0.845, "pos": 0.112}}, {"date": "2023-10-17T13:33:00+00:00", "title": "Stock Split Watch: Is Nvidia Next?", "content": "Stock splits always create a buzz among investors, even though the split itself doesn't affect the company's value. Last year was a banner year for stock splits, with Amazon, Alphabet, and Tesla all executing splits. This year has been quiet so far, but Nvidia (NASDAQ: NVDA) could soon shake that up because the company has a history of splits, and the stock price has risen nearly 300% over the past year.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a25547e6-1d95-3d66-a5cc-6295e8753965/stock-split-watch%3A-is-nvidia.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.141, "neg": 0.028, "neu": 0.908, "pos": 0.063}}, {"date": "2023-10-17T13:30:06+00:00", "title": "Is It Worth Investing in Nvidia (NVDA) Based on Wall Street's Bullish Views?", "content": "Investors often turn to recommendations made by Wall Street analysts before making a Buy, Sell, or Hold decision about a stock. While media reports about rating changes by these brokerage-firm employed (or sell-side) analysts often affect a stock's price, do they really matter?\n\nLet's take a look at what these Wall Street heavyweights have to say about Nvidia (NVDA) before we discuss the reliability of brokerage recommendations and how to use them to your advantage.\n\nNvidia currently has an average brokerage recommendation (ABR) of 1.13, on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell, etc.) made by 36 brokerage firms. An ABR of 1.13 approximates between Strong Buy and Buy.\n\nOf the 36 recommendations that derive the current ABR, 32 are Strong Buy and three are Buy. Strong Buy and Buy respectively account for 88.9% and 8.3% of all recommendations.\n\nBrokerage Recommendation Trends for NVDA Broker Rating Breakdown Chart for NVDA\n\nCheck price target & stock forecast for Nvidia here>>>\r\n\r\nWhile the ABR calls for buying Nvidia, it may not be wise to make an investment decision solely based on this information. Several studies have shown limited to no success of brokerage recommendations in guiding investors to pick stocks with the best price increase potential.\n\nAre you wondering why? The vested interest of brokerage firms in a stock they cover often results in a strong positive bias of their analysts in rating it. Our research shows that for every \"Strong Sell\" recommendation, brokerage firms assign five \"Strong Buy\" recommendations.\n\nThis means that the interests of these institutions are not always aligned with those of retail investors, giving little insight into the direction of a stock's future price movement. It would therefore be best to use this information to validate your own analysis or a tool that has proven to be highly effective at predicting stock price movements.\n\nStory continues\n\nZacks Rank, our proprietary stock rating tool with an impressive externally audited track record, categorizes stocks into five groups, ranging from Zacks Rank #1 (Strong Buy) to Zacks Rank #5 (Strong Sell), and is an effective indicator of a stock's price performance in the near future. Therefore, using the ABR to validate the Zacks Rank could be an efficient way of making a profitable investment decision.\n\nABR Should Not Be Confused With Zacks Rank\n\nIn spite of the fact that Zacks Rank and ABR both appear on a scale from 1 to 5, they are two completely different measures.\n\nThe ABR is calculated solely based on brokerage recommendations and is typically displayed with decimals (example: 1.28). In contrast, the Zacks Rank is a quantitative model allowing investors to harness the power of earnings estimate revisions. It is displayed in whole numbers -- 1 to 5.\n\nIt has been and continues to be the case that analysts employed by brokerage firms are overly optimistic with their recommendations. Because of their employers' vested interests, these analysts issue more favorable ratings than their research would support, misguiding investors far more often than helping them.\n\nIn contrast, the Zacks Rank is driven by earnings estimate revisions. And near-term stock price movements are strongly correlated with trends in earnings estimate revisions, according to empirical research.\n\nIn addition, the different Zacks Rank grades are applied proportionately to all stocks for which brokerage analysts provide current-year earnings estimates. In other words, this tool always maintains a balance among its five ranks.\n\nAnother key difference between the ABR and Zacks Rank is freshness. The ABR is not necessarily up-to-date when you look at it. But, since brokerage analysts keep revising their earnings estimates to account for a company's changing business trends, and their actions get reflected in the Zacks Rank quickly enough, it is always timely in indicating future price movements.\n\nIs NVDA Worth Investing In?\n\nIn terms of earnings estimate revisions for Nvidia, the Zacks Consensus Estimate for the current year has increased 0.8% over the past month to $10.74.\n\nAnalysts' growing optimism over the company's earnings prospects, as indicated by strong agreement among them in revising EPS estimates higher, could be a legitimate reason for the stock to soar in the near term.\n\nThe size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #1 (Strong Buy) for Nvidia. You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\n\nTherefore, the Buy-equivalent ABR for Nvidia may serve as a useful guide for investors.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/worth-investing-nvidia-nvda-based-133006603.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.012, "neu": 0.843, "pos": 0.145}}, {"date": "2023-10-17T13:30:04+00:00", "title": "New to Investing? This 1 Computer and Technology Stock Could Be the Perfect Starting Point", "content": "Kickstarting your investment journey can be both exciting and scary at the same time, and if you're new to investing, you may not know where to even begin. However, one thing is for certain -- stocks set to beat the market over the next 12 months serve as the perfect foundation for any kind of investor.\n\nLet's now take a look at one standout stock that could be a perfect fit for your portfolio.\n\nWhy You Should Pay Attention to Nvidia (NVDA)\n\nNVIDIA Corporation is the worldwide leader in visual computing technologies and the inventor of the graphic processing unit, or GPU. Over the years, the company’s focus has evolved from PC graphics to artificial intelligence (AI) based solutions that now support high performance computing (HPC), gaming and virtual reality (VR) platforms.\n\nSince being added to the Zacks Focus List on May 20, 2019 at $39.13 per share, shares of NVDA have increased 1078% to $460.95.\n\nFor fiscal 2024, 15 analysts revised their earnings estimate upwards in the last 60 days, and the Zacks Consensus Estimate has increased $2.91 to $10.74. NVDA boasts an average earnings surprise of 9.8%.\n\nEarnings for Nvidia are forecasted to see growth of 221.6% for the current fiscal year as well.\n\nSince stock prices respond to earnings estimate revisions, it can be very profitable to buy stocks with an increased earnings outlook. By buying a Focus List stock like NVDA, then, you're likely getting into a company whose future earnings estimates will be raised, potentially leading to price momentum.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/investing-1-computer-technology-stock-133004286.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.014, "neu": 0.82, "pos": 0.166}}, {"date": "2023-10-17T12:59:43+00:00", "title": "UPDATE 4-Biden to cut China off from more Nvidia chips, expand curbs to more countries", "content": "(Adds DUV restriction, SIA statement)\n\nBy Alexandra Alper, Karen Freifeld and Stephen Nellis\n\nWASHINGTON, Oct 17 (Reuters) - The Biden administration said on Tuesday it plans to halt shipments to China of more advanced artificial intelligence chips designed by Nvidia and others, part of a suite of measures aimed at stopping Beijing from getting cutting-edge U.S. technologies to strengthen its military.\n\nThe rules, described by senior administration officials in a press briefing on Monday evening, restrict a broader swathe of advanced chips and chipmaking tools to a greater number of countries including Iran and Russia, and blacklist Chinese chip designers Moore Thread and Biren.\n\nThe new measures aim to hamper China's military development by closing loopholes in regulations released last October and will probably be updated \"at least annually,\" according to Commerce Department Secretary Gina Raimondo.\n\nThe goal is to limit China's access to \"advanced semiconductors that could fuel breakthroughs in artificial intelligence and sophisticated computers that are critical to (Chinese) military applications,\" she said, stressing the administration was not seeking to hurt Beijing economically.\n\nThe United States and China are locked in a years-long technology war, but the sweeping curbs released last October further escalated tensions between the superpowers.\n\nCHINA-ONLY CHIPS HIT\n\nIn a statement following publication of the rules, Top AI chip designer Nvidia said it complies with regulations and does not expect \"a near-term meaningful impact on our financial results.\"\n\nThe company, whose shares fell 7%, has made chips such as the A800 and H800 that walked right up the line of the previous rules to continue selling to China, and AMD, also impacted by the rules, has said it plans a similar strategy.\n\nNvidia's business has soared since the imposition of last year's rules because its China-only chips are still better than alternatives. The Silicon Valley firm is currently selling almost every chip it can procure as worldwide demand outstrips supply, but would be hurt in the long term as Chinese chip firms seek to fill any voids left by U.S. companies.\n\nStory continues\n\nNvidia's A800 and H800 chips will be hit by the new regulations, due to a change in chip parameters aimed at capturing a greater number of chips.\n\nBut the rules will exempt most consumer chips used in laptops, smartphones and gaming, though some will be subject to licensing and notification requirements by U.S. officials.\n\n\"The fact is, China, even after the update of this rule, will import hundreds of billions of dollars of semiconductors from the United States,\" Raimondo said, emphasizing that the goal of the measures was not to hammer U.S. companies.\n\nThe previous rules imposed a two-pronged test that measured both a chip’s computing performance and its ability to communicate with other chips, an important measure in AI supercomputers where thousands of chips are strung together to chew through huge amounts of data.\n\nNvidia and Intel created special chips for the Chinese market that retained the powerful computing capabilities but limited communications speeds to stay inside the previous rules.\n\nBiren and Moore Thread, whose U.S. suppliers will now face a tough licensing requirement before shipping products to them, are both Chinese startups founded by former Nvidia employees in China and aim to compete with the U.S. AI chip giant.\n\nThe rules released on Tuesday eliminate the communication speed limits and focus on computing performance, which will have the effect of halting sales of Nvidia's A800 and H800 chips for the China market, according to a senior administration official.\n\nU.S. officials on Tuesday added a new measure to restrict chips that exceed a certain level of \"performance density,\" a measure focused on how much computing power can be packed into a given amount of silicon, a senior administration official said.\n\nThe senior administration official said this rule was meant to prevent companies from trying to work around restrictions on full chips by using a technology called \"chiplets,\" where firms could try to join together small pieces called chiplets into a large chip that violates the rules.\n\nReuters reported in July that chiplets have become a core part of China’s technology strategy to advance its chip industry, and analysts have said that Chinese companies could use the technology to evade U.S. restrictions.\n\nLICENSING EXPANDED\n\nThe new measures also expand licensing requirements for exports of advanced chips to more than 40 additional countries that present risks of diversion to China and are subject to U.S. arms embargoes, the officials said.\n\nThat measure appears to build on a letter received by Nvidia in August that it described as restricting shipments of its A100 and H100 chips beyond China to other regions including some countries in the Middle East.\n\nConfirming a Reuters report, chips will be barred from being sent to units of firms located anywhere in the world if their parent companies are headquartered in China, Macau and other arms embargoed countries. The move is part of a bid to keep the chips from being illegally smuggled into China or remotely accessed by Chinese parent companies.\n\nThe Biden administration also hit 21 countries outside China with a licensing requirement for chipmaking tools. It also broadened the list of equipment restricted from going to that country to include some deep ultraviolet (DUV) lithography systems.\n\nDUV is less advanced chipmaking equipment than state-of-the art extreme ultraviolent equipment (EUV), which has not yet been shipped to China, but can make chips nearly as advanced at greater cost.\n\nOfficials took pains to stress that Chinese officials were warned the rules were coming by National Security Advisor Jake Sullivan, Treasury Secretary Janet Yellen and Commerce Secretary Gina Raimondo, confirming a prior Reuters report.\n\nThe Semiconductor Industry Association said in a statement it was \"evaluating the impact\" of the new rules and urged the administration to work with allies. \"Overly broad, unilateral controls risk harming the U.S. semiconductor ecosystem without advancing national security,\" the group said. (Reporting by Alexandra Alper, Karen Freifeld, Stephen Nellis, David Shepardson and Max A. Cherney; Editing by Chris Sanders and Jamie Freed)", "link": "https://finance.yahoo.com/news/1-biden-cut-china-off-125943932.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.936, "neg": 0.06, "neu": 0.856, "pos": 0.083}}, {"date": "2023-10-17T12:55:00+00:00", "title": "U.S. Tightens Curbs on AI Chip Exports to China, Widening Rift With U.S. Businesses", "content": "The new rules, which significantly constrict sales of advanced semiconductors to the Chinese market, came despite intense lobbying by chip companies.\n\nContinue reading", "link": "https://finance.yahoo.com/m/8b1cf4ab-a7e0-3b47-b90e-d092bfe905b5/u.s.-tightens-curbs-on-ai.html", "symbols": ["INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.25, "neg": 0.045, "neu": 0.827, "pos": 0.128}}, {"date": "2023-10-17T12:50:44+00:00", "title": "NVIDIA: does not expect near-term impact from new U.S. curbs on AI exports to China", "content": "WASHINGTON, Oct 17 (Reuters) - Nvidia, the world's most valuable chipmaker, said on Tuesday it does not expect a near-term meaningful impact on financial results from new U.s. curbs on AI exports to China.\n\n\"We comply with all applicable regulations while working to provide products that support thousands of applications across many different industries,\" the company said in a statement.\"\n\n\"Given the demand worldwide for our products, we don’t expect a near-term meaningful impact on our financial results.\" (Reporting by Karen Freifeld; Writing by Doina Chiacu;)", "link": "https://finance.yahoo.com/news/nvidia-does-not-expect-near-125044666.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.757, "neg": 0.033, "neu": 0.873, "pos": 0.095}}, {"date": "2023-10-17T12:47:38+00:00", "title": "Biden to cut China off from more Nvidia chips, expand curbs to more countries", "content": "By Alexandra Alper, Karen Freifeld and Stephen Nellis\n\nWASHINGTON (Reuters) -The Biden administration said on Tuesday it plans to halt shipments to China of more advanced artificial intelligence chips designed by Nvidia and others, part of a suite of measures aimed at stopping Beijing from getting cutting-edge U.S. technologies to strengthen its military.\n\nThe rules, described by senior administration officials in a press briefing on Monday evening, restrict a broader swathe of advanced chips and chipmaking tools to a greater number of countries including Iran and Russia, and blacklist Chinese chip designers Moore Thread and Biren.\n\nThe new measures aim to hamper China's military development by closing loopholes in regulations released last October and will probably be updated \"at least annually,\" according to Commerce Department Secretary Gina Raimondo.\n\nThe goal is to limit China's access to \"advanced semiconductors that could fuel breakthroughs in artificial intelligence and sophisticated computers that are critical to (Chinese) military applications,\" she said, stressing the administration was not seeking to hurt Beijing economically.\n\nThe United States and China are locked in a years-long technology war, but the sweeping curbs released last October further escalated tensions between the superpowers.\n\nCHINA-ONLY CHIPS HIT\n\nIn a statement following publication of the rules, Top AI chip designer Nvidia said it complies with regulations and does not expect \"a near-term meaningful impact on our financial results.\"\n\nThe company has made chips such as the A800 and H800 that walked right up the line of the previous rules to continue selling to China, and AMD, also impacted by the rules, has said it plans a similar strategy.\n\nNvidia's business has soared since the imposition of last year's rules because its China-only chips are still better than alternatives. The Silicon Valley firm is currently selling almost every chip it can procure as worldwide demand outstrips supply, but would be hurt in the long term as Chinese chip firms seek to fill any voids left by U.S. companies.\n\nStory continues\n\nNvidia's A800 and H800 chips will be hit by the new regulations, due to a change in chip parameters aimed at capturing a greater number of chips.\n\nBut the rules will exempt most consumer chips used in laptops, smartphones and gaming, though some will be subject to licensing and notification requirements by U.S. officials.\n\n\"The fact is, China, even after the update of this rule, will import hundreds of billions of dollars of semiconductors from the United States,\" Raimondo said, emphasizing that the goal of the measures was not to hammer U.S. companies.\n\nThe previous rules imposed a two-pronged test that measured both a chip’s computing performance and its ability to communicate with other chips, an important measure in AI supercomputers where thousands of chips are strung together to chew through huge amounts of data.\n\nNvidia and Intel created special chips for the Chinese market that retained the powerful computing capabilities but limited communications speeds to stay inside the previous rules.\n\nBiren and Moore Thread, whose U.S. suppliers will now face a tough licensing requirement before shipping products to them, are both Chinese startups founded by former Nvidia employees in China and aim to compete with the U.S. AI chip giant.\n\nThe rules released on Tuesday eliminate the communication speed limits and focus on computing performance, which will have the effect of halting sales of Nvidia's A800 and H800 chips for the China market, according to a senior administration official.\n\nU.S. officials on Tuesday added a new measure to restrict chips that exceed a certain level of \"performance density,\" a measure focused on how much computing power can be packed into a given amount of silicon, a senior administration official said.\n\nThe senior administration official said this rule was meant to prevent companies from trying to work around restrictions on full chips by using a technology called \"chiplets,\" where firms could try to join together small pieces called chiplets into a large chip that violates the rules.\n\nReuters reported in July that chiplets have become a core part of China’s technology strategy to advance its chip industry, and analysts have said that Chinese companies could use the technology to evade U.S. restrictions.\n\nLICENSING EXPANDED\n\nThe new measures also expand licensing requirements for exports of advanced chips to more than 40 additional countries that present risks of diversion to China and are subject to U.S. arms embargoes, the officials said.\n\nThat measure appears to build on a letter received by Nvidia in August that it described as restricting shipments of its A100 and H100 chips beyond China to other regions including some countries in the Middle East.\n\nConfirming a Reuters report, chips will be barred from being sent to units of firms located anywhere in the world if their parent companies are headquartered in China, Macau and other arms embargoed countries. The move is part of a bid to keep the chips from being illegally smuggled into China or remotely accessed by Chinese parent companies.\n\nThe Biden administration also hit 21 countries outside China with a licensing requirement for chipmaking tools and broadened the list of equipment barred from going to that country.\n\nOfficials took pains to stress that Chinese officials were warned the rules were coming by National Security Advisor Jake Sullivan, Treasury Secretary Janet Yellen and Commerce Secretary Gina Raimondo, confirming a prior Reuters report.\n\n(Reporting by Alexandra Alper, Karen Freifeld, Stephen Nellis, David Shepardson and Max A. Cherney; Editing by Chris Sanders and Jamie Freed)", "link": "https://finance.yahoo.com/news/biden-cut-china-off-more-124738198.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.953, "neg": 0.054, "neu": 0.864, "pos": 0.081}}, {"date": "2023-10-17T11:57:00+00:00", "title": "The Best Stocks to Invest $50,000 in Right Now", "content": "According to the Brookings Institute, the world's digital economy is worth $11.5 trillion, and has grown more than twice as fast as the broader economy over the past 15 years. The company makes money by selling ads to you when you're on these sites, as well as through some secondary businesses like cloud computing. Alphabet nearly monopolizes internet search, with an estimated 83% of the global market share.\n\nContinue reading", "link": "https://finance.yahoo.com/m/c1c14b0a-0c18-334c-8dee-5bc1d26388a7/the-best-stocks-to-invest.html", "symbols": ["45C.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "CRWD.US", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.681, "neg": 0.028, "neu": 0.858, "pos": 0.115}}, {"date": "2023-10-17T11:30:00+00:00", "title": "Is AMD's Artificial Intelligence (AI) Acquistion Enough to Catch Nvidia?", "content": "Nvidia (NASDAQ: NVDA) is dominating Advanced Micro Devices (NASDAQ: AMD) in their respective artificial intelligence (AI) offerings. Nvidia grew second-quarter revenue by 102% versus AMD's 18% decline. On Oct. 10, AMD announced its intention to acquire Nod.ai to better compete with Nvidia.\n\nContinue reading", "link": "https://finance.yahoo.com/m/80f6f8e3-c3d6-3100-bd5f-b5b77f031a14/is-amd%27s-artificial.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.823, "neg": 0.042, "neu": 0.75, "pos": 0.208}}, {"date": "2023-10-17T11:13:00+00:00", "title": "The Zacks Analyst Blog Highlights NVIDIA, Procter &amp; Gamble, NextEra Energy, Goldman Sachs and Prologis", "content": "For Immediate Release\n\nChicago, IL – October 17, 2023 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: NVIDIA Corp. NVDA, The Procter & Gamble Co. PG, NextEra Energy, Inc. NEE, The Goldman Sachs Group, Inc. GS and Prologis, Inc. PLD.\n\nHere are highlights from Monday’s Analyst Blog:\n\nTop Analyst Reports for NVIDIA, Procter & Gamble and NextEra Energy\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including NVIDIA Corp., The Procter & Gamble Co. and NextEra Energy, Inc. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today’s research reports here >>>\r\n\r\nNVIDIA shares have outperformed the Zacks Semiconductor - General industry over the past year (+285.4% vs. +152.9%), a huge outperformance relative the S&P 500 index's +18.1% gain. The Zacks analyst believes that strong growth from artificial intelligence (AI), high-performance computing and accelerated computing is boosting its Compute & Networking revenues. Large language models using GPUs based on NVIDIA Hopper and Ampere architectures, rising demand for generative AI and surge in Hyperscale demand also aid its growth.\r\n\r\nContinued momentum in the small and medium businesses and frontline worker offerings have driven the top-line growth. However, the company’s near-term prospects are likely to be hurt by weakening demand for chips used in the professional visualization end market.\r\n\r\n(You can read the full research report on NVIDIA here >>>)\r\n\r\nProcter & Gamble shares have outperformed the Zacks Consumer Staples – Soap and Cleaning Materials industry over the past year (+13.6% vs. +10.2%). The Zacks analyst believes that the company is benefiting from a growth in its organic sales, driven by robust pricing and a favorable mix, along with strength across segments. Focus on productivity and cost-saving plans to boost margins have also helped. Rapid adoption of cloud-based solutions, continued deal wins in international markets, and acquisition of Slack have positioned the company as a market leader.\r\n\r\nYet, supply-chain issues, higher SG&A costs, higher transportation costs, geopolitical challenges, currency headwinds and rising inflation have plagued the company. It’s large global presence has also meant that it has been affected by the global macroeconomic goings on.\r\n\r\n(You can read the full research report on Procter & Gamble here >>>)\r\n\r\nShares of NextEra Energy have underperformed the Zacks Utility – Electric Power industry over the past year (-26% vs. -8.2%). Per the Zacks analyst, the company’s nature of business has exposed it to complex regulations. Also, risks in operating nuclear units, unfavorable weather conditions and increasing supply costs adversely impact earnings.\r\n\r\nHowever, with numerous projects in its backlog and the merger between Gulf Power and FPL have strengthened NextEra’s position in the area. Also, the company has ample liquidity to pay off its debt obligations while growing exponentially through acquisitions.\r\n\r\n(You can read the full research report on NextEra Energy here >>>)\r\n\r\nOther noteworthy reports we are featuring today The Goldman Sachs Group, Inc. and Prologis, Inc.\n\nStory continues\n\nWhy Haven’t You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\n\nNextEra Energy, Inc. (NEE) : Free Stock Analysis Report\n\nPrologis, Inc. (PLD) : Free Stock Analysis Report\n\nProcter & Gamble Company (The) (PG) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-nvidia-111300264.html", "symbols": ["FP3.F", "GSPC.INDX", "NEE.US", "NEP.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PG.BA", "PG.MX", "PG.US", "PLD.US", "PLDGP.US", "PRG.F", "PRG.XETRA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.031, "neu": 0.834, "pos": 0.135}}, {"date": "2023-10-17T10:30:00+00:00", "title": "1 Artificial Intelligence (AI) Stock to Buy and Hold Forever", "content": "Chipmaker Nvidia (NASDAQ: NVDA) has become a Wall Street darling. It's soared by a whopping 215% year to date as it takes advantage of the opportunity in artificial intelligence (AI), which boosts demand for its cutting-edge hardware. Since its founding in 1993, Nvidia has been on the cutting edge of computer hardware because of its focus on graphics processing units (GPUs).\n\nContinue reading", "link": "https://finance.yahoo.com/m/ed1cbe90-6577-3b61-afce-cb467626fdcf/1-artificial-intelligence.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.9, "neg": 0.042, "neu": 0.761, "pos": 0.197}}, {"date": "2023-10-17T09:12:00+00:00", "title": "Missed Out on Nvidia? My Best Chip Stock to Buy and Hold.", "content": "The rally in artificial intelligence (AI) stocks greatly benefited Nvidia (NASDAQ: NVDA). The stock is up more than 200% since the beginning of the year and sells close to all-time highs. Unfortunately, investors have likely missed the rally in this semiconductor stock.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f8b0fd33-cbe1-36e0-ae74-1471c8777ad2/missed-out-on-nvidia%3F-my-best.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "NVDA.US"], "tags": [], "sentiment": {"polarity": -0.128, "neg": 0.094, "neu": 0.842, "pos": 0.064}}, {"date": "2023-10-17T00:00:00+00:00", "title": "Why Nvidia, AMD, Intel, and Other Semiconductor Stocks Are Down After New AI Regulation Announcement", "content": "Nvidia warned investors during its last earnings calls about future AI regulations.", "link": "https://www.fool.com/investing/2023/10/17/why-nvidia-amd-intel-and-other-semiconductor-stock/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": -0.273, "neg": 0.16, "neu": 0.84, "pos": 0}}, {"date": "2023-10-17T00:00:00+00:00", "title": "Why Nvidia, Intel, Broadcom, and Other Artificial Intelligence (AI) Semiconductor Stocks Crumbled Tuesday Morning", "content": "Regulators announced a limit that could hurt AI chip sales. If this seems like an eerie case of déjà vu, there's a reason for that.", "link": "https://www.fool.com/investing/2023/10/17/why-nvidia-intel-broadcom-and-other-artificial-int/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": -0.71, "neg": 0.219, "neu": 0.781, "pos": 0}}, {"date": "2023-10-17T00:00:00+00:00", "title": "The 7 Top Growth Stocks You Can&#039;t Ignore Today", "content": "Investors should dive into growth stocks now as they present great opportunities at lower valuations at the end of 2023. ", "link": "https://investorplace.com/2023/10/the-7-top-growth-stocks-you-cant-ignore-today/", "symbols": ["AMZN.US", "CRM.US", "GOOG.US", "GOOGL.US", "NFLX.US", "NVDA.US", "SQ.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.796, "neg": 0.08, "neu": 0.582, "pos": 0.338}}, {"date": "2023-10-17T00:00:00+00:00", "title": "2 Hot Stocks to Buy and Hold Until You Retire", "content": "A focus on a company's core strength and growth opportunities helps separate the average stock tip from a true wealth creator.", "link": "https://www.fool.com/investing/2023/10/17/2-hot-stocks-to-buy-and-hold-until-you-retire/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0.943, "neg": 0, "neu": 0.414, "pos": 0.586}}, {"date": "2023-10-17T00:00:00+00:00", "title": "1 Artificial Intelligence (AI) Stock to Buy and Hold Forever", "content": "Nvidia still stands head and shoulders above the competition.", "link": "https://www.fool.com/investing/2023/10/17/1-artificial-intelligence-ai-stock-to-buy-and-hold/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-17T00:00:00+00:00", "title": "Is NVDA Stock a Good Buy Now? Here&#039;s My Take", "content": "After its parabolic rise, NVDA stock has traded sideways. As financial results catch up to growth expectations, where is it headed?", "link": "https://investorplace.com/2023/10/is-nvda-stock-a-good-buy-now-heres-my-take/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0, "neu": 0.885, "pos": 0.115}}, {"date": "2023-10-17T00:00:00+00:00", "title": "Stock Split Watch: Is Nvidia Next?", "content": "An announcement could happen at any time.", "link": "https://www.fool.com/investing/2023/10/17/stock-split-watch-is-nvidia-next/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-17T00:00:00+00:00", "title": "Nvidia (NVDA) Stock Dips on U.S.-China Chip Restrictions", "content": "With the Commerce Department impeding Nvidia’s directive to sell chips to China, NVDA stock absorbed a sizable hit.", "link": "https://investorplace.com/2023/10/nvidia-nvda-stock-dips-on-u-s-china-chip-restrictions/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-16T22:25:00+00:00", "title": "Highly Ranked Semiconductor Stocks to Keep an Eye on in October", "content": "Earnings season is upon us again and one area of the broader technology sector that investors will be watching is the results from semiconductor companies.\n\nWhile many semiconductor companies won’t report their quarterly results until November there will certainly be growing sentiment and observation after a number of stellar reports last quarter with Nvidia NVDA leading the way.\n\nWith Nvidia‘s stock sporting a Zacks Rank #1 (Strong Buy) since late May and now up more than +200% this year, we point to a few semiconductor stocks that were recently added to the strong buy list in October and look poised for more upside over the next month as well. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nApplied Materials AMAT: Added to the strong buy list in early October, Applied Materials stock will be one to watch as the company is well-positioned to keep its reign as a global leader in supplying equipment for the fabrication of semiconductors.\n\nApplied Materials will be releasing its fiscal fourth quarter results in mid-November and AMAT shares could very well rise leading up to the report. To that point, Applied Materials has surpassed top and bottom-line expectations in its last five quarterly reports, and over the last 60 days fiscal 2023 and FY24 earnings estimates have soared 7% and 13% respectively.  Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nContinuing to focus its strategy and investments on key technologies to accelerate the Internet of Things and AI era, AMAT shares have soared +45% this year and are up over +100% in the last three years to largely outperform the broader indexes. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nQorvo QRVO: With its fiscal second quarter earnings a few weeks away on Wednesday, November 1, Qorvo’s stock got the nod as a Zacks Rank #1 (Strong Buy) this week.\n\nQorvo is a multinational semiconductor company that has become one of the leading providers of core technologies and radio frequency (RF) solutions for mobile, infrastructure, and aerospace applications. Leading up to its Q2 report, Qorvo has now surpassed earnings expectations for a remarkable 27 consecutive quarters and surpassed the Zacks Consensus for sales estimates in 30 straight quarterly reports.\n\nStory continues Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nPlus, the Zacks Earnings ESP (Expected Surprise Prediction) indicates the steak of earnings beats could continue with the Most Accurate Estimate having Q2 EPS at $1.85 per share and 4% above the Zacks Consensus of $1.77 a share. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nUp a modest +2% year to date, Qorvo’s stock may be overlooked at the moment and trades at a reasonable 17.9X forward earnings multiple. Notably, Qorvo’s current fiscal 2024 and FY25 EPS estimates are nicely up over the last 30 days offering further support. Furthermore, annual earnings are now forecasted to dip -12% in FY24 after a tougher-to-compete-against year but rebound and soar 40% in FY25 at $7.29 per share. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nBottom Line\n\nThe trend of rising earnings estimates is compelling for Applied Materials and Qorvo stock and now may be a great time to buy. This also makes their steaks of stellar quarterly results look more likely to continue and it would be no surprise if Applied Materials and Qorvo stock start to rise in October.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nApplied Materials, Inc. (AMAT) : Free Stock Analysis Report\n\nQorvo, Inc. (QRVO) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/highly-ranked-semiconductor-stocks-keep-222500312.html", "symbols": ["2QO.F", "AMAT.MX", "AMAT.US", "AP2.F", "AP2.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "QRVO.US"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.006, "neu": 0.889, "pos": 0.105}}, {"date": "2023-10-16T21:45:18+00:00", "title": "Nvidia (NVDA) Exceeds Market Returns: Some Facts to Consider", "content": "In the latest market close, Nvidia (NVDA) reached $460.95, with a +1.39% movement compared to the previous day. This move outpaced the S&P 500's daily gain of 1.06%. Meanwhile, the Dow gained 0.93%, and the Nasdaq, a tech-heavy index, added 1.2%.\n\nPrior to today's trading, shares of the maker of graphics chips for gaming and artificial intelligence had gained 3.56% over the past month. This has outpaced the Computer and Technology sector's loss of 2.02% and the S&P 500's loss of 3% in that time.\n\nThe investment community will be closely monitoring the performance of Nvidia in its forthcoming earnings report. The company is forecasted to report an EPS of $3.34, showcasing a 475.86% upward movement from the corresponding quarter of the prior year. Meanwhile, the Zacks Consensus Estimate for revenue is projecting net sales of $16.12 billion, up 171.72% from the year-ago period.\n\nFor the annual period, the Zacks Consensus Estimates anticipate earnings of $10.74 per share and a revenue of $54.4 billion, signifying shifts of +221.56% and +101.69%, respectively, from the last year.\n\nInvestors should also pay attention to any latest changes in analyst estimates for Nvidia. Recent revisions tend to reflect the latest near-term business trends. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\n\nOur research shows that these estimate changes are directly correlated with near-term stock prices. To take advantage of this, we've established the Zacks Rank, an exclusive model that considers these estimated changes and delivers an operational rating system.\n\nThe Zacks Rank system, spanning from #1 (Strong Buy) to #5 (Strong Sell), boasts an impressive track record of outperformance, audited externally, with #1 ranked stocks yielding an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 0.82% higher. Currently, Nvidia is carrying a Zacks Rank of #1 (Strong Buy).\n\nStory continues\n\nIn terms of valuation, Nvidia is currently trading at a Forward P/E ratio of 42.34. This denotes a premium relative to the industry's average Forward P/E of 18.86.\n\nAlso, we should mention that NVDA has a PEG ratio of 3.14. The PEG ratio is similar to the widely-used P/E ratio, but this metric also takes the company's expected earnings growth rate into account. The Semiconductor - General was holding an average PEG ratio of 2.69 at yesterday's closing price.\n\nThe Semiconductor - General industry is part of the Computer and Technology sector. This group has a Zacks Industry Rank of 85, putting it in the top 34% of all 250+ industries.\n\nThe Zacks Industry Rank assesses the vigor of our specific industry groups by computing the average Zacks Rank of the individual stocks incorporated in the groups. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nDon't forget to use Zacks.com to keep track of all these stock-moving metrics, and others, in the upcoming trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/nvidia-nvda-exceeds-market-returns-214518621.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.988, "neg": 0.008, "neu": 0.903, "pos": 0.089}}, {"date": "2023-10-16T21:22:48+00:00", "title": "These Aren’t Your Grandfather’s Transportation Stocks. 3 Top Picks for the Future of Travel.", "content": "Transportation sure has come a long way since our grandfathers were on the roads. Now, instead of those traditional, gas-powered cars, we’re nearing the potential for flying cars, autonomous vehicles and even further adoption of millions of battery-powered cars. Better, the opportunities in transportation stocks could be worth billions, even trillions in some cases.\n\nIn fact, the global EV market could be worth nearly $1 trillion by 2030, according to Markets and Markets. Allied Market Research estimated the flying cars market could be worth $3.8 billion by 2035 and reach about $2.1 trillion by 2030.\n\nWith that in mind, investors may want to consider buying these three transportation stocks.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nTransportation Stocks: Joby Aviation (JOBY)\n\nSource: Iljanaresvara Studio / Shutterstock.com\n\nJoby Aviation (NYSE:JOBY) could soon take flight. For one, it recently received clearance to start its test flights from the Federal Aviation Administration (FAA). And two, it’s on track to begin commercial urban air mobility operations by 2025.\n\nAccording to CEO JoeBen Bevirt, Joby’s initial role will be similar to Uber Technologies (NYSE:UBER), meaning its mission will be to get passengers from point A to point B. “In terms of costs, he noted service fees will start at a little north of $5 a mile down and should move below $5 a mile over the launch period,” as highlighted by Seeking Alpha.\n\nAlso, while analysts say JOBY may only produce revenues of $84 million in 2025, we know it is capable of much bigger sales. In fact, we can see that with the $131 million contract with the U.S. Air Force. We also have to remember that JOBY partnered with Delta Air Lines (NYSE:DAL) to help with home-to-airport transportation.\n\nLuminar Technologies (LAZR)\n\nSource: JHVEPhoto/shutterstock.com\n\nOr, take a look at Luminar Technologies (NASDAQ:LAZR) — which could help with full automation with its vision-based lidar and machine perception technologies. Better, if all goes according to plan, the company will tap into a total addressable market of about $150 billion by 2030.\n\nStory continues\n\nAs noted by the company’s site, “Advanced Driving Assistance Systems (“ADAS:) and autonomous driving are the two segments integrating into all vehicles in the future. Whether the driver has control or the ADAS is in charge, these markets will integrate into passenger vehicles, commercial trucking, robo-taxi and other autonomous needs.”\n\nEven better, the company does expect to increase sales by “at least 100%” year over year, added Barron’s. It also expects to post a positive adjusted gross profit margin by Q4. Down the road, LAZR believes it can produce about $5 billion in annual sales.\n\nSmartETFs Smart Transportation & Technology ETF (MOTO)\n\nSource: Smile Fight / Shuttterstock.com\n\nOr, if you want to diversify at a low cost, consider an ETF like the SmartETFs Smart Transportation & Technology ETF (NYSEARCA:MOTO). With an expense ratio of 0.68%, the ETF includes companies involved with “electric vehicles, autonomous vehicles, transportation as a service, flying autonomous vehicles, autonomous or electric public transportation, and hyperloop-based transportation, for passengers or goods,” according to SmartETFs’ website.\n\nSome of its top holdings include Nvidia (NASDAQ:NVDA), Tesla (NASDAQ:TSLA), ON Semiconductor (NASDAQ:ON), BYD (OTCMKTS:BYDDF) and Aptiv (NYSE:APTV) to name a few of its 35 holdings. After testing $45 a share, the MOTO ETF is now a bit oversold at $39.26. From here, I’d like to see it retest $45 again soon.\n\nOn the date of publication, Ian Cooper did not hold (directly or indirectly) any positions in the securities mentioned. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nIan Cooper, a contributor to InvestorPlace.com, has been analyzing stocks and options for web-based advisories since 1999.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post These Aren’t Your Grandfather’s Transportation Stocks. 3 Top Picks for the Future of Travel. appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/aren-t-grandfather-transportation-stocks-212248274.html", "symbols": ["APTV.US", "DAL.US", "JOBY.US", "LAZR.US", "NVDA.US", "ON.US", "TSLA.US", "UBER.US"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.011, "neu": 0.896, "pos": 0.092}}, {"date": "2023-10-16T21:11:54+00:00", "title": "Dow Jones Rallies 300 Points As Market Rally Snaps Back; Netflix, Nvidia, Tesla In Focus", "content": "Dow Jones futures were little changed after the Dow Jones industrials rallied than 300 points Monday. Netflix, Nvidia and Tesla are in focus.\n\nContinue reading", "link": "https://finance.yahoo.com/m/76113ca2-1841-3e2e-913e-8117dffae49c/dow-jones-rallies-300-points.html", "symbols": ["DJI.INDX", "FB2A.F", "FB2A.XETRA", "GSPC.INDX", "IXIC.INDX", "NFC.F", "NFC.XETRA", "NFLX.MX", "NFLX.US", "NFLX34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-16T20:28:47+00:00", "title": "Dow Jones Rallies As Yellen Makes Pledge; Cathie Wood Sells These Stocks As Tech Earnings Loom", "content": "The Dow Jones rallied as Janet Yellen made an Israel-Ukraine pledge. Famed investor Cathie Wood sold some key tech stocks. Microsoft gained.\n\nContinue reading", "link": "https://finance.yahoo.com/m/b4a30614-2375-3121-bc4d-f5318c42415f/dow-jones-rallies-as-yellen.html", "symbols": ["33L.F", "DJI.INDX", "GSPC.INDX", "LULU.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0, "neu": 0.898, "pos": 0.102}}, {"date": "2023-10-16T20:01:24+00:00", "title": "Why Nvidia is a 'special case' despite a wavering market: CEO", "content": "With economic headwinds such as escalating geopolitical conflicts, high inflation, and unrest in Washington, many investors are unsure where to place their investments. With third-quarter earnings reports underway, many are eyeing the tech sector which has seen a jump in earnings. Shana Orczyk Sissel, Banrion Capital Management CEO, joins Yahoo Finance to explain why Nvidia (NVDA) stands out to her and why investors should consider this stock going forward.\n\nSissel explains: \"There's not a lot of competition for what they provide, they have a very strong balance sheet, substantial cash, reserves much higher than their debt, and quite frankly, this AI tailwind is not going to stop just because the economy slows down... Nvidia will continue to benefit as they are the largest provider of chips in that space...\" Sissel adds that \"if it did, for any reason, start to turn down, I'd be a buyer of the stock.\"\n\nClick here to watch the full interview on the Yahoo Finance YouTube page or you can watch this full episode of Yahoo Finance Live here.\n\nVideo Transcript\n\n- Given all these very powerful cross currents you're mentioning here, so Fed, geopolitical risk, we have earnings on deck. What's your general view of the equity markets, Shana right now?\n\nSHANA ORCZYK SISSEL: I think they're holding up quite well. The economy is showing to be continued, to ne hotter than expected. Labor markets remain inflation remains sticky high. And as long as that continues, that's going to be a headwind to equities. Because we're always going to have the Fed as a concern.\n\nNow, there have been many Fed members, and governors who have indicated that the Fed is done raising rates. And they really want to see how this kind of plays out. Which, I think, is smart. But we don't want to get into a 1970s scenario where there's a lot of stop and go.\n\nThe question really remains, is the Fed-- when they say 2%-- do they mean, 2% or do they mean sub 3? Because the long-term average over the last 40 years for inflation is about 2.8%. So I think the realistic target should, be if they can get inflation under 3%, that would be a win. And that is what I would consider as the best scenario for a soft landing.\n\nStory continues\n\nThey're not really communicating well, if that's what they're looking for, and I think that's really a risk. Because inflation does appear to be sticky high, and there's really nothing in the growth numbers that are indicating that growth is slowing down, which is what we would really need to get supply and demand back into equilibrium. Until that happens, I'm concerned that there is downside in this market.\n\n- So let's get to some of your other investment ideas, right. You mentioned some of the liquid alts and the ETFs that you're playing them through. I was struck by your choice of NVIDIA also in your stock picks because if we're looking at a market that is on a little bit of delicate footing right now. And as we know, NVIDIA has been almost a rocket ship on this AI thesis. Doesn't it get hit along with other growth stocks, if things start to go south a little bit?\n\n- That's certainly a risk. And I'm not saying I'm a huge fan of technology here, NVIDIA is kind of a special case, in my opinion, I follow this stock my entire career, so 20 plus years. And I just think that there's not a lot of competition for what they provide.\n\nThey have very strong balance sheet. They have substantial cash, reserves are much higher than their debt. And quite frankly, this AI tailwind is not going to stop just because the economy slows down. It might be somewhat slower, but NVIDIA will continue to benefit as they are the largest provider of chips in that space. They lead that space. They really don't have any competition there.\n\nAnd so M that reason, I think Nvidia can actually hold up quite well. If it did for any reason, start to turn down, I would be a buyer of the stock. I'd continue to hold the stock. And I think that it is a stock that actually will of the technology names ride through this period quite well.\n\nThe AI trend is not going away. And Nvidia is the largest benefactory of that particular trend. So for me, it's still a stock that I hold. It's a stock I would buy more of on weakness. I just think the long-term trend is very favorable for there, them in particular. And that is not saying that I'm a huge fan of technology as a sector, but that stock in particular, I think, has a lot of tailwinds. And will continue to do well regardless of economic conditions.", "link": "https://finance.yahoo.com/video/why-nvidia-special-case-despite-200124760.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.982, "neg": 0.035, "neu": 0.895, "pos": 0.07}}, {"date": "2023-10-16T19:20:00+00:00", "title": "Cathie Wood says one prominent tech stock is a stronger long-term bet than Nvidia", "content": "Ark Invest CEO Cathie Wood said she does not regret dumping the bulk of her firm's investment in chipmaker Nvidia.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e6dccdab-82cc-368e-a8dd-12aa9b81961b/cathie-wood-says-one.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.228, "neg": 0, "neu": 0.873, "pos": 0.127}}, {"date": "2023-10-16T19:15:00+00:00", "title": "Top Analyst Reports for NVIDIA, Procter &amp; Gamble &amp; NextEra Energy", "content": "Wednesday, October 16, 2023\r\n\r\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including NVIDIA Corporation (NVDA), The Procter & Gamble Company (PG) and NextEra Energy, Inc. (NEE). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today’s research reports here >>>\r\n\r\nNVIDIA shares have outperformed the Zacks Semiconductor - General industry over the past year (+285.4% vs. +152.9%), a huge outperformance relative the S&P 500 index's +18.1% gain. The Zacks analyst believes that strong growth from artificial intelligence (AI), high-performance computing and accelerated computing is boosting its Compute & Networking revenues. Large language models using GPUs based on NVIDIA Hopper and Ampere architectures, rising demand for generative AI and surge in Hyperscale demand also aid its growth.\r\n\r\nContinued momentum in the small and medium businesses and frontline worker offerings have driven the top-line growth.\r\nHowever, the company’s near-term prospects are likely to be hurt by weakening demand for chips used in the professional visualization end market.\r\n\r\n(You can read the full research report on NVIDIA here >>>)\r\n\r\nProcter & Gamble shares have outperformed the Zacks Consumer Staples – Soap and Cleaning Materials industry over the past year (+13.6% vs. +10.2%). The Zacks analyst believes that the company is benefitting from a growth in its organic sales, driven by robust pricing and a favorable mix, along with strength across segments. Focus on productivity and cost-saving plans to boost margins have also helped.\r\nRapid adoption of cloud-based solutions, continued deal wins in international markets, and acquisition of Slack have positioned the company as a market leader.\r\n\r\nYet, supply-chain issues, higher SG&A costs, higher transportation costs, geopolitical challenges, currency headwinds and rising inflation have plagued the company. It’s large global presence has also meant that it has been affected by the global macroeconomic goings on.\r\n\r\n(You can read the full research report on Procter & Gamble here >>>)\r\n\r\nShares of NextEra Energy have underperformed the Zacks Utility – Electric Power industry over the past year (-26% vs. -8.2%). Per the Zacks analyst, the company’s nature of business has exposed it to complex regulations. Also, risks in operating nuclear units, unfavorable weather conditions and increasing supply costs adversely impact earnings.\r\n\r\nHowever, with numerous projects in its backlog and the merger between Gulf Power and FPL have strengthened NextEra’s position in the area. Also, the company has ample liquidity to pay off its debt obligations while growing exponentially through acquisitions.\r\n\r\n(You can read the full research report on NextEra Energy here >>>)\r\n\r\nOther noteworthy reports we are featuring today BP p.l.c. (BP), The Goldman Sachs Group, Inc. (GS) and Prologis, Inc. (PLD).\r\n\r\nDirector of Research\r\n\r\nSheraz Mian\r\n\r\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\n\nStory continues\n\nToday's Must Read\n\nNVIDIA (NVDA) Rides on Strong Adoption of GPUs, Partnerships\n\nP&G's (PG) Productivity & Cost Savings Plan to Aid Margins\n\nNextEra (NEE) Gains from Steady Investment, Renewable Focus\n\nFeatured Reports\n\nKeysight (KEYS) Rides on Strength in Key End Markets, Innovation\r\nPer the Zacks analyst, the development of advanced satellite communication testing system will likely boost Keysight's prospects. Healthy traction in automotive, aerospace and defense are tailwinds.\n\nSolid U.S Demand, Backlog Levels Aid Commercial Metals (CMC)\r\nPer the Zacks analyst, robust end-market demand and order backlogs in North America are aiding Commercial Metals' results. Higher average selling price is also aiding margins.\n\nProgressive's (PGR) Solid Policies in Force Aid, Cat Loss Ail\r\nPer the Zacks analyst, Progressive is set to grow on solid policies in force, competitive rates and leadership position. However, cat loss exposure inducing underwriting volatility ails.\n\nCVS Health (CVS) Digital Offerings Grow Amid Stiff Rivalry\r\nThe Zacks analyst is impressed with CVS Health's expansion in digital offering as it exceeded 53 million unique digital customers till the second quarter end. Yet, stiff rivalry remains a concern.\n\nHigh Salvage Auction Volume & Partnership Aid Copart (CPRT)\r\nThe Zacks analyst is optimistic about elevated salvage auction volumes. Moreover, its strategic partnership with CHAMP titles to introduce an automated digital platform for car sellers bodes well.\n\nMarket Diversity & Strategic Efforts Benefit Fluor (FLR)\r\nPer the Zacks analyst, Fluor's market diversity remains a key strength that helps it mitigate the cyclicality of markets. Also, its focus on \"Building a Better Future\" strategy bodes well.\n\nDatadog (DDOG) Banks on Cloud Partnerships, Customer Additions\r\nPer the Zacks analyst, Datadog is benefitting from solid cloud partnerships and expanding customer base driven by increased adoption of its cloud-based monitoring and analytics platform.\n\nNew Upgrades\n\nDelek US Holdings (DK) To Benefit from Permian Exposure \r\nThe Zacks analyst believes Delek US Holdings' large presence in the Permian Basin will give it a significant advantage over its competitors in the long run.\n\nRobust Pricing to Bolster Spectrum Brands' (SPB) Margins\r\nPer the Zacks analyst, Spectrum Brands' has been gaining from solid margins stemming from increased pricing and favorable mix. Also, gains from cost-reduction efforts bodes well.\n\nSolid Enrollment & Strategic Initiatives Aid Adtalem (ATGE)\r\nPer the Zacks analyst, Adtalem is benefiting from improved enrollment trends, strategic initiatives and cost synergies. Also, growing demand for healthcare professionals adds to its uptrend.\n\nNew Downgrades\n\nBioMarin's (BMRN) Lack of Late-Stage Pipeline Drugs a Woe\r\nThough the Zacks Analyst is encouraged by the recent Voxzogo and Roctavian approvals, BioMarin's pipeline now consists of only early-stage candidates, which are years away from marketing approval.\n\nC.H. Robinson (CHRW) Reels Under Freight-Market Weakness\r\nThe Zacks analyst is concerned by C.H. Robinson's weak demand, high inventories and excess capacity, which is helping its competition. Also, low gross profit per transaction is worrisome.\n\nHigh Costs, Stiff Competition Ail Evercore's (EVR) Growth\r\nPer the Zacks analyst, high costs will impede Evercore's bottom-line growth while volatility of institutional AUM will hurt revenues. Also, stiff competition creates pricing and competitive pressures.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Goldman Sachs Group, Inc. (GS) : Free Stock Analysis Report\n\nNextEra Energy, Inc. (NEE) : Free Stock Analysis Report\n\nBP p.l.c. (BP) : Free Stock Analysis Report\n\nPrologis, Inc. (PLD) : Free Stock Analysis Report\n\nProcter & Gamble Company (The) (PG) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/top-analyst-reports-nvidia-procter-191500348.html", "symbols": ["FP3.F", "NEE.US", "NEP.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PG.BA", "PG.MX", "PG.US", "PRG.F", "PRG.XETRA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.045, "neu": 0.783, "pos": 0.172}}, {"date": "2023-10-16T19:10:44+00:00", "title": "13 Technology Stocks To Buy That Are Too Cheap To Ignore", "content": "In this piece, we will take a look at the 13 technology stocks to buy that are cheap to ignore. If you want to skip our analysis of the technology industry, then take a look at 5 Technology Stocks To Buy That Are Too Cheap To Ignore.\n\nTechnology has proven to be the most remarkable industry of our age since it has virtually (no pun intended) transformed every aspect of modern day living. We've written this article using technology, you're using technology to read this article, and the stocks that everyone is trading are now available through digital mediums that would have been unimaginable just a couple of decades back.\n\nBefore we get to the financial bit about the technology industry it's important to understand what the term actually means. Due to its near ubiquity in modern day living, technology is simply defined as the use of knowledge involving technical processes to achieve an objective. In a broad definition, this adaptability of technical processes to different use cases naturally affects a lot of different walks of life. At its very heart, technology can also be defined as using an electronic system to speed up data collection, analysis, and computation - three things that can power anything from the iPhone to a data center, an airplane, or a car.\n\nSince computing sits at the heart of technology, one of the most important segments of the technology industry is the semiconductor sector. A semiconductor is a small piece of silicon with circuits made of different materials printed on top of it. The smaller these circuits get, the greater the semiconductor's performance since small feature sizes lead to greater power savings and electrical conductivity. This criticality of semiconductors, also called chips, to the global technological landscape has also made semiconductors one of the most controversial and risky industries these days.\n\nThis is because the high end technologies involved in making chips coupled with the billions of dollars in capital expenditure needed to set up a new chip manufacturing plant mean that the barriers of entry to this industry are among the highest in the world and stand in parallel to other high tech sectors such as rocket and aircraft manufacturing. Consequently, only three companies in the world, namely the Taiwan Semiconductor Manufacturing Company (NYSE:TSM), Intel Corporation (NASDAQ:INTC), and Samsung Electronics can make the latest chips, with others limited to older models. Out of these, only TSMC and Samsung sell their chips to third party customers such as NVIDIA Corporation (NASDAQ:NVDA) and Advanced Micro Devices, Inc. (NASDAQ:AMD) since Intel only makes and sells its own chips.\n\nStory continues\n\nWhy is this important? Well, TSMC is the biggest contract chip manufacturer in the world in terms of volume and all of its advanced chip manufacturing facilities are located in the disputed island of Taiwan. Taiwan and China share a common history, and Beijing considers it an integral part of its territory even though Taiwan has its own passport and holds its own elections. Therefore, the island's status is a cause of significant friction between China and the Western rules based order led by the United States, and one of the biggest worries in the chip sector is that a potential conflict in China can disrupt the global semiconductor supply chain to lead to unimaginable consequences.\n\nThe potential repercussions of such a conflict are so significant that they even made the well known Warren Buffett of Berkshire Hathaway to change his mind. Mr. Buffett's investment firm made headlines at the end of last year as its filings with the Security and Exchange Commission (SEC) revealed that it had bought a whopping 60 million TSMC shares for a $4.1 billion investment for its third quarter of 2022 investments. Since Mr. Buffett takes his sweet time before investing, the decision suggested that TSMC could do nothing wrong. However, in the very next quarter, Berkshire Hathaway reduced its stake by an equally stunning $3.5 billion and disposed off of the shares entirely in the succeeding quarter. The $3.5 billion reduction made waves in the industry as speculation started to become rife about the reason behind the Oracle of Omaha's sudden shift of mood.\n\nMr. Buffett explained his decision soon, sharing that he believes that TSMC is a solid company but the firm's geopolitical risks simply proved too much to ignore. According to CNN which quotes several of his statements:\n\n“I feel better about the capital that we’ve got deployed in Japan than in Taiwan,” the Berkshire Hathaway chairman added. “I wish it weren’t sold, but I think that’s a reality.”\n\nDespite the share sale, Buffett lauded TSMC as “one of the best-managed companies and [most] important companies in the world.”\n\n“There’s no one in the chip industry that’s in their league, at least in my view,” he said.\n\n“Marvelous people and marvelous competitive position and everything, [but] I’d rather find it in the United States.”\n\nBuffett said his reassessment of the company was in “light of certain things that were going on.” He had previously pointed to geopolitical tensions as a concern.\n\nBefore we get to our latest pick of the cheapest technology stocks, it's also important to briefly consider the current investment climate for these stocks. The technology sector is a growth industry that depends on robust purchasing power for both businesses and consumers as well as easy access to capital due to expensive products and services. These days, technology stocks are under pressure as high rates and troubling economic data have dampened investors' risk appetites. Therefore, the major catalysts for the sector as a whole are announcements regarding interest rate cuts as well as economic growth since a slowing economy sees capital fly to safety in sectors such as consumer defensive.\n\nSo, time to look at some great cheap technology stocks, and some notable picks are QUALCOMM Incorporated (NASDAQ:QCOM), Applied Materials, Inc. (NASDAQ:AMAT), and Taiwan Semiconductor Manufacturing Company (NYSE:TSM). 13 Technology Stocks To Buy That Are Too Cheap To Ignore\n\nA Wall Street trader on the phone, quickly executing a technology-driven trade. Editorial photo for a financial news article. 8k. --ar 16:9\n\nOur Methodology\n\nTo compile our list of the best cheap technology stocks, we first made a list of the 30 most valuable technology companies whose price to trailing and forward earnings ratios are lower than 20, and that have analyst ratings of Buy or better. Then, the number of hedge funds that had bought their shares as of June 2023 was determined via Insider Monkey's database of 910 funds and the top cheap technology stocks are as follows.\n\n13 Technology Stocks To Buy That Are Too Cheap To Ignore\n\n13. Sensata Technologies Holding plc (NYSE:ST)\n\nNumber of Hedge Fund Investors in Q2 2023: 32\n\nSensata Technologies Holding plc (NYSE:ST) is a technology company that sells sensors and other products for automobiles and aircraft. The firm expanded its product portfolio in October 2023 by announcing new sensors for aircraft electrical systems and performance.\n\nDuring this year's second quarter, 32 out of the 910 hedge funds part of Insider Monkey's database had held a stake in Sensata Technologies Holding plc (NYSE:ST). Robert Joseph Caruso's Select Equity Group is the biggest investor among these, owning 9.2 million shares that are worth $414 million.\n\nAlong with Applied Materials, Inc. (NASDAQ:AMAT), QUALCOMM Incorporated (NASDAQ:QCOM), and Taiwan Semiconductor Manufacturing Company (NYSE:TSM), Sensata Technologies Holding plc (NYSE:ST) is a cheap tech stock that cannot be ignored.\n\n12. Leidos Holdings, Inc. (NYSE:LDOS)\n\nNumber of Hedge Fund Investors in Q2 2023: 32\n\nLeidos Holdings, Inc. (NYSE:LDOS) is a defense contractor that works with NASA, the Pentagon, and other organizations. It also sells cloud computing and other services to civilian users. The firm expanded its civil software portfolio in October 2023 by announcing a new security management system.\n\nAs of June 2023, 32 out of the 910 hedge funds polled by Insider Monkey had invested in the firm. Leidos Holdings, Inc. (NYSE:LDOS)'s largest shareholder is Anand Parekh's Alyeska Investment Group due to its $122 million investment.\n\n11. Vontier Corporation (NYSE:VNT)\n\nNumber of Hedge Fund Investors in Q2 2023: 33\n\nForward P/E Ratio:\n\nVontier Corporation (NYSE:VNT) is an automotive technology company that sells sensors and other products for large scale vehicle fleets. It has beaten analyst EPS estimates in all four of its latest quarters and the stock is rated Buy on average.\n\nDuring Q2 2023, 33 among the 910 hedge fund investors tracked by Insider Monkey had bought Vontier Corporation (NYSE:VNT)'s shares. Robert Joseph Caruso's Select Equity Group is the biggest hedge fund stakeholder since it owns $74 million worth of shares.\n\n10. Gen Digital Inc. (NASDAQ:GEN)\n\nNumber of Hedge Fund Investors in Q2 2023: 36\n\nTrailing P/E Ratio: 8.08\n\nGen Digital Inc. (NASDAQ:GEN) is an American cybersecurity company that is known for its well known anti virus brands such as Norton. It expanded its presence in the home security market in September 2023 by teaming up with a home security products provider.\n\nBy the end of this year's second quarter, 36 hedge funds out of the 910 surveyed by Insider Monkey had held a stake in the company. Gen Digital Inc. (NASDAQ:GEN)'s largest shareholder among these is Jeffrey Smith's Starboard Value LP due to a $350 million stake.\n\n9. TE Connectivity Ltd. (NYSE:TEL)\n\nNumber of Hedge Fund Investors in Q2 2023: 37\n\nTrailing P/E Ratio: 18.8\n\nTE Connectivity Ltd. (NYSE:TEL) sells sensors, connectors, and terminals for telecommunications, industrial, and other use cases. The firm has been performing well on the financial front lately as it has beaten analyst EPS estimates in all of its four latest quarters. This strong performance is also reflected in an increased 59 cent dividend per share payable in December.\n\n37 out of the 910 hedge funds part of Insider Monkey's June quarter of 2023 research were TE Connectivity Ltd. (NYSE:TEL)'s investors. Natixis Global Asset Management's Harris Associates owns the biggest stake among these, which is worth $864 million and comes via 6.1 million shares.\n\n8. Microchip Technology Incorporated (NASDAQ:MCHP)\n\nNumber of Hedge Fund Investors in Q2 2023: 41\n\nTrailing P/E Ratio: 17.89\n\nMicrochip Technology Incorporated (NASDAQ:MCHP), as the name suggests, is a semiconductor company. It made a big announcement earlier this year by announcing new chip products for use in outer space applications.\n\nInsider Monkey took a look at 910 hedge fund holdings for their second quarter of 2023 shareholdings to find that 41 had bought the company's shares. Microchip Technology Incorporated (NASDAQ:MCHP)'s largest hedge fund stakeholder is Kerr Neilson's Platinum Asset Management courtesy of its $295 million investment.\n\n7. NXP Semiconductors N.V. (NASDAQ:NXPI)\n\nNumber of Hedge Fund Investors in Q2 2023: 48\n\nTrailing P/E Ratio: 18.42\n\nNXP Semiconductors N.V. (NASDAQ:NXPI) is one of the more important chip companies in the world due to its close partnership with the car industry. The firm has partnered up with TSMC in Europe to build a massive $11 billion advanced chip making facility.\n\nInsider Monkey's 910 hedge fund survey for their investments during this year's June quarter outlined that 48 had held a stake in NXP Semiconductors N.V. (NASDAQ:NXPI). Robert Rodriguez and Steven Romick's First Pacific Advisors LLC is the biggest investor among these since it owns a $162 million stake.\n\n6. Flex Ltd. (NASDAQ:FLEX)\n\nNumber of Hedge Fund Investors in Q2 2023: 54\n\nTrailing P/E Ratio: 15.52\n\nFlex Ltd. (NASDAQ:FLEX) is a specialty technology firm that caters to the needs of the supply chain industry. Its shares are rated Strong Buy on average and analysts have penned in a $7 share price upside based on the average share price target of $32.83.\n\n54 out of the 910 hedge funds part of Insider Monkey's Q2 2023 research had bought and owned the firm's shares. Flex Ltd. (NASDAQ:FLEX)'s largest hedge fund shareholder is Andrew Wellington and Jeff Keswin's Lyrical Asset Management as it owns 9.8 million shares that are worth $273 million.\n\nQUALCOMM Incorporated (NASDAQ:QCOM), Flex Ltd. (NASDAQ:FLEX), Applied Materials, Inc. (NASDAQ:AMAT), and Taiwan Semiconductor Manufacturing Company (NYSE:TSM) are some great cheap tech stocks.\n\nClick here to continue reading and check out 5 Technology Stocks To Buy That Are Too Cheap To Ignore.\n\nSuggested articles:\n\n12 Best Cash App Stocks To Buy Now 14 Best Bear Market Stocks To Buy Now 12 Best Aggressive Growth Stocks To Buy According to Hedge Funds\n\nDisclosure: None. 13 Technology Stocks To Buy That Are Too Cheap To Ignoreis originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/13-technology-stocks-buy-too-191044075.html", "symbols": ["2330.TW", "AMAT.MX", "AMAT.US", "AMD.US", "AP2.F", "AP2.XETRA", "FLEX.US", "FXI.F", "GEN.US", "INTC.US", "LDOS.US", "MCHP.US", "MCP.F", "MCP.STU", "NVDA.US", "NXPI.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.03, "neu": 0.854, "pos": 0.115}}, {"date": "2023-10-16T17:45:13+00:00", "title": "Why Intel, Broadcom, and Indie Semi Stocks All Popped Today", "content": "Shares of semiconductors giants Intel (NASDAQ: INTC) and Broadcom (NASDAQ: AVGO) were eking out small gains in early afternoon trading Monday, up 2% and 1.8%, respectively. Meanwhile, tiny rival Indie Semiconductor (NASDAQ: INDI), a specialist in chips designed for use in automobiles, had raced ahead by 19.8% after pre-announcing third-quarter revenue numbers that pleased Wall Street mightily. Why is Indie Semiconductor outperforming Intel and Broadcom?\n\nContinue reading", "link": "https://finance.yahoo.com/m/4b7b03ad-db3c-35ab-95cc-90ac05f57b25/why-intel%2C-broadcom%2C-and.html", "symbols": ["AVGO.US", "AVGO34.SA", "INDI.US", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.836, "neg": 0, "neu": 0.862, "pos": 0.138}}, {"date": "2023-10-16T17:21:20+00:00", "title": "Dow Jones Leader JPMorgan, Chip Giant Nvidia Eye Buy Points", "content": "Dow Jones banking leader JPMorgan and chip giant Nvidia are approaching new buy points in today's stock market action.\n\nContinue reading", "link": "https://finance.yahoo.com/m/0586acd5-d83e-3af9-b462-c838e4cf84b8/dow-jones-leader-jpmorgan%2C.html", "symbols": ["5AP.F", "CMC.F", "CMC.XETRA", "DJI.INDX", "JPM-PC.US", "JPM-PD.US", "JPM.MX", "JPM.US", "JPMC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US", "REGN.US", "RGO.F"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-16T17:16:48+00:00", "title": "Nvidia Could Be Affected by Expanded US Export Controls on AI Chips to China", "content": "Regulators reportedly want to expand the list of AI semiconductor chips that fall under export control rules, a move which could target chips Nvidia designed just to meet the export guidelines.\n\nContinue reading", "link": "https://finance.yahoo.com/m/2a2be0e9-ba77-3c51-a6e2-eaa75fbbd9ea/nvidia-could-be-affected-by.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0, "neu": 0.893, "pos": 0.107}}, {"date": "2023-10-16T16:53:13+00:00", "title": "The Israel-Hamas war has already had a tragic impact on tech workers in Israel and Gaza", "content": "The current situation in Israel and Palestine is tragic, ugly, and quite capable of touching all our lives in some form soon. For tech workers there, it’s already had a devastating effect.\n\nSeveral years ago, Nvidia bought an Israeli-American networking company called Mellanox for $7 billion, using it as the basis for a center that employs 3,000 people. As reported Friday by CTech, Nvidia CEO Jensen Huang wrote to Israeli employees to offer his condolences to Mellanox founder Eyal Waldman, whose daughter Danielle was among those slaughtered by Hamas militants at the Supernova music festival—her partner, former Nvidia employee Noam Shai, also was killed.\n\nNvidia employee Avinatan Or and his girlfriend Noa Argamani are hostages. And hundreds of Nvidia’s workers have been called up to return to military duty. “Our thoughts are constantly with you, and we hope for your safe return,” Huang wrote. “Nvidians worldwide will rise to cover for our colleagues in Israel and pick up and offload whatever work you need. We are here for you.”\n\nMeanwhile, at least a tenth of workers at the workplace collaboration platform Spike have taken up co-founder Dvir Ben-Aroya’s offer of company support for those who want to temporarily move away from Israel with their families, according to CNBC—the article also notes several examples of companies where international colleagues are eagerly filling in for Israeli employees who have been called up, or who just need time off to cope with the national trauma.\n\n“It’s very difficult to concentrate on work when you’re dealing with all these personal matters and on securing yourself and the country,” venture capitalist Yaniv Sadka told CNBC, also noting that many of the tech workers are being pulled into the Israeli Defense Forces’ intelligence units.\n\nBut while Israel’s tech focus is well known—the sector accounts for a tenth of the Israeli workforce—Palestine also has aspirations as a tech hub, with some Silicon Valley companies eagerly hiring talent there. TechCrunch’s Mike Butcher provides a grim account of what’s been happening in Gaza even before Israel’s planned ground offensive.\n\nStory continues\n\nThe building that housed the Gaza Sky Geeks accelerator—from which 5,000 developers graduated last year—has been blown out by Israeli shelling. “The offices are destroyed, the fiber lines are destroyed. The universities are destroyed,” Ryan Sturgill, who used to run the accelerator, told Butcher. “Three main universities in Gaza that produce all the computer science grads are leveled.”\n\n“The tech sector is almost completely unable to function in Gaza right now,” added Iliana Montauk, CEO of Y-Combinator-backed social impact startup Manara. “Most people are in too much danger to be able to work; some have evacuated three times in the past 24 hours, moving from friend’s house to family house, because each neighborhood they end up in is the next one being bombed.”\n\nMore news below.\n\nWant to send thoughts or suggestions to Data Sheet? Drop a line here.\n\nDavid Meyer\n\nThis story was originally featured on Fortune.com", "link": "https://finance.yahoo.com/news/israel-hamas-war-already-had-165313636.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": -0.904, "neg": 0.073, "neu": 0.865, "pos": 0.062}}, {"date": "2023-10-16T16:45:05+00:00", "title": "3 Reasons Why Growth Investors Shouldn't Overlook Nvidia (NVDA)", "content": "Investors seek growth stocks to capitalize on above-average growth in financials that help these securities grab the market's attention and produce exceptional returns. But finding a growth stock that can live up to its true potential can be a tough task.\n\nBy their very nature, these stocks carry above-average risk and volatility. Moreover, if a company's growth story is over or nearing its end, betting on it could lead to significant loss.\n\nHowever, it's pretty easy to find cutting-edge growth stocks with the help of the Zacks Growth Style Score (part of the Zacks Style Scores system), which looks beyond the traditional growth attributes to analyze a company's real growth prospects.\n\nNvidia (NVDA) is on the list of such stocks currently recommended by our proprietary system. In addition to a favorable Growth Score, it carries a top Zacks Rank.\n\nResearch shows that stocks carrying the best growth features consistently beat the market. And returns are even better for stocks that possess the combination of a Growth Score of A or B and a Zacks Rank #1 (Strong Buy) or 2 (Buy).\n\nHere are three of the most important factors that make the stock of this maker of graphics chips for gaming and artificial intelligence a great growth pick right now.\n\nEarnings Growth\n\nEarnings growth is arguably the most important factor, as stocks exhibiting exceptionally surging profit levels tend to attract the attention of most investors. For growth investors, double-digit earnings growth is highly preferable, as it is often perceived as an indication of strong prospects (and stock price gains) for the company under consideration.\n\nWhile the historical EPS growth rate for Nvidia is 31.2%, investors should actually focus on the projected growth. The company's EPS is expected to grow 221.5% this year, crushing the industry average, which calls for EPS growth of -9.4%.\n\nImpressive Asset Utilization Ratio\n\nAsset utilization ratio -- also known as sales-to-total-assets (S/TA) ratio -- is often overlooked by investors, but it is an important indicator in growth investing. This metric shows how efficiently a firm is utilizing its assets to generate sales.\n\nStory continues\n\nRight now, Nvidia has an S/TA ratio of 0.74, which means that the company gets $0.74 in sales for each dollar in assets. Comparing this to the industry average of 0.69, it can be said that the company is more efficient.\n\nIn addition to efficiency in generating sales, sales growth plays an important role. And Nvidia is well positioned from a sales growth perspective too. The company's sales are expected to grow 101.7% this year versus the industry average of -3.9%.\n\nPromising Earnings Estimate Revisions\n\nSuperiority of a stock in terms of the metrics outlined above can be further validated by looking at the trend in earnings estimate revisions. A positive trend is of course favorable here. Empirical research shows that there is a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nThere have been upward revisions in current-year earnings estimates for Nvidia. The Zacks Consensus Estimate for the current year has surged 0.8% over the past month.\n\nBottom Line\n\nNvidia has not only earned a Growth Score of A based on a number of factors, including the ones discussed above, but it also carries a Zacks Rank #1 because of the positive earnings estimate revisions.\n\nYou can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nThis combination positions Nvidia well for outperformance, so growth investors may want to bet on it.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/3-reasons-why-growth-investors-164505686.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.013, "neu": 0.76, "pos": 0.228}}, {"date": "2023-10-16T16:10:37+00:00", "title": "Big tech earnings: What to expect from Q3 results", "content": "Investors will be closely watching third quarter earnings from the big tech companies. Data from Bloomberg Intelligence shows that the big five - Apple (APPL), Microsoft (MSFT), Amazon (AMZN), Nvidia (NVDA), and Alphabet (GOOG,GOOGL) - are expected to show an average 34% year-over-year jump in earnings. Yahoo Finance Senior Business Reporter Ines Ferre joins to break down the potential performance of these companies and what investors should pay attention to.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/big-tech-earnings-expect-q3-161037850.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "FB2A.F", "FB2A.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MI", "GOOG.MX"], "tags": [], "sentiment": {"polarity": 0.527, "neg": 0.015, "neu": 0.932, "pos": 0.053}}, {"date": "2023-10-16T15:48:59+00:00", "title": "What Nvidia, Intel, and AMD Stock Investors Should Know About Recent Top AI Updates", "content": "Could Advanced Micro Devices' recent acquisition be a red flag for Nvdia's software dominance?\n\nContinue reading", "link": "https://finance.yahoo.com/m/b2340e0d-1acb-3802-ad5c-af79726c1dba/what-nvidia%2C-intel%2C-and-amd.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0, "neu": 0.774, "pos": 0.226}}, {"date": "2023-10-16T14:55:00+00:00", "title": "Logitech (LOGI) to Launch PS5 Adaptive Gaming Kit Next Year", "content": "Logitech International's LOGI brand, Logitech G, has announced the upcoming release of the Logitech G Adaptive Gaming Kit for the PlayStation 5 (PS5) Access controller in January 2024. Logitech and Sony are collaborating to launch this kit to offer customizable options to enable gamers with disabilities to enjoy their gaming experiences.\n\nThe kit includes a variety of high-performance and durable buttons and triggers that are specifically designed to meet the accessibility needs of gamers. It also features gaming-grade mechanical button switches, adjustable trigger controls, custom PS5 controller labels, velcro ties and a host of other options for optimal setup and customization.\n\nThe Logitech G Adaptive Gaming Kit for the Access controller will be accessible for purchase through both the Logitech G website and selected retail outlets. The users must have a PS5 Console and Access controller to utilize the Adaptive Gaming Kit.\n\nLogitech International S.A. Price and Consensus Logitech International S.A. Price and Consensus\n\nLogitech International S.A. price-consensus-chart | Logitech International S.A. Quote\n\nThe launch of the Adaptive Gaming Kit is part of a series of product launches in the second quarter of 2024, which also included the Logitech G PRO X TKL LIGHTSPEED Gaming Keyboard, Logitech G PRO X SUPERLIGHT 2 Gaming Mouse, Wave Keys Keyboards and the latest generation of Yeti microphones.\n\nShares of Logitech have outperformed the Zacks Computer – Peripheral Equipment industry in the year-to-date (YTD) period. Shares of LOGI have gained 14.2% YTD compared with the Computer – Peripheral Equipment industry’s rise of 2.1%.\n\nLogitech Focuses on Expanding Product Portfolio\n\nLogitech intends to tap the high-potential market for accessories by pursuing innovation and expanding its product lines. The company has manufactured innovative offerings like the fastest performing mouse and keyboard switches, wireless mouse with longest battery and multi-device keyboards, among others.\n\nLOGI is also expanding its product portfolio through acquisitions. In July 2023, it acquired Finland’s Loupedeck. The acquisition is expected to enhance Logitech’s ability to provide customizable and contextual control experiences for the company’s full portfolio of devices, including the Logitech Software Roadmap solution.\n\nStory continues\n\nLoupedeck offers deep native integrations with industry-leading creative software for photo editing, retouching, video editing, color grading design and streaming. Its custom consoles combine analog control with digital precision to offer power and flexibility to all creators. With this buyout, Logitech will leverage Loupedeck’s strong and growing developer community that will unveil advanced innovation, empowering streamers, creators and gamers.\n\nLOGI’s sustained focus on introducing new and innovative products might boost sales and somewhat offset the negative impact of the weakened demand for PC peripheral products. In 2020 and 2021, Logitech benefited from the elevated demand for its Video Collaboration, PC Webcams, Keyboards & Combos and Pointing Device tools, mainly driven by the heightening of work-from-home and learn-from-home trends.\n\nHowever, the weakening global economy amid ongoing macroeconomic and geopolitical issues enhanced global recessionary concerns, thereby prompting enterprises to postpone their large IT spending plan. Furthermore, continued industry layoffs due to growing recessionary concerns are hampering the demand for PC peripheral products by organizations.\n\nThe aforementioned factors are hurting Logitech’s financial performance. In first-quarter fiscal 2024, the company’s revenues and non-GAAP earnings per share declined 16% and 12%, respectively, on a year-over-year basis.\n\nZacks Rank and Other Stocks to Consider\n\nCurrently, Logitech carries a Zacks Rank #2 (Buy).\n\nSome other top-ranked stocks from the broader technology sector are NVIDIA NVDA, Synopsys SNPS and Palo Alto Networks PANW, each sporting a Rank #1 (Strong Buy) at present. You can see the complete list of today's Zacks #1 Rank stocks here.\n\nThe Zacks Consensus Estimate for NVIDIA's third-quarter fiscal 2024 earnings has been revised upward by 2 cents to $3.34 per share in the past 30 days. For fiscal 2024, earnings estimates have increased by 7 cents to $10.74 per share in the past 30 days.\n\nNVIDIA’s earnings beat the Zacks Consensus Estimate thrice in the preceding four quarters while missing on one occasion, the average surprise being 9.8%. Shares of NVDA have rallied 211% year to date.\n\nThe Zacks Consensus Estimate for Synopsys’ fourth-quarter fiscal 2023 earnings has been revised upward by 12 cents to $3.04 per share in the past 60 days. For fiscal 2023, earnings estimates have moved upward by 27 cents to $11.09 per share in the past 60 days.\n\nSynopsys’ earnings beat the Zacks Consensus Estimate in each of the preceding four quarters, the average surprise being 4.23%. Shares of SNPS have gained 53.4% year to date.\n\nThe Zacks Consensus Estimate for Palo Alto Networks' first-quarter fiscal 2024 earnings has been revised upward by 6 cents to $1.16 per share in the past 60 days. For fiscal 2024, earnings estimates have increased by 39 cents to $5.34 per share in the past 60 days.\n\nPalo Alto Networks’ earnings beat the Zacks Consensus Estimate in the preceding four quarters, the average surprise being 22.2%. Shares of PANW have surged 85.9% year to date.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLogitech International S.A. (LOGI) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nSynopsys, Inc. (SNPS) : Free Stock Analysis Report\n\nPalo Alto Networks, Inc. (PANW) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/logitech-logi-launch-ps5-adaptive-145500657.html", "symbols": ["5AP.F", "LOGI.US", "LOGN.SW", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.021, "neu": 0.868, "pos": 0.111}}, {"date": "2023-10-16T14:17:00+00:00", "title": "Nvidia’s AI Chip Exports to China Are Under Threat: Report", "content": "Nvidia stock was falling early Monday following a report the chip maker could face further restrictions on exports of its artificial-intelligence chips to China.\n\nContinue reading", "link": "https://finance.yahoo.com/m/ccb97dfd-326d-3917-ab9c-445fc44b5bd3/nvidia%E2%80%99s-ai-chip-exports-to.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": -0.153, "neg": 0.063, "neu": 0.938, "pos": 0}}, {"date": "2023-10-16T14:12:00+00:00", "title": "4 Stocks That Moved the Market in September", "content": "September was a rough month in the stock market, as the S&P 500 fell 4.9%. But investors can gain an advantage by understanding the forces that drove certain stocks higher or lower. You can prepare yourself for upcoming market trends by digging deeper beyond the headlines.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9ebb8e11-d211-31d2-bca2-66ff7722677f/4-stocks-that-moved-the.html", "symbols": ["12DA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DELL.US", "DYH.F", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TGT.MX", "TGT.US", "TGTB34.SA"], "tags": [], "sentiment": {"polarity": 0.649, "neg": 0.042, "neu": 0.816, "pos": 0.142}}, {"date": "2023-10-16T14:08:38+00:00", "title": "Cathie Wood’s 3 Favorite AI Stocks: October 2023", "content": "At the end of September, Cathie Wood sat down with Morningstar to discuss the current and future state of Ark Invest, including the investment management firm’s flagship fund, the ARK Innovation ETF (NYSEARCA:ARKK). In the interview, the host noted one apparent misstep. He pointed out that ARKK and other Cathie Wood funds dropped the ball on AI stocks, particularly after her funds divested all Nvidia (NASDAQ:NVDA) stock well before the company’s current runup.\n\nHowever, Cathie Wood disagreed with the assessment. Specifically, Cathie Wood said, “if you read our research going back to 2014, we’ve been very focused on the revolution called artificial intelligence.” She then reminded the interviewer that her funds held Nvidia when the stock traded for just $5 before selling in January 2022 in the mid-$100 range. Furthermore, Cathie Wood told the interviewer the real reason the Nvidia play doesn’t matter for Ark Invest: her firm is doing “real original research as opposed to checking a box, artificial intelligence, Nvidia.”\n\nCathie Wood says her firm is focusing on more than simply leveraging AI as a buzzword. Instead, Ark Invest is focusing on firms with domain expertise and uniquely applied AI that stands to dominate those respective domains.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nUltimately, Cathie Wood says these three AI stocks are how her funds offer “diversification in the disruptive innovation space.” But you don’t need to be an ARKK bag holder to copy her strategy with Cathie Wood stocks.\n\nZoom (ZM)\n\nSource: Girts Ragelis / Shutterstock.com\n\nZoom (NASDAQ:ZM) is a somewhat surprising AI stock play for Cathie Wood. In the interview, she pointed to the then-upcoming Zoomtopia event for an idea of how the remote conferencing tool leveraged AI. That event happened at the beginning of the month. Investors can now understand what Cathie Wood sees in this AI stock.\n\nDuring Zoomtopia, the company unveiled a new suite of AI-driven products. Zoom Docs, for example, is a centralized AI workspace that could emerge as a competitor to Alphabet’s (NASDAQ:GOOGL, NASDAQ:GOOG) ever-popular Google Docs platform.\n\nStory continues\n\nIf Cathie Wood’s Zoom endorsement isn’t enough, maybe Berkshire Hathaway’s (NYSE:BRK-A, NYSE:BRK-B) Charlie Munger’s enthusiastic support will sway value and growth investors alike. Munger delivered Zoomtopia’s closing keynote speech. In the speech, Munger jokingly discussed how he and Warren Buffett used to rely on telegraph and telephone to discuss and execute deals. But today, he’s bullish on Zoom. He told listeners, “I use Zoom a lot to do business out of my house. It’s very convenient for me because travel is difficult.” But Munger and his team don’t just use Zoom for business. He also said. “We have family Zooms, too, and get the whole family together. It’s easy to punch a few buttons overall to get connected.”\n\nZoom has been a longtime staple of the emerging remote work world. Its AI offerings could mean big things for the stock. Cathie Wood is headed in the right direction with Zoom, and Charlie Munger’s endorsement further cements its long-term potential on the list of AI stocks.\n\nExact Sciences (EXAS)\n\nSource: Tada Images / Shutterstock\n\nExact Sciences (NASDAQ:EXAS) is a biotech stock leveraging AI. The company also comprises the largest holding in Cathie Wood’s ARK Genomic Revolution ETF (BATS:ARKG) at 10.38% total weight. The company recently posted its sixth consecutive quarter of double-digit sales growth, proving its market potential. Likewise, analyst sentiment for the stock is overwhelmingly positive, with its current price nearly 50% below consensus fair value estimates.\n\nExact Sciences’ AI potential comes, in part, from an ongoing partnership with OncXerna Therapeutics, a private biotech firm. The two leverage OncXerna’s AI-powered platform to act as an early cancer diagnostic tool. The platform uses machine learning to align patient tumor types with biologically-appropriate treatment tailored to the patient. The platform’s potential is massive and serves as proof that AI has a bright future in healthcare.\n\nExact Sciences also partnered with VieCure, another AI-driven cancer diagnostic platform. Like its other goals, this AI-powered partnership seeks to “improve clinical workflow and make it easier for community oncologists to order the right tests and generate patient-specific treatment plans.”\n\nUiPath (PATH)\n\nSource: dennizn / Shutterstock.com\n\nUiPath (NYSE:PATH) is Cathie Wood’s top AI stock. In the interview, she said that the robotics automation firm “is helping companies automate the most mundane administrative tasks in their companies” using AI. UiPath’s offerings might seem mundane at first. After all, automation systems in the workplace have been longtime staples of the digital office age. But a look at the many case studies the firm hosts points to the underlying reason behind Cathie Wood’s bull thesis. UiPath is tailorable across innumerable industries leveraging company or sector-specific data sets. UiPath is also integratable with many leading SaaS products, including Salesforce (NYSE:CRM), Amazon’s (NASDAQ:AMZN) web service segment and even OpenAI.\n\nConsidering how the economy treats tech stocks today, the company’s financial strength and growth are also noteworthy. UiPath posted a 19% overall year-over-year revenue growth in its most recent report. UiPath also grew recurring revenue by 25%, indicating a happy client base sticking with the company’s automation solutions. PATH shares are up about 33% this year, but the stock is still priced to buy. Investors interested in replicating the Cathie Wood strategy should make UiPath a AI stocks portfolio fixture.\n\nOn the date of publication, Jeremy Flint held no positions in the securities mentioned. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJeremy Flint, an MBA graduate and skilled finance writer, excels in content strategy for wealth managers and investment funds. Passionate about simplifying complex market concepts, he focuses on fixed-income investing, alternative investments, economic analysis, and the oil, gas, and utilities sectors. Jeremy’s work can also be found at www.jeremyflint.work.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post Cathie Wood’s 3 Favorite AI Stocks: October 2023 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/cathie-wood-3-favorite-ai-140838988.html", "symbols": ["5ZM.F", "AMZN.US", "CRM.US", "EXAS.US", "EXK.F", "NVDA.US", "PATH.US", "ZM.US"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.018, "neu": 0.898, "pos": 0.084}}, {"date": "2023-10-16T14:00:00+00:00", "title": "Want to Get Richer? 3 Best Stocks to Buy and Hold for the Next Decade", "content": "In fact, companies capable of capitalizing on secular trends such as artificial intelligence (AI), cybersecurity, and observability can prove to be some of the best candidates for a long-term buy-and-hold strategy. In my view, three stocks -- Nvidia (NASDAQ: NVDA), Datadog (NASDAQ: DDOG), and CrowdStrike (NASDAQ: CRWD) -- seem to fit the bill. In fact, according to Grand View Research, the AI market is projected to expand at a compound annual rate of 37.3% through the end of this decade, from $196.6 billion in 2023 to $1.8 trillion in 2030.\n\nContinue reading", "link": "https://finance.yahoo.com/m/33dd1981-7426-3197-b1e9-3e87bf305ee4/want-to-get-richer%3F-3-best.html", "symbols": ["45C.F", "CRWD.US", "DDOG.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.949, "neg": 0, "neu": 0.826, "pos": 0.174}}, {"date": "2023-10-16T13:56:00+00:00", "title": "Infosys (INFY) Extends Digital Services JV With Temasek", "content": "InfosysLimited INFY recently announced that it is set to extend its joint venture (JV) with Temasek. Initially, the two companies collaborated in 2018, with Infosys acquiring a 60% stake in the JV while Temasek held 40%.\n\nThe Infosys-Temasek JV, named Infosys Compaz, was established with INFY's vision to enter into the Southeast Asian market, with the former benefiting from an increase in workforce capacity and the latter gaining from improvements in its IT services.\n\nIn the past five years, the JV has undergone numerous partnerships with large corporations in Southeast Asia. These partnerships have worked on multiple digital transformation journeys in the fields of cloud, cybersecurity, digital, automation, data and analytics and artificial intelligence (AI).\n\nInfosys Limited Price and Consensus American Noble Gas Inc. Price and Consensus\n\nInfosys Limited price-consensus-chart | Infosys Limited Quote\n\nInfosys Compaz is leveraging the capabilities of Infosys Cobalt and Topaz to enable its customers to enhance the cloud and AI capabilities. The recent extension reinforces the company's 2018 commitment to invest in advanced technologies, capabilities and workforce development for high-quality professional services.\n\nShares of Infosys have underperformed the Zacks Computer and Technology sector in the year-to-date (YTD) period. Shares of INFY have declined 6.2% YTD against the Computer and Technology sector’s rise of 36.1%.\n\nINFY's digital transformation offerings are receiving a positive response from its clients. Furthermore, as clients focus on vendor consolidation, the company is benefiting from stronger deals. In the second quarter of 2024, Infosys signed 21 large deals across America and Europe.\n\nHowever, the company is facing a mixed bag of challenges. Its business is being affected by near-term uncertainties stemming from inflation and high interest rates. Slow decision-making processes, along with softness in digital transformation programs and discretionary spending in the current uncertain macroeconomic environment, are hurting the company’s volumes.\n\nStory continues\n\nNevertheless, during the recently reported financial results for second-quarter fiscal 2024, Infosys’ revenues grew 2.5% year over year and 2.3% sequentially. Its AI capabilities, like those of Infosys Topaz, have shown promising results and have increased its market share, thus more than offsetting the negative impact of the aforementioned factors.\n\nZacks Rank & Stocks to Consider\n\nInfosys currently carries a Zacks Rank #3 (Hold).\n\nSome better-ranked stocks from the broader technology sector are NVIDIA NVDA, Synopsys SNPS and Palo Alto Networks PANW, each sporting a Rank #1 (Strong Buy) at present. You can see the complete list of today's Zacks #1 Rank stocks here.\n\nThe Zacks Consensus Estimate for NVIDIA's third-quarter fiscal 2024 earnings has been revised upward by 2 cents to $3.34 per share in the past 30 days. For fiscal 2024, earnings estimates have increased by 7 cents to $10.74 per share in the past 30 days.\n\nNVIDIA’s earnings beat the Zacks Consensus Estimate thrice in the preceding four quarters while missing on one occasion, the average surprise being 9.8%. Shares of NVDA have rallied 211% year to date.\n\nThe Zacks Consensus Estimate for Synopsys’ fourth-quarter fiscal 2023 earnings has been revised upward by 12 cents to $3.04 per share in the past 60 days. For fiscal 2023, earnings estimates have moved upward by 27 cents to $11.09 per share in the past 60 days.\n\nSynopsys’ earnings beat the Zacks Consensus Estimate in each of the preceding four quarters, the average surprise being 4.23%. Shares of SNPS have gained 53.4% year to date.\n\nThe Zacks Consensus Estimate for Palo Alto Networks' first-quarter fiscal 2024 earnings has been revised upward by 6 cents to $1.16 per share in the past 60 days. For fiscal 2024, earnings estimates have increased by 39 cents to $5.34 per share in the past 60 days.\n\nPalo Alto Networks’ earnings beat the Zacks Consensus Estimate in the preceding four quarters, the average surprise being 22.2%. Shares of PANW have surged 85.9% year to date.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmerican Noble Gas Inc. (INFY) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nSynopsys, Inc. (SNPS) : Free Stock Analysis Report\n\nPalo Alto Networks, Inc. (PANW) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/infosys-infy-extends-digital-services-135600621.html", "symbols": ["5AP.F", "INFY.BSE", "INFY.NSE", "INFY.US", "IOY.F", "IOY.STU", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.027, "neu": 0.84, "pos": 0.133}}, {"date": "2023-10-16T13:36:00+00:00", "title": "New Investor? Buy These 2 Growth Stocks", "content": "A strong foundation is critical for any portfolio, so beginners should look for great stocks to build with.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1df6f295-b886-3c47-813b-8da1a60f58a0/new-investor%3F-buy-these-2.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.727, "neg": 0.089, "neu": 0.623, "pos": 0.288}}, {"date": "2023-10-16T13:33:17+00:00", "title": "What Analog Devices, Tesla, and Nvidia Stock Investors Should Know About Recent Semiconductor Updates", "content": "In today's video, I discuss recent updates impacting Analog Devices (NASDAQ: ADI), Tesla (NASDAQ: TSLA), Nvidia (NASDAQ: NVDA), and other semiconductor companies. Check out the short video to learn more, consider subscribing, and click the special offer link below.\n\nContinue reading", "link": "https://finance.yahoo.com/m/551816ad-d220-36f2-bd13-df2ea4ab0607/what-analog-devices%2C-tesla%2C.html", "symbols": ["ADI.US", "ANL.F", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.402, "neg": 0, "neu": 0.935, "pos": 0.065}}, {"date": "2023-10-16T12:25:00+00:00", "title": "Zacks Investment Ideas feature highlights: S&amp;P 500 Index ETF, Nasdaq 100 ETF, Microsoft and Nvidia", "content": "For Immediate Release\n\nChicago, IL – October 16, 2023 – Today, Zacks Investment Ideas feature highlights S&P 500 Index ETF SPY, Nasdaq 100 ETF QQQ, Microsoft MSFT and Nvidia NVDA.\n\nBull Market Turns One: 5 Takeaways\n\nTo Achieve Stock Market Success, Learn from the Past to Take Advantage of the Future\n\nOn October 13th 2022, the nearly one-year-long equity bear market finally ended. Year-to-date, the S&P 500 Index ETF is up 13.65%, while the tech-heavy Nasdaq 100 ETF is up a robust 40%. Despite the massive turnaround and the clear character change in equities, many of Wall Street’s most esteemed analysts were neutral on the stocks, or worse, bearish. Regardless of whether you have cashed in on the bull market or missed it, studying and learning from stock market history is crucial for several reasons, including:\n\nPatterns & Trends: Stock market history reveals patterns and trends that repeat over time. Investors can identify and learn from repeatable patterns to make more informed decisions in the future.\n\nMarket Psychology: Historical events show how market psychology can drive prices.\n\nInformed Decision Making: Informed investors equip themselves with historical data that can aid them in reducing impulsive and emotional trading, which often leads to stock market losses.\n\nBelow are 5 of the most critical lessons from the 2023 equity market:\n\nBear Markets Bottom on Bad News\n\nThough it may seem counterintuitive to amateur investors, corrective markets tend to bottom when there is panic selling on poor news. That’s precisely what occurred in 2023. The Consumer Price Index (CPI) reading shot to 40-year highs on the day equities bottomed. Equity markets are similar to poor poker players in that they often give a “tell” or a subtle clue that things have changed. The day CPI hit 40-year highs, stocks opened the session deep in the red but closed the session higher by more than 2%. The best bottoms occur when “bad” news becomes good news.\n\nStory continues\n\nStocks Discount Future Earnings\n\nAs 2022 concluded, many Wall Street gurus were discussing the potential for a recession (a significant decline in economic activity across the economy, characterized by a decrease in GDP, employment, and overall trade, usually lasting for a prolonged period). They failed to understand that the bullish price action in stocks was a sign that earnings were troughing. Stocks almost always turn before earnings.\n\nThe AI Revolution Is For Real\n\nWhenever a new technology emerges, investors can easily get lost in the hype and have unrealistic expectations. 2023 will be known as the year OpenAI and Microsoft’s ChatGPT catapulted AI into the mainstream. But how do investors separate revolutionary technology from hype? Earnings. Nvidia, which makes the top chips used in AI technology, will grow revenues to more than $50 billion in 2024. For context, NVDA was already the far-and-away chip leader in 2020, when the company earned just $10 billion in revenue.\n\nBull Markets Climb a Wall of Worry\n\nThe 2023 bull market is proof that bull markets climb a “wall of worry”. Equities have rallied in the face of recession fears, rising interest rates, stubborn inflation, and geopolitical upheaval.\n\nExtreme Sentiment Readings Mark Turning Points\n\n“If everyone is thinking the same, someone isn’t thinking.”The CNN Fear & Greed Index flashed “extreme fear” readings three times in the past year: October 2022, March 2023, and early October. Each time fear hit a fever pitch, equities established a significant bottom.\n\nConclusion\n\nIn 2023, the stock market is witnessing a significant turnaround and is defying Wall Street analysts’ bearish expectations. The lessons that investors can learn underscore the value of historical analysis and understanding market psychology for successful stock market navigation.\n\nWhy Haven’t You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nInvesco QQQ (QQQ): ETF Research Reports\n\nSPDR S&P 500 ETF (SPY): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-122500841.html", "symbols": ["GSPC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.987, "neg": 0.064, "neu": 0.838, "pos": 0.098}}, {"date": "2023-10-16T10:46:00+00:00", "title": "Tesla May Be a Better Haven Than Treasuries. Here’s Why.", "content": "Nvidia’s AI chip exports to China are under threat, General Motors reaches deal with striking Canadian auto workers, and other news to start your day.\n\nContinue reading", "link": "https://finance.yahoo.com/m/fdffcc33-0df0-39fb-ba62-48ac89966693/tesla-may-be-a-better-haven.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "NFC.F", "NFC.XETRA", "NFLX.MX", "NFLX.US", "NFLX34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": -0.494, "neg": 0.115, "neu": 0.845, "pos": 0.041}}, {"date": "2023-10-16T09:21:00+00:00", "title": "2 Trillion-Dollar Stocks Billionaires Are Selling and the 1 They're Surprisingly Buying Hand Over Fist", "content": "Among Apple, Microsoft, Alphabet, Amazon, and Nvidia, there are two industry leaders that have billionaires headed for the exit, as well as one shocking outperformer they're piling into.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6efe39e7-248a-3cb1-8f1a-d61eacd9146a/2-trillion-dollar-stocks.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.026, "neg": 0.081, "neu": 0.806, "pos": 0.113}}, {"date": "2023-10-16T08:00:47+00:00", "title": "Apple, Nvidia and Pfizer fall premarket; Lululemon rises", "content": "Investing.com -- U.S. futures edged higher Monday, at the start of a week that sees the quarterly earnings season ramp up.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nRite Aid (NYSE:RAD) stock rose 4.5%, rebounding after Friday’s 17% drop, after the drugstore chain filed for Chapter 11 bankruptcy and announced it has received a commitment for $3.45 billion in new financing from some of its lenders.\n\nApple (NASDAQ:AAPL) stock fell 0.8% after Bloomberg reported the tech giant’s new iPhone 15 is facing challenges in the Chinese market, with sales lagging behind its predecessor - the iPhone 14.\n\nNvidia (NASDAQ:NVDA) stock fell 1% following a Bloomberg News report that the U.S. will strengthen restrictions on China's access to advanced chip technology.\n\nPfizer  (NYSE:PFE) stock fell 2.6%, while German partner BioNTech (NASDAQ:BNTX) stock dropped 5.4% and rival  Moderna  (NASDAQ:MRNA) fell 4%, after the U.S. drugmaker slashed the sales forecast for its COVID vaccine and therapy last week.\n\nManchester United (NYSE:MANU) stock fell 11% after reports that British billionaire Jim Ratcliffe is looking to acquire only a 25% stake in the soccer club, raising concerns that a buyout by Qatar's Sheikh Jassim bin Hamad al Thani could be off the table.\n\nNovo Nordisk (NYSE:NVO) stock rose 0.1% after the drugmaker agreed to buy a hypertension drug from KBP Biosciences for up to $1.3 billion.\n\nLululemon (NASDAQ:LULU) stock rose 6.3% with the athleticwear company set to join the benchmark S&P 500 index on Wednesday, S&P Dow Jones Indices confirmed last week.\n\nDR Horton (NYSE:DHI) stock rose 2% after Goldman Sachs upgraded its stance on the housebuilder to ‘buy’ from ‘neutral’, while KB Home (NYSE:KBH) stock fell 2.1% as Goldman cut to ‘neutral’ from ‘buy’.\n\nRelated Articles\n\nApple, Nvidia and Pfizer fall premarket; Lululemon rises\n\nPfizer's foggy COVID outlook hits vaccine maker shares\n\nSociete Generale Contemplates Unit Sales as Part of New Strategy", "link": "https://finance.yahoo.com/news/apple-nvidia-pfizer-fall-premarket-080047489.html", "symbols": ["33L.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "BNTX.US", "DHI.US", "HO2.F", "KBH.US", "LULU.US", "MANU.US", "MRNA.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.807, "neg": 0.026, "neu": 0.919, "pos": 0.055}}, {"date": "2023-10-16T07:24:48+00:00", "title": "Top 7 Stocks to Consider as Virtual and Augmented Reality Take Center Stage Again", "content": "Virtual reality stocks flamed out beginning in late 2021, some very dramatically. 2022 was exceptionally tough on all things tech. Rate hikes prompted by rampant inflation caused a swift and about-face for a sector that had been red hot. The hype fell off a cliff, the reality of Fed rate hikes set in, and investor capital fled the sector en masse. Still, there’s still plenty of potential left in VR stocks for investors to consider.\n\nIf you’re thinking it should have been predictable, it wasn’t. Headlines celebrated the sector before it fell and an infamous rebrand only reinforced the idea that the metaverse was set to continue growing. Rate hikes are slowing now and there’s an end in sight. VR/AR/XR products are going to be released in the near future.\n\nThat means investors are again reexamining VR stocks and so should you.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nApple (AAPL)\n\nSource: askarim / Shutterstock\n\nApple (NASDAQ:AAPL) stock has performed very well in 2023. It hasn’t been due to VR in any direct way. Nor has it been due to growth. In fact, Apple continued to contract in its fiscal year Q3 overall.\n\niPhone sales are down which is a leading indicator that consumers simply don’t have as much money for expensive tech as they did in the recent past. That should dictate that AAPL shares fall in price. They haven’t. Apple is simply too big and important and has too many catalysts in its favor. Investors are giving Apple credit for all of it. That includes a burgeoning market in India where Apple is investing heavily. It also includes an increasing ability to derive more revenue from services. This makes it one of those VR stocks to consider.\n\nEven when Apple falters investors give it the benefit of the doubt. iPhone sales have inspired a cult-like following and that matters. VR matters too. Apple will release the Apple Vision Pro in the first quarter of 2024. It will cost $3,499. While that’s a lofty price, it isn’t expected to move the revenue needle much given sales projections. Instead, it gives Apple greater long-term potential in an exciting new sector.\n\nStory continues\n\nMeta Platforms (META)\n\nSource: Blue Planet Studio / Shutterstock.com\n\nI alluded to Meta Platforms’ (NASDAQ:META) rebrand in the introduction to this article. The stock gave a lot of pundits a lot to like when it ditched its Facebook moniker in late October of 2021.\n\nThe rebrand implied that growth initiatives were here to stay. Otherwise, what would give Facebook the confidence to abandon its brand for the Metaverse? You don’t give up the Facebook name without a firm belief that rates will remain low and growth high. The Meta Platforms rebrand was a screaming indication of that belief. It was also wrong. A few weeks later inflation data caught up to the markets. The realization that quantitative tightening was approaching swept over markets in mid-November. The newly renamed Meta Platforms tanked, Zuckerberg looked like a fool, and the metaverse fervor dissipated.\n\nAll things come and go. Meta Platforms has rebounded in 2023. The rebound is primarily attributable to its growing top-line and steady bottom-line performance. Reality Labs, its virtual reality segment, is only losing more and more money. It has sold a lot of headsets but struggles to retain customers. As VR comes back into focus that’s where Meta can make gains.\n\nQualcomm (QCOM)\n\nSource: Akshdeep Kaur Raked / Shutterstock.com\n\nLet me start by discussing Qualcomm (NASDAQ:QCOM) as a stock that is attractive in general. The company is an important chipmaker in the tech space and has forged important relationships with the world’s biggest companies. Apple among them. It’s going to continue to supply Apple with RF chips through 2026. That’s a big win because it provides a stable runway for the firm for several years.\n\nFurther, Qualcomm is simply stable overall. Not many other tech firms of its size provide a dividend that yields 2.9%. QCOM shares do and that dividend has grown since 2003. Investors should get the general sense that Qualcomm is stable. This stability may boost its attractiveness as one of those VR stocks.\n\nIn regard to virtual reality, Qualcomm is also notable. The company is developing VR glasses that will compete with the Apple Vision Pro in the near future. They’re not nearly as large and look like industrial safety glasses, not a massive headset. Overall, QCOM is a safe bet for tech exposure that includes virtual reality.\n\nUnity Software (U)\n\nSource: viewimage / Shutterstock.com\n\nA peak into Unity Software’s (NYSE:U) investor relations provides a lot of insight into the direction of the stock. It is heavily entrenched in the reemerging virtual reality opportunity.\n\nThe company released a beta program to allow developers to begin creating apps and games for the Apple Vision Pro in July. Unity developers are now creating VR experiences using VisionOS, Apple’s operating system for its headset.\n\nUnity has also set up a new division that will grant the broader virtual effects industry access to its Weta FX tools. Those tools were used in movies including Lord of the Rings and Avatar. The new division is making both 2D and 3D tools available to developers. That further confirms that Unity Software has established itself in the VR space.\n\nUnity Software continues to grow steadily and reached EBITDA profitability in Q4 of 2022. Net losses narrowed in H1 though still substantial. Those losses are likely to be a drag on U shares in this higher longer rate environment. That said, the overall picture is positive based on VR-related news and fundamental improvements.\n\nMatterport (MTTR)\n\nMatterport (NASDAQ:MTTR) stock is again becoming a relevant growth story in the virtual reality/digital twin space. The company sells 3D cameras and software that are used to create virtual models of buildings. It’s easy to imagine the overall utility and opportunity the company provides for investors as more and more spaces get mapped digitally.\n\nThat is actually precisely what’s occurring at the moment. Matterport is growing steadily and rapidly. Q2 revenues grew by 39% to $39.6 million. That’s great but not particularly compelling to investors because of the rates. The issue that holds MTTR stock lower at the moment is the fact that losses increased from $56.5 million to $64.6 million in Q2. The positive there is that losses grew at a lower rate than that by which revenues increased. In other words, Matterport could reasonably be expected to see losses begin to narrow in the future.\n\nIt has no problem selling its cameras and software. It has a cyclicality problem that will change in a year or so. It’s definitely one o those VR stocks to consider.\n\nAdobe (ADBE)\n\nSource: Tattoboo / Shutterstock\n\nAdobe (NASDAQ:ADBE) is another stock that’s heavily invested in virtual reality. It’s perhaps best known for tools like Acrobat but it is also a major visualization firm as evidenced by Photoshop’s dominance. Adobe’s presence in 2D digital visualization should make it unsurprising that the company is moving into 3D digital experiences as well.\n\nAbode Substance 3D is the company’s toolset for 3D and AR software. It supports 3D modeling of objects just as all other 3D visualization software does. It’s difficult to assert that Adobe is the clear winner in that regard as it remains early. However, it’s incontrovertible that Adobe just delivered record revenue in Q3. It also reported record digital media annual recurring revenue for within digital media. Adobe is capitalizing on the AI boom and the VR opportunity is yet to come.\n\nABDE shares are strong even though the company is part of a second tier of tech stocks that fall behind the likes of the ‘Magnificent 7’.\n\nNvidia (NVDA)\n\nSource: Evolf / Shutterstock.com\n\nNvidia (NASDAQ:NVDA), unsurprisingly, is also very useful for virtual reality. That, among many other strengths, continues to make the stock a strong overall pick.\n\nThere’s no definitive ‘best’ chip for VR. Everything depends upon end-use and budget. This guide lays out those options very thoroughly. Nvidia comes up again and again and that’s yet another reason that investors have to believe in its long-term value.\n\nIt’s tough to talk about Nvidia without mentioning AI. Its dominance in that sphere has propelled shares massively higher this year as generative AI has been commercialized. AI investment has cooled as the market is more fearful at the moment. However, Nvidia has done its part: It delivered revenues that far exceeded already sky-high estimates in Q2. Buy it for virtual reality because it’s strong there or buy it for AI because it dominates there. Nvidia simply remains a buy because it’s too difficult to argue against its overall strengths in this new era as AI emerges. Whichever way you cut it, this means it one of those VR stocks to pay attention to.\n\nOn the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nAlex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post Top 7 Stocks to Consider as Virtual and Augmented Reality Take Center Stage Again appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/top-7-stocks-consider-virtual-072448836.html", "symbols": ["AAPL.US", "ADB.F", "ADBE.US", "ADBE34.SA", "META.US", "MTTR.US", "NVDA.US", "QCI.F", "QCI.XETRA", "QCOM.MX", "QCOM.US", "U.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.045, "neu": 0.819, "pos": 0.135}}, {"date": "2023-10-16T00:00:00+00:00", "title": "What Nvidia, Intel, and AMD Stock Investors Should Know About Recent Top AI Updates", "content": "Could Advanced Micro Devices' recent acquisition be a red flag for Nvdia's software dominance?", "link": "https://www.fool.com/investing/2023/10/16/what-nvidia-intel-and-amd-stock-investors-should-k/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0, "neu": 0.743, "pos": 0.257}}, {"date": "2023-10-16T00:00:00+00:00", "title": "7 Cutting-Edge Stocks That Could Change Humanity as We Know It", "content": "Investors wanting exposure to companies whose technology is changing the world should consider these cutting-edge stocks.", "link": "https://investorplace.com/2023/10/7-cutting-edge-stocks-that-could-change-humanity-as-we-know-it/", "symbols": ["GOOG.US", "GOOGL.US", "ISRG.US", "LLY.US", "MSFT.US", "NVDA.US", "TSLA.US", "TSM.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-16T00:00:00+00:00", "title": "New Investor? Buy These 2 Growth Stocks", "content": "A strong foundation is critical for any portfolio, so beginners should look for great stocks to build with.", "link": "https://www.fool.com/investing/2023/10/16/new-investor-buy-these-2-growth-stocks/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0.727, "neg": 0.097, "neu": 0.591, "pos": 0.312}}, {"date": "2023-10-16T00:00:00+00:00", "title": "NVDA Stock: A Must-Buy for Risk-Takers or a Cautionary Tale?", "content": "Now, it seems like every company with the ability to use AI is looking to improve its efficiency. For the behind-the-scenes chip makers like Nvidia (NASDAQ:NVDA), it's expected that a majority of the spoils will be headed in this direction. That is, at least until competition for high-performance GPUs and AI software picks up. ", "link": "https://investorplace.com/2023/10/nvda-stock-a-must-buy-for-risk-takers-or-a-cautionary-tale/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0.893, "neg": 0, "neu": 0.791, "pos": 0.209}}, {"date": "2023-10-16T00:00:00+00:00", "title": "Buffett&#039;s Successors: 3 Stocks the Next Generation of Billionaires Are Buying", "content": "These Warren Buffett stocks are some of the best the market has to offer. The stocks on this list represent great value bargains.", "link": "https://investorplace.com/2023/10/buffetts-successors-3-stocks-the-next-generation-of-billionaires-are-buying/", "symbols": ["AAPL.US", "MSFT.US", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.893, "neg": 0, "neu": 0.651, "pos": 0.349}}, {"date": "2023-10-16T00:00:00+00:00", "title": "What to Know About the Latest China Chip Restrictions as the U.S. Cracks Down", "content": "News that the White House is planning to tighten China chip restrictions further is making waves in semiconductor stocks today.", "link": "https://investorplace.com/2023/10/what-to-know-about-the-latest-china-chip-restrictions-as-the-u-s-cracks-down/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-16T00:00:00+00:00", "title": "Want to Get Richer? 3 Best Stocks to Buy and Hold for the Next Decade", "content": "These stocks are well-positioned to grow at an impressive pace in the coming years.", "link": "https://www.fool.com/investing/2023/10/16/want-to-get-richer-3-best-stocks-to-buy-and-hold-f/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": 0.511, "neg": 0, "neu": 0.798, "pos": 0.202}}, {"date": "2023-10-15T22:37:08+00:00", "title": "Dow Jones Futures Rise As Market Rally Faces Key Test; Tesla Earnings Ahead", "content": "The Nasdaq and leading stocks suffered sharp losses late in the week, an expectation breaker for the market rally, Tesla headlines big earnings.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6b20481a-612e-357b-8f7c-112a0d9ef732/dow-jones-futures-rise-as.html", "symbols": ["DJI.INDX", "GSPC.INDX", "IXIC.INDX", "LAR.F", "LRCX.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.71, "neg": 0.204, "neu": 0.796, "pos": 0}}, {"date": "2023-10-15T20:33:00+00:00", "title": "Step Aside, Banks. Tesla and Netflix Earnings Are the Real Tests.", "content": "The Magnificent Eight punch well above their fundamental weight, thanks to premium valuation multiples.\n\nContinue reading", "link": "https://finance.yahoo.com/m/20209b29-6dc2-394c-841b-ecae461e0793/step-aside%2C-banks.-tesla-and.html", "symbols": ["GSPC.INDX", "NFC.F", "NFC.XETRA", "NFLX.MX", "NFLX.US", "NFLX34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.836, "neg": 0, "neu": 0.594, "pos": 0.406}}, {"date": "2023-10-15T16:00:00+00:00", "title": "Big Tech’s Profit Machine Is Propping Up S&amp;P 500 Earnings", "content": "(Bloomberg) -- With the list of stock-market worries growing seemingly by the day, investors looking to earnings season for a dose of good news are hanging their hopes on a familiar group: Big Tech.\n\nMost Read from Bloomberg\n\nIsrael Latest: Army Says Hamas Officials Dead; Over 600,000 in Gaza Flee South US Pushes to Contain Israel-Hamas War, Warns Iran About Escalation Israel Latest: Biden and Abbas Talk as Gaza Invasion Nears Global Markets Stable as US Pushes to Contain Middle East War Your Guide to Understanding the Roots of the Israel-Hamas War\n\nAfter slashing thousands of jobs to cut costs, the biggest US technology and internet companies are pumping out profits similar to those generated two years ago when the pandemic sent sales of digital services and electronic devices soaring. The expectation now is that they’ll help pick up the slack from industries like energy and health care that are still mired in an earnings slump.\n\nThe five biggest companies in the S&P 500 Index — Apple Inc., Microsoft Corp., Alphabet Inc., Amazon.com Inc. and Nvidia Corp. — account for about a quarter of the benchmark’s market capitalization. Their earnings are projected to jump 34% from a year earlier on average, according to analyst estimates compiled by Bloomberg Intelligence.\n\nThe S&P 500 as a whole isn’t looking nearly as strong. The index’s profits are expected to be roughly flat, but they’d face a drop of around 5% without those five behemoths.\n\n“It’s very important for the big tech stocks to deliver” and bolster confidence broadly, said Gary Bradshaw, a portfolio manager at Hodges Capital Management. “The Street expects earnings to be good across the board. Megacap tech stocks have whatever it takes to lead the market in the final quarter of the year.”\n\nLeading the Market\n\nSoaring interest rates have rattled markets this month with the 10-year Treasury yield hitting the highest in more than a decade. A hotter-than-expected inflation report has investors bracing for the Federal Reserve to keep policy tight, and potentially hike again. That backdrop has reignited fears about a potential recession that have only been heightened by conflict in the Mideast.\n\nStory continues\n\nTech stocks have faltered in the face of those headwinds, with the tech-heavy Nasdaq 100 tumbling for two straight months. But they’ve still hugely outperformed the overall market. The five key big-tech companies account for the bulk of the S&P 500’s 13% advance this year.\n\nNetflix Inc. and Tesla Inc. are scheduled to kick off tech-related earnings Wednesday. Alphabet, Microsoft, Amazon and Meta Platforms Inc. report the following week. Apple announces Nov. 2 and Nvidia on Nov. 21.\n\nAfter robust second-quarter earnings, “we need to see more of the same in the third-quarter results,” said Mike Bailey, director of research at FBB Capital Partners. Given their big weighting, “you can bet that the rest of the market will play follow the leader as big tech earnings unfold this quarter.”\n\nHe said he sees “fairly low odds of a tech earnings wreck this quarter.”\n\nInvestors have good reason to be optimistic. In the past century, the S&P 500 has rallied during reporting season about two-thirds of the time, data compiled by Bloomberg show.\n\nRoadblocks Ahead\n\nOne potential roadblock to an earnings-fueled rally is that a lot of the anticipated good news may be priced in. Alphabet and Amazon have gained more than 50% this year, while Apple and Microsoft have advanced nearly 40%.\n\nOn top of rising profit expectations, the stocks have benefited from bets that the tech giants are best positioned to capitalize on generative artificial intelligence. That’s despite Nvidia, whose shares have tripled this year, being the only one to show a substantial financial boost from the trend.\n\nA source of concern for investors is that even with recent declines, big tech’s stock-market valuations are still elevated. Apple and Microsoft are priced at about 27 and 29 times estimated earnings, respectively, well above averages over the past decade. That figure is around 18 for the S&P 500 as a whole.\n\nExpensive share prices put pressure on companies to deliver strong earnings, according to Kim Forrest, founder and chief investment officer at Bokeh Capital Partners.\n\n“They have to constantly deliver or they will lose the attention of investors,” she said in an interview. “Somebody needs to keep buying, and these rich valuations need to be justified.”\n\nMost Read from Bloomberg Businessweek\n\nWall Street’s Surprising Quest for Ways to Finance Coal Again The K-Pop Mogul Behind BTS Is Building the Next BTS Has Bob Iger Lost the Magic? Introducing The Businessweek Show With Max Abelson Pro-Putin Propaganda Flows Onto Android via Google Loophole\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/big-tech-profit-machine-propping-160000107.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "GSPC.INDX", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.057, "neu": 0.814, "pos": 0.129}}, {"date": "2023-10-15T16:00:00+00:00", "title": "Big Tech’s Profit Machine Is Propping Up S&amp;P 500 Earnings", "content": "(Bloomberg) -- With the list of stock-market worries growing seemingly by the day, investors looking to earnings season for a dose of good news are hanging their hopes on a familiar group: Big Tech.\n\nMost Read from Bloomberg\n\nIsrael Latest: Blinken Confident Border Will be Opened for Aid Israel Latest: Biden and Abbas Talk as Gaza Invasion Nears Your Guide to Understanding the Roots of the Israel-Hamas War US in Frantic Bid to Avert Wider Israel War After Iran Warning Stanford Suspends Teacher as Mideast Conflict Roils Campus\n\nAfter slashing thousands of jobs to cut costs, the biggest US technology and internet companies are pumping out profits similar to those generated two years ago when the pandemic sent sales of digital services and electronic devices soaring. The expectation now is that they’ll help pick up the slack from industries like energy and health care that are still mired in an earnings slump.\n\nThe five biggest companies in the S&P 500 Index — Apple Inc., Microsoft Corp., Alphabet Inc., Amazon.com Inc. and Nvidia Corp. — account for about a quarter of the benchmark’s market capitalization. Their earnings are projected to jump 34% from a year earlier on average, according to analyst estimates compiled by Bloomberg Intelligence.\n\nThe S&P 500 as a whole isn’t looking nearly as strong. The index’s profits are expected to be roughly flat, but they’d face a drop of around 5% without those five behemoths.\n\n“It’s very important for the big tech stocks to deliver” and bolster confidence broadly, said Gary Bradshaw, a portfolio manager at Hodges Capital Management. “The Street expects earnings to be good across the board. Megacap tech stocks have whatever it takes to lead the market in the final quarter of the year.”\n\nLeading the Market\n\nSoaring interest rates have rattled markets this month with the 10-year Treasury yield hitting the highest in more than a decade. A hotter-than-expected inflation report has investors bracing for the Federal Reserve to keep policy tight, and potentially hike again. That backdrop has reignited fears about a potential recession that have only been heightened by conflict in the Mideast.\n\nStory continues\n\nTech stocks have faltered in the face of those headwinds, with the tech-heavy Nasdaq 100 tumbling for two straight months. But they’ve still hugely outperformed the overall market. The five key big-tech companies account for the bulk of the S&P 500’s 13% advance this year.\n\nNetflix Inc. and Tesla Inc. are scheduled to kick off tech-related earnings Wednesday. Alphabet, Microsoft, Amazon and Meta Platforms Inc. report the following week. Apple announces Nov. 2 and Nvidia on Nov. 21.\n\nAfter robust second-quarter earnings, “we need to see more of the same in the third-quarter results,” said Mike Bailey, director of research at FBB Capital Partners. Given their big weighting, “you can bet that the rest of the market will play follow the leader as big tech earnings unfold this quarter.”\n\nHe said he sees “fairly low odds of a tech earnings wreck this quarter.”\n\nInvestors have good reason to be optimistic. In the past century, the S&P 500 has rallied during reporting season about two-thirds of the time, data compiled by Bloomberg show.\n\nRoadblocks Ahead\n\nOne potential roadblock to an earnings-fueled rally is that a lot of the anticipated good news may be priced in. Alphabet and Amazon have gained more than 50% this year, while Apple and Microsoft have advanced nearly 40%.\n\nOn top of rising profit expectations, the stocks have benefited from bets that the tech giants are best positioned to capitalize on generative artificial intelligence. That’s despite Nvidia, whose shares have tripled this year, being the only one to show a substantial financial boost from the trend.\n\nA source of concern for investors is that even with recent declines, big tech’s stock-market valuations are still elevated. Apple and Microsoft are priced at about 27 and 29 times estimated earnings, respectively, well above averages over the past decade. That figure is around 18 for the S&P 500 as a whole.\n\nExpensive share prices put pressure on companies to deliver strong earnings, according to Kim Forrest, founder and chief investment officer at Bokeh Capital Partners.\n\n“They have to constantly deliver or they will lose the attention of investors,” she said in an interview. “Somebody needs to keep buying, and these rich valuations need to be justified.”\n\nMost Read from Bloomberg Businessweek\n\nThe K-Pop Mogul Behind BTS Is Building the Next BTS Introducing The Businessweek Show With Max Abelson Has Bob Iger Lost the Magic? Pro-Putin Propaganda Flows Onto Android via Google Loophole The War in Israel Shows How Social Media’s Idealistic Era Has Ended\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/big-tech-profit-machine-propping-160000361.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "GSPC.INDX", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.064, "neu": 0.806, "pos": 0.13}}, {"date": "2023-10-15T15:36:54+00:00", "title": "Forget FAANG, These Are the 3 Tech Stocks to Buy for 2025 and Beyond", "content": "Despite risks from the Israel-Hamas conflict, U.S. Treasury Secretary Janet Yellen’s expectation of a soft landing for the country’s economy bodes well for the stock market. Driven by a resilient labor market and moderated wage pressure, this promises favorable conditions for businesses and investors. A strong labor market, consumer spending and controlled inflation will boost investors confidence and contribute to potential stock market growth. This outlook underscores the importance of stability and measured growth in fostering a robust and resilient economic environment. These three tech stocks to buy will benefit from the economic environment through 2025 and beyond as they are poised for long-term growth.\n\nLi Auto (LI)\n\nSource: Robert Way / Shutterstock.com\n\nLi Auto (NASDAQ:LI) is a Chinese producer and distributor of plug-in hybrid electric vehicles. It currently sells three main vehicles: the LV family-sized SUV, and the L8 and L9 crossover SUVs.\n\nLI stock is up 63.49% YTD and has been maintaining its spectacular growth. The company’s revenue has been outstanding. Revenue of $28.65 billion grew 228.11% YoY and beat analyst expectations by 5.14%. A diluted EPS of $2.18 grew 440.63% YoY which beat analyst expectations by 84.77%. Its strong financial growth is apparent in its 8.00% net profit margin and net income of $2.29 billion.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLi Auto’s competitive advantage in the Chinese EV market lies in its impressive production ramp-up. Li Auto’s deliveries surged by 177% in 2021, and increased by 47% in 2022, totalling 133,246 vehicles. Despite supply chain challenges, including shifting consumer demand and environmental regulations, Li Auto achieved a remarkable 66% year-over-year delivery growth in Q1 2023.\n\nNotably, while its competitor, Nio (NYSE:NIO), faced a challenging first quarter that ended with a narrow vehicle margin of just 5.1%, Li Auto maintained a robust vehicle margin of 19.8%. This underscores the company’s ability to navigate industry challenges and maintain profitability in a competitive landscape.\n\nStory continues\n\nYahoo! Financereports 23 analysts having a 12-month mean price target of $53.04 on LI stock, with the range spanning from as low as $34.99 to as high as $73.08. LI stock should continue to grow as one of the more fascinating tech stocks to buy in the long term.\n\nSoFi Technologies (SOFI)\n\nSource: shutterstock.com/rafapress\n\nSoFi Technologies (NASDAQ:SOFI) is an online personal finance company that offers financial services such as borrowing, saving and investing.\n\nSOFI stock is up over 80% YTD, trading at $8.12. Yahoo! Finance analysts forecast a price target ranging from $8.00 to $16.00, reflecting an upside of 0% to 100%. Additionally, analysts estimate a growth of 120% in the next year.\n\nSoFi’s market capitalization increased from $4.28 billion in September 2022 to $7.77 billion in 2023, increasing investor interest. Institutional holdings represent 35.51% of SoFi’s shares, indicating confidence among professional investors. Additionally, the company’s 52-week change of 64.57% outpaces the S&P 500’s52-week change of 21.84%.\n\nSoFi positioned itself as an attractive option for younger millennial and Gen Z bank users. This is a promising accomplishment, as Gen Z is the largest group of investors looking to invest more despite inflation. SoFi’s appeal lies in its low fees, competitive rates and user-friendly apps. With a national bank charter, the company can engage with younger consumers as a legitimate financial institution. They also offer a wide range of value-added services that should draw more youthful bankers and their capital.\n\nSoFi Technologies’ appeal to younger generations, positions it for substantial growth in 2025. Particularly, with a focus on attracting younger consumers and offering value-added services, SOFI presents an attractive investment opportunity in tech stocks to buy.\n\nNvidia (NVDA)\n\nSource: Below the Sky / Shutterstock.com\n\nNvidia (NASDAQ:NVDA) is a world-renowned American-based technology corporation focused on the production of computer graphics cards.\n\nNVIDIA boasts a 221% YTD stock growth, currently priced at $460.01. Yahoo! Financereports 45 analysts having a 1-year mean price target of $634.17, with the range spanning from as low as $439.00 to as high as $1,100.00.\n\nAt the end of the current January 2024 FY, NVIDIA is set to bring in $52 billion in revenue. That’s close to twice the $27 billion in revenue cultivated in the previous fiscal year. Current shareholders have earned roughly a 38% CAGR over the past 5 years and are expected to earn upwards of 44% CAGR in the next 5 years.\n\nNVIDIA’s impressive growth can be directly attributed to the company’s strong leadership in AI technology, as exemplified by its cutting-edge products such as GPUs and deep learning platforms. This dominance extends across critical industries such as gaming, data centers and autonomous vehicles. The company’s commitment to innovation ensures its status as a preeminent and highly profitable entity within its industries. NVIDIA’s stock value is sure to trend upward, making it an attractive investment option for those seeking to benefit from the company’s consistent and robust performance. Its cutting edge product offerings are exploding in growth, securing NVDA’s place among the tech stocks to buy.\n\nOn the date of publication, Michael Que did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nThe researchers contributing to this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article.\n\nMichael Que is a financial writer with extensive experience in the technology industry, with his work featured on Seeking Alpha, Benzinga and MSN Money. He is the owner of Que Capital, a research firm that combines fundamental analysis with ESG factors to pick the best sustainable long-term investments.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The #1 AI Investment Might Be This Company You’ve Never Heard Of The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post Forget FAANG, These Are the 3 Tech Stocks to Buy for 2025 and Beyond appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/forget-faang-3-tech-stocks-153654184.html", "symbols": ["LI.US", "NIO.US", "NVDA.US", "SOFI.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.023, "neu": 0.816, "pos": 0.161}}, {"date": "2023-10-15T15:35:08+00:00", "title": "Dow Jones Futures Due: Market Rally Faces Key Test; Tesla Earnings Ahead", "content": "The Nasdaq and leading stocks suffered sharp losses late in the week, an expectation breaker for the market rally, Tesla headlines big earnings.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6b20481a-612e-357b-8f7c-112a0d9ef732/dow-jones-futures-due%3A-market.html", "symbols": ["DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.71, "neg": 0.204, "neu": 0.796, "pos": 0}}, {"date": "2023-10-15T12:15:00+00:00", "title": "1 Artificial Intelligence (AI) Stock to Buy Now That Could Soar Like Nvidia", "content": "With its shares up 245% year to date, Super Micro Computer (NASDAQ: SMCI) is one of the few tech stocks that has outperformed Nvidia (NASDAQ: NVDA) (up 211%) in 2023. What is Super Micro Computer? Founded in 1993, Super Micro is a California-based hardware company specializing in energy-efficient computer servers and storage systems for enterprise clients.\n\nContinue reading", "link": "https://finance.yahoo.com/m/0242d12c-48fd-3213-8232-b30faa40df08/1-artificial-intelligence.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "SMCI.US"], "tags": [], "sentiment": {"polarity": 0.931, "neg": 0, "neu": 0.792, "pos": 0.208}}, {"date": "2023-10-15T12:10:08+00:00", "title": "Dow Jones Futures Due: What To Do After Market Breaks Expectations; Tesla Earnings Ahead", "content": "The Nasdaq and leading stocks suffered sharp losses late in the week, an expectation breaker for the market rally, Tesla headlines big earnings.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6b20481a-612e-357b-8f7c-112a0d9ef732/dow-jones-futures-due%3A-what.html", "symbols": ["DJI.INDX", "GSPC.INDX", "IXIC.INDX", "LAR.F", "LRCX.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.71, "neg": 0.204, "neu": 0.796, "pos": 0}}, {"date": "2023-10-15T09:10:00+00:00", "title": "Investors Should Be Following This 1 Development, Which Could Be Like Kryptonite for Nvidia", "content": "The business applications for generative AI are still emerging, but the ability to summarize emails and draft responses, generate presentations from existing information, and automate repetitive tasks has the potential to yield vast productivity gains. The latest developments in generative AI have business leaders scrambling to adopt and integrate this next-generation technology. One of the primary beneficiaries of the exploding AI use is Nvidia (NASDAQ: NVDA).\n\nContinue reading", "link": "https://finance.yahoo.com/m/c23b1e25-526e-3d4d-8873-5000a9bb7191/investors-should-be-following.html", "symbols": ["2330.TW", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TSFA.F", "TSFA.STU", "TSM.US", "TSMC34.SA", "TSMN.MX"], "tags": [], "sentiment": {"polarity": 0.852, "neg": 0.032, "neu": 0.815, "pos": 0.153}}, {"date": "2023-10-15T00:00:00+00:00", "title": "Forget FAANG, These Are the 3 Tech Stocks to Buy for 2025 and Beyond", "content": "These tech stocks are the ones to buy in on for long term growth based on its innovations in research and development.", "link": "https://investorplace.com/2023/10/forget-faang-these-are-the-3-tech-stocks-to-buy-for-2025-and-beyond/", "symbols": ["LI.US", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0, "neu": 0.89, "pos": 0.11}}, {"date": "2023-10-15T00:00:00+00:00", "title": "Investors Should Be Following This 1 Development, Which Could Be Like Kryptonite for Nvidia", "content": "China's new export restrictions could ultimately spell trouble for the chipmaker.", "link": "https://www.fool.com/investing/2023/10/15/investors-should-be-following-this-1-development-w/", "symbols": ["NVDA.US"], "tags": [], "sentiment": {"polarity": -0.402, "neg": 0.213, "neu": 0.787, "pos": 0}}]