[{"date": "2023-08-21T23:43:35+00:00", "title": "Want to Get Rich? 3 Game-Changing Biotech Stocks to Buy Right Now", "content": "Biotech stocks may offer some of the most explosive opportunities on the market. For one, we have millions of baby boomers demanding better care. Two, there’s substantial demand for new innovative therapies, especially with gene editing. Three, multiple heavyweight companies are hunting for new drugs to keep their pipelines fresh with patent expirations nearing.\n\nEven better, according to The Wall Street Journal, biotech M&A is gaining big momentum. All because drug makers are facing a patent cliff. Plus, biotech stock valuations are exceptionally low, making many of them attractive.\n\nWe also have to consider biotech stocks are relatively recession resistant. All because millions of people will always need care. That being said, investors may want to focus on biotech stocks, including these potential game-changers with strong catalysts.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nApellis Pharmaceuticals (APLS) A close-up of someone's eye\n\nSource: Shutterstock\n\nWeakness may be an opportunity for Apellis Pharmaceuticals (NASDAQ:APLS), whose eye-disease drug, Syfovre is the first US FDA-approved treatment for geographic atrophy. Granted, the stock was recently halved after six recipients of Syfovre said they experienced inflammation in their eyes. However, most of the negativity has been priced into the stock.\n\nPlus, analysts have been coming out in support of the company. For example, Plus, according to STATNews.com, “the passing of more ‘clean’ days and weeks while the total number of eye injections continues to add up makes it more likely the scare will dissipate and strong demand for Syfovre will return.” Even better, with recent weakness – and a potential game-changing eye drug – APLS could be a potential acquisition target – especially for companies with patent cliffs nearing.\n\nRecursion Pharmaceuticals (RXRX) Recursion Pharmaceuticals (RXRX) website displayed on a modern smartphone\n\nSource: Piotr Swat / Shutterstock.com\n\nThe last time I mentioned Recursion Pharmaceuticals (NASDAQ:RXRX), it traded around $10.75 on Aug. 8. While the stock dipped to about $8.58 following that note, there’s still a lot to like here.  Remember, Nvidia (NASDAQ:NVDA) recently invested $50 million in the company to work on drug development using artificial intelligence.\n\nStory continues\n\nWith Nvidia’s help, Recursion can accelerate AI software that can identify relationships between trillions of genes and compounds. All in an effort to treat issues we never thought could be treated.\n\nIn addition, Recursion is also working on potential treatments for cerebral cavernous malformations, neurofibromatosis, familial adenomatous polyposis, mutant cancers, ovarian cancers, and cancer immunotherapy. If RXRX AI efforts can create treatments for issues such as cancer, the stock may never be as cheap as it is now.\n\nDeciphera Pharmaceuticals (DCPH) pharmaceutical industry. Production line machine conveyor with glass bottles ampoules at factory\n\nSource: Dmitry Kalinovsky / Shutterstock.com\n\nAlso, take a look at Deciphera Pharmaceuticals (NASDAQ:DCPH), which could see higher highs. For one, the company just reported second-quarter earnings per share (EPS) loss of $48.6 million, or 57 cents a share. That was an earnings beat by five cents.  It also posted revenues of $38.3 million, which beat expectations by $1.98 million.\n\nTwo, its lead therapy Qinlock (ripretinib), which was approved for gastrointestinal stromal tumors (GISTs), just saw $37.3 million in product revenue, an 18% jump year over year. Three, DCPH just began another Phase 3 study for patients with advanced GIST.\n\nIt also expects to post Phase 3 trial results on its vimseltinib treatment for tenosynovial giant cell tumor (TGCT) in the last quarter of the year. Another treatment in trials is DC-3116 for several types of cancer.  At the moment, DC-3116 is in Phase 1 trials. Analysts at Stifel just upgraded the DCPH stock to a buy rating with a $20 price target. “Despite a significant ~40% drop from its 2023 peak, the continuous expansion of Qinlock’s core business, the prospective commercial roll-out of vimseltinib, and potential long-term gains from Qinlock label enhancements are encouraging signs,” said the firm, as quoted by WeBull.com.\n\nOn the date of publication, Ian Cooper did not hold (either directly or indirectly) any positions in the securities mentioned. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nIan Cooper, a contributor to InvestorPlace.com, has been analyzing stocks and options for web-based advisories since 1999.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post Want to Get Rich? 3 Game-Changing Biotech Stocks to Buy Right Now appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/want-rich-3-game-changing-234335356.html", "symbols": ["APLS.US", "D05.F", "DCPH.US", "NVDA.US", "RXRX.US"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.051, "neu": 0.84, "pos": 0.109}}, {"date": "2023-08-21T22:50:08+00:00", "title": "Why Nvidia Stock Is the Key to the Stock Market's Future: NVDA Earnings Preview, Price Targets, and Analysis", "content": "The fate of the stock market relies on Nvidia (NASDAQ: NVDA) earnings this week. In the video below, Fool.com contributor and 25-year stock market veteran Eric Cuka breaks down NVDA stock and provides price targets, valuation metrics, predictions, technical analysis, commentary, and more.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4d45be07-777a-303a-82a0-6ab3b9eef2df/why-nvidia-stock-is-the-key.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-21T22:49:13+00:00", "title": "Asian stocks rise as tech strength helps offset U.S. rate fears", "content": "Investing.com -- Most Asian stocks rose on Tuesday, buoyed by a recovery in technology stocks ahead of key earnings from Nvidia Corp (NASDAQ:NVDA), although concerns over rising U.S. interest rates and slowing Chinese growth held back bigger gains.\n\nWhile Wall Street indexes ended lower overnight, the technology sector saw strong gains ahead of closely-watched earnings from Nvidia on Wednesday. Anticipation of the Nvidia results also spurred positioning in stocks exposed to the world’s most valuable chipmaker.\n\nFocus this week will largely be on whether the chipmaker benefited as forecast from an artificial intelligence boom- a trend that is likely to benefit Asian chip stocks that supply to the firm.\n\nBut concerns over slowing growth in China, especially after a disappointing interest rate cut by the People’s Bank on Monday, still weighed on sentiment.\n\nAn overnight spike in U.S. Treasury yields, ahead of the Jackson Hole Symposium this week, also kept traders wary.\n\nTech stocks, chipmakers gain ahead of Nvidia results\n\nJapan’s Nikkei 225 index was the best performer in Asia for the day, rising 0.8%, while the broader TOPIX added 0.6%.\n\nSemiconductor testing equipment maker Advantest Corp (TYO:6857), which is an Nvidia supplier, surged over 4% and was the best performer on the Nikkei. Tech conglomerate SoftBank Group Corp (TYO:9984) - which also has chipmaking exposure through its Arm unit, jumped over 2%.\n\nIn addition to the tech gains, sentiment towards Japan was also buoyed by a strong earnings season. Analysis from Japanese news agency Nikkei showed that top listed companies in Japan were headed for a third straight year of record profits, thanks to higher prices and continued monetary stimulus from the Bank of Japan.\n\nAmong other major Asian tech firms, Taiwan Semiconductor Manufacturing (TW:2330) (NYSE:TSM) added 0.6%, while South Korea’s KOSPI rose 0.6% on gains in chipmakers Samsung Electronics (KS:005930) and SK Hynix Inc (KS:000660).\n\nStory continues\n\nFutures for India’s Nifty 50 index were flat, although heavyweight Indian tech stocks are expected to track gains in their U.S. peers.\n\nChinese stocks recover, but outlook uncertain\n\nChina’s Shanghai Shenzhen CSI 300 and Shanghai Composite indexes added about 0.2% each, while Hong Kong’s Hang Seng index rose 0.4% on strength in heavyweight technology stocks.\n\nAll three indexes were trading close to their weakest levels for the year, after doubts over a Chinese economic recovery were intensified by a disappointing interest rate cut from the People’s Bank on Monday.\n\nThe move pointed to limited monetary support for the Chinese economy, as it struggles with its worst growth rate in years.\n\nConcerns over China weighed on Australia’s ASX 200, with miner BHP Group Ltd (ASX:BHP), the biggest stock on the index, down 1.3% after it reported a weak annual profit on sluggish Chinese demand.\n\nRelated Articles\n\nAsian stocks rise as tech strength helps offset U.S. rate fears\n\nUS court rejects investor lawsuit against Boeing supplier Spirit AeroSystems\n\nNewmont gets Aussie regulatory nod for $16.8 billion Newcrest deal", "link": "https://finance.yahoo.com/news/asian-stocks-rise-tech-strength-224913776.html", "symbols": ["HSI.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TSM.US"], "tags": [], "sentiment": {"polarity": 0.838, "neg": 0.098, "neu": 0.768, "pos": 0.134}}, {"date": "2023-08-21T21:40:00+00:00", "title": "Analysts expect fireworks when Nvidia reports earnings", "content": "Wall Street expects big news from the Godfather of AI when it reports quarterly financials on August 23.\n\nContinue reading", "link": "https://finance.yahoo.com/m/2ffe2cb9-0c23-3b8c-baa8-94791ce49e3b/analysts-expect-fireworks.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-21T21:20:38+00:00", "title": "S&amp;P 500 Gains and Losses Today: Tech Stocks Lead Index Higher", "content": "The S&P 500 posted a 0.7% gain to start the trading week on Monday, Aug. 21, 2023, boosted by strong performance from technology stocks.\n\nContinue reading", "link": "https://finance.yahoo.com/m/40c68b6d-7462-37da-9035-a15d28b28bcd/s%26p-500-gains-and-losses.html", "symbols": ["0QF.F", "5AP.F", "GSPC.INDX", "MRNA.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US"], "tags": [], "sentiment": {"polarity": 0.848, "neg": 0, "neu": 0.705, "pos": 0.295}}, {"date": "2023-08-21T21:07:26+00:00", "title": "Nvidia bulls pile in after HSBC raises price target", "content": "Shares of Nvidia were up Monday after HSBC analysts lifted the chipmaker’s price target on an increasing sales forecast for fiscal 2024.\n\nResearchers are raising their price target from $600 to $780 based on bullish predictions for Nvidia AI data center sales and a significant quarter-over-quarter spike of roughly 29% on $19.4 billion in total sales for fiscal 2024. Consensus estimates have total sales near $13.7 billion.\n\nHSBC also revised its earnings per share (EPS) estimates of 19% and 29%, which are now 21% and 23% above consensus estimates.\n\nNVIDIA ANNOUNCES NEW CHIP TO POWER AI MODELS, REDUCE COSTS A Nvidia Corp. chip during the Taipei Computex expo in Taipei, Taiwan, May 29, 2023.\n\nOn Wall Street, shares of Nvidia have risen around 48% the last quarter and nearly 216% since Jan. 1. Over the last five days, shares of the chipmaker are almost 5.9% higher.\n\nThe rapid advance of artificial intelligence applications fueled much of Nvidia's stock growth throughout the year, pushing its market capitalization over $1 trillion.\n\nREAD ON THE FOX BUSINESS APP\n\nWHAT IS ARTIFICIAL INTELLIGENCE (AI)?\n\nGLOBAL INVESTMENT IN AI COULD NEAR $200 BILLION BY 2025: GOLDMAN SACHS\n\n\"We see Nvidia likely to beat its previous guidance as our fiscal year 2024 sales now up 9% ahead of consensus estimate and company guidance,\" HSBC analyst Frank Lee wrote. The logo of Nvidia Corporation is seen during the annual Computex computer exhibition in Taipei, Taiwan May 30, 2017.\n\nSURGING DEMAND FOR AI CREATING SHORTAGE OF HIGH-POWERED CHIPS\n\n\"Another potential bull case scenario for Nvidia involves the product mix toward more downstream businesses such as its system product line up.\"\n\nLast week, Nvidia shares reached their highest mark of 2023 after HSBC analysts changed their recommendation from \"reduce\" to \"buy\" amid increasing opportunities in artificial intelligence.", "link": "https://finance.yahoo.com/news/nvidia-bulls-pile-hsbc-raises-210726666.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.973, "neg": 0.016, "neu": 0.883, "pos": 0.102}}, {"date": "2023-08-21T20:50:03+00:00", "title": "GLOBAL MARKETS-US yields hit decade highs; European shares and Nasdaq rise", "content": "*\n\nEuropean stocks gain after last week's drop\n\n*\n\nBond yields rising again ahead of Fed's Jackson Hole event\n\n*\n\nNasdaq rises with traders eyeing Nvidia earnings\n\n(Recasts first paragraph; updates prices throughout, including closing prices for U.S. stocks, oil and gold)\n\nBy Chris Prentice and Yoruk Bahceli\n\nNEW YORK, Aug 21 (Reuters) - U.S. Treasury yields rose to decade highs, European equities recovered from a six-week low and the Nasdaq jumped more than 1% on Monday as investors awaited a Federal Reserve meeting on Friday at Jackson Hole, Wyoming.\n\nWall Street trading was mixed, with the Dow Jones Industrial and the S&P 500 giving back early gains while the tech-heavy Nasdaq Composite rose on earnings optimism.\n\nBenchmark oil futures finished lower after rallying more than $1 a barrel, as hopes for Chinese demand faded.\n\nThe Dow Jones Industrial Average fell 36.97 points, or 0.11%, to 34,463.69, the S&P gained 30.06 points, or 0.69%, to 4,399.77 and the Nasdaq gained 206.81 points, or 1.56%, to 13,497.59.\n\nNvidia led gains among semiconductor stocks as HSBC raised its target prices on the stock.\n\nEarnings on Wednesday will be another major test of valuations.\n\n\"Wall Street is having a hard time deciding what to do with stocks,\" said Edward Moya, senior market analyst with OANDA. \"Everyone is expecting an impact from the surge in yields, but it seems like tech companies have held up. Nvidia is going to be key.\"\n\nThe pan-European STOXX 600 ended higher, after rising as much as 0.9% intraday, recovering from Friday's six-week low. Energy and mining sectors gained, tracking higher crude oil and metals prices.\n\nGermany's DAX rose 0.2% even as official data showed a higher-than-expected fall in German producer prices in July.\n\nAdyen slumped 8.6% as two brokerages downgraded the Dutch digital payments firm's stock after the company missed half-year expectations on Aug. 17.\n\nLonger-dated U.S. Treasury yields were up, with the 30-year yield hitting 4.474%, its highest since April 2011. Bond yields move inversely with prices.\n\nStory continues\n\nThe 10-year Treasury hit 4.354%, the highest since November 2007 - before the collapse of Lehman Brothers almost a year later fully ushered in the Great Financial Crisis.\n\n\"People are starting to get worried about the (bond) selloff and are looking ahead to (Federal Reserve Chair Jerome) Powell and what he says later this week about peak rates,\" said Principal Global Investors' chief global strategist, Seema Shah.\n\nThe key event for the week is the Fed's Jackson Hole conference, where markets assume Powell will note the jump in yields and the recent run of strong economic data. The Atlanta Fed's GDP Now tracker is running at a heady 5.8% for this quarter.\n\nA majority of polled analysts think the Fed is done hiking, while traders are betting on a 40% chance of a final Fed hike by November.\n\nCHINA'S CENTRAL BANK SURPRISES\n\nDisappointment earlier weighed on Asian shares.\n\nChina's central bank trimmed its one-year lending rate by 10 basis points and left its five-year rate unmoved. That was a surprise to analysts who had expected cuts of 15 bps to both as recovery in the world's second-largest economy has lost steam due to a worsening property slump, weak spending and tumbling credit growth.\n\n\"The small injection of stimulus by China's central bank in the ailing economy has proved largely underwhelming given the scale of the challenges erupting across sectors, but it has given investors hope there could be more to come,\" said Susannah Streeter, head of money and markets at Hargreaves Lansdown.\n\nAnalysts said concern around downward pressure on the yuan, which has lost nearly 6% against the dollar this year, is likely limiting the size and scope of rate cuts.\n\nThe European single currency was up 0.2% on the day at $1.0892, while the dollar index, which tracks the greenback against a basket of currencies of other major trading partners, was down at 103.35 by 4:19 p.m. ET (2019 GMT).\n\nIn commodities, Brent crude futures settled down 34 cents at $84.46, a loss of 0.4%. U.S. West Texas Intermediate crude finished at $80.72 a barrel for a loss of 53 cents or 0.65%.\n\nSpot gold prices rose 0.32% to $1,894.19 an ounce.\n\n(Reporting by Yoruk Bahceli and Wayne Cole, additional reporting by Dhara Ranasinghe; Editing by David Evans, Mark Potter, Will Dunham and Nick Macfie)", "link": "https://finance.yahoo.com/news/global-markets-us-yields-hit-205003180.html", "symbols": ["DJI.INDX", "GDAXI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": -0.936, "neg": 0.094, "neu": 0.825, "pos": 0.081}}, {"date": "2023-08-21T20:46:04+00:00", "title": "Nvidia 'in the driver's seat' when it comes to AI: Analyst", "content": "Nvidia (NVDA) has cornered the market on artificial intelligence, according to Bernstein Research Managing Director and Senior Analyst Stacy Rasgon. When asked by Yahoo Finance Live about concerns there could be a bubble forming in AI, Rasgon says the fact that demand is so strong and supply is so tight, you could get worries about an air pocket.\"\n\nVideo Transcript\n\n- So Nvidia is far and above the leader when it comes to AI. Do they kind of have the market basically cornered in this area?\n\nSTACY RASGON: Yeah, I mean, right now look, so there's only a couple of companies-- there's a lot of companies out there that have like an AI narrative about them. There's only actually two that are showing real actual dollars right now. It's Nvidia and Broadcom, and that's about it.\n\nAnd Nvidia is like here, and then you've got everybody else, which is like pretty far below. So they do kind of have it quartered right now. There are other players that are trying to develop products for this market. You've got like, AMD there's a story as they get into next year and they have other products that are there.\n\nAnd you've got Intel and you've got some others that are trying to do this. You also have some of their large hyperscale customers like the Google's and the Amazons of the world that are building their own chips, which is not new. They've been doing their own chips for many, many years. But you have that aspect as well. But in terms of benefiting from the swell of demand that has occurred with AI probably since the beginning of this year, it really is Nvidia that is in the driver's seat.\n\n- And the hype that's surrounding Nvidia largely began around their previous earnings announcements where they just announced this guidance that blew past analyst expectations. And I believe your firm has done an analysis whereby their four biggest customers could easily deliver that guidance. And so anything else, presumably would be gravy.\n\nSTACY RASGON: Well, so you're right. So last quarter's guidance was pretty astonishing. I had to look at the number twice. I couldn't register in my brain, and I've been doing this job a fairly long time.\n\nStory continues\n\nI've never seen a guide like that from an established like, at-scale company like we saw. So that was pretty unbelievable. If you do the math, so they're guiding total revenues, and again, I think, expectations are that they'll do better than this. But they're guiding total revenues at about $11 billion for this quarter.\n\nIf you work through it, the implied guidance for data center this quarter is about 8 billion, which is roughly a $4 billion incremental data center growth this quarter versus last quarter. If you sort of do the math on some of the larger hyperscale customers, and they've all guided CapEx, the CapEx increases from four of them would be enough to account for that $4 billion incremental. There are clearly lots of other customers besides those four that are buying these parts. But I think that the companies like at least implied guidance the way they laid it out for this quarter is easily doable given what we've seen in the supply chain and given their customer demand.\n\n- So there's been a little bit of talk about this, not much yet because given the early days about the potential for a bubble, an AI bubble. I don't know that we would say that Nvidia is there. Is there the potential for that? And how long-- what's the kind of trajectory for that, if there is?\n\nSTACY RASGON: So at some point, yeah. So I mean, right now, demand is off the charts, but again supply is very limited. So customers can't get what they want. And there's a general behavior that happens in semiconductors and lots of other places, it's called double ordering. When people can't get what they want, they order more.\n\nThis is the toilet paper situation from like, 2020. It's the same kind of dynamic. And that sort of thing, like forget Nvidia for a minute, just in general, that sort of behavior happens. And so the fact that demand is so strong and supply is so tight right now, you could potentially worry about an air pocket or something.\n\nAnd with Nvidia, that's one of the primary controversies is is this new level of demand that we see, is that sort of the new baseline for growth? Or is it like pull forward and panic buying and is there an air pocket? And look, at some point, what is the chance that Nvidia will see an air pocket?\n\nIt's probably 100%. We've seen them before. We'll see it again. I mean, look, the stock may have a 50% drawdown in it again at some point. We've seen those before.\n\nIt might be $1,000 to 500, like, I don't know. We'll see it. Am I worried about an air pocket like right now? Absolutely not, like, they're certainly not going to see one this year.\n\nMy guess is even next year is just fine, like, calendar 25, like, by the time we get there, maybe we'll know a little more. But like, I guess, we'll worry about that a little when we get a little closer. And frankly, the actual run rate that we could be seeing by the time we get there could be materially higher than what we see.\n\nAnd I will say along those lines, if I'm looking at five years or 10 years, I'm convinced that we'd be talking numbers of that point that are materially higher than what we are talking about today. We are still very early in this whole thing, like, ChatGPT and all this other stuff that's gotten people excited, it's only been here since November. It's less than a year. We are very early on the whole progress of the AI cycle.\n\nThey'll probably overshoot. They'll probably undershoot. This is semiconductors. This is why we get cycles in the industry. I'm not worried about at least the next 12 to 18 months, maybe even longer, I think, we're OK.", "link": "https://finance.yahoo.com/video/nvidia-drivers-seat-comes-ai-204604880.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AVGO.US", "AVGO34.SA", "GOGL34.SA", "GOGL35.SA", "GOOG.MI", "GOOG.MX", "GOOG.US", "GOOGL.US", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "MSF.F", "MSF.XETRA", "MSFT.MX"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.036, "neu": 0.874, "pos": 0.089}}, {"date": "2023-08-21T20:42:19+00:00", "title": "Dow Jones Futures: Nvidia, Tesla Boost Stock Market Rally Attempt; What To Do Now", "content": "Dow Jones futures: The stock market rally attempt received a boost Monday. Tesla surged, while Nvidia earnings and Fed Chair Powell's speech loom.\n\nContinue reading", "link": "https://finance.yahoo.com/m/8d0bece3-058e-3fba-951e-8a80832ef3de/dow-jones-futures%3A-nvidia%2C.html", "symbols": ["117.F", "ANET.US", "COST.MX", "COST.US", "COWC34.SA", "CTO.F", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0.071, "neu": 0.827, "pos": 0.102}}, {"date": "2023-08-21T20:39:00+00:00", "title": "Soon, We'll See Just How Much of the Market Nvidia Can Really Carry", "content": "After lagging for a couple of weeks, big-cap technology and artificial intelligence names regained their leadership role. The bounce was primarily triggered by Nvidia , which had a couple more target increases before its earnings report on Wednesday. Nvidia is raising prices and is selling all the AI chips it can make, and the only question is whether analysts have correctly predicted its manufacturing capacity.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a8ba3336-d643-35b7-b276-69117a2bd42d/soon%2C-we%27ll-see-just-how-much.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.25, "neg": 0.031, "neu": 0.923, "pos": 0.046}}, {"date": "2023-08-21T20:35:48+00:00", "title": "Nvidia Stock Breaks Out, Flashing Bullish Sign, With Earnings Due — Is It A Buy?", "content": "Nvidia, a giant in data centers and gaming, continues to sizzle. Is Nvidia stock a buy, after topping a buy point on Monday, with earnings due later this week? Nvidia is due to report its fiscal second-quarter results on Wednesday, after the market close.\n\nContinue reading", "link": "https://finance.yahoo.com/m/ded6b0a1-015a-3584-9e8d-cd3c12535718/nvidia-stock-breaks-out%2C.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-21T20:33:11+00:00", "title": "US STOCKS-Nasdaq rallies with Nvidia, tech shares; investors look toward Jackson Hole", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click LIVE/ or type LIVE/ in a news window.)\n\n*\n\nGS weighs sale of part of wealth business\n\n*\n\nPalo Alto Networks jumps on upbeat forecast\n\n*\n\nIndexes: Dow down 0.1%, S&P 500 up 0.7%, Nasdaq up 1.6%\n\n(Updates close with volume, share moves)\n\nBy Caroline Valetkevitch\n\nNEW YORK, Aug 21 (Reuters) - The Nasdaq ended more than 1% higher and the S&P 500 also rose on Monday, with shares of Nvidia jumping as investors were optimistic ahead of its earnings this week, and other technology-related stocks gaining.\n\nThe Dow Jones industrial average ended slightly lower.\n\nThe yield on 10-year Treasury notes hit highs last seen during the Great Financial Crisis in 2007 as investors looked warily toward a meeting of central bankers who convene on Thursday at Jackson Hole in Wyoming. Federal Reserve Chair Jerome Powell is due to speak on Friday.\n\nThe technology sector gave the biggest boost to the S&P 500 and Nasdaq, while an index of semiconductors advanced 2.8%.\n\nNvidia rose 8.5%, leading gains among semiconductor stocks, as HSBC raised its price target on the stock to $780, the second highest on Wall Street.\n\nNvidia, one of the biggest winners in this year's artificial intelligence tech stock rally, is expected to forecast quarterly revenue above analysts' estimates when it reports late on Wednesday. Nvidia's stock is up more than 220% for the year so far, while the Nasdaq is up 29%.\n\n\"Nvidia is considered the brand for AI,\" said Quincy Krosby, chief global strategist at LPL Financial in Charlotte, North Carolina. \"Their targets have been lifted dramatically, so the question is, can they deliver... A catalyst coming in with Nvidia would be extremely helpful.\"\n\nAt the same time, she said, investors are anxious to hear Powell's comments at Jackson Hole. Concerns the Fed will keep interest rates higher for longer have pushed up U.S. Treasury yields, and fanned worries about the impact of higher rates on businesses and consumers.\n\nStory continues\n\nThe Dow Jones Industrial Average fell 36.97 points, or 0.11%, to 34,463.69, the S&P 500 gained 30.06 points, or 0.69%, to 4,399.77 and the Nasdaq Composite added 206.81 points, or 1.56%, to 13,497.59.\n\nAmong decliners in the Dow, Johnson & Johnson shares fell 3% after the healthcare conglomerate said it was expecting to retain a stake of about 9.5% in its newly separated consumer health unit, Kenvue.\n\nGoldman Sachs Group's stock dipped 0.9% after the bank said it was weighing the sale of a part of its wealth business.\n\nAlso in the tech space, Palo Alto Networks surged 14.8% after the cybersecurity firm alleviated worries about its late Friday release of results with a strong quarter and a forecast for annual billings above expectations.\n\nAnd VMware jumped 4.9% after UK's competition regulator cleared Broadcom's purchase of the cloud computing firm. Broadcom's stock gained 4.8%.\n\nVolume on U.S. exchanges was 9.75 billion shares, compared with the 10.99 billion average for the full session over the last 20 trading days.\n\nDeclining issues outnumbered advancing ones on the NYSE by a 1.44-to-1 ratio; on Nasdaq, a 1.08-to-1 ratio favored decliners.\n\nThe S&P 500 posted 3 new 52-week highs and 18 new lows; the Nasdaq Composite recorded 36 new highs and 214 new lows.\n\n(Reporting by Caroline Valetkevitch; additional reporting by Amruta Khandekar and Shristi Achar; Editing by Arun Koyyur, Vinay Dwivedi and David Gregorio)", "link": "https://finance.yahoo.com/news/us-stocks-nasdaq-rallies-nvidia-203311159.html", "symbols": ["DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.988, "neg": 0.029, "neu": 0.876, "pos": 0.095}}, {"date": "2023-08-21T20:33:00+00:00", "title": "These Stocks Moved the Most Today: Palo Alto, Nikola, AMC, XPeng, Tesla, Nvidia, and More", "content": "Palo Alto Networks' fiscal fourth-quarter earnings top analysts' expectations, Nikola says it 'may incur significant expenses' from the voluntary recall of more than 200 of its electric vehicles, and Nvidia stock rises ahead of earnings later this week.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1352b9a6-192f-3fbe-b867-31ef0103e2f3/these-stocks-moved-the-most.html", "symbols": ["5AP.F", "5ZM.F", "FB2A.F", "FB2A.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US", "ZM.US"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0, "neu": 0.913, "pos": 0.087}}, {"date": "2023-08-21T20:22:00+00:00", "title": "Nvidia Earnings Preview Plus Other Top Ranked Semiconductor Stocks", "content": "Nvidia NVDA has without a doubt been the stock to own in 2023. Thanks to the boom in Artificial Intelligence, Nvidia’s earnings and revenue estimates have absolutely skyrocketed. On Tuesday after the market closes, we will get a look inside the semiconductor giant when Nvidia reports its Q2 earnings.\n\nNvidia enjoys a Zacks Rank #1 (Strong Buy) rating and the Zacks Earnings ESP currently forecasts that it will beat earnings estimates by 2.39%. Analysts have set expectations high for Wednesday’s report, with earnings estimated at $2.06 per share, which will be a 304% YoY gain, and sales at $11 billion, or a 64.6% YoY increase.\n\nDuring the Q1 report NVDA beat estimates by a huge margin, with earnings coming in 44% above estimates and sales 10.5%. Additionally, the stock rallied 24% in the week following and pushed it to a new all-time high. Can Nvidia pull off another big beat?\n\nWhile Nvidia’s stock performance has been nothing short of spectacular this year, up 215% YTD, it has also been a top performing stock for the last decade. Over the last 10 years NVDA has compounded at an almost unbelievable 62.6% annually. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nOther Top Ranked Semi Stocks\n\nNvidia isn’t the only semiconductor stock out there worth owning though. Because of the explosion in AI and the massive computing power necessary, semiconductor companies throughout the supply chain are going to be critical for reaching demand. This huge demand should be a tailwind for their sector’s stock prices for years to come.\n\nApplied Materials AMAT is one of the world’s largest suppliers of equipment for the fabrication of semiconductors. Applied Materials’ silicon segment offers equipment for front-end operations in the semiconductor manufacturing process. Front-end processes involve the deposition or implantation of multiple thin layers of electronically conductive, semiconductive and insulating materials onto and within a silicon wafer with the help of photomasks (reticles) to give multiple copies of integrated circuit devices.\n\nStory continues\n\nApplied Materials boasts a Zacks Rank #2 (Buy) rating, indicating upward trending earnings revisions. Next quarter earnings estimates have been increased by 5.7% and FY23 earnings estimates have been upgraded by 3.4% over the last two months. EPS are projected to grow by 5.4% annually over the next 3-5 years. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nAMAT also has an incredible history of steady growth in sales and earnings. Over the last 20 years annual sales have grown from $8 billion to $26.5 billion, which is a CAGR of 6.2%. Over that same period EPS have expanded from $0.87 per share to $7.96 per share, which is a CAGR of 11.7%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nApplied Materials is trading at a one year forward earnings multiple of 18.8x, which is below the industry average of 24.7x, and just above its 10-year median of 15.7x. Furthermore, AMAT pays a dividend yield of 0.9% and has raised the payment by an average of 6.5% annually over the last five years. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nAnother semiconductor stock with a long history of success is Lam Research LRCX. Lam Research is a leading semiconductor equipment company that designs and manufactures equipment used in the fabrication of integrated circuits. LRCX specializes in providing advanced solutions for the semiconductor industry, including etch, deposition, and cleaning processes. Lam Research's technology plays a crucial role in enabling the production of smaller, more powerful, and energy-efficient chips used in various electronic devices.\n\nLam Research is a Zacks Rank #1 (Strong Buy) stock, demonstrated by some strong earnings revisions over the last two months. Current quarter earnings estimates have been upgraded by 10.8% and FY23 estimates by 8.8%. Additionally, the company is expected to grow EPS by 6.2% annually over the next 3-5 years. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nSales at Lam Research have grown from $936 million to $17.4 billion over the last twenty years, which is a CAGR of 15.7%. EPS have grown from $0.62 to $34.10 per share over the same period, which is a CAGR of 22.1%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nLRCX is trading at a one year forward earnings multiple of 24.4x, which is right in line with the industry average and above its five-year median of 16.6x. Additionally, the company pays a dividend yield of 1.1% and has raised the dividend by an average of 11.9% annually over the last five years. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nBottom Line\n\nInvestors have piled into Nvidia stock all year, and it doesn’t appear to be slowing. While some investors may be writing the move up to hype, the data leads me to think that Nvidia’s future business expectations are the real deal.\n\nInvestors should also note that they don’t only have to own Nvidia. There are a number of compelling semiconductor stocks in the market with exceptional histories of success, and strong near-term expectations.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nLam Research Corporation (LRCX) : Free Stock Analysis Report\n\nApplied Materials, Inc. (AMAT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/nvidia-earnings-preview-plus-other-202200477.html", "symbols": ["AMAT.MX", "AMAT.US", "AP2.F", "AP2.XETRA", "LAR.F", "LRCX.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.006, "neu": 0.898, "pos": 0.096}}, {"date": "2023-08-21T20:10:58+00:00", "title": "Tech Sector Lifts Nasdaq", "content": "U.S. stocks finished mixed as information technology shares gained ground. Palo Alto Networks jumped nearly 15% after reporting quarterly results late Friday that topped analyst expectations. Chipmaker Nvidia climbed 8.\n\nContinue reading", "link": "https://finance.yahoo.com/m/735b7904-465b-3008-b4c1-d7936ff39f85/tech-sector-lifts-nasdaq.html", "symbols": ["5AP.F", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US"], "tags": [], "sentiment": {"polarity": 0.586, "neg": 0, "neu": 0.862, "pos": 0.138}}, {"date": "2023-08-21T20:09:17+00:00", "title": "Stock Market Today: Tech Stocks Soar as Bargain Hunters Swoop In", "content": "The Nasdaq outperformed today as mega-cap stocks Nvidia (NVDA) and Tesla (TSLA) popped.\n\nThe major indexes suffered notable losses last week, with the technology sector bearing the brunt of the selling.\n\nHowever, bulls were given a reprieve Monday, with tech stocks soaring as bargain hunters looked past spiking Treasury yields to scoop up some of Wall Street's favorite names at a discount.\n\nAll three main benchmarks finished last week with losses of more than 2% as Treasury yields jumped on growing expectations the Federal Reserve may not be done raising interest rates. Today, however, the rate-sensitive Nasdaq Composite climbed 1.6% to 13,497 and the S&P 500 added 0.7% to 4,399, even as the 10-year Treasury yield hit its highest level since 2007.\n\nHelping boost the Nasdaq and S&P 500 were big returns for several mega-cap stocks. Nvidia (NVDA), for one, rose 8.5% ahead of the chipmaker's appearance on the earnings calendar this Wednesday evening. Other big movers included Facebook parent Meta Platforms (META, +2.4%) and electric vehicle stockTesla (TSLA, +7.3%).\n\nPalo Alto spikes after unusually timed earnings report\n\nBut it was Palo Alto Networks (PANW) that was one of Monday's most notable gainers. The cybersecurity stock surged 14.8% after the company disclosed its quarterly earnings after Friday's close – an unusual time slot for a firm to report its financial results. PANW unveiled higher-than-expected fiscal fourth-quarter earnings and revenue, while giving solid guidance.\n\nPalo Alto also said there has been strong demand for XSIAM, its artificial intelligence (AI) security operations platform, particularly after a July ruling from the Securities and Exchange (SEC) commission that cyberattacks must be reported within four days after they are deemed \"material\" by a company.\n\n\"This is a big week for tech stocks and optimism is brewing that Nvidia will deliver some good results later this week,\" says Edward Moya, senior market strategist at currency data provider OANDA. \"Also providing a boost was Palo Alto’s results that we got after the Friday close.\" The key for tech stocks going forward is to show how they can make money off of AI, Moya adds.\n\nStory continues\n\nJ&J weighs on Dow\n\nThe Dow Jones Industrial Average wasn't as resilient as the other two indexes, shedding 0.1% to 34,463 on weakness in Johnson & Johnson (JNJ). The blue chip stock tumbled 3.0% after the company said a $35 billion exchange offer for its Kenvue (KVUE, +0.1%) spinoff was too popular, and those that participated will only be able to convert a portion of their JNJ shares for KVUE stock.\n\nLooking ahead, all eyes will be on this week's annual Federal Reserve gathering in Jackson Hole, Wyoming, which is slated to kick off Thursday.\n\n\"This year's Jackson Hole symposium occurs near a pivotal juncture for the Fed,\" says Matthew Luzzetti, senior economist at Deutsche Bank. \"Whether it takes an additional rate hike or two, monetary policy is nearing the sufficiently restrictive policy stance the Fed has long sought after eleven rate increases.\" Still, Luzzetti doesn't expect Fed Chair Jerome Powell to send any strong signals about the central bank's near-term policy plans as his \"data dependence message\" from the July Fed meeting \"was clear.\"\n\nRelated Content\n\nStock Picks That Billionaires Love Americans Are Running Through Pandemic Savings, Study Shows When is the Next CPI Report?", "link": "https://finance.yahoo.com/news/stock-market-today-tech-stocks-200917043.html", "symbols": ["5AP.F", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.99, "neg": 0.022, "neu": 0.877, "pos": 0.101}}, {"date": "2023-08-21T20:09:00+00:00", "title": "Nasdaq Closes Higher; Treasury Yields Resume Their Climb", "content": "Tech shares helped boost U.S. stock indexes, despite pressure from higher yields on longer-term Treasurys. The Dow industrials ended slightly lower.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1bef65d9-8d16-36ab-b5db-a24e181a4be9/nasdaq-closes-higher%3B.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.513, "neg": 0.071, "neu": 0.699, "pos": 0.23}}, {"date": "2023-08-21T19:22:09+00:00", "title": "Dow Jones Falls As Nvidia Surges On Wall Street Calls; These Warren Buffett Stocks Eye Entries", "content": "The Dow Jones fell even as Microsoft stock rallied. Nvidia stock retook a key level. A trio of Warren Buffett stocks are near entries.\n\nContinue reading", "link": "https://finance.yahoo.com/m/c6ca7eba-b49d-3de3-bb53-9fb9c007fc98/dow-jones-falls-as-nvidia.html", "symbols": ["DJI.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-21T19:03:13+00:00", "title": "The 2 Nasdaq Stocks to Watch This Week", "content": "The Nasdaq Composite (NASDAQINDEX: ^IXIC) has fallen back a bit in the past few weeks, but it still remains the big winner among major indexes so far in 2023. This week, a pair of high-profile Nasdaq stocks are set to report their latest financial results. Both Nvidia (NASDAQ: NVDA) and Marvell Technology (NASDAQ: MRVL) have sought to cash in on the popularity of artificial intelligence (AI), and with AI initiatives coming out right and left, investors have high hopes that the two companies will tell a favorable story about their recent performance.\n\nContinue reading", "link": "https://finance.yahoo.com/m/c21ede4b-0574-3b6e-978b-848696620a32/the-2-nasdaq-stocks-to-watch.html", "symbols": ["IXIC.INDX", "MRVL.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.971, "neg": 0.016, "neu": 0.786, "pos": 0.198}}, {"date": "2023-08-21T18:57:06+00:00", "title": "S&amp;P 500: Cybersecurity Giant Soars On Earnings; Tesla, Nvidia Are Big Winners", "content": "Palo Alto surged Monday after earnings, leading the S&P 500. Megacaps Tesla and NVDA were big winners too, with Nvidia earnings looming.\n\nContinue reading", "link": "https://finance.yahoo.com/m/657d186b-4d65-3247-95eb-079dd58ad5cd/s%26p-500%3A-cybersecurity-giant.html", "symbols": ["0QF.F", "5AP.F", "AVGO.US", "AVGO34.SA", "GSPC.INDX", "MRNA.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0.056, "neu": 0.827, "pos": 0.117}}, {"date": "2023-08-21T18:46:18+00:00", "title": "US STOCKS-Nasdaq gains more than 1% as Nvidia jumps; investors await Jackson Hole meet", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click LIVE/ or type LIVE/ in a news window.)\n\n*\n\nGS weighs sale of part of wealth business, shares fall\n\n*\n\nPalo Alto Networks jumps on upbeat forecast\n\n*\n\nIndexes: Dow down 0.3%, S&P up 0.5%, Nasdaq up 1.3%\n\n(Updates to early afternoon, adds NEW YORK dateline)\n\nBy Caroline Valetkevitch\n\nNEW YORK, Aug 21 (Reuters) - The Nasdaq was up more than 1% on Monday, and S&P 500 was also higher in afternoon trading, with shares of Nvidia jumping more than 6% as investors were optimistic ahead of its earnings due late on Wednesday.\n\nThe Dow Jones Industrial Average edged lower.\n\nThe yield on the benchmark 10-year Treasury rose to a 15-year high as investors looked warily toward a meeting of central bankers who convene on Thursday at Jackson Hole in Wyoming. Federal Reserve Chair Jerome Powell is due to speak on Friday.\n\nThe S&P 500 technology index was up 1.9%, while shares of Nvidia rose 6.4% as HSBC raised its price target on the stock to $780, the second highest on Wall Street. Nvidia outperformed its megacap peers last week with gains.\n\nNvidia, one of the biggest winners in this year's artificial intelligence tech stock rally, is expected to forecast quarterly revenue above analysts' estimates when it reports. Nvidia's stock is up more than 200% for the year so far, while the Nasdaq is up about 29%.\n\n\"Nvidia is considered the brand for AI,\" said Quincy Krosby, chief global strategist at LPL Financial in Charlotte, North Carolina. \"Its targets have been lifted dramatically, so the question is, can they deliver, and if they can, will it help to lift the market.\"\n\nAt the same time, she said, investors are anxious to hear Powell's comments at Jackson Hole. Concerns the Fed will keep interest rates higher for longer have pushed up yields, and fanned worries about the impact of higher rates on businesses and consumers.\n\nThe Dow Jones Industrial Average fell 84.8 points, or 0.25%, to 34,415.86, the S&P 500 gained 19.67 points, or 0.45%, to 4,389.38 and the Nasdaq Composite added 173.63 points, or 1.31%, to 13,464.41.\n\nStory continues\n\nAmong stocks weighing on the Dow, Johnson & Johnson lost 2.5% after the healthcare conglomerate said it was expecting to retain a stake of about 9.5% in its newly separated consumer health unit, Kenvue.\n\nAlso lower, Goldman Sachs was down 1.3% after the bank said it was weighing the sale of a part of its wealth business.\n\nPalo Alto Networks surged 15.7% as the cybersecurity firm forecast late Friday annual billings above expectations.\n\nDeclining issues outnumbered advancing ones on the NYSE by a 1.81-to-1 ratio; on Nasdaq, a 1.08-to-1 ratio favored decliners.\n\nThe S&P 500 posted 2 new 52-week highs and 18 new lows; the Nasdaq Composite recorded 31 new highs and 182 new lows.\n\n(Reporting by Caroline Valetkevitch; additional reporting by Amruta Khandekar and Shristi Achar; Editing by Arun Koyyur, Vinay Dwivedi and David Gregorio)", "link": "https://finance.yahoo.com/news/us-stocks-nasdaq-gains-more-184618482.html", "symbols": ["DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.95, "neg": 0.037, "neu": 0.892, "pos": 0.071}}, {"date": "2023-08-21T18:29:00+00:00", "title": "Stock Market Today: Treasury Yields Resume Their Climb", "content": "The Nasdaq Composite extended gains, with tech stocks a bright spot for the market ahead of Nvidia’s earnings later this week. The S&P 500 also rose while the Dow industrials remained lower.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1bef65d9-8d16-36ab-b5db-a24e181a4be9/stock-market-today%3A-treasury.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0.059, "neu": 0.8, "pos": 0.141}}, {"date": "2023-08-21T18:26:50+00:00", "title": "'Godfather Of AI' To Offer Quarterly Results; Can Investors Refuse?", "content": "Wall Street has high expectations for Nvidia's earnings report on Wednesday but production constraints could be a spoiler for the fabless chipmaker.\n\nContinue reading", "link": "https://finance.yahoo.com/m/626750da-a121-3c20-8b1e-531d81761abc/%27godfather-of-ai%27-to-offer.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-21T18:03:48+00:00", "title": "Nvidia Stock Breaks Out With Earnings Due, After Setting High AI Bar", "content": "Nvidia, a giant in data centers and gaming, continues to sizzle. Is Nvidia stock a buy, after topping a buy point on Monday, with earnings due later this week? Nvidia is due to report its fiscal second-quarter results on Wednesday, after the market close.\n\nContinue reading", "link": "https://finance.yahoo.com/m/ded6b0a1-015a-3584-9e8d-cd3c12535718/nvidia-stock-breaks-out-with.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-21T17:55:00+00:00", "title": "Rebel's Edge - August 21: $TSLA, $NVDA, $EL, and Aaron Rodgers", "content": "Jon and Pete Najarian join forces to discuss and debate their favorite topics, including the hottest stock-specific news and sports!\n\nContinue reading", "link": "https://finance.yahoo.com/m/c18acacb-7188-36e4-955f-1bc0a048b7c4/rebel%27s-edge-august-21%3A.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.67, "neg": 0, "neu": 0.785, "pos": 0.215}}, {"date": "2023-08-21T17:40:00+00:00", "title": "Tap These Stocks &amp; ETFs to Play Like Billionaires", "content": "Who doesn’t dream of becoming an iconic investor like Warren Buffett, Carl Icahn, Daniel Loeb, David Tepper or David Einhorn? Keeping investors’ aspirations in mind, we have profiled a few stock and ETF picks below that billionaire investors are betting on currently.\n\nFollow Warren Buffett by Investing in Homebuilders\n\nWarren Buffett's reputation as an investment achiever is known to all. No wonder, his recent 13F filing is in the spotlight. In the second quarter, Buffett’s company Berkshire Hathaway established positions in three new stocks, namely NVR NVR, Lennar LEN and D.R. Horton Inc. DHI.\n\nNotably, these three stocks have positions in iSharesU.S. Home Construction ETF ITB and SPDR S&P Homebuilders ETF (XHB). Buffett is a fan of value investing. Berkshire’s acquisition of three stocks despite a great rally this year is a tell-tale sign of the remaining value quotient in the homebuilding space (read: Is It Time to Buy Homebuilding ETFs Following Warren Buffett?).\n\nAgreed, steep home prices and higher rates are concerns. But investors should not forget that demand resumed after the initial surge in mortgage rates, as buyers became used to a new normal interest rate environment.\n\nTake a Bite Out of Apple With Warren Buffett\n\nBuffett’s Berkshire Hathaway has invested 51% of its stake in Apple. Apple shares have been performing better than the industry year to date. It is benefiting from steady demand for iPhone 14 and 14 Plus as well as its expanding footprint in emerging markets. Growing services subscriber base and improving customer engagement are tailwinds for the services business.\n\nApple’s focus on autonomous vehicles and augmented reality/virtual reality technologies presents a growth opportunity for the long haul. Notably, while Apple lacks on value currently, it is still a good growth stock. Also note that Apple-heavy iShares U.S. Technology ETF IYW has a Zacks Rank #1 (Strong Buy) (read: 4 Sectors Warren Buffett Binges On: ETFs in Focus).\n\nStory continues\n\nFollow Bill Ackman by Investing in AI\n\nBill Ackman increased his exposure to artificial intelligence (AI) in the second quarter. His Pershing Square fund loaded up about 1.3 million of Alphabet's (GOOG) Class C shares in the period, lifting the value of its position to $1.1 billion at the end of June. It also held about $262 million worth of Alphabet's Class A shares.\n\nAlphabet’s the search giant’s AI research group – Google DeepMind – is reportedly developing at least 21 new generative AI features. Alphabet shares have a moderate Value score of C and a good Growth score of B. Alphabet has solid exposure to ETFs like Communication Services Select Sector SPDR Fund XLC and Fidelity MSCI Communication Services Index ETF FCOM.\n\nMoreover, Ackman and his team added to their Hilton Worldwide (HLT) stakes. The hotelier has considerable exposure to Kelly Hotel & Lodging Sector ETF HOTL andDefiance Hotel Airline and Cruise ETF CRUZ.\n\nNvidia Continues to Get Billionaire’s Love\n\nSeveral of the world's leading investors and funds bet big on Nvidia NVDA stock — another AI pick — last quarter. The AI-boom would continue to spur demand for graphics chips. Dan Loeb's Third Point, Soros Fund Management, and Jeremy Grantham's GMO all established stakes in Nvidia last quarter, per the source.\n\nNot only the trio, David Tepper's Appaloosa Management, Jim Simons' Renaissance Technologies, Paul Tudor Jones' Tudor Investment Corporation, Steve Cohen's Point72 Asset Management, Stanley Druckenmiller's Duquesne Family Office, and the investment arm of the Church of Jesus Christ of Latter-day Saints all raised their Nvidia positions in the period.\n\nNvidia has a double-digit focus on VanEck Semiconductor ETF SMH, AXS Esoterica NextG Economy ETF WUGI, Simplify Volt RoboCar Disruption and Tech ETF (VCAR) and Global X Robotics & Artificial Intelligence ETF BOTZ.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nLennar Corporation (LEN) : Free Stock Analysis Report\n\nD.R. Horton, Inc. (DHI) : Free Stock Analysis Report\n\nNVR, Inc. (NVR) : Free Stock Analysis Report\n\niShares U.S. Home Construction ETF (ITB): ETF Research Reports\n\nVanEck Semiconductor ETF (SMH): ETF Research Reports\n\nFidelity MSCI Communication Services Index ETF (FCOM): ETF Research Reports\n\niShares U.S. Technology ETF (IYW): ETF Research Reports\n\nGlobal X Robotics & Artificial Intelligence ETF (BOTZ): ETF Research Reports\n\nCommunication Services Select Sector SPDR ETF (XLC): ETF Research Reports\n\nAXS Esoterica NextG Economy ETF (WUGI): ETF Research Reports\n\nDefiance Hotel, Airline, and Cruise ETF (CRUZ): ETF Research Reports\n\nKelly Hotel & Lodging Sector ETF (HOTL): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/tap-stocks-etfs-play-billionaires-174000418.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "APC.F", "APC.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "LEN-B.US", "LEN.US", "LNN.F", "NVD.F", "NVD.XETRA", "NVDA.MX"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.016, "neu": 0.852, "pos": 0.133}}, {"date": "2023-08-21T17:34:44+00:00", "title": "GLOBAL MARKETS-US yields hit decade highs, European shares rise off 6-wk low", "content": "*\n\nEuropean stocks gain after last week's drop\n\n*\n\nBond yields rising again ahead of Fed's Jackson Hole event\n\n*\n\nNasdaq rises with traders eyeing Nvidia earnings\n\n(New throughout with updated prices; adds comment in paragraph 9; moves details on Asia trading lower, below new subhead)\n\nBy Chris Prentice and Yoruk Bahceli\n\nNEW YORK, Aug 21 (Reuters) -\n\nEuropean shares recovered from a six-week low and key U.S. treasury yields rose to decade highs on Monday as investors awaited a Federal Reserve meeting later this week.\n\nWall Street trading was mixed, with the Dow Jones Industrial and the S&P 500 giving back earlier gains while the tech-heavy Nasdaq Composite gained on earnings optimism.\n\nGlobal benchmark oil futures fell after rising $1 a barrel, under pressure from potential interest rate hikes and uncertainty around Chinese demand.\n\nThe Dow Jones Industrial Average fell 121.76 points, or 0.36%, to 34,377.24, the S&P gained 9.62 points, or 0.22%, to 4,379.33 and the Nasdaq gained 127.27 points, or 0.96%, to 13,418.46 by 1:18 p.m. ET (1718 GMT).\n\nThe pan-European STOXX 600 ended higher, after rising as much as 0.9% intraday, recovering from Friday's six-week low. Energy and mining sectors gained, tracking higher crude oil and metals prices.\n\nGermany's DAX rose 0.2% even as official data showed a higher-than-expected fall in German producer prices in July.\n\nAdyen slumped 8.6% after two brokerages downgraded the Dutch digital payments firm's stock after the company missed half-year expectations on Aug. 17.\n\nEarnings from AI-darling Nvidia on Wednesday will be another major test of valuations.\n\n\"Wall Street is having a hard time deciding what to do with stocks,\" said Edward Moya, senior market analyst with OANDA. \"Everyone is expecting an impact from the surge in yields, but it seems like tech companies have held up. Nvidia is going to be key.\"\n\nLonger-dated U.S. Treasury yields were up, with the 30-year yield hitting 4.468%, its highest since April 2011. Bond yields move inversely with prices.\n\nStory continues\n\nThe 10-year Treasury hit 4.35%, the highest since November 2007 - before the collapse of Lehman Brothers almost a year later fully ushered in the Great Financial Crisis.\n\n\"People are starting to get worried about the (bond) selloff and are looking ahead to (Federal Reserve Chair Jerome) Powell and what he says later this week about peak rates,\" said Principal Global Investors' chief global strategist, Seema Shah.\n\nThe key event for the week is the Fed's Jackson Hole conference, where markets assume Powell will note the jump in yields and the recent run of strong economic data. The Atlanta Fed's GDP Now tracker is running at a heady 5.8% for this quarter.\n\nA majority of polled analysts think the Fed is done hiking, while traders are betting on a 40% chance of a final Fed hike by November.\n\nCHINA'S CENTRAL BANK SURPRISES\n\nDisappointment earlier weighed on Asian shares.\n\nChina's central bank trimmed its one-year lending rate by 10 basis points and left its five-year rate unmoved. That was a surprise to analysts who had expected cuts of 15 bps to both as recovery in the world's second-largest economy has lost steam due to a worsening property slump, weak spending and tumbling credit growth.\n\n\"The small injection of stimulus by China's central bank in the ailing economy has proved largely underwhelming given the scale of the challenges erupting across sectors, but it has given investors hope there could be more to come,\" said Susannah Streeter, head of money and markets at Hargreaves Lansdown.\n\nAnalysts said concern around downward pressure on the yuan, which has lost nearly 6% against the dollar this year, is likely limiting the size and scope of rate cuts.\n\nThe European single currency was up 0.2% on the day at $1.0897, having lost 0.88% in a month, while the dollar index, which tracks the greenback against a basket of currencies of other major trading partners, was down at 103.32.\n\nIn commodities, spot gold prices rose 0.2% to $1,892.00 an ounce.\n\nBrent crude fell 0.25% to $84.59, while U.S. crude futures rose 0.11% to $81.34 a barrel.\n\n(Reporting by Yoruk Bahceli and Wayne Cole, additional reporting by Dhara Ranasinghe; Editing by David Evans, Mark Potter and Nick Macfie)", "link": "https://finance.yahoo.com/news/global-markets-us-yields-hit-173444758.html", "symbols": ["DJI.INDX", "GDAXI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": -0.861, "neg": 0.092, "neu": 0.825, "pos": 0.083}}, {"date": "2023-08-21T17:01:12+00:00", "title": "Nvidia: A Robust Outlook", "content": "For NVIDIA Corp (NASDAQ:NVDA), the primary driver of anticipated growth is the data center sector, fueled by increasing demand for generative artificial intelligence and expansive language models. However, there are concerns around AI stocks amid a recent drop.\n\nOutlook and expectations\n\nLooking ahead to the second quarter of fiscal 2024, the street expects total revenue of approximately $11 billion. The growth trajectory is chiefly attributed to the data center sector, driven by escalating demand tied to generative AI and expansive language models. The heightened demand has bolstered the company's visibility in the data center space for several upcoming quarters, prompting preparations for increased supply during the latter half of the year.\n\nWarning! GuruFocus has detected 10 Warning Signs with NVDA. Click here to check it out.  NVDA 30-Year Financial Data The intrinsic value of NVDA\n\nThe company's projected GAAP and non-GAAP gross margins stand at 68.6% and 70%, respectively, subject to a potential fluctuation of up to 50 basis points. Anticipated GAAP and non-GAAP operating expenses are roughly $2.71 billion and $1.9 billion, respectively.\n\nFinancial Predictions\n\nRegarding GAAP and non-GAAP other income and expenses, an approximate income of $90 million is predicted, excluding gains and losses from non-affiliated investments. Capital expenditures are estimated to range from $300 million to $350 million. Moving on to the forthcoming earnings announcement on August 23, 2023, the normalized EPS estimate is $2.07, while the GAAP EPS estimate is $1.73.\n\nSignificant Developments\n\nOther significant developments may push NVIDIA Corp (NASDAQ:NVDA)'s performance apart from the expected data center boom. For instance, a moderation in sequential growth has been observed due to some Chinese NEV customers adjusting production schedules in response to slower-than-expected demand growth. The trend is expected to persist throughout the remainder of the calendar year.\n\nStory continues\n\nThe company has also expanded its partnership with BYD (OTCMKTS:BYDDY), a leading NEV manufacturer, securing a new design win to extend the utilization of DRIVE Orin technology to the upcoming high-volume Dynasty and Ocean vehicle series, with production set to commence in 2024.\n\nRiding high on AI dominance, billionaire confidence and expanding frontiers\n\nDespite the fact that there have been no company-specific developments that should have negatively influenced its ascent, the stock has dropped in the past month, and investors appear to be affected by Morgan Stanley's assumption that the high-flying run in AI companies is coming to an end and the \"bubble\" is set to burst.\n\nOn the contrary, NVIDIA Corp (NASDAQ:NVDA)'s strengths, including its dominance in AI, robust financial performance, investor confidence, leadership in edge computing, and other market expansion opportunities, suggest a compelling robust outlook for the firm. Specifically, the company's growth trajectory is supported by:\n\nKey Strengths\n\n1. Dominance in Artificial Intelligence: NVIDIA Corp (NASDAQ:NVDA) has been at the forefront of AI innovation, providing cutting-edge solutions for data centers, autonomous vehicles, healthcare, and more. Its GPUs have become the preferred hardware for AI training and inference due to their parallel processing capabilities. Also, the company's CUDA platform and software libraries further bolster its position, making it a go-to choice for AI researchers and developers.\n\n2. Strong Financial Performance: The company's financials have been consistently impressive, showcasing its ability to convert technological leadership into substantial revenue growth. NVIDIA Corp (NASDAQ:NVDA)'s Q2 2023 earnings demonstrated its ability to maintain strong performance across various segments, with revenue of $7.76 billion, an increase of 68% year-over-year.\n\n3. Billionaire Investor Confidence: Renowned billionaire investor David Tepper (Trades, Portfolio), known for his astute market insights, has recently increased his stake in NVIDIA Corp (NASDAQ:NVDA). This move suggests a strong vote of confidence in the company's long-term growth potential.\n\n4. Expanding Market Opportunities: NVIDIA Corp (NASDAQ:NVDA)'s market opportunities continue to expand as AI applications permeate various industries. From healthcare and finance to automotive and entertainment, AI is becoming integral to enhancing efficiency and capabilities. NVIDIA Corp (NASDAQ:NVDA) will benefit from this broader trend as the demand for AI-driven solutions increases.\n\n5. Leadership in Edge Computing: The rise of edge computing, where data processing occurs closer to the data source than in centralized data centers, is gaining momentum. NVIDIA Corp (NASDAQ:NVDA)'s GPUs and AI technologies are well-suited for edge computing applications, enabling real-time processing and decision-making in scenarios like autonomous vehicles and Internet of Things (IoT) devices.\n\n6. Synergies with Metaverse and Gaming: The company's gaming division has long been a significant revenue driver, and its technologies are also aligning with the growing concept of the metaverse. As virtual and augmented reality experiences gain traction, NVIDIA Corp (NASDAQ:NVDA)'s graphics prowess and AI capabilities could be crucial in shaping this emerging digital landscape.\n\n7. Ongoing Innovations: NVIDIA Corp (NASDAQ:NVDA)'s commitment to innovation is evident in its consistently releasing new and improved products. The company's dedication to pushing the boundaries of technology ensures that it remains relevant and competitive in a rapidly evolving tech landscape.\n\n8. Strategic Acquisitions: NVIDIA Corp (NASDAQ:NVDA) has a history of strategic acquisitions that have bolstered its capabilities and expanded its portfolio. These acquisitions enable the company to tap into new markets and enhance its offerings, further solidifying its position as a technology leader.\n\nA \"wonderful\" company at a \"wonderful\" price\n\nNVIDIA Corp (NASDAQ:NVDA)'s current price of $432.99 is significantly higher than its intrinsic value of $312.97, suggesting an overvaluation. In addition, the high P/E ratio of 225.52x further supports this notion, indicating that investors are willing to pay a premium for each dollar of earnings the company generates due to the growth and AI hype.\n\nSimilarly, the P/S ratio of 41.76x and EV/EBITDA ratio of 165.59x also indicate that NVIDIA Corp (NASDAQ:NVDA) may be overvalued, significantly higher than its 5-year and 10-year averages, as well as trading at a premium to its industry peers.\n\nOn the other hand, the PEG ratio of 11.62x suggests that NVIDIA Corp (NASDAQ:NVDA)'s future earnings growth may not be keeping pace with its current valuation.\n\nFinally, the company will disclose its fiscal 2024 second-quarter results the following week, and I wouldn't be surprised if NVIDIA Corp (NASDAQ:NVDA) gets another valuation boost in the following days if earnings results exceed Wall Street's expectations. Nvidia: A Robust Outlook\n\nTakeaway\n\nIn conclusion, NVIDIA Corp (NASDAQ:NVDA)'s prowess in artificial intelligence, strong financial performance, endorsement from prominent investors like David Tepper (Trades, Portfolio), expanding market opportunities, edge computing leadership, and ongoing innovations collectively paint a bullish picture for the company's future prospects. As technology continues to reshape industries and drive innovation, NVIDIA Corp (NASDAQ:NVDA) appears well-positioned to remain at the forefront of these advancements.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/nvidia-robust-outlook-170112131.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.022, "neu": 0.816, "pos": 0.162}}, {"date": "2023-08-21T16:46:00+00:00", "title": "Nvidia surges as KeyBanc, HSBC boost price targets into hotly anticipated Q2 earnings", "content": "Supply constraints could limit Nvidia's near-term sales forecast, but KeyBanc's John Vinh sees a potential China offset for the AI market leader.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6855c496-52f3-370b-b25a-d0187859a0f5/nvidia-surges-as-keybanc%2C.html", "symbols": ["2330.TW", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TSFA.F", "TSFA.STU", "TSM.US", "TSMC34.SA", "TSMN.MX"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-21T16:41:57+00:00", "title": "Nvidia Targets Keep Rising as Analysts Bet on Earnings Blowout", "content": "(Bloomberg) -- Nvidia Corp. shares climbed as much as 5.4% on Monday, as more analysts raised their price targets on the stock, a sign of growing optimism about the chipmaker’s highly anticipated results later this week.\n\nMost Read from Bloomberg\n\nBorrowers With $39 Billion in Student Loans Finally See Relief Bond Bulls at JPMorgan, Allianz Double Down on a Bet Gone Bad Cargill Tests 123-Foot-Tall Sails in Effort to Slash Fuel Burn Bond Slide Takes Wind Out of Stocks Amid Fed Angst: Markets Wrap\n\nThe average price target for the stock has been moving steadily higher recently, and is above $520, up from $505 just a week ago. The current target implies an upside of about 15% from current levels. Nvidia has risen 212% this year, compared with a gain of 39% for the Philadelphia Stock Exchange Semiconductor Index. Much of the rally reflects optimism over artificial intelligence, which Nvidia is a key player in.\n\nHSBC, KeyBanc Capital Markets, and BMO Capital Markets are among the latest firms to boost their targets ahead of the Aug. 23 release of Nvidia’s second-quarter results. The report is expected to show significant demand for the chips used to process AI services. Revenue is seen rising 65% from the year-ago period, according to data compiled by Bloomberg.\n\nThis is one of the first reports by Nvidia where AI is expected to be the primary focus. Generative AI services like ChatGPT were thrust into the spotlight earlier this year and the excitement surrounding applications of artificial intelligence buoyed stocks like Nvidia. Last quarter, Nvidia gave a forecast that was far stronger than expected, cementing its status of a primary beneficiary of spending on AI.\n\n“Although market expectations have clearly risen for Nvidia and the overall AI supply chain, we expect bullish AI server momentum continued to surpass market expectations,” wrote HSBC analyst Frank Lee, who has a buy rating on the stock.\n\nKeyBanc Capital Markets, meanwhile, expects Nvidia’s results and outlook will be “meaningfully above” consensus expectations, given strong demand trends.\n\nStory continues\n\nRosenblatt Securities, Piper Sandler, UBS, and Morgan Stanley have also lifted their targets recently.\n\nThe overall consensus on Nvidia is extremely positive, as nearly 90% of the analysts tracked by Bloomberg recommend buying the stock.\n\nMost Read from Bloomberg Businessweek\n\nNever Mind Shrinking Households, Builders Are Adding Bedrooms ‘Don’t You Remember Me?’ The Crypto Hell on the Other Side of a Spam Text GOP Presidential Hopeful Ramaswamy Sued Over Strive’s Practices Sam’s Club’s War Against Costco Started With $1.38 Hot Dog Combo The Legendary, Wildly Profitable QQQ Fund Makes No Money for Its Owner\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/nvidia-targets-keep-rising-analysts-164157579.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.99, "neg": 0.045, "neu": 0.824, "pos": 0.131}}, {"date": "2023-08-21T16:15:53+00:00", "title": "Stock market today: Dow slips as consumer staples, energy fall to offset tech", "content": "Investing.com -- The Dow closed lower Monday as weakness in consumer staples and energy offset an Nvidia-led rebound in tech despite a jump in Treasury yields to 16-year highs ahead of potential clues on monetary policy later this week.\n\nThe Dow Jones Industrial Average fell 0.1%, 37 points, Nasdaq rose 1.6%, and the S&P 500 rose 0.7%.\n\nNvidia leads surge in Technology ahead of results\n\nTech stocks were led higher by a more than 8% surge in NVIDIA Corporation (NASDAQ:NVDA) ahead of the chipmaker’s quarterly results due Wednesday.\n\nNvidia has been riding the wave of AI optimism since surprising Wall Street with blowout guidance in the fiscal quarter.\n\nAhead of the chipmaker’s third-quarter results, some are expecting more of the same amid optimism of an AI-led boost to data center growth.\n\n\"While we see hyperscale as being the largest consumer of AI training servers; demand for AI GPUs from entities beyond cloud services providers (emerging AI clouds, sovereign states, large enterprises, etc.) increased substantially from late March through the course of CQ2,” Wedbush said in a recent note.\n\nTreasury yields hit more than decade high ahead of Jackson Hole\n\nTreasury yields started the week on the front foot, with the 10-year Treasury yield surging to a more than 16-year high as investors anticipate that Federal Reserve chairman Jerome Powell may hint that further work is likely needed to slow inflation following recent signs of healthy economic growth.\n\n“With the market broadly on board with at least one additional rate hike by year-end, Powell is likely to emphasize the need to remain at a sufficiently restrictive level for some time with still ‘significant’ upside risks to inflation,” Stifel said in a note.\n\nTesla surges on Wall Street praise\n\nTesla Inc (NASDAQ:TSLA) rose more than 7% as investors bought a recent dip in the electric vehicle maker on the heels of fresh positive remarks from Wall Street.\n\nBaird placed Tesla on its ‘best ideas’ list, outlining several tailwinds -- including the Cybertruck launch, the wider adoption of self-driving software, and ongoing growth in the energy business – that could overshadow concerns about softer margins from recent price cuts.\n\nStory continues\n\nPalo Alto shines on earnings stage\n\nPalo Alto Networks (NASDAQ:PANW) rose more than 14% after the software maker reported better-than-expected quarterly earnings and annual guidance that topped Wall Street estimates.\n\n“The results were better than feared and the company's end-to-end cybersecurity platform is set to yield solid financial leverage and more than 35% free cash flow,” Oppenheimer said, adding that the company’s \"platformization\" of its portfolio can successfully deliver sustainable profitable growth.\n\nEnergy, consumer staples stumble\n\nEnergy stocks including Valero Energy Corporation (NYSE:VLO), Exxon Mobil Corp (NYSE:XOM) and Marathon Petroleum Corp (NYSE:MPC), were pressured by weaker oil prices as worries about the demand outlook continued amid a stuttering economy in China.\n\nConsumer staples, which tend to serve as a bond proxy given the sector's steady dividends, were also hurt by the surge in yields, with Target Corporation (NYSE:TGT), General Mills (NYSE:GIS), and Estee Lauder Companies Inc (NYSE:EL) among the biggest decliners in the sector.\n\nRelated Articles\n\nStock market today: Dow slips as consumer staples, energy fall to offset tech\n\nLawsuit claiming Apple Watch sensor exhibits 'racial bias' is dismissed\n\nNewmont gets Aussie regulatory nod for $16.8 billion Newcrest deal", "link": "https://finance.yahoo.com/news/stock-market-today-dow-slips-161553643.html", "symbols": ["5AP.F", "DJI.INDX", "EL.US", "GIS.US", "MPC.US", "NVDA.US", "PANW.US", "TGT.US", "TSLA.US", "VLO.US", "XOM.US"], "tags": [], "sentiment": {"polarity": 0.987, "neg": 0.056, "neu": 0.829, "pos": 0.115}}, {"date": "2023-08-21T16:11:51+00:00", "title": "US STOCKS-Wall St mixed as investors await Nvidia earnings, Jackson Hole meet", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click LIVE/ or type LIVE/ in a news window.)\n\n*\n\nGS weighs sale of part of wealth business, shares fall\n\n*\n\nPalo Alto Networks jumps on upbeat forecast\n\n*\n\nVMware gains as UK clears buyout by Broadcom\n\n*\n\nIndexes: Dow down 0.63%, S&P down 0.16%, Nasdaq up 0.31%\n\n(Updated at 11:45 a.m. ET/1545 GMT)\n\nBy Amruta Khandekar and Shristi Achar A\n\nAug 21 (Reuters) - Wall Street's main indexes were mixed on Monday with the Nasdaq boosted by gains in Nvidia ahead of its earnings this week, while investors awaited a meeting of central bankers for more clues on the U.S. interest rate path.\n\nNvidia, which sharply outperformed its megacap peers with gains of nearly 6% last week, climbed 4.5% as HSBC raised its price target on the stock to $780, the second highest on Wall Street.\n\nThe company is expected to forecast quarterly revenue above analysts' estimates when it reports results on Wednesday. Its results will help determine whether this year's stock market rally, fueled by optimism around the potential for artificial intelligence, will continue.\n\n\"(Nvidia earnings) are important for the next step in the marmarket. Ifey were to disappoint, you would see risk-off (sentiment) for a number of days until we get more information from the Fed on Friday,\" said Thomas Hayes, chairman at Great Hill Capital LLC.\n\nOther beaten-down growth shares gained as well, with Tesla snapping six straight sessions of losses to rise 4.4% after brokerage Baird Equity Research added the stock to its \"best ideas\" list.\n\nAt 11:45 a.m. ET, the Dow Jones Industrial Average was down 217.62 points, or 0.63%, at 34,283.04, the S&P 500 was down 6.86 points, or 0.16%, at 4,362.85, and the Nasdaq Composite was up 40.77 points, or 0.31%, at 13,331.55. The S&P 500 information technology sector, which houses Nvidia, rose 0.7% while real estate and utilities were a drag, down more than 1% each.\n\nInvestors are now keenly waiting for comments from Federal Reserve Chair Jerome Powell on Friday at a meeting of central bankers at Jackson Hole in Wyoming that begins on Aug. 24, to gauge the direction for interest rates.\n\nStory continues\n\nThe strong advance in equities this year on signs of cooling inflation has stalled in August, with the S&P 500 losing more than 5% from its intra-day high in late July.\n\nPressuring stocks, the yield on the 10-year note rose to a 15-year high of 4.35% on Monday as recent evidence of a robust U.S. economy stokes concerns the Federal Reserve could keep rates higher for longer. Traders' bets for a pause in rate hikes in September stood at nearly 86.5%, according to the CME Group's Fedwatch tool.\n\nAmong other stocks, Palo Alto Networks jumped 15.9% as the cybersecurity firm forecast annual billings above expectations.\n\nThe Dow declined as Johnson and Johnson lost 2.6% after the healthcare conglomerate said it was expecting to retain a stake of about 9.5% in its newly separated consumer health unit, Kenvue.\n\nAlso hurting the cyclicals-heavy index was a 1.4% fall in Goldman Sachs after the Wall Street bank said it was weighing the sale of a part of its wealth business.\n\nVMware gained 4.1% after UK's competition regulator cleared Broadcom's purchase of the cloud computing firm.\n\nDeclining issues outnumbered advancers by a 2.38-to-1 ratio on the NYSE and a 1.46-to-1 ratio on the Nasdaq.\n\nThe S&P index recorded one new 52-week high and 18 new lows, while the Nasdaq recorded 27 new highs and 141 new lows.\n\n(Reporting by Amruta Khandekar and Shristi Achar; Editing by Arun Koyyur and Vinay Dwivedi)", "link": "https://finance.yahoo.com/news/us-stocks-wall-st-mixed-161151444.html", "symbols": ["BZF1.F", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "VMW.US"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.037, "neu": 0.854, "pos": 0.109}}, {"date": "2023-08-21T15:34:52+00:00", "title": "Is NVIDIA Corp (NVDA) Significantly Overvalued? A Comprehensive Valuation Analysis", "content": "NVIDIA Corp (NASDAQ:NVDA) recently experienced a daily gain of 4.62% and a 3-month gain of 36.7%. The company's Earnings Per Share (EPS) stands at 1.92. However, the question arises: is the stock significantly overvalued? In this article, we will delve into the valuation analysis of NVIDIA, providing a comprehensive examination of its financial health, profitability, and growth.\n\nCompany Overview\n\nWarning! GuruFocus has detected 10 Warning Signs with NVDA. Click here to check it out.  NVDA 30-Year Financial Data The intrinsic value of NVDA\n\nNVIDIA Corp (NASDAQ:NVDA) is a leading designer of discrete graphics processing units that enhance the experience on computing platforms. The firm's chips are used in various end markets, including PC gaming and data centers. In recent years, NVIDIA has broadened its focus from traditional PC graphics applications such as gaming to more complex and favorable opportunities, including artificial intelligence and autonomous driving. This shift leverages the high-performance capabilities of the firm's products.\n\nWith a current share price of $453, NVIDIA boasts a market cap of $1.10 trillion. However, its GF Value, an estimation of fair value, stands at $312.97, indicating that the stock might be significantly overvalued. Let's delve deeper into this valuation. Is NVIDIA Corp (NVDA) Significantly Overvalued? A Comprehensive Valuation Analysis\n\nUnderstanding GF Value\n\nThe GF Value represents the current intrinsic value of a stock derived from our exclusive method. It is calculated based on historical multiples that the stock has traded at, a GuruFocus adjustment factor based on the company's past returns and growth, and future estimates of the business performance. The GF Value Line on our summary page gives an overview of the fair value that the stock should be traded at.\n\nIf the stock price is significantly above the GF Value Line, it is overvalued, and its future return is likely to be poor. On the other hand, if it is significantly below the GF Value Line, its future return will likely be higher. According to our analysis, NVIDIA (NASDAQ:NVDA) is believed to be significantly overvalued.\n\nStory continues\n\nGiven that NVIDIA is significantly overvalued, the long-term return of its stock is likely to be much lower than its future business growth. Is NVIDIA Corp (NVDA) Significantly Overvalued? A Comprehensive Valuation Analysis\n\nFinancial Strength\n\nInvesting in companies with poor financial strength has a higher risk of permanent loss of capital. Thus, it is important to carefully review the financial strength of a company before deciding whether to buy its stock. Looking at the cash-to-debt ratio and interest coverage is a great starting point for understanding the financial strength of a company.\n\nNVIDIA has a cash-to-debt ratio of 1.27, which is worse than 58.84% of 865 companies in the Semiconductors industry. However, GuruFocus ranks the overall financial strength of NVIDIA at 8 out of 10, which indicates that the financial strength of NVIDIA is strong. Is NVIDIA Corp (NVDA) Significantly Overvalued? A Comprehensive Valuation Analysis\n\nProfitability and Growth\n\nInvesting in profitable companies, especially those with consistent profitability over the long term, is typically less risky. A company with high profit margins is usually a safer investment than those with low profit margins. NVIDIA has been profitable 10 over the past 10 years. Over the past twelve months, the company had a revenue of $25.90 billion and Earnings Per Share (EPS) of $1.92. Its operating margin is 17.37%, which ranks better than 75.75% of 936 companies in the Semiconductors industry. Overall, the profitability of NVIDIA is ranked 10 out of 10, which indicates strong profitability.\n\nGrowth is probably one of the most important factors in the valuation of a company. GuruFocus' research has found that growth is closely correlated with the long-term performance of a company's stock. If a company's business is growing, the company usually creates value for its shareholders, especially if the growth is profitable. NVIDIA's 3-year average revenue growth rate is better than 87.86% of 865 companies in the Semiconductors industry. However, NVIDIA's 3-year average EBITDA growth rate is 20.1%, which ranks worse than 52.99% of 768 companies in the Semiconductors industry.\n\nROIC vs WACC\n\nReturn on invested capital (ROIC) measures how well a company generates cash flow relative to the capital it has invested in its business. The weighted average cost of capital (WACC) is the rate that a company is expected to pay on average to all its security holders to finance its assets. We want to have the return on invested capital higher than the weighted cost of capital. For the past 12 months, NVIDIA's return on invested capital is 20.32, and its cost of capital is 16.75. Is NVIDIA Corp (NVDA) Significantly Overvalued? A Comprehensive Valuation Analysis\n\nConclusion\n\nIn summary, the stock of NVIDIA Corp (NASDAQ:NVDA) is believed to be significantly overvalued. The company's financial condition is strong and its profitability is strong. Its growth ranks worse than 52.99% of 768 companies in the Semiconductors industry. To learn more about NVIDIA stock, you can check out its 30-Year Financials here.\n\nTo find out the high quality companies that may deliver above-average returns, please check out GuruFocus High Quality Low Capex Screener.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/nvidia-corp-nvda-significantly-overvalued-153452801.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.035, "neu": 0.766, "pos": 0.198}}, {"date": "2023-08-21T15:31:00+00:00", "title": "Nvidia ETFs in Focus Ahead of Q2 Earnings", "content": "Investors' favorite Nvidia NVDA is set to release second-quarter fiscal 2024 results on Aug 23, after market close.\r\n\r\nThis graphics chipmaker, currently the world’s most valuable semiconductor company, has been at the forefront of the rally in technology stocks this year, skyrocketing more than 200%. The rally was driven by optimism about the potential of artificial intelligence and the demand for components necessary to power the technology. Notably, Nvidia stock has risen about 39%, much higher than the industry average of 17.2% (read: Why to Buy Nvidia Even After 212% YTD Jump? ETFs in Focus).\r\n\r\nThe outperformance is expected to continue given that the chipmaker is likely to come up with earnings beat in its Q2 report. Additionally, Wall Street analysts have turned more bullish ahead of the chipmaker’s quarterly earnings report. Given this, ETFs having the largest allocation to Nvidia could make compelling plays ahead of its earnings report. These include VanEck Vectors Semiconductor ETF SMH, AXS Esoterica NextG Economy ETF WUGI, Global X Robotics & Artificial Intelligence ETF BOTZ, Pacer Data and Digital Revolution ETF TRFK and The Spear Alpha ETF SPRX.\n\nEarnings Whispers\n\nNvidia currently has a Zacks Rank #1 (Strong Buy) and an Earnings ESP of +2.39%. According to our methodology, the combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the chances of an earnings beat. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\r\n\r\nThis videogame-gear specialist saw no earnings estimate revision over the past 30 days for the second quarter of fiscal 2024. Nvidia’s earnings surprise history is good as it delivered an earnings surprise of 0.26%, on average, in the last four quarters. Nvidia is expected to post earnings and revenue growth of 303.9% and 64.6%, respectively, for the to-be-reported quarter.\r\n\r\nNvidia currently has an average brokerage recommendation (ABR) of 1.24 on a scale of 1 to 5 (Strong Buy to Strong Sell), calculated based on the actual recommendations (Buy, Hold, Sell etc.) made by 35 brokerage firms. The current ABR compares to an ABR of 1.24 a month ago based on 35 recommendations.\r\n\r\nOf the 35 recommendations deriving the current ABR, 29 are Strong Buy and three are Buy. Strong Buy and Buy, respectively, account for 82.86% and 8.57% of all recommendations. A month ago, Strong Buy made up 82.86%, while Buy represented 8.57%.\r\n\r\nBased on short-term price targets offered by 33 analysts, the average price target for Nvidia comes to $489.55. The forecast ranges from a low of $215.00 to a high of $600.00.\n\nStory continues\n\nWhat’s Hot?\n\nAnalysts are bullish on the chipmaker as most of them like Oppenheimer, UBS, Raymond James, Wells Fargo raised the price target on Nvidia ahead of its earnings.\r\n\r\nNvidia became the world’s ninth public company and the first chipmaker to ever hit the trillion level at the end of May. The chipmaker is seeing explosive demand for its cutting-edge chips used in AI applications, which are used to power ChatGPT and many similar services, and is boosting supply to meet surging demand. Nvidia's chips are used in applications ranging from robotics and the metaverse to medical imaging and video analytics (read: Nvidia Hits Trillion-Dollar Market Cap: 5 ETFs to Track).\r\n\r\nFor the second quarter of fiscal 2024, the graphics chipmaker expects revenues of around $11 billion, plus or minus 2%, on increased demand for its data-center family of products, including H100, Grace CPU, Grace Hopper Superchip, NVLink, Quantum 400 InfiniBand and BlueField-3 DPU, sparked by the AI boom.\r\n\r\nOn the Q1 earnings call, Nvidia CEO Jensen Huang said the company is seeing “surging demand” for these products and is “significantly increasing” supply. The company is boosting supply to meet surging demand for its artificial intelligence chips, which are used to power ChatGPT and many similar services.\n\nETFs in Focus\n\nLet’s delve into each ETF below:\r\n\r\nVanEck Vectors Semiconductor ETF (SMH)\r\n\r\nVanEck Vectors Semiconductor ETF offers exposure to the companies involved in semiconductor production and equipment. SMH follows the MVIS US Listed Semiconductor 25 Index, which tracks the most liquid companies in the industry based on market capitalization and trading volume. VanEck Vectors Semiconductor ETF holds 26 stocks in its basket, with Nvidia occupying the top position at 20.3%. \r\n\r\nVanEck Vectors Semiconductor ETF has managed assets worth $9.4 billion and charges 35 bps in annual fees and expenses. SMH is heavily traded with a volume of 6.7 million shares per day and has a Zacks ETF Rank #2 (Buy) with a High risk outlook.\r\n\r\nAXS Esoterica NextG Economy ETF (WUGI)\r\n\r\nAXS Esoterica NextG Economy ETF is an actively managed ETF that invests in stocks of companies that benefit from the ever-evolving digital economy. It holds 31 stocks in the basket, with Nvidia occupying the top position at 18.9%.\r\n\r\nAXS Esoterica NextG Economy ETF has accumulated $21.3 million in its asset base and charges 75 bps in fees per year. It trades in an average daily volume of 2,000 shares.\r\n\r\nGlobal X Robotics & Artificial Intelligence ETF (BOTZ)\r\n\r\nGlobal X Robotics & Artificial Intelligence ETF follows the Indxx Global Robotics & Artificial Intelligence Thematic Index, which seeks investment in companies that stand to benefit from the increased adoption and utilization of robotics and AI, including those involved with industrial robotics and automation, non-industrial robots and autonomous vehicles (read: Guide to Artificial Intelligence ETFs).\r\n\r\nGlobal X Robotics & Artificial Intelligence ETF has 43 stocks in its basket, with NVIDIA occupying the second spot with a 14% share. The ETF has AUM of $2.2 billion and an average daily volume of 1.5 million shares. It charges 69 bps in annual fees.\r\n\r\nPacer Data and Digital Revolution ETF (TRFK)\r\n\r\nPacer Data and Digital Revolution ETF aims to offer investors exposure to the globally listed stocks and depositary receipts of data and digital revolution companies. It follows the Pacer Data Transmission and Communication Revolution Index, holding 81 stocks in its basket. Out of these, Nvidia is the top firm, accounting for a 10.7% share. Semiconductors take the largest share at 33.8%, while system software and communication equipment round off the next two spots.\r\n\r\nPacer Data and Digital Revolution ETF debuted in June last year and has accumulated $1.1 million in its asset base. It has an expense ratio of 0.60%. TRFK trades in a meager volume of under 1000 shares per day on average.\r\n\r\nThe Spear Alpha ETF (SPRX)\r\n\r\nThe Spear Alpha ETF is an actively managed fund that invests in companies poised to benefit from breakthrough trends in industrial technology. The ETF’s objective is to find underappreciated opportunities across different industrial supply chains that are beneficiaries of secular themes such as enterprise digitalization, automation & robotics, artificial intelligence, environmental focus and decarbonization, photonics and additive manufacturing, and space exploration. The Spear Alpha ETF holds 25 stocks in its basket, with Nvidia taking the top spot at 9.4% share.\r\n\r\nThe Spear Alpha ETF has accumulated $11.2 million in its asset base and charges 75 bps in annual fees. It trades in an average daily volume of 33,000 shares.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nVanEck Semiconductor ETF (SMH): ETF Research Reports\n\nGlobal X Robotics & Artificial Intelligence ETF (BOTZ): ETF Research Reports\n\nAXS Esoterica NextG Economy ETF (WUGI): ETF Research Reports\n\nSpear Alpha ETF (SPRX): ETF Research Reports\n\nPacer Data and Digital Revolution ETF (TRFK): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/nvidia-etfs-focus-ahead-q2-153100303.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.023, "neu": 0.85, "pos": 0.127}}, {"date": "2023-08-21T15:28:18+00:00", "title": "5 Safe Stocks Under $40 to Buy Immediately", "content": "This article is an excerpt from the InvestorPlace Digest newsletter. To get news like this delivered straight to your inbox, click here.\n\nIt’s been a rough month for high-growth tech stocks. The tech-heavy Nasdaq-100 index has fallen 6% since July, and many of its constituents are down even more. Fast-growing moonshots from Enphase Energy (NASDAQ:ENPH) to electric vehicle maker Tesla (NASDAQ:TSLA) have lost close to 20% of their market values in less than a month.\n\nThat’s because investors have been pivoting into safer stocks. Over the past month, some of the top performers have included pharma company Eli Lilly (NYSE:LLY) (up 20%), energy company APA (NASDAQ:APA) (up 16%), and telecom firm Charter Communications (NASDAQ:CHTR) (up 9%).\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThese moves are reflected in fund flow data.\n\nIn the past week alone, investors have unloaded $4.2 billion of the popular Nasdaq-100 ETF Invesco QQQ Trust (NASDAQ:QQQ), making it the most sold exchange-traded fund in the world.\n\nMeanwhile, blue-chip ETFs are gaining ground. During the same period, ETF inflows went into S&P 500 indices and the iShares MSCI USA Min Vol ETF (BATS:USMV) – an index tracker that seeks to reduce volatility. Bar chart of top bought and sold etfs in August 2023\n\nOur writers at InvestorPlace.com, our free news site, have also pivoted to recommending shares of safer stocks, especially firms that will thrive in a market pullback.\n\nWith investor sentiment suddenly taking a downwards turn, here are the five under-$40 safe stocks our writers and analysts are recommending this week…\n\n5 Safe Stocks Under $40 to Buy Immediately: Pfizer (PFE) Pfizer logo on Pfizer building. Pfizer is an American pharmaceutical corporation.\n\nSource: Manuel Esteban / Shutterstock.com\n\nShares of Pfizer (NYSE:PFE) fell 30% this year as investors pivoted away from the Covid-19 winner. Prices of the pharma giant now sit below their pre-pandemic levels\n\nInvestorPlace.com writer Jeremy Flint sees this as a perfect opportunity to buy in.\n\nHere’s from his recent update:\n\nPfizer remains focused on the future, with a robust pipeline ensuring a steady stream of revenue. Its production and distribution networks also ensure the company can compete against generics, threatening its bottom line. Analysts are just as bullish on Pfizer, with estimates indicating PFE is nearly 35% undervalued today. The company’s growing revenue, profits, and 4% dividend yield also make Pfizer perfect for undervalued blue-chip seekers.\n\nStory continues\n\nEssentially, bearish investors have become overly focused on Pfizer’s declining sales of Comirnaty and Paxlovid – two Covid-19 treatments with plummeting demand. To these skeptics, Pfizer has become the next Gilead Sciences (NASDAQ:GILD) – a company that became reliant on therapies for a single disease. It’s a high-risk strategy that can quickly fall apart once that disease ebbs. (Gilead still trades 32% below its 2015 high).\n\nBut Pfizer is no one-trick pony. The New York-based company has dozens of other high-performing treatments on the market, and owns a pipeline with several potential blockbusters in the making. Its treatments for respiratory disease, migraines, and blood cancers could be worth $1 billion or more.\n\nPfizer’s size also gives it significant advantages in the pharma industry. According to data from Thomson Reuters, the company outspends all but two competitors in research and development (R&D). Its sales team is also one of the most efficient in the industry, with overheads consuming less than 17% of the company’s revenues.\n\nThat makes Pfizer’s $35 stock an unusual outlier in its industry. Shares currently trade at 10X forward earnings, a level that probably won’t last long.\n\n2. Intel (INTC) Close up of Intel (INTC) sign at entrance of The Intel Museum in Silicon Valley. Intel is an American multinational corporation and technology company.\n\nSource: JHVEPhoto / Shutterstock.com\n\nMany investors mistakenly view Intel (NASDAQ:INTC) as a risky turnaround. The company’s failure to keep up with Taiwan Semiconductor Manufacturing (NYSE:TSM) has left the Silicon Valley pioneer a generation behind in chip technology. Intel’s R&D bosses are now trying to leapfrog to 1.8-nanometer technology, a risky strategy that might not pay off.\n\nYet, Intel remains the dominant player in CPU and server chips.\n\nThe company has increased its share of the CPU market by 6.4% to 82.7% this year and has been aggressively defending its server business from Advanced Micro Devices (NASDAQ:AMD).\n\nAnalysts expect Intel to generate $20 billion in operating cash in 2024, a 32% increase from last year’s figures.\n\nThis week, Larry Ramer from InvestorPlace.com joins top analyst Eric Fry and me in recommending Intel, a company that Eric calls “the next trillion-dollar stock.”\n\nHere’s from Ramer:\n\nIntel looks poised to get strong boosts from multiple, powerful trends. Specifically, the company is well-positioned to be lifted by the increased demand for PCs and by its AI chips…\n\nThe company is also building a large semiconductor factory in Arizona, and will get subsidies for its chip factories from Washington and the EU. Further, Nvidia has expressed interest in having Intel build its chips.\n\nIntel is far safer of a stock than people realize.\n\nArtificial intelligence servers still require powerful CPUs that Intel produces. And even Intel’s higher-cost fabrication business will soon become an asset. Governments are waking up to the risks of outsourcing advanced chipmaking and are pouring taxpayer money into homegrown players. Even Nvidia (NASDAQ:NVDA) might use Intel to produce its chips someday.\n\nEric just released a presentation on how the stage is set for AI once again. Only this time, we’re on the verge of seeing an AI panic unlike anything you could ever imagine. Watch Eric share his 1,000% AI blueprint for turning the coming panic into 1,000% profit potential in the days ahead.\n\n3. SoFi Technologies (SOFI) the Social Finance (SoFi stock) logo is displayed on a smartphone.\n\nSource: rafapress / Shutterstock.com\n\nShares of SoFi Technologies (NASDAQ:SOFI) have pulled back in recent weeks, despite the firm announcing a “beat-and-raise” quarter. Q2 earnings came in well ahead of expectations, and the fintech firm raised its full-year 2023 revenue guidance to $2 billion of adjusted net revenue.\n\nIt’s why top InvestorPlace.com analyst Louis Navellier and his team now sees SoFi’s $8 share price a golden opportunity to buy in. They note that the “neobank” likely remains on track to achieve GAAP profitability by Q4.\n\nTo see more about Louis’ most recent presentation, click here.\n\n“Although it is far from certain how this stock will perform in the near-term as the long-term growth potential of this financial services industry disruptor remains intact, the chances of higher prices for shares down the road remain very strong.”\n\nFundamentally, SoFi is a financial institution that uses student loans as a loss leader to access potential customers. Shares sold off in 2022 as investors wondered whether the company could convert enough borrowers into higher-margin products to survive.\n\nThis year’s results have shown the answer is “yes.” On July 31, SoFi revealed the number of checking and savings customers rose 47% year over year, vastly outpacing the 6% growth in student loans. Rising interest rates would further push SoFi’s net interest up 477% year over year.\n\nThe company also gets a B grade in Louis’ Portfolio Grader, ranking the company above traditional banks, from C-grade Bank of America (NYSE:BAC) to D-grade Citigroup (NYSE:C).\n\nTo see more how Louis uses his AI-powered Portfolio Grader to the right time to buy the best blue chips, click here.\n\n4. Freeport-McMoRan (FCX) Freeport-McMoRan Stock's Long List of Catalysts Boosts Its Buy Status\n\nSource: 360b / Shutterstock.com\n\nAt first glance, shares of Freeport-McMoRan (NYSE:FCX) look unexciting at best. The world’s largest copper miner will generate only $1.55 earnings per share this year, a 35% decline from 2022. Falling copper prices and sagging Chinese demand have pushed share prices under $40.\n\nBut Eric sees significant opportunities for this blue-chip miner. This week at InvestorPlace.com, he notes how Freeport is quickly becoming a top user of artificial intelligence:\n\nThe terms “copper miner” and “artificial intelligence” do not obviously relate to one another. But in the case of Freeport, they do.\n\nFreeport has been using a machine-learning model at its Bagdad copper mine in Arizona to boost production. This model uses data from sensors around the mine to “tailor” the ore-processing method to each of the seven distinct types of ore that come from the mine.\n\nBecause of the company’s success with AI at Bagdad, it is rolling out the technology across several other mines and expects to increase its annual copper production by a hefty 5% “with very little capital investment.”\n\nThe company is also a beneficiary of the EV revolution. Each new plug-in vehicle uses roughly 4X more copper than gas-powered ones, and the International Copper Association estimates that EV demand will add 1 million tons of annual demand by 2027. Copper futures reflect this reality, with forward prices trading at a 20-year high relative to spot prices.\n\nThat means Freeport could return to 2021-level profits by 2025, sending shares well into the $50 range.\n\nU.S. Bancorp (USB) The logo for U.S. Bancorp's U.S. Bank is displayed on the side of a building.\n\nSource: Michael Vi / Shutterstock.com\n\nFinally, Tyrik Torres highlights U.S. Bancorp (NYSE:USB) this week at InvestorPlace.com as a top safe stock to buy the dip.\n\nU.S. Bancorp has been one of the most consistent performers among U.S. banks, delivering superior profitability and efficiency ratios throughout the years. In the second quarter of 2023, the bank reported a net income of $1.5 billion.\n\nWhile U.S. Bancorp’s shares are down 9.5% year-to-date, the stock remains undervalued. U.S. Bancorp is trading at around 9.3 times forward earnings. The bank also offers an attractive dividend yield of 4.87%.\n\nPut another way, U.S. Bancorp is one of the most profitable regional banks in America.\n\nThe company generates 11% return on equity, and Wall Street analysts expect the firm to produce $6.8 billion in net income this year, a 3% increase from 2022.\n\nThe bank is also surprisingly safe, thanks to a focus on conservative underwriting and diversified business lines. Quarter net charge-offs peaked at 2.5% during the 2007-08 financial crisis, far lower than the 3%-plus rates that others saw. Meanwhile, the company’s highly efficient non-banking businesses bring in a steady stream of profits. Payment services alone accounts for over a quarter of corporate profits.\n\nThat makes U.S. Bancorp’s recent drawdown an attractive opportunity to buy the dip. Shares have not yet fully recovered from this year’s regional banking crisis, and shares trade at only 1.1X book value – a level that suggests at least a 20% near-term upside, relative to returns.\n\nThe 2023 Quality Discount\n\nOrdinarily, nice things are expensive. People pay more for first-class flights… luxury cars… designer handbags… you name it.\n\nBut what if high-quality items suddenly became cheap?\n\nWe’d be lining out the door at the Porche dealership!\n\nThat exact opportunity is now happening in the U.S. stock market. High-quality firms like U.S. Bancorp are trading at near book value while lower-returning ones like Morgan Stanley (NYSE:MS) are going for a higher 1.4X multiple.\n\nThe story is the same no matter where you look. Earlier this week, Vietnamese electric vehicle startup VinFast Auto (NASDAQ:VFS) became worth more than Ford Motor (NYSE:F) and General Motors (NYSE:GM) combined, despite selling only 7,400 vehicles in 2022. MotorTrend called the VinFast VF8 a project that would take “cubic dollars to fix” after basic functions like climate control and parking brakes failed to work properly.\n\nThere’s no hold function, so you’d better keep Creep mode engaged so it’s always sending power to the motors. Disable Creep, and the car will roll away in gear.\n\nMeanwhile, blue chips like Volkswagen (OTCMKTS:VWAGY) are selling for less than 4X forward earnings.\n\nIn a topsy-turvy market like this, it’s no wonder investors are taking profits in expensive companies and moving into far safer bets.\n\nAs of this writing, Tom Yeung held a LONG position in GM. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nTom Yeung is a market analyst and portfolio manager of the Omnia Portfolio, the highest-tier subscription at InvestorPlace. He is the former editor of Tom Yeung’s Profit & Protection, a free e-letter about investing to profit in good times and protecting gains during the bad.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 5 Safe Stocks Under $40 to Buy Immediately appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/5-safe-stocks-under-40-152818489.html", "symbols": ["AMD.US", "APA.US", "BAC.US", "C.US", "CHTR.US", "ENPH.US", "F.US", "FCX.US", "GILD.US", "GM.US", "INTC.US", "LLY.US", "MS.US", "NVDA.US", "PFE.US", "QQQ.US", "SOFI.US", "TSLA.US", "TSM.US", "UB5.F"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.037, "neu": 0.809, "pos": 0.154}}, {"date": "2023-08-21T15:26:00+00:00", "title": "Nvidia Is Helping to Pull Up Some of the Big-Cap Tech Stocks", "content": "It may not be that logical, but the emotions of AI are making interest rate concerns less important.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6f86daca-5984-313e-8e79-fcd17bbb7c86/nvidia-is-helping-to-pull-up.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.701, "neg": 0, "neu": 0.756, "pos": 0.244}}, {"date": "2023-08-21T14:52:14+00:00", "title": "Nvidia &amp; retail earnings, Jackson Hole: What to watch this week", "content": "There will be a lot of interest in Nvidia's (NVDA) second quarter earnings on Wednesday. Investors will also be eyeing results from Macy's (M), Lowe's (LOW), Peloton (PTON), Gap (GPS), Toll Brothers (TOL), and Dollar Tree (DLTR). There is some key housing data on tap Tuesday and Wednesday. The big event of the week though is Federal Reserve Chairman Jerome Powell's speech at the Jackson Hole Economic Symposium on Friday. Yahoo Finance Reporter Josh Schafer breaks down the events investors need to be watching this week.\n\nVideo Transcript\n\n- Well, we have a solid week ahead of us with housing data, the Fed, big earnings. Here to break it all down for us, Yahoo Finance reporter, Josh Schafer. Hey, Josh.\n\nJOSH SCHAFER: Hey, Julie. Yeah. So we've got another fun week to close out our-- almost close out August for us. Here and right now, what I have next to me is the earnings schedule for this week. So you can see we're expecting Zoom today. We're going to have Dick's Sporting Goods and Lowe's later this week. Urban Outfitters, Macy's, Gap. Another look at that consumer.\n\nBut the big one here, we gave it its own special day. I should mention companies like Peloton also report on Wednesday, but we did circle out Nvidia on purpose. This will be a key market driver to find out what we know more about in that artificial intelligence story. You remember Nvidia boosting its guidance last quarter, saying it expected revenue to grow about 50% more than it initially had. That sent the stock soaring. That sent really the stock market soaring and the NASDAQ soaring in that overall AI hype story.\n\nThe street right now is expecting Nvidia to report about $11 billion in quarterly revenue. So we'll be closely tracking if they meet that number. Julian Emanuel, a strategist over Evercore, said that he thinks how Nvidia performs on Wednesday after the bell could tell us if stocks continue to head down for August or if we get a bounce back. So it seems like not just a report, Julie, for tech there but maybe a report that tells us about overall market sentiment depending on how it goes.\n\nStory continues\n\n- Yeah, for sure. Let's also talk eco data for the week because we got some stuff there to pay attention.\n\nJOSH SCHAFER: Yeah. It's another fun week of eco data. And really, the big one here is on Friday. But when you take a look, we have existing home sales and some home data that we're going to be taking a look at this week. And then also be interesting to see if manufacturing PMI ticks back up closer to that 50 number.\n\nBut you notice there's not a lot of the bigger stuff we normally talk about in terms of any look at inflation or labor, which is important to note because we have Federal Reserve Chair Jay Powell speaking on Friday at Jackson Hole. Now some economists think that we won't get much of an indicator on what the Fed feels about rates for the September meeting and if they're going to move again because we don't have those key data points. We're going to have the labor report come next week. We're going to have another print on inflation also come next week.\n\nSo I think what the large portion of the focus is going to be for this meeting is how Chair Powell feels about the overall resilient economy that we've been talking about for the last two months. Has it been too resilient, and does he come out and be more hawkish? There are some people sort of anticipating that. So the final thing I want to take a look at here is just the September expectations for if the Fed were to move or not.\n\nYou can see here, right now, the market is pricing in a nearly 89% chance that the Fed does not move interest rates come September. This will be the chart I'm looking at Friday afternoon to see what happens to this chart right here after Chair Powell speaks. Do we see people more confident that the Fed will hold in September? Or is he overly hawkish, and maybe there's a little bit more movement here that people might expect a move on interest rates to come in September? That's something I'm excited for come Friday.\n\n- I mean, those move a lot. So we're definitely going to see something happen there.", "link": "https://finance.yahoo.com/video/nvidia-retail-earnings-jackson-hole-145214933.html", "symbols": ["34U.F", "DLTR.MX", "DLTR.US", "DT3.F", "FDO.F", "GAP.F", "GPS.MX", "GPS.US", "LOW.US", "LOWC34.SA", "LWE.F", "M&M.BSE", "M&M.NSE", "M.US", "MACY34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.004, "neu": 0.911, "pos": 0.084}}, {"date": "2023-08-21T14:26:49+00:00", "title": "US STOCKS-S&amp;P 500, Nasdaq gain as investors await Nvidia earnings, Jackson Hole meet", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nPalo Alto Networks jumps on upbeat forecast\n\n*\n\nVMware gains as UK clears buyout by Broadcom\n\n*\n\nIndexes: Dow down 0.13%, S&P up 0.36%, Nasdaq up 0.82%\n\n(Updated at 9:55 a.m. ET/ 1355 GMT)\n\nBy Amruta Khandekar and Shristi Achar A\n\nAug 21 (Reuters) - The S&P 500 and Nasdaq climbed on Monday as Nvidia shares rose ahead of the chip designer's earnings this week, with investors also focused on a meeting of central bank policymakers for clues on the U.S. interest rate path.\n\nNvidia, which sharply outperformed its megacap peers with gains of nearly 6% last week, climbed 4.4% as HSBC raised its price target on the stock to $780, the second highest on Wall Street.\n\nThe company is expected to forecast quarterly revenue above analysts' estimates when it reports results on Wednesday. Its earnings will be a major test whether this year's stock market rally, fueled by optimism around the potential for artificial intelligence, will continue.\n\n\"If they (Nvidia) indicate that there is some acceleration in earnings and sales from AI or that they perceive an increase coming, it would be very meaningful to the market,\" said Rick Meckler, partner at Cherry Lane Investments.\n\nOther bruised growth stocks gained as well, with Tesla snapping six straight sessions of losses to rise 5.5%. The S&P 500 information technology sector led the advance among the 11 major sub-indexes, rising 1.1%, while the consumer discretionary sector climbed 1.1%.\n\nStrong gains in equities this year on signs of cooling inflation have come under test in August, with the S&P 500 losing more than 5% from its intra-day high in late July.\n\nThe yield on the 10-year note rose to a 15-year high of 4.342% as recent evidence of a robust U.S. economy stokes concerns the Federal Reserve could keep rates higher for longer.\n\nInvestors are now keenly waiting for comments from Federal Reserve Chair Jerome Powell on Friday at a meeting of central bankers at Jackson Hole in Wyoming that begins on Aug. 24.\n\nStory continues\n\n\"I don't think the market is looking for some statement suggesting rate rises are over. But investors are looking for anything that can turn the near-term negative sentiment,\" said Meckler.\n\nTraders' bets for a pause in rate hikes in September stood at nearly 89%, according to the CME Group's Fedwatch tool.\n\nPalo Alto Networks jumped 15.2% as the cybersecurity firm forecast annual billings above expectations.\n\nPressuring the Dow, Johnson and Johnson lost 2.2% after the healthcare conglomerate said it was expecting to retain a stake of about 9.5% in its newly separated consumer health unit, Kenvue, whose shares rose 1.4%.\n\nAt 9:55 a.m. ET, the Dow Jones Industrial Average was down 44.23 points, or 0.13%, at 34,456.43, the S&P 500 was up 15.75 points, or 0.36%, at 4,385.46, and the Nasdaq Composite was up 109.21 points, or 0.82%, at 13,399.99.\n\nVMware gained 4.4% after UK's competition regulator cleared U.S. tech company Broadcom's $69 billion purchase of the cloud computing firm.\n\nDeclining issues outnumbered advancers by a 1.21-to-1 ratio on the NYSE and a 1.04-to-1 ratio on the Nasdaq.\n\nThe S&P index recorded no new 52-week highs and 12 new lows, while the Nasdaq recorded 17 new highs and 82 new lows.\n\n(Reporting by Amruta Khandekar and Shristi Achar; Editing by Arun Koyyur and Vinay Dwivedi)", "link": "https://finance.yahoo.com/news/us-stocks-p-500-nasdaq-142649189.html", "symbols": ["5AP.F", "AVGO.US", "AVGO34.SA", "BZF1.F", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US", "VMW.US"], "tags": [], "sentiment": {"polarity": 0.979, "neg": 0.033, "neu": 0.882, "pos": 0.085}}, {"date": "2023-08-21T14:12:00+00:00", "title": "Upcoming earnings release could change the story of the 'Magnificent 7' tech stocks", "content": "The 'Magnificent 7' -- Apple, Meta, Microsoft, Amazon, Nvidia, Tesla and Google -- have led a surge in the markets throughout 2023. But this elite group has lost more than $600 billion in August alone.\n\nContinue reading", "link": "https://finance.yahoo.com/m/30761971-507e-340c-af81-3a7e1da84e2a/upcoming-earnings-release.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.318, "neg": 0.103, "neu": 0.764, "pos": 0.134}}, {"date": "2023-08-21T14:10:54+00:00", "title": "S&amp;P 500 rides Nvidia surge, shrugging off jolt in Treasury yields to 16-year highs", "content": "Investing.com -- The S&P 500 climbed Monday as Nvidia led a rebound in tech ahead of its quarterly results due Wednesday even as Treasury yields jumped to 16-year highs ahead of potential clues on monetary policy later this week.\n\nThe S&P 500 rose 0.5% higher, the Dow Jones Industrial Average fell 0.3%, 84 points, and Nasdaq rose 1.3%.\n\nNvidia leads surge in Technology ahead of results\n\nTech stocks were led higher by a more than 6% surge in NVIDIA Corporation (NASDAQ:NVDA) ahead of the chipmaker’s quarterly results due Wednesday.\n\nNvidia has been riding the wave of AI optimism since surprising Wall Street with blowout guidance in the fiscal quarter.\n\nAhead of the chipmaker’s third-quarter results, some are expecting more of the same on expectations amid optimism of an AI-led boost to data center growth.\n\n\"While we see hyperscale as being the largest consumer of AI training servers; demand for AI GPUs from entities beyond cloud services providers (emerging AI clouds, sovereign states, large enterprises, etc.) increased substantially from late March through the course of CQ2,” Wedbush said in a recent note.\n\nTreasury yields hit more than decade high ahead of Jackson Hole\n\nTreasury yields started the week on the front foot, with the 10-year Treasury yield surging to a more than 16-year high as investors anticipate that Federal Reserve chairman Jerome Powell may hint that further work is likely needed to slow inflation following recent signs of healthy economic growth.\n\n“With the market broadly on board with at least one additional rate hike by year-end, Powell is likely to emphasize the need to remain at a sufficiently restrictive level for some time with still ‘significant’ upside risks to inflation,” Stifel said in a note.\n\nTesla surges on Wall Street praise\n\nTesla Inc (NASDAQ:TSLA) rose more than 6% as investors bought a recent dip in the electric vehicle maker on the heels of fresh positive remarks from Wall Street.\n\nBaird placed Tesla on its ‘best ideas’ list, outlining several tailwinds -- including the Cybertruck launch, the wider adoption of self-driving software, and ongoing growth in the energy business – that could overshadow concerns about softer margins from recent price cuts.\n\nStory continues\n\nPalo Alto shines on earnings stage\n\nPalo Alto Networks (NASDAQ:PANW) rose more than 15% after the software maker reported better-than-expected quarterly earnings and annual guidance that topped Wall Street estimates.\n\n“The results were better than feared and the company's end-to-end cybersecurity platform is set to yield solid financial leverage and more than 35% free cash flow,” Oppenheimer said, adding that the company’s \"platformization\" of its portfolio can successfully deliver sustainable profitable growth.\n\nRelated Articles\n\nIndivior to pay $30 million to settle health plans' Suboxone claims\n\nGoldman Sachs weighs selling part of wealth business in broad strategy revamp", "link": "https://finance.yahoo.com/news/p-500-rides-nvidia-surge-141054593.html", "symbols": ["5AP.F", "NVDA.US", "PANW.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.021, "neu": 0.852, "pos": 0.128}}, {"date": "2023-08-21T14:04:05+00:00", "title": "Dow Jones Rises With Powell Speech On Deck; Nvidia Jumps On Price-Target Hikes", "content": "The Dow Jones Industrial Average dropped Monday, as investors braced for Fed Chair Powell's speech on Friday. Nvidia jumped on price-target hikes.\n\nContinue reading", "link": "https://finance.yahoo.com/m/56e76e42-1d77-3a8f-b4e1-e4e564250d18/dow-jones-rises-with-powell.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-21T14:03:00+00:00", "title": "Chip Stocks Gain Ahead of Nvidia's Second-Quarter Earnings", "content": "Investors are starting the week off by piling back into chip stocks ahead of [Nvidia's earnings report this week](https://www.wsj.com/finance/stocks/the-ai-trade-faces-its-first-major-test-with-nvidia-earnings-4e820df1).\n\nContinue reading", "link": "https://finance.yahoo.com/m/4115b5e2-189f-3cbc-8b7a-ee3d70f6de09/chip-stocks-gain-ahead-of.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-21T13:46:00+00:00", "title": "Nvidia leaps as KeyBanc, HSBC boost price targets into hotly anticipated Q2 earnings", "content": "Supply constraints could limit Nvidia's near-term sales forecast, but KeyBanc's John Vinh sees a potential China offset for the AI market leader.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6855c496-52f3-370b-b25a-d0187859a0f5/nvidia-leaps-as-keybanc%2C-hsbc.html", "symbols": ["2330.TW", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TSFA.F", "TSFA.STU", "TSM.US", "TSMC34.SA", "TSMN.MX"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-21T13:42:44+00:00", "title": "The One Stock to Watch in Trading This Week: Nvidia", "content": "The poster child for 2023's artificial intelligence frenzy, Nvidia, reports earnings this week. The stakes are high ahead of this week's earnings report—not just for Nvidia, but for the broader market.\n\nContinue reading", "link": "https://finance.yahoo.com/m/092e7e7d-41da-3433-aafb-480f28dcffde/the-one-stock-to-watch-in.html", "symbols": ["GSPC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.103, "neg": 0.048, "neu": 0.893, "pos": 0.059}}, {"date": "2023-08-21T13:36:26+00:00", "title": "Palo Alto stock surges after 'unique' Friday earnings release: 'Clearly, we have enjoyed the attention.'", "content": "Palo Alto Networks (PANW) stock rose more than 14% early Monday after the company's fourth quarter results topped Wall Street expectations, despite fears the company was planning to bury bad news with a Friday night earnings report.\n\n\"Our choice of Friday has definitely made us the topic du jour these past two weeks and has made for some very interesting reading of all the analyst notes,\" Palo Alto CEO Nikesh Arora told analysts during a conference call on Friday.\n\n\"We apologize to people who are inconvenienced, but as we had mentioned in our press release, we wanted to give ample time to analysts to have one-on-one calls with us over the weekend, and we have a sales conference that kicks off on Sunday.\n\n\"So again, we apologize for the unique Friday afternoon earnings call, but clearly, we've enjoyed the attention.\"\n\nIn early August, Palo Alto made a rare shift to announce earnings after the bell on a Friday, a move not seen by an S&P 500 company since Nike (NKE) in 2020. The stock had slumped nearly 20% on fears that bad news was coming from the company due to the adjusted earnings announcement date.\n\nPalo Alto delivered fourth quarter revenue of $1.44 billion, above the $1.28 billion analysts had expected, while the cybersecurity company projected full-year billings in a range of $10.9 billion-$11 billion. The Street had been expecting $10.77 billion.\n\nThese upbeat results may also bolster sentiment around the AI narrative headed into Nvidia's (NVDA) earnings, which are expected on Wednesday after the bell.\n\nIn a note titled \"Flying over the firewall of worry\" — a nod to timing-related concerns around the company's results — Jefferies analyst Joseph Gallo maintained a Buy rating and $285 price target on the stock.\n\n\"Results/Guide were much better than feared & PANW remains our fav platform benefitting from cyber consolidation & AI,\" Gallo wrote.\n\nSeveral Wall Street analysts had worried bad news may be coming from a Friday announcement.\n\nStory continues\n\nAnd the concerns could've been warranted.\n\nAs Wall Street Horizon's vice president of research Christine Short highlighted in Yahoo Finance's Chartbook, a late earnings announcement \"typically signals negative news on the horizon.\"\n\nWedbush Securities managing director Dan Ives called the move \"one of the biggest PR disasters and black eyes we have seen in decades of covering tech.\"\n\nAfter the results and call came and went without disappointing news, analysts celebrated the beats and the company's artificial intelligence promise.\n\nMeanwhile, UBS analyst Roger Boyd noted the Friday earnings date had his team fearing results could come in similar to fellow cybersecurity player Fortinet (FTNT), which is down nearly 30% since reporting disappointing results on August 3.\n\nUBS cited industry partners which said Palo Alto had been \"chasing deals\" to the end the quarter in a fashion similar to Fortinet.\n\n\"While this is admittedly a small sample size, and you have to be careful not to extrapolate that comment or Fortinet's underwhelming results too much, we still think it's noteworthy, especially when you consider the unconventional timing of the earnings release on a summer Friday,\" Boyd wrote in an earnings preview on August 10. The Palo Alto Networks Inc. logo, the American multinational cybersecurity company, being displayed on their stand during the Mobile World Congress 2023 on March 2, 2023, in Barcelona, Spain. (Photo by Joan Cros/NurPhoto via Getty Images)\n\nJosh Schafer is a reporter for Yahoo Finance.\n\nClick here for the latest economic news and economic indicators to help you in your investing decisions\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/palo-alto-stock-surges-after-unique-friday-earnings-release-clearly-we-have-enjoyed-the-attention-133626444.html", "symbols": ["5AP.F", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US"], "tags": [], "sentiment": {"polarity": -0.318, "neg": 0.071, "neu": 0.851, "pos": 0.078}}, {"date": "2023-08-21T13:13:33+00:00", "title": "Jackson Hole, Nvidia earnings, Tropical storm Hilary: 3 Things", "content": "The 10-year Treasury yield continues to surge ahead of Fed Chairman Jerome Powell's speech at the Jackson Hole Economic Symposium this week. Semiconductor producer Nvidia (NVDA) is set to report earnings after the closing bell on Wednesday, August 23. Tropical storm Hilary makes landfall over California as flood warnings coincide with an earthquake that shook up the West Coast state. Yahoo Finance's Julie Hyman breaks down several of the top stories this morning.", "link": "https://finance.yahoo.com/video/jackson-hole-nvidia-earnings-tropical-131333424.html", "symbols": ["GSPC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0.047, "neu": 0.906, "pos": 0.047}}, {"date": "2023-08-21T12:58:00+00:00", "title": "Tom Lee: We See Selloff Likely Ending at or Before Powell's Jackson Hole Speech", "content": "Among these are the stalling growth in China and the surge in US 10-yr yields and to a very secondary extent, Fitch downgrading the USA sovereign rating. Maybe, but we think probabilities favor equities bottoming at or before Fed Chair Powell's speech at Jackson Hole this coming Friday (8/25) at 10:05am. * Over our many conversations with institutional investors in the past week, the vast majority cite the rise in interest rates as the most concerning for equities.\n\nContinue reading", "link": "https://finance.yahoo.com/m/18027831-3f6f-3b78-8e62-c4503087560c/tom-lee%3A-we-see-selloff.html", "symbols": ["GSPC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.838, "neg": 0.017, "neu": 0.873, "pos": 0.11}}, {"date": "2023-08-21T12:56:00+00:00", "title": "We're Focused on the August Flash PMI, Jackson Hole, and Nvidia Earnings", "content": "* This week: August Flash PMI, Jackson Hole, Nvidia Earnings * Economists are more upbeat on the economy and soft-landing prospects * AAP Poll of the Week results see another rate hike likely * Treasury yields will gauge the market's reaction to Powell's Jackson Hole comments * What's on our shopping list.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f34514d2-cb05-364d-aea4-b41c29c3abad/we%27re-focused-on-the-august.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.459, "neg": 0, "neu": 0.922, "pos": 0.078}}, {"date": "2023-08-21T12:46:29+00:00", "title": "US STOCKS-Wall St set to open higher with focus on Jackson Hole meet, Nvidia earnings", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click LIVE/ or type LIVE/ in a news window.)\n\n*\n\nPalo Alto Networks jumps on upbeat forecast\n\n*\n\nVMware gains as UK clears buyout by Broadcom\n\n*\n\nFutures up: Dow 0.30%, S&P 0.47%, Nasdaq 0.70%\n\n(Updated at 8:27 a.m. ET/ 1227 GMT)\n\nBy Amruta Khandekar and Shristi Achar A\n\nAug 21 (Reuters) - Wall Street was set to open higher on Monday as investors awaited more clues on interest rates from a meeting of central bank policymakers at Jackson Hole and quarterly results from Nvidia later this week.\n\nStrong gains in equities this year on signs of cooling inflation have come under test in August, with the S&P 500 losing more than 5% from its intra-day high in late July.\n\nFresh evidence of a robust U.S. economy last week yet again stoked expectations the Federal Reserve could keep rates higher for longer, driving the 10-year Treasury yield to its highest level since October, and pulling stocks lower. If the yield on the 10-year note, last up at 4.298%, crosses 4.338%, it would hit its highest level since 2007.\n\nInvestors are now keenly waiting for comments from Federal Reserve Chair Jerome Powell on Friday at a meeting of central bankers at Jackson Hole in Wyoming that begins on Aug. 24.\n\n\"I don't think the market is looking for some statement suggesting rate rises are over. But investors are looking for anything that can turn the near-term negative sentiment,\" said Rick Meckler, partner at Cherry Lane Investments.\n\nTraders' bets for a pause in rate hikes in September stood at nearly 89%, according to the CME Group's Fedwatch tool. All three main U.S. stock indexes posted declines last week, led by the Nasdaq due to losses in major technology and growth stocks.\n\nBruised growth stocks edged higher, with Tesla rising 3.1% in premarket trading on Monday to lead the advance.\n\nNvidia, which sharply outperformed its megacap peers with gains of nearly 6% last week, climbed 2.6% as HSBC raised its price target on the stock to $780, the second highest on Wall Street.\n\nStory continues\n\nThe chip designer is expected to forecast quarterly revenue above estimates when it reports results on Wednesday. Nvidia earnings will be a major test for this year's stock market rally, which has been fueled by optimism around the potential for artificial intelligence.\n\n\"They (Nvidia) are at the forefront of investor interest today and to the extent they indicate that there is some acceleration in earnings and sales from AI or that they perceive an increase coming, it would be very meaningful to the market,\" said Meckler.\n\nAt 8:27 a.m. ET, Dow e-minis were up 105 points, or 0.3%, S&P 500 e-minis were up 20.5 points, or 0.47%, and Nasdaq 100 e-minis were up 103.25 points, or 0.7%.\n\nShares of Palo Alto Networks jumped 12.6% in premarket trading as the cybersecurity firm forecast annual billings above expectations. Shares of its peer CrowdStrike Holdings also gained 2.9% .\n\nVMware gained 5.6% after UK's competition regulator cleared U.S. tech company Broadcom's $69 billion purchase of the cloud computing firm.\n\n(Reporting by Amruta Khandekar; Editing by Arun Koyyur and Vinay Dwivedi)", "link": "https://finance.yahoo.com/news/us-stocks-wall-st-set-124629596.html", "symbols": ["5AP.F", "BZF1.F", "GSPC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US", "VMW.US"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.022, "neu": 0.886, "pos": 0.092}}, {"date": "2023-08-21T12:16:21+00:00", "title": "12 Best Virtual Reality Stocks to Invest In", "content": "In this article, we will discuss 12 best virtual reality stocks to invest in. If you want to skip our detailed analysis of the virtual reality industry which highlights key trends and major players, you can directly go to the 5 Best Virtual Reality Stocks to Invest In.\n\nVirtual Reality (VR) is a technology that immerses users in a simulated digital environment, often through the use of specialized headsets and other sensory devices. The aim of VR is to create a sense of presence and interaction within a virtual world that can be visually and sometimes audibly or haptically experienced as if it were real. The technology crafts this engrossing encounter for users using devices like VR headsets, glasses, gloves, and bodysuits. Although virtual reality emerged in the 1990s, its true potential, promised three decades ago, is only now beginning to materialize. While VR currently finds its primary applications in gaming and entertainment, its capabilities hold significant promise across various sectors like engineering, design, healthcare, defense, and education. According to a report by Grand View Research, the worldwide market for virtual reality was valued at approximately $59.96 billion in 2022, with projections indicating a compounded annual growth rate (CAGR) of 27.5% from 2023 to 2030.\n\nCurrently, conventional VR setups employ VR headsets or multi-projected setups to generate lifelike sensations, mimicking a user's actual existence within a virtual world. This effect is predominantly achieved through VR headsets, which encompass head-mounted displays—enclosed headsets that prevent external light or real-world visuals from interfering with the virtual domain. Prominent providers of VR headsets encompass massive tech corporations like NVIDIA Corporation (NASDAQ:NVDA), Sony Group Corporation (NYSE:SONY), and naturally, Meta Platforms, Inc. (NASDAQ:META). Enhancements in VR hardware, including the emergence of compact and stylish devices, are anticipated to bolster the wider acceptance of VR both among consumers and across various sectors. Healthcare, workforce training, and manufacturing are foreseen as some of the industries most profoundly influenced by VR's advancements. Instances of VR applications encompass training simulations for surgeons and production workers, as well as immersive educational encounters within classrooms. An example of such application includes Kansas City University's Center for Medical Education Innovation (CMEI), a teaching facility that allows medical students to learn how to evaluate, diagnose and treat patients in repetition with real-world simulation through the use of virtual reality and augmented reality (AR) technology.\n\nStory continues\n\nFor now, the market is dominated by the gaming and entertainment sectors, where companies are making substantial investments in the creation of content, software, and hardware tailored for gaming applications. The increasing appeal of virtual theme parks, museums, and arcades contributes significantly to the expansion of this segment. The initial endeavors to integrate VR into video games can be traced back all the way back to the 1980s, with prominent examples like Nintendo's Virtual Boy and Matter, Inc.'s Power Glove. However, it wasn't until 2013 that VR gaming truly gained momentum, catalyzed by the introduction of Meta Platforms, Inc. (NASDAQ:META)'s Oculus Rift, which marked the advent of the first consumer-ready VR product. As a testament to its growth, the valuation of the VR gaming market was approximated at $6.26 billion in 2020. Projections indicate that this market is poised to expand to $53.44 billion by 2028, exhibiting a compound annual growth rate exceeding 30%.\n\nOverall, this industry is poised to grow with more companies planning to get involved. Companies like Apple, Inc. (NASDAQ:AAPL), Microsoft Corporation (NASDAQ:MSFT), and NVIDIA Corporation (NASDAQ:NVDA) are among the many that are making strides in the space and could be at the forefront of the massive opportunity that virtual reality and augmented reality present. If you want to read up on different technological spaces, and their respective market analysis, you can start with our article on the 12 Best Metaverse Stocks To Invest In. Best Virtual Reality Stocks to Buy\n\nPhoto by mahdis mousavi on Unsplash\n\nOur Methodology\n\nFor this article we scanned Insider Monkey’s database of 910 hedge funds and picked 12 VR-related companies with the highest number of hedge fund investors. These include various technology companies that are either directly involved in the advancement of virtual reality technology, or are poised to benefit from its expansion.\n\n12. Matterport, Inc. (NASDAQ:MTTR)\n\nNumber of Hedge Funds Holders: 10\n\nMatterport, Inc. (NASDAQ:MTTR) stands as a pioneering company in Sunnyvale, California, specializing in 3D data capture and visualization technology. The firm is dedicated to creating solutions that enable the capture, digitization, and seamless sharing of three-dimensional environments. Matterport, Inc. (NASDAQ:MTTR)'s technology finds applications in VR experiences, architecture design, construction planning, and more.\n\nIn 2020, Matterport, Inc. (NASDAQ:MTTR) introduced a VR mode to its platform. This enhancement provides users with enhanced visual quality, greater mobility, and the capability to experience 360º Views of spaces featured in specific tours. Additionally, Matterport, Inc. (NASDAQ:MTTR)'s VR technology is actively utilized by its partners, including event planning firm Allseated, to drive sales growth at an expedited rate.\n\nAt the end of Q2 2023, 10 hedge funds were long Matterport, Inc. (NASDAQ:MTTR) and disclosed positions worth $10.2 million in the company. Of those, Mark Coe's Intrinsic Edge Capital was the top shareholder in the company and held a position worth $5.04 million.\n\nSimilar to Microsoft Corporation (NASDAQ:MSFT), Apple, Inc. (NASDAQ:AAPL), and NVIDIA Corporation (NASDAQ:NVDA), Matterport, Inc. (NASDAQ:MTTR) is poised to reap the benefits from the VR race.\n\n11. Unity Software Inc. (NYSE:U)\n\nNumber of Hedge Funds Holders: 30\n\nUnity Software Inc. (NYSE:U) stands as a prominent figure within the realm of real-time 3D content creation, solidifying its position as a dominant force in the VR market. Its platform serves as a toolbox that empowers developers to construct immersive 3D environments that form the very foundation of the virtual world. The company has achieved remarkable financial success, with a 56% year-over-year sales growth in the first quarter of 2023. Furthermore, Unity Software Inc. (NYSE:U) has revised its fiscal 2023 outlook, anticipating even stronger results that are poised to surpass estimates. A revenue of $2.6 billion by the end of 2024 is expected, reflecting an 87% increase in sales compared to the previous year.\n\nPiper Sandler, on June 6, commented that Unity Software Inc. (NYSE:U)'s enduring vision and strategy to establish itself as a favored developer platform for 3D applications could gain strength from Apple's recent introduction of the Vision Pro spatial computer. In addition to Apple, the presence of Unity Software Inc. (NYSE:U)'s developer job opportunities within TikTok, Meta, Samsung, Snap, and Microsoft suggests a broader interest in augmented reality and virtual reality applications. Piper continued to uphold an Overweight rating on the company, along with a price target of $43.\n\nAt the end of the second quarter of 2023, 30 hedge funds in the database of Insider Monkey held stakes worth $2.56 billion in Unity Software Inc. (NYSE:U), compared to 24 in the preceding quarter worth $1.69 billion. Jim Davidson, Dave Roux and Glenn Hutchins’ Silver Lake Partners held the highest stake in the company, worth approximately $1.13 billion.\n\n10. Sony Group Corporation (NYSE:SONY)\n\nNumber of Hedge Funds Holders: 31\n\nSony Group Corporation (NYSE:SONY) crafted its proprietary virtual reality headset, designed to harmonize with its widely acclaimed PlayStation video-game consoles—dubbed the PlayStation VR or PSVR. Following its introduction in 2016, it emerged as a top-performing VR headset, even though its prominence was outshone by the 2020 launch of the Meta Quest 2. However, in 2023, Sony made a pivotal move by revamping the design of the original, which had been in circulation for over six years, giving birth to the PlayStation VR 2, which debuted in February 2023, accompanied by an initial price tag of $550—significantly surpassing the initial cost of $400 for its predecessor.\n\nGoldman Sachs analyst Minami Munakata raised the evaluation of Sony Group Corporation (NYSE:SONY) shares on July 12, shifting the rating from 'Neutral' to 'Buy' and including the stock in the firm's 'conviction buy list'. The driving factor behind this upgrade, as cited by the analyst, was the company's robust presence in the anime and live games sectors.\n\nOut of the 910 hedge funds tracked by Insider Monkey, 31 of them had stakes in Sony Group Corporation (NYSE:SONY) in the second quarter of 2023. This number was up from 30 in the previous quarter. Mario Gabelli’s GAMCO Investors had the most significant stake in the company in the second quarter, with 1.53 million shares worth $138.2 million.\n\n9. Roblox Corporation (NYSE:RBLX)\n\nNumber of Hedge Funds Holders: 35\n\nRoblox Corporation (NYSE:RBLX), a notable online entertainment platform that empowers game creation, can be seen as one of the closest things to a functional metaverse at present. Boasting an impressive 50 million daily active users, Roblox Corporation (NYSE:RBLX) stands as more than a mere video game, encompassing its own digital currency and providing a wide spectrum of unique virtual encounters.\n\nInitiating coverage on June 13, Canaccord analyst Jason Tilchen provided a Buy rating and set a $48 price target for Roblox Corporation (NYSE:RBLX). While initially established as a gaming hub for younger audiences, Roblox Corporation (NYSE:RBLX) has transformed into a premier hub for immersive gaming and social interactions within persistent virtual realms. This evolution has been propelled by continuous investments aimed at introducing more realistic avatars and enhanced communication features. The analyst sees potential for upward revisions in estimates if the company manages to effectively execute strategic initiatives to attract increased spending to the platform, coupled with a long-term opportunity to expand into new verticals.\n\nAccording to Insider Monkey’s second quarter database, 35 hedge funds were bullish on Roblox Corporation (NYSE:RBLX), compared to 37 funds in the earlier quarter. Catherine Wood's  ARK Investment Management held the largest shareholder position within the company, with $375.5 million worth of stakes.\n\nSaltLight Capital Management made the following comment about Roblox Corporation (NYSE:RBLX) in its Q4 2022 investor letter:\n\n“We’ve used this incremental capital strategy with some of our ‘early-stage’ investments such as Roblox Corporation (NYSE:RBLX), Purple Group, Transaction Capital and Karooooo (Cartrack).\n\nToday, we would like to discuss one of our early-stage investments, Roblox. While there is a risk that we may be premature, mistaken, or even wrong in our evaluation of this opportunity, we see Roblox as a company with the potential to ‘matter’.\n\nRoblox is a 3D real-time content platform that bridges consumers and creators. Instead of being a conventional gaming product, Roblox acts as a tool provider that democratises the creation of 3D real-time user-generated content (UGC)…” (Click here to read the full text)\n\n8. Baidu, Inc. (NASDAQ:BIDU)\n\nNumber of Hedge Funds Holders: 36\n\nBaidu, Inc. (NASDAQ:BIDU) is a prominent Chinese multinational technology enterprise that focuses on Internet-based services, products, and artificial intelligence. It operates from its headquarters located in Beijing's Haidian District. As one of the global giants in AI and the Internet sector, Baidu, Inc. (NASDAQ:BIDU) has maintained a virtual reality division actively engaged in VR research and development since 2016. When the COVID-19 pandemic began, the company recognized the potential utility of employing its VR technology to potentially facilitate expansive virtual events. This eventually led to XiRang, an invisible web of technological capabilities that the company is developing to support the development of the metaverse.\n\nMorgan Stanley analyst Gary Yu's upgrade of Baidu, Inc. (NASDAQ:BIDU) on June 20 shifted the rating from Equal Weight to Overweight, accompanied by a raised price target of $190, previously $160. The analyst highlights that Baidu, Inc. (NASDAQ:BIDU) is positioned as the primary beneficiary of China's substantial $7.4 trillion AI internet opportunity, predicting an estimated 31% CAGR in Baidu, Inc. (NASDAQ:BIDU)'s cloud revenue by the year 2025.\n\nAccording to Insider Monkey’s second quarter database, 36 hedge funds were bullish on Baidu, Inc. (NASDAQ:BIDU), compared 43 funds in the last quarter. These held a consolidated stake value of $1.75 billion.\n\n7. QUALCOMM Incorporated (NASDAQ:QCOM)\n\nNumber of Hedge Funds Holders: 73\n\nQualcomm Incorporated (NASDAQ:QCOM) is a multinational corporation based in San Diego, California, with its incorporation in Delaware. It operates at the forefront of semiconductor development, software solutions, and wireless technology services. The company holds pivotal patents in crucial mobile communication standards like 5G, 4G, CDMA2000, TD-SCDMA, and WCDMA.\n\nThis past year, Qualcomm Incorporated (NASDAQ:QCOM) announced the new Snapdragon AR2 Gen 1 platform. Made using the state-of-the-art TSMC 4nm manufacturing process and fine-tuned to meet the demands of AR processing, the Snapdragon AR2 Gen 1 platform delivers an impressive 2.5-fold enhancement in AI processing capabilities compared to the XR2 platform, all within a power consumption of less than 1W. The upcoming platform will also make use of Qualcomm's Snapdragon Spaces XR developer environment, founded on the OpenXR standards and rapidly embraced by a wide-ranging ecosystem, encompassing AR and VR system original equipment manufacturers (OEMs) such as Honor, Motorola, Nubia, OnePlus, Oppo, RedMagic, Sharp, Vivo, Xiaomi, and ZTE.\n\nAccording to Insider Monkey’s second quarter database, 73 hedge funds were bullish on QUALCOMM Incorporated (NASDAQ:QCOM, compared to 69 funds in the earlier quarter.\n\nMadison Sustainable Equity Fund made the following comment about QUALCOMM Incorporated (NASDAQ:QCOM) in its Q1 2023 investor letter:\n\n“QUALCOMM Incorporated (NASDAQ:QCOM) stock was volatile during the quarter but moved higher in March. Qualcomm fundamentals have been hurt over the last several quarters due to excess smartphone inventories. Management messaged in their recent conference call that inventory issues peaked in their first fiscal quarter and should begin to moderate. They are also seeing excess inventory in their IoT (Internet of Things) business, which will take a couple of quarters to work through. By our estimates, Qualcomm fundamentals should trough in the June quarter with a second-half recovery. Qualcomm remains well positioned to diversify away from smartphones with long-term growth in Auto and IoT.”\n\n6. Advanced Micro Devices, Inc. (NASDAQ:AMD)\n\nNumber of Hedge Funds Holders: 112\n\nAdvanced Micro Devices, Inc. (NASDAQ:AMD), commonly abbreviated as AMD, is an American multinational semiconductor company based in Santa Clara, California, that develops computer processors and related technologies for business and consumer markets.\n\nAdvanced Micro Devices, Inc. (NASDAQ:AMD's chip division has positioned it as a pivotal player in the realm of VR. A prime example is Sony's PlayStation VR 2 headset, launched in February, which exclusively operates on AMD chips via the PS5. Additionally, AMD's potent GPUs and processors provide the necessary horsepower for driving headsets like HTC's Vive, Microsoft's Windows Mixed Reality, and the Oculus Rift (now under Meta's umbrella). As the VR sector evolves, it's probable that more enterprises will seek out AMD's chips to fulfill their technological requirements.\n\nThere were 112 hedge funds long Advanced Micro Devices, Inc. (NASDAQ:AMD) in the second quarter of 2023, up from 91 in the preceding quarter. Philippe Lafont's Coutue Management was the company's largest shareholder for the quarter.\n\nHorizon Kinetics LLC said the following about Advanced Micro Devices, Inc. (NASDAQ:AMD) in its first-quarter 2023 investor letter:\n\n“It is among what are considered to be the great technology companies, like Advanced Micro Devices, Inc. (NASDAQ:AMD) and Intel, that one is apt to see some of the greatest confusion between short-term financial results and share price movements, on the one hand, and long-term financial results. The former are exceedingly difficult to predict. Long term results are relatively easy to predict, because they are bound by the limiting realities of the business model. In the case of AMD, that is the business of being a large-scale semi-conductor manufacturer with a more dominant competitor that has a scale economy advantage.\n\nHere’s what people see, remember and act upon. In the past several years, AMD has been the best performing major technology stock. It’s outperformed Apple, Amazon, Google, Meta (Facebook) and Nvidia…” (Click here to read the full text)\n\nLike Microsoft Corporation (NASDAQ:MSFT), Apple, Inc. (NASDAQ:AAPL), and NVIDIA Corporation (NASDAQ:NVDA), Advanced Micro Devices, Inc. (NASDAQ:AMD) is a prominent virtual reality stock.\n\nClick to continue reading and see 5 Best Virtual Reality Stocks to Invest In.\n\nSuggested articles:\n\n10 Best Warehouse and Self-Storage Stocks To Buy 10 Best Inexpensive Stocks To Buy Right Now 10 Oversold Healthcare Stocks to Buy\n\nDisclosure: None. 12 Best Virtual Reality Stocks to Invest In is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/12-best-virtual-reality-stocks-121621665.html", "symbols": ["A1MD34.SA", "AAPL.MX", "AAPL.US", "AAPL34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "APC.F", "APC.XETRA", "B1C.F", "BIDU.US", "BIDUN.MX", "META.US", "MSF.F", "MSF.XETRA", "MSFT.MX"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.008, "neu": 0.889, "pos": 0.103}}, {"date": "2023-08-21T12:12:00+00:00", "title": "Datacenter's AI Investment to Aid NVIDIA's (NVDA) Q2 Earnings", "content": "NVIDIA Corporation NVDA is slated to report second-quarter fiscal 2024 results on Aug 23.\n\nNVIDIA’s second-quarter performance is likely to reflect the continued strength of its Datacenter business on the growing adoption of cloud-based solutions amid the growing hybrid working trend. An increase in Hyperscale demand and growing adoption in the inference market are likely to have been tailwinds in the to-be-reported quarter. The strong demand for its chips from large cloud service and consumer internet companies is anticipated to have aided the segment’s top-line growth in the second quarter.\n\nAdditionally, the Datacenter end-market business is likely to have mostly benefited from the growing demand for generative AI and large language models using GPUs based on NVIDIA Hopper and Ampere architectures. In the last reported financial results for the first quarter of fiscal 2024, the company’s revenues from the Datacenter business jumped 14% year over year and 18% sequentially, mainly due to growing investments in generative AI.\n\nWe believe that the trend is likely to have continued in the to-be-reported quarter. Our second-quarter revenue estimate for the data center end market is pegged at $8.02 billion, implying year-over-year growth of 110.6% and a sequential increase of 87.1%.\n\nNVIDIA Corporation Price and EPS Surprise\n\nNVIDIA Corporation price-eps-surprise | NVIDIA Corporation Quote\n\nInvestments in Generative AI to Boost the Top Line\n\nThough AI has been around for years, the meteoric rise of OpenAI’s ChatGPT has captivated the world’s attention on the power of generative AI to augment human capability, suggesting that the AI boom may just get started.\n\nGenerative AI is a type of AI technology that can produce various types of content, including text, imagery, audio and synthetic data. It is driven by a large language model, which means it uses a lot of data to understand and generate conversations.\n\nThe growing demand to modernize the workflow across industries is expected to drive the demand for generative AI applications. The global generative AI market size is anticipated to reach $109.37 billion by 2030, according to a new report by Grand View Research. The market is expected to expand at a CAGR of 35.6% from 2023 to 2030.\n\nStory continues\n\nThe adoption of ChatGPT among enterprises has already proven generative AI technology’s usefulness across multiple industries, including marketing, advertising, customer service, education, content creation, healthcare, automotive, energy & utilities and video game development.\n\nHowever, generative AI requires vast knowledge to create content and needs huge computational power. As a result, enterprises looking to create generative AI-based applications will require to upgrade their existing network infrastructure.\n\nNVIDIA’s next-generation chips with high computing power can be the top choice for enterprises. The company’s CEO, Jensen Huang, already stated during the first-quarter fiscal 2024 earnings conference call that existing data centers are insufficiently equipped to handle growing AI workloads.\n\nNVIDIA’s GPUs are already being applied in AI models, which is expanding its footprint in untapped markets like automotive, healthcare and manufacturing. The generative AI revolution is likely to create huge demand for its next-generation high computing powerful chips. NVIDIA expects its second-quarter fiscal 2024 revenues to reach $11 billion from $6.7 billion in the year-ago quarter, largely driven by surging AI investments across the data center end market.\n\nZacks Rank & Other Stocks to Consider\n\nNVIDIA currently sports a Zacks Rank #1 (Strong Buy). Shares of NVDA have surged 196.3% year to date (YTD).\n\nSome other top-ranked stocks from the broader technology sector are Workday WDAY, Manhattan Associates MANH and Salesforce CRM. Workday and Manhattan Associates each sport a Zacks Rank #1, while Salesforce carries a Zacks Rank #2 (Buy) at present. You can see the complete list of today's Zacks #1 Rank stocks here.\n\nThe Zacks Consensus Estimate for Workday's second-quarter fiscal 2024 earnings has been revised upward by a penny to $1.25 per share in the past 30 days. For fiscal 2024, earnings estimates have increased by 3 cents to $5.32 per share in the past 30 days.\n\nWorkday’s earnings beat the Zacks Consensus Estimate in the preceding four quarters, the average surprise being 13.1%. Shares of WDAY have rallied 34.1% YTD.\n\nThe Zacks Consensus Estimate for Manhattan Associates’ third-quarter 2023 earnings has been revised 5 cents northward to 77 cents per share in the past 30 days. For 2023, earnings estimates have moved 22 cents upward to $3.09 per share in the past 30 days.\n\nManhattan Associates’ earnings beat the Zacks Consensus Estimate in the preceding four quarters, the average surprise being 31.6%. Shares of MANH have rallied 53.2% YTD.\n\nThe Zacks Consensus Estimate for Salesforce's second-quarter fiscal 2024 earnings has remained unchanged at $1.90 per share in the past 60 days. For fiscal 2024, earnings estimates have remained unchanged at $7.44 per share in the past 60 days.\n\nSalesforce's earnings beat the Zacks Consensus Estimate in the preceding four quarters, the average surprise being 15.5%. Shares of CRM have risen 54.5% YTD.\n\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nSalesforce Inc. (CRM) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nManhattan Associates, Inc. (MANH) : Free Stock Analysis Report\n\nWorkday, Inc. (WDAY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/datacenters-ai-investment-aid-nvidias-121200715.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.01, "neu": 0.861, "pos": 0.129}}, {"date": "2023-08-21T12:02:00+00:00", "title": "Zacks Value Trader Highlights: Bank of America, The Sherwin-Williams, NVIDIA, Berkshire Hathaway and VOO", "content": "For Immediate Release\n\nChicago, IL – August 21, 2023 – Zacks Value Trader is a podcast hosted weekly by Zacks Stock Strategist Tracey Ryniec. Every week, Tracey will be joined by guests to discuss the hottest investing topics in stocks, bonds and ETFs and how it impacts your life. To listen to the podcast, click here: https://www.zacks.com/stock/news/2138235/investing-lessons-from-rich-retirees)\n\nInvesting Lessons from Rich Retirees\n\nWelcome to Episode #340 of the Value Investor Podcast.\n\n(0:30) - Building A Strong Retirement Portfolio: How Much Do You Need? (12:45) - Where Should You Invest For Long Term Investments? (25:40) - Episode Roundup: BAC, SHW, NVDA, BRK.B, VOO Podast@Zacks.com\n\nEvery week, Tracey Ryniec, the editor of Zacks Value Investor portfolio, shares some of her top value investing tips and stock picks.\n\nRecently, the Wall Street Journal ran an article called \"Here's What a $5 Million Retirement Looks like in America.\" In the article, it highlighted 5 couples and singletons who had substantial investment portfolios, over $1 million, and several had over $4 million portfolios. That's impressive. They are rich.\n\nHow'd they do it?\n\nNone of those in the article were best selling novelists, movie stars, or professional athletes. That makes it seem even more obtainable for you and I. If they can do it, why not us?\n\nLessons from Rich Retirees\n\nThose featured in the article seemingly had similar paths they followed to achieve this incredible wealth. This included,\n\n1.       They started investing early\n\n2.       They maxed out their 401ks\n\n3.       They invested in equities, both individual stocks and index funds. You don't have to get fancy.\n\nKeep it Simple\n\nThe stocks listed in the article were big caps that you and I could also own. When Tracey has talked with her friend Ed, another rich retiree with a million-dollar stock portfolio, he too owned basic, large cap stocks, many of which paid dividends.\n\nStory continues\n\nNone were IPOs or a small cap stock that was largely unknown to most investors. These rich investors had kept it simple.\n\n1.       Bank of America BAC\n\nWarren Buffett has owned Bank of America in the Berkshire Hathaway portfolio for years. It's up 108.3% over the last 10 years, but that's underperforming the S&P 500 which is up 170% during that same time.\n\nBank of America pays an attractive dividend again, however, now yielding 3%, which gives long-term investors even more firepower for compounding.\n\nShould value investors be considering a bank like Bank of America again?\n\n2.       The Sherwin-Williams Company SHW\n\nSherwin-Williams rarely gets much attention on the business shows like CNBC or Fox Business. But Tracey's friend Ed has owned it for decades. Over the last 10 years, shares of Sherwin-Williams are up 437.8% with the dividends reinvested. That's an annualized return of 18.3%.\n\n$10,000 invested in Sherwin-Williams in 2013 would be worth $53,780 in 2023.\n\nDoes Sherwin-Williams still have further upside?\n\n3.       NVIDIA Corp. NVDA\n\nNVIDIA was mentioned in the article as a holding by one of the rich retirees. If you had bought NVIDIA just 10 years ago, it would have gone up an astounding 11,786%.\n\nBut in 2022, shares sold off so it now has a 2-year return of \"just\" 117%. But NVIDIA is a leader in AI and revenue is expected to rise 59% this fiscal year to $43 billion from $26 billion last year. That's impressive.\n\nIs NVIDIA a good buy-and-hold stock for long-term investors?\n\n4.       Berkshire Hathaway (BRK.B)\n\nBerkshire Hathaway shares have been hitting new all-time highs in 2023. For investors looking for a way to track Buffett's moves, including buy-and-hold, why not just buy shares of Berkshire's B shares?\n\nShares of Berkshire Hathaway are up 218.9% over the last 10 years which beat the S&P 500 which was up just 170% during that same time. Over 20 years, Berkshire is up 600.9% versus the S&P 500 gaining 338.5%.\n\nShould Berkshire Hathaway be on your short list?\n\n5.       Vanguard 500 Index Fund VOO\n\nMany of the rich retirees said they owned \"indexes.\" They didn't say which index but the most common one is the S&P 500. The Vanguard 500 Index is one of the most common choices for those who want to own the S&P 500 in an ETF because it has a low expense ratio of just 0.04%.\n\nTracey owns shares of VOO in her own personal portfolio. It's up 14.1% year-to-date but hasn't yet hit another new all-time high this year. Buffett is a big fan of owning the indexes, like the VOO.\n\nShould the VOO be the first step in growing your own million-dollar portfolio?\n\nWhat Else Do You Need to Know About Retiring with Millions?\n\nTune into this week's podcast to find out.\n\nWhy Haven't You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nTracey Ryniec is the Value Stock Strategist for Zacks.com. She is also the Editor of the Insider Trader and Value Investor services. You can follow her on twitter at @TraceyRyniec and she also hosts the Zacks Market Edge Podcast on iTunes.\n\nAbout Zacks\n\nZacks.com is a property of Zacks Investment Research, Inc., which was formed in 1978. The later formation of the Zacks Rank, a proprietary stock picking system; continues to outperform the market by nearly a 3 to 1 margin. The best way to unlock the profitable stock recommendations and market insights of Zacks Investment Research is through our free daily email newsletter; Profit from the Pros.  In short, it's your steady flow of Profitable ideas GUARANTEED to be worth your time!  Click here for your free subscription to Profit from the Pros.\n\nFollow us on Twitter:  https://twitter.com/zacksresearch\n\nJoin us on Facebook:  https://www.facebook.com/ZacksInvestmentResearch/\n\nZacks Investment Research is under common control with affiliated entities (including a broker-dealer and an investment adviser), which may engage in transactions involving the foregoing securities for the clients of such affiliates.\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com/performance\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performancefor information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBank of America Corporation (BAC) : Free Stock Analysis Report\n\nThe Sherwin-Williams Company (SHW) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nBerkshire Hathaway Inc. (BRK.B) : Free Stock Analysis Report\n\nVanguard S&P 500 ETF (VOO): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/zacks-value-trader-highlights-bank-120200579.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "SHW.US", "SJ3.F"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.008, "neu": 0.837, "pos": 0.155}}, {"date": "2023-08-21T11:53:00+00:00", "title": "Nvidia’s Upcoming Earnings Have Wall Street Overexcited. Why That’s a Risk.", "content": "Analysts seem convinced that Nvidia earnings will wow Wall Street this week. Does it raise the risk of disappointment that could hit the whole stock market?\n\nContinue reading", "link": "https://finance.yahoo.com/m/2d449eef-440d-3f41-aa21-a51cd8f17fdf/nvidia%E2%80%99s-upcoming-earnings.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.273, "neg": 0.15, "neu": 0.669, "pos": 0.181}}, {"date": "2023-08-21T11:53:00+00:00", "title": "Ulta Beauty, Lowe's, Nvidia and Amazon  are part of Zacks Earnings Preview", "content": "For Immediate Release\n\nChicago, IL – August 21, 2023 – Zacks.com releases the list of companies likely to issue earnings surprises. This week’s list includes Ulta Beauty ULTA, Lowe's LOW, Nvidia NVDA and Amazon AMZN.\n\nWhy Are Stocks Moving Lower?\n\nAre stocks finally coming out of the irrational exuberance they were suffering from this year, or is the pullback in the market only a temporary and passing phase that primarily reflects the absence of any meaningful near-term catalysts that can help sustain its earlier momentum?\n\nI find myself in the latter camp, with the better-than-expected June-quarter earnings reporting cycle now effectively behind us - more on that a little later in this note – and the steady flow of positive economic readings pushing the 'recession-is-coming' crowd into retreat.\n\nThe recent uptrend in treasury yields is a legitimate point of concern. But I see it as more reflective of renewed economic resilience than a reassessment of what the Fed will or will not do going forward.\n\nEven if the Atlanta Fed's GDPNow tracker of +5.8% growth estimate for the current period proves to be too optimistic, and the actual growth pace proves to be around half that level where the consensus is, it is still magnitudes better than what anyone would have expected six, nine, or twelve months back. The U.S. economy's performance has been nothing less than spectacular, particularly given how much the central bank has tightened monetary policy in this cycle.\n\nHigher interest rates and mortgage rates are undoubtedly a headwind for the market. Still, many stocks will thrive even in a high-rate environment if the driver for higher rates is economic growth and positive momentum.\n\nWe will see what the Fed chief says at Jackson Hole, but the market doesn't seem to have an issue with another rate hike. The way I see it, the big point of uncertainty at present is the duration of 'higher-for-longer,' meaning a tentative timeline for when the Fed will start cutting rates. Perhaps Jackson Hole will help provide some clarity on that question.\n\nStory continues\n\nOn the earnings front, we provide the scorecard and other details below, but this earnings season has been another example of the continued resilience and stability of the U.S. consumer. We heard this from the banks, the leisure and hospitality players, and consumer-facing digital and traditional operators.\n\nThere is undoubtedly stress at the lower end of income distribution, and one can intuitively project moderation in consumer spending as the economy further slows down under the weight of tighter monetary conditions. However, one is at a loss to see that in current estimates of GDP growth.\n\nInflation may be down from the multi-decade highs of a few quarters back, but it still remains a headwind, particularly for the lower end of income distribution. Other issues, like the resumption of student loan payments, are seen as weighing on spending trends. That said, the labor market remains very strong, with wages still going up.\n\nIt is hard to envision any meaningful consumer spending slowdown without a labor market crackup.\n\nQ2 Earnings Scorecard (As of Friday, August 18th)\n\nThe Q2 reporting cycle is effectively over now, with results from 473 S&P 500 members, or 94.5% of the index's total membership, already out.\n\nWe have over 100 companies reporting results this week, including 12 S&P 500 members. Ulta Beauty and Lowe's are among this week's notable companies reporting results this week. Still, the most consequential company on deck to report results is Nvidia, which will report after the market's close on Wednesday, August 23rd.\n\nNvidia's last earnings release on May 24th was one for the record books, with the magnitude of the guidance upgrade unlike any we have seen in the past. The stock is up +41.1% since the May 24th release, which compares to the Tech sector's +5.2% gain and the S&P 500 index's +5.6% rise in the same time period. The stock has effectively become a play on the AI trend.\n\nNvidia shares are down -7.4% this month, roughly in-line with the Tech sector's -7.3% decline but lagging behind the market's -4.6% decline. This recent underperformance notwithstanding, the stock is up +196.2% this year, massively outperforming the Zacks Tech sector (up +32.7%) and the S&P 500 index (up +15.2%).\n\nEstimates for the quarter doubled following the aforementioned guidance, with the current $2.06 per share estimate up $1.04 per share three months ago. Estimates for Q4 and full-year 2024 similarly went up sharply.\n\nGiven its performance since the last quarterly release, the stock is under a spotlight as it comes out with July-quarter numbers and discusses trends about the coming periods. The market is trying to handicap whether the May 2023 report was a one-off or the start of a new trend.\n\nThat's a lot of pressure to handle, but Nvidia has a history of thriving under such conditions.\n\nReturning to the 473 S&P 500 members that have reported already, total Q2 earnings for these companies are down -8.5% from last year on +0.91% higher revenues, with 79.5% beating EPS estimates and 65.8% beating revenue estimates.\n\nWith respect to the Retail sector 2023 Q2 earnings season scorecard, we now have results from 25 of the 33 retailers in the S&P 500 index.\n\nRegular readers know that Zacks has a dedicated stand-alone economic sector for the retail space, which is unlike the placement of the space in the Consumer Staples and Consumer Discretionary sectors in the Standard & Poor's standard industry classification. The Zacks Retail sector includes not only Walmart, Target, and other traditional retailers but also online vendors like Amazon and restaurant players.\n\nTotal Q2 earnings for these 25 retailers that have reported are up +28.9% from the same period last year on +6.2% higher revenues, with 80% beating EPS estimates and 56% beating revenue estimates.\n\nWith respect to the earnings and revenue growth rates, we like to show the group's performance with and without Amazon, whose results are among the 25 companies that have reported already. As we know, Amazon's Q2 earnings were up +526% on +10.8% higher revenues, as it beat top and bottom-line expectations.\n\nAs we all know, digital and brick-and-mortar operators have been converging for some time now. Amazon is now a decent-sized brick-and-mortar operator after Whole Foods, and Walmart is a growing online vendor. This long-standing trend got a huge boost from the Covid lockdowns.\n\nThe Earnings Big Picture\n\nPlease note that the -7.7% decline for Q2 earnings on +0.9% higher revenues is the blended growth picture for the quarter, which combines the actual results that have come out with estimates for the still-to-come companies.\n\nAs you can see in this chart, Q2 is on track to be the third consecutive quarter of earnings declines and the first quarter of declining revenues. As noted earlier, a big part of the earnings and revenue weakness is due to the Energy sector.\n\nExcluding the Energy sector drag, Q2 earnings would be down -1.6% on +4.7% higher revenues.\n\n2023 Q2 will be the 6th quarter in a row of declining margins for the S&P 500 index.\n\nMargins in Q2 are expected to be below the year-earlier level for 7 of the 16 Zacks sectors, with the biggest margin pressure expected to be in the Energy, Medical, Basic Materials, and Construction sectors.\n\nWith the earnings focus lately on the Tech sector, it is instructive to see how much distance has been covered on the margins front in this key sector.\n\nFor a detailed look at the overall earnings picture, including expectations for the coming periods, please check out our weekly Earnings Trends report >>>>Q2 Earnings Confirm Improving Growth Trends\n\nWhy Haven't You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performancefor information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\n\nLowe's Companies, Inc. (LOW) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nUlta Beauty Inc. (ULTA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/ulta-beauty-lowes-nvidia-amazon-115300606.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.037, "neu": 0.845, "pos": 0.118}}, {"date": "2023-08-21T11:31:44+00:00", "title": "US STOCKS-Futures gain as focus shifts to Powell at Jackson Hole, Nvidia earnings", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nPalo Alto Network jumps on upbeat forecast\n\n*\n\nVMware gains as UK clears buyout by Broadcom\n\n*\n\nFutures up: Dow 0.32%, S&P 0.46%, Nasdaq 0.61%\n\n(Updated at 07:06 a.m. ET/ 1106 GMT)\n\nBy Amruta Khandekar and Shristi Achar A\n\nAug 21 (Reuters) - U.S. stock index futures rose on Monday after a sharp selloff last week, with investors awaiting more clues on interest rates from an upcoming gathering of central bank policymakers at Jackson Hole, as well as quarterly results from Nvidia.\n\nStrong gains in equities this year on signs of cooling inflation have come under test in August, with the S&P 500 losing more than 5% from its intra-day high in late July.\n\nFresh evidence of a robust U.S. economy last week yet again stoked expectations the Federal Reserve could keep rates higher for longer, driving the 10-year Treasury yield to its highest level since October. If the yield on the 10-year note, last at 4.296%, crosses 4.338%, it would hit its highest level since 2007.\n\nInvestors are now keenly waiting for comments from Federal Reserve Chair Jerome Powell on Friday at a meeting of central bankers at Jackson Hole in Wyoming that begins on Aug. 24.\n\n\"The Jackson Hole symposium will be key to assess Powell's dovishness meter. If he raises concerns on the economic momentum or the rising credit risks, that may prompt the markets to price in rate cuts to start earlier,\" said Charu Chanana, a market strategist at Saxo Markets in a note.\n\nTraders' bets of a pause in rate hikes in September stood at nearly 89%, according to the CME Group's Fedwatch tool. All three main U.S. stock indexes posted declines last week, led by the Nasdaq due to losses in major technology and growth stocks.\n\nOn Monday, bruised growth stocks edged higher, with Tesla rising 3.2% in premarket trading to lead the advance.\n\nNvidia, which sharply outperformed its megacap peers with gains of nearly 6% last week, climbed 2.2% as HSBC raised its price target on the stock to $780, the second highest on Wall Street.\n\nStory continues\n\nThe chip designer is expected to forecast quarterly revenue above estimates when it reports quarterly results on Wednesday. Nvidia earnings will be a major test for this year's stock market rally, which has been fueled by optimism around the potential for artificial intelligence.\n\nAt 7:06 a.m. ET, Dow e-minis were up 112 points, or 0.32%, S&P 500 e-minis were up 20.25 points, or 0.46%, and Nasdaq 100 e-minis were up 89.75 points, or 0.61%.\n\nShares of Palo Alto Networks jumped 12.1% in premarket trading as the cybersecurity firm forecast annual billings above expectations. Shares of its peer CrowdStrike Holdings also gained 3.5%.\n\nVMware gained 4.6% after UK's competition regulator cleared U.S. tech company Broadcom's $69 billion purchase of the cloud computing firm.\n\n(Reporting by Amruta Khandekar; Editing by Arun Koyyur and Vinay Dwivedi)", "link": "https://finance.yahoo.com/news/us-stocks-futures-gain-focus-113144552.html", "symbols": ["5AP.F", "AVGO.US", "AVGO34.SA", "BZF1.F", "GSPC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US", "VMW.US"], "tags": [], "sentiment": {"polarity": 0.988, "neg": 0.018, "neu": 0.883, "pos": 0.098}}, {"date": "2023-08-21T11:16:21+00:00", "title": "Why China remains hungry for AI chips despite US restrictions", "content": "Nvidia’s processors are weakened for the Chinese market, but are still more powerful than the alternatives\n\nContinue reading", "link": "https://finance.yahoo.com/m/9c96d5e9-9d54-3b50-9e98-e45845a038b0/why-china-remains-hungry-for.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.534, "neg": 0.076, "neu": 0.736, "pos": 0.188}}, {"date": "2023-08-21T11:00:30+00:00", "title": "The 3 Most Undervalued Semiconductor Stocks to Buy Now: August 2023", "content": "The red-hot semiconductor sector has cooled off recently as the artificial intelligence hype that fueled massive gains last year simmers down. Now, as the industry’s valuation multiples start plateauing from previously lofty levels, many hidden gem chipmakers seem primed for their time in the sun.\n\nWhile headline grabbers like Nvidia (NASDAQ:NVDA) soaked up much of the attention during the AI craze, more underappreciated players in the space offer intriguing value now. The rising tide of digitization, AI, automotive electronics, and the metaverse mania will provide a tide that should lift many boats in the semiconductors space over the long haul. Investors just need to look beyond the shiny objects to find the most discounted tickets for that ride. Here are three.\n\nACM Research (ACMR) a magnifying glass enlarges the ACM logo on a website\n\nSource: Pavel Kapysh / Shutterstock.com\n\nFlying under the radar as a provider of specialized wafer cleaning tools to the semiconductor industry, China-based ACM Research (NASDAQ:ACMR) looks poised to ride powerful geopolitical trends accelerating domestic chip production, in my opinion.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nACM Research posted record Q2 2023 revenue growth of almost 39% year-over-year, driven by strong demand trends in mature node investments within China. Management called out the substantial gap between China’s domestic mature node capacity and actual semiconductor consumption, which creates solid tailwinds for equipment suppliers like ACMR that have significant exposure there.\n\nAdditionally, ACMR is making strides with international expansion, having delivered its first evaluation tool order received from a major European semiconductor manufacturer last quarter. While regulatory risks associated with U.S.-China relations exist, I believe ACMR’s differentiated proprietary technology across wafer cleaning, electroplating, furnaces, and other areas gives it a strong, sustainable competitive edge both in China and abroad.\n\nStory continues\n\nTrading at just around 10.6-times forward earnings, ACMR stock presents sizable upside potential if execution continues, especially given the favorable industry trends. The average analyst price target of $25.80 for this stock implies a massive upside potential of 91.4% from current levels.\n\nIntel Corporation (INTC) Close up of Intel sign at their San Jose campus in Silicon Valley\n\nSource: Sundry Photography / Shutterstock.com\n\nLeft behind during the pandemic bull market, Intel (NASDAQ:INTC) now trades at a bargain level compared to the broader semiconductor sector average. Over the past decade, Intel slowly lost process leadership to Taiwan SemiconductorManufacturing Company (NYSE:TSM) as manufacturing challenges mounted. However, under new leadership, Intel’s bold turnaround strategy aims to reorganize the current hierarchy of process technology companies, with Intel in the lead by 2025. It even had its CPU business under threat by AMD (NASDAQ:AMD), but thankfully, the company has started a turnaround here, too, with the company gaining market share.\n\nAdditionally, recent boosts to Intel’s foundry ambitions make me very bullish on its prospects. The announcements that Boeing (NYSE:BA) and Northrop Grumman (NYSE:NOC) are joining Intel’s Department of Defense program to develop next-generation chips domestically are huge. Furthermore, the CHIPS Act providing $52.7 billion of funding to bolster semiconductor manufacturing in the U.S. will likely support Intel’s ambitious plans to build new cutting-edge fabs stateside. In Q2 2023, Intel’s foundry revenue already grew over 300% versus last year, showing promising early traction.\n\nDespite the near-term economic demand uncertainty, Intel reiterated its full-year 2023 guidance on its latest earnings call, signaling confidence in its ability to execute the product roadmap. The company expects to launch its Intel 20A node in 2024, which promises major performance and efficiency gains.\n\nWith its beaten-down valuation and progress toward achieving both IDM 2.0 leadership and foundry business growth, Intel deserves greater investor attention. Analyst price targets suggest as much as 87% upside from current levels, though the average target has been dragged down by a lowball $17 price target by Rosenblatt Securities.\n\nQorvo (QRVO) a cell phone with\n\nSource: Shutterstock\n\nAs a leading radio frequency (RF) solution supplier, Qorvo (NASDAQ:QRVO) serves diverse end markets like defense, internet-of-things (IoT), automotive, and smartphones. Despite macroeconomic uncertainty, Qorvo’s recent design wins across radar, auto, and defense applications provide a solid base of business, in my view.\n\nThe company also looks well-positioned to me in higher growth segments like Wi-Fi 7, IoT connectivity, and silicon carbide power devices. Qorvo’s recent multi-million-dollar order for its silicon carbide chips shows its strong positioning to enable more efficient AI servers and data centers. Its Matter 1.1 smart home certification also significantly expanded its serviceable addressable market among top smart home ecosystem players, a segment I’m very bullish on.\n\nAlthough Qorvo’s Q1 FY2024 results showed declines versus last year amid inventory adjustments across the supply chain, management expects demand recovery in the second half of 2023. Qorvo’s very strong cash balance of $744 million and reasonable debt load of $2 billion provide stability amidst market volatility. And given its leading market share in RF solutions, exposure to diverse secular growth drivers, and reasonable valuation around 20-times forward price-earnings ration, QRVO looks poised for upside in my view. The average analyst price target of $113.64 represents a modest 14% upside potential from current levels. It may not seem like a lot, but it is a far cry from the downside risk that most semiconductor stocks currently face.\n\nOn the date of publication, Omor Ibne Ehsan did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nOmor Ibne Ehsan is a writer at InvestorPlace. He is a self-taught investor with a focus on growth and cyclical stocks that have strong fundamentals, value, and long-term potential. He also has an interest in high-risk, high-reward investments such as cryptocurrencies and penny stocks. You can follow him on LinkedIn.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post The 3 Most Undervalued Semiconductor Stocks to Buy Now: August 2023 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-most-undervalued-semiconductor-stocks-110030423.html", "symbols": ["2QO.F", "ACMR.US", "AMD.US", "BA.US", "INTC.US", "NOC.US", "NVDA.US", "QRVO.US", "TSM.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.032, "neu": 0.81, "pos": 0.158}}, {"date": "2023-08-21T10:48:05+00:00", "title": "The 3 Most Undervalued AI Chip Stocks to Buy Now: August 2023", "content": "For much of 2023, the AI boom has sent chip stocks to dizzying highs. It seemed like not a day went by when Nvidia (NASDAQ:NVDA) wasn’t reaching another all-time high. Even with a recent pullback, Nvidia’s stock price has increased by over 200% year to date. But some investors may balk at buying in now that its price-to-earnings ratio has soared past 200.\n\nBut if you missed out on the Nvidia action, fear not: there are still undervalued AI stocks to buy. Not everyone can soar quite so fast, but many chip companies are making the necessary investments to challenge or even surpass Nvidia’s dominance. And while Nvidia doesn’t fabricate its own chips, the companies that do are receiving numerous subsidies to help them along the way. As the AI boom continues to increase demand for these chips, the companies building them may soon skyrocket as well, taking advantage of their new production facilities.\n\nBecause AI isn’t just a passing fad. AI has the potential to transform every industry in the world. And with that, the undervalued AI stocks of today could become the generational wealth of tomorrow. So with an eye toward the future and a nose for bargains, here are three of the best undervalued AI chip stocks to buy\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nIntel (INTC) Illustration of geometric mask surrounded by tech symbols against blue background representing artificial intelligence (AI)\n\nSource: shutterstock.com/Andrey Suslov\n\nIntel (NASDAQ:INTC) stands to capitalize on the AI boom thanks in part to substantial government subsidies pouring in from various nations. From Germany to America to Ohio, billions of dollars are rolling in to help Intel build chip fabs all over the world. These investments make Intel a robust AI chip contender going forward.\n\nIntel has sometimes been seen as a laggard in chip technology. But it is poised for a comeback and is exploring the possibility of manufacturing Nvidia’s chips, further expanding its reach in the AI chip market. With Nvidia being the biggest player in the AI boom, this could be very big news for Intel.\n\nStory continues\n\nIntel both designs and manufactures chips, and it is making the chips that can power every facet of the AI boom. From graphics processors to data centers, from storage chips to everything in between, Intel is uniquely positioned to meet every requirement of the AI industry. And that could make it the biggest beneficiary among all AI stocks.\n\nOn a trailing 12-month view, investors may still be suspicious that Intel is an undervalued AI stock. Its PE is still negative, and its Q2 2023 earnings report shows revenue decreasing year on year. Intel only achieved net income instead of net loss due to benefits from tax, its operating income was negative.\n\nBut with a forward-looking view, Intel is still an AI stock to buy as it is likely to be the biggest beneficiary from Western on-shoring. Chip fabs are capital intensive, but Intel’s billions of subsidies will allow them to build more fabs in more places. And by being able to provide a chip for every occasion, Intel’s position in the AI boom is all but assured.\n\nSuper Micro Computer (SMCI) Close-up of letters \"AI\" written on a computer chip, symbolizing artificial intelligence and AI stocks. ai chip stocks\n\nSource: shutterstock.com/YAKOBCHUK V\n\nStock for Super Micro Computer (NASDAQ:SMCI) has already been a big winner in the AI boom. Super Micro designs chips for data centers and GPUs that are powering the AI boom. And as AI companies will need copious amounts of data and GPUs both, Super Micro’s chips have a vital role in enabling these computational requirements.\n\nSuper Micro’s stock has had a recent price drop on disappointing revenue forecasts. However, it’s trading at just a 21 price-to-earnings ratio. That’s lower than the S&P as a whole and far less than many of the chip designers that it competes with. This could point to Super Micro as a bargain of an undervalued AI chip stock, and one of the best to buy.\n\nBecause Super Micro doesn’t directly fabricate its chips, it designs them. This lets it adjust rapidly to an evolving chip landscape without the need for investing in fabs. This is the same strategy taken by Nvidia, and it has paid off with huge gains\n\nSuper Micro’s Q3 2023 earnings report shows that net income has increased year on year from $77 million to $86 million. That benefit has come in part from cost-saving measures, net sales decreased but the cost of sales decreased by more. As they did give a disappointing revenue forecast, this decreasing revenue does show problems that need to be addressed. But their recent meteoric rise in price has shown that investors are confident in them. And as the AI boom continues, Super Micro still stands as one of the most undervalued AI stocks you can buy.\n\nTaiwan Semiconductor (TSM) TSM stock: the Taiwan Semiconductor logo on the side of its facility in Taiwan\n\nSource: ToyW / Shutterstock\n\nTaiwan Semiconductor (NYSE:TSM) currently stands as the titan of chip manufacturing. They are the company currently building the latest Nvidia graphics cards. They are also the world’s largest chip manufacturer overall, and a leader in chip technology. And they occupy a crucial spot in the AI supply chain, making them perhaps the most undervalued AI chip stock on the market.\n\nBeing the world’s largest chip manufacturer, Taiwan Semiconductor’s influence extends across every aspect of the tech industry. And AI is no exception. Despite this, their price-to-earnings ratio is relatively low compared to the S&P average and others in the chip industry. This could reflect concerns about geopolitical risk due to the concentration of its fabrication facilities in Taiwan. But for investors confident that no wars will break out soon in Taiwan, now is the perfect time to be greedy while others are fearful.\n\nAdditionally, Taiwan Semiconductor is strategically addressing geopolitical concerns by investing significantly in fabs both in the United States and Europe. Government subsidies are assisting this expansion, fostering a global footprint and mitigating potential risks. This makes it one of those AI chip stocks to buy.\n\nTaiwan Semiconductor’s dominance in the chips space cannot be understated. They produce 60% of the world’s chips, and by some calculations produce 90% of the advanced chips needed in modern AIs. The AI boom will need all the chips it can get, and Taiwan Semiconductor will be getting the lion’s share of the fabrication money if this trend continues. Even though they’re the biggest by far, they still stand as one of the most undervalued AI chip stocks to buy today.\n\nOn the date of publication, John Blankenhorn held LONG positions in INTC and TSM. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJohn Blankenhorn is a neuroscientist at Emory University. He has significant experience in biochemistry, biotechnology and pharmaceutical research.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post The 3 Most Undervalued AI Chip Stocks to Buy Now: August 2023 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-most-undervalued-ai-chip-104805757.html", "symbols": ["2330.TW", "INTC.US", "NVDA.US", "SMCI.US", "TSFA.F", "TSFA.STU", "TSM.US", "TSMC34.SA", "TSMN.MX"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.05, "neu": 0.814, "pos": 0.136}}, {"date": "2023-08-21T10:28:38+00:00", "title": "Dow Jones Futures Rise: Market In Correction As Nvidia Earnings, Powell Speech Loom; What To Do", "content": "Nvidia earnings and Fed chief Jerome Powell's speech loom with the market in correction. Here's what to do now.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d98e0143-cbce-327e-bc3f-d4fb353e7a80/dow-jones-futures-rise%3A.html", "symbols": ["117.F", "5AP.F", "ANET.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US"], "tags": [], "sentiment": {"polarity": -0.226, "neg": 0.087, "neu": 0.913, "pos": 0}}, {"date": "2023-08-21T10:19:00+00:00", "title": "Wall Street Week Ahead: Powell Speech, Nvidia earnings, housing in focus", "content": "Markets will focus on two potentially game-changing events this week as Nvidia preps its second quarter earnings release Wednesday and Fed Chair Powell speaks at the Jackson Hole summit on Friday.\n\nContinue reading", "link": "https://finance.yahoo.com/m/7d2f1b9f-9ad7-35e7-80f9-813c5ab5d0bd/wall-street-week-ahead%3A.html", "symbols": ["GSPC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-21T09:13:00+00:00", "title": "These Stocks Are Moving the Most Today: Palo Alto, Meta, Napco Security, Nvidia, Zoom Video, and More", "content": "Palo Alto Networks' fiscal fourth-quarter earnings top analysts' expectations, a report says Meta Platforms is expected this week to launch of desktop version of its microblogging app Threads, Zoom Video reports earnings after the close of trading Monday, and Nvidia reports later in the week.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1352b9a6-192f-3fbe-b867-31ef0103e2f3/these-stocks-are-moving-the.html", "symbols": ["5AP.F", "5ZM.F", "FB2A.F", "FB2A.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US", "ZM.US"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0, "neu": 0.962, "pos": 0.038}}, {"date": "2023-08-21T07:33:40+00:00", "title": "Palo Alto, Tesla, Nvidia rise premarket; Napco, Nikola fall", "content": "Investing.com -- U.S. futures traded higher Monday, starting a new week on a positive note as investors await news from Federal Reserve Chair Jerome Powell at the Jackson Hole symposium.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nPalo Alto Networks (NASDAQ:PANW) stock soared 12% after the cybersecurity company delivered an upbeat outlook for the current quarter, expecting further strength in billings growth.\n\nTesla (NASDAQ:TSLA) stock rose 3.1% after the investment firm Baird reiterated its ‘Buy’ rating, calling the EV manufacturer its Best Pick for the year.\n\nNvidia (NASDAQ:NVDA) stock rose 2.5% after HSBC raised its price target to $780, the second highest on Wall Street, ahead of the chip designer's quarterly report on Wednesday - a major test for this year's stock market rally.\n\nMeta Platforms (NASDAQ:META) stock rose 0.6% after the tech giant announced it is set to roll out the web version on its new text-first social media platform Threads, hoping to gain an edge over X, formerly Twitter. The WSJ reported Monday that the number of daily active users of Threads has fallen to under 10 million, down from a peak of almost 50M days after its launch.\n\nNapco Security (NASDAQ:NSSC) stock slumped 35% after the high-tech electronic security equipment manufacturer said it would revise its financial statements over the first three quarters of its 2023 fiscal year after accounting errors.\n\nBroadcom (NASDAQ:AVGO) stock rose 0.7% after the UK's competition regulator said it has cleared the U.S. tech company's $69 billion purchase of VMware (NYSE:VMW), up 6.4%, following an in-depth probe.\n\nXPeng (NYSE:XPEV) stock rose 5.9% after Bank of America Securities upgraded the Chinese EV manufacturer to ‘Buy’ from ‘Neutral’, citing a partnership with German auto giant Volkswagen (ETR:VOWG_p).\n\nNikola (NASDAQ:NKLA) stock fell 11% after the EV manufacturer unveiled a $325 million convertible bond deal a week after it had to recall all the battery-powered electric trucks that it has delivered to date after an investigation into recent fires found a coolant leak inside a battery pack as the cause.\n\nStory continues\n\nRelated Articles\n\nPalo Alto, Tesla, Nvidia rise premarket; Napco, Nikola fall\n\nCiti remains bullish on Snowflake as 'estimates have likely bottomed'\n\nContinental considers sell-off of ContiTech car business - manager magazin", "link": "https://finance.yahoo.com/news/palo-alto-tesla-nvidia-rise-073340114.html", "symbols": ["8NI.F", "AVGO.US", "AVGO34.SA", "META.US", "NKLA.US", "NSSC.US", "NVDA.US", "PANW.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA", "VMW.US", "XPEV.US"], "tags": [], "sentiment": {"polarity": 0.973, "neg": 0.019, "neu": 0.893, "pos": 0.088}}, {"date": "2023-08-21T06:02:50+00:00", "title": "Futures rise with Jackson Hole ahead, Zoom to report - what's moving markets", "content": "Investing.com -- Stock futures inch into the green, hinting at an early rebound for equities following a losing week on Wall Street. Video conferencing group Zoom is due to report its latest quarterly earnings on Monday, while semiconductor giant Nvidia is on deck to unveil results on Wednesday. Elsewhere, China rolls out a new lending rate cut, but policymakers still face calls to do more to support the country's sputtering economic recovery.\n\n1. Futures point higher\n\nU.S. stock futures edged up on Monday, with the major indices on Wall Street coming off a losing week that featured surging bond yields and deepening worries over China's post-pandemic recovery.\n\nAt 05:15 ET (09:15 GMT), the Dow futures contract had moved higher by 102 points or 0.3%, the S&P 500 futures contract gained 19 points or 0.4%, and the Nasdaq 100 futures rose by 94 points or 0.6%.\n\nFollowing a mixed session on Friday, the benchmark S&P 500, tech-heavy Nasdaq Composite, and the 30-stock Dow Jones Industrial Average all posted weekly declines. Equities came under pressure from a jump in bond yields that partly stemmed from waning hopes that the Federal Reserve will soon begin to back away from its long-standing monetary tightening campaign. Prices typically dip as yields rise.\n\nAs the new trading week begins in the U.S., investors will be looking ahead to comments on Friday from Fed Chair Jerome Powell at an annual symposium in Jackson Hole, Wyoming.\n\nMeanwhile, weak economic releases have added fuel to concerns over how long it will take China to fully rebound from draconian COVID-19 rules. Calls for Beijing to roll out more stimulus to help spur demand in the world's second-largest economy have been intensifying, yet officials remain wary about causing further weakening in the yuan (see below).\n\n2. Zoom to report with AI plans in focus\n\nVideo conferencing service Zoom (NASDAQ:ZM) is set to deliver its latest quarterly results after the bell on Monday, kicking off a fresh week of corporate returns.\n\nStory continues\n\nOnce a pandemic-era powerhouse driven by remote working, Zoom has been hit by more workers coming back to physical offices, along with rising competition from similar offerings backed by big-name players like Microsoft (NASDAQ:MSFT) and Google (NASDAQ:GOOGL). Revenue growth has slowed, while the company has slashed about a sixth of its headcount.\n\nZoom's leadership has outlined plans to use artificial intelligence to spruce up the business. Chief Executive Officer Eric Yuan recently said that the San Jose, California-based group is aiming to fold AI into almost all its features, arguing that the nascent technology has \"a lot of monetization opportunities.\"\n\nTraders seem unconvinced so far: Zoom shares have shed more than 8% of their value over the past six months.\n\nThe hype around AI will likely continue to take center stage this week, powered in particular by results from chipmaker Nvidia (NASDAQ:NVDA) and Chinese tech behemoth Baidu (NASDAQ:BIDU).\n\n3. Strong cybersecurity demand boosts Palo Alto Networks\n\nShares in Palo Alto Networks (NASDAQ:PANW) climbed by over 12% in premarket U.S. trading on Monday after the cybersecurity group unveiled a better-than-expected estimate for annual billings.\n\nThe firm said it now anticipates that it will report billings of between $10.9 billion to $11 billion in its 2024 fiscal period, topping Bloomberg consensus estimates of $10.77B.\n\nBillings in Palo Alto's fourth quarter came in slightly underestimated, although Chief Financial Officer Dipak Golechha noted that the figure did not capture the company's top-line strength.\n\nThe rosy outlook was enough to also lift shares in Palo Alto peers Zscaler (NASDAQ:ZS) and Fortinet (NASDAQ:FTNT).\n\nThese one-stop shops for cybersecurity solutions have seen a spike in demand from both businesses and governments following a spate of hacks and other digital crimes over the past year. According to Check Point Research, a cyber threat intelligence provider, average weekly global cyberattacks touched a two-year high in the second quarter of 2023.\n\n4. China unveils unexpectedly modest lending rate cut\n\nChina slashed a benchmark lending rate on Monday, but kept another steady, in a move that widely surprised expectations that Beijing would announce deeper policy cuts.\n\nThe People's Bank of China lowered its one-year loan prime rate, a key reference for bank lending, to 3.45% from 3.55%. The five-year rate, used to determine mortgage rates, was left unchanged at 4.20%. Analysts had seen a 15-basis-point cut for each rate.\n\nOfficials in the country are under increasing pressure to introduce new stimulus measures to reignite flagging post-pandemic growth and support an ailing property sector. But worries over a weakening in the local currency and potential capital flight have placed limitations on the depth of the changes policymakers can make.\n\nThe renminbi dropped following the PBOC's announcement.\n\n5. Crude moves higher\n\nOil prices rose Monday, rebounding after selling last week, boosted in part by the Chinese rate cut and also by expectations for lower output from a group of top producers in August.\n\nThe crude market was lower to the end the prior week, ending a seven-week long winning streak, on concerns that higher U.S. interest rates and China's slowing economic recovery will hit oil demand.\n\nHowever, the prospect of tighter supplies after deep output cuts this year from Saudi Arabia and Russia -- the two leading producers in the group known as OPEC+ -- have helped support prices.\n\nBy 05:19 ET, the U.S. crude futures traded 0.5% higher at $81.06 a barrel, while the Brent contract climbed 0.5% to $85.22.\n\nRelated Articles\n\nFutures rise with Jackson Hole ahead, Zoom to report - what's moving markets\n\nHistoric drought, hot seas slow Panama Canal shipping\n\nJapan to raise FY2024/25 assumed interest rate after BOJ policy tweak -Kyodo", "link": "https://finance.yahoo.com/news/futures-rise-jackson-hole-ahead-060250654.html", "symbols": ["5ZM.F", "BIDU.US", "DJI.INDX", "FTNT.US", "GOOGL.US", "GSPC.INDX", "IXIC.INDX", "MSFT.US", "NVDA.US", "PANW.US", "ZM.US", "ZS.US"], "tags": [], "sentiment": {"polarity": 0.79, "neg": 0.088, "neu": 0.822, "pos": 0.09}}, {"date": "2023-08-20T20:23:51+00:00", "title": "10 Stocks ChatGPT Said Will Make Me Rich in 10 Years", "content": "In this article, we will be taking a look at the 10 stocks ChatGPT said will make me rich in 10 years. To skip our detailed analysis of generative AI and its application in the field of investing, you can go directly to see the 5 Stocks ChatGPT Said Will Make Me Rich in 10 Years.\n\nUsing Artificial Intelligence To Invest\n\nThe markets have been talking about artificial intelligence, particularly generative AI, all year. Companies across a wide range of industries and sectors are attempting to introduce their own AI-driven products and services so as not to be left in the dust by their competitors. At the same time, every investor is trying to get into the artificial intelligence trade today. Individual investors and hedge funds alike are putting their manpower into picking out the best AI stocks for the rest of the year as we head into the second half of 2023. Interestingly enough, at this point, it's not just manpower that's going into picking stocks. Some investors and hedge funds are actually trying to harness the power of AI to pick stocks instead of leaving the job to human beings. This trend really gets you thinking about how successful an AI software might be at helping an investor build up their portfolio. Is it a strategy that might lead to mind-blowing results or one that will lead you to ruin?\n\nOn August 3, CNBC invited Todd Rosenbluth, the head of research at VettaFi, to talk about just this. CNBC's Bob Pisani noted that AI-driven exchange-traded funds (ETFs) have been around for a while and are starting to come up more this year. Pisani thus invited Rosenbluth to share some of his insights on these ETFs and how effective they are. According to Rosenbluth, a lot more AI-driven ETFs have been working on picking stocks recently. Here's what he had to say about this development:\n\n\"It's perhaps a smarter way of picking stocks. I know that computers can be smarter than I know I am, [it's] whether or not they're going to be better at outperforming the broader S&P 500. There's no emotion behind it.\"\n\nStory continues\n\nIs Generative AI Really Helpful For Investors?\n\nThe discussion surrounding artificial intelligence, in general, and in the world of investing, has been extremely interesting because of the immense potential of this technology when it comes to changing the way people live, work, and even invest. It makes you wonder how not only AI-driven ETFs but also AI chatbots can contribute to the investing world today. This May, CNN reported that a dummy portfolio of 38 stocks recommended by OpenAI's viral chatbot, ChatGPT, actually managed to outperform major investment funds in the United Kingdom, for instance. This portfolio managed to gain about 4.9% between March 6 and April 28, while the 10 leading investment funds of the country reported an average loss of about 0.8%. During the same period, the S&P 500 rose by 3%. The result of this experiment is merely one example of the sheer potential vested in artificial intelligence when it comes to investing.\n\nOur Stock-Picking Experiment with ChatGPT\n\nConsidering these developments, we also attempted to get a list of stocks from ChatGPT this March. We first prompted the AI chatbot to present itself as a professional investment advisor and then asked it to present a list of 10 stocks it thinks will make us rich in the next 10 years. ChatGPT then proceeded to give us a diversified list of stocks, ranging from tech names and consumer staples to financials and healthcare. Some of the most notable names on its list included Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and NVIDIA Corporation (NASDAQ:NVDA), all big names in the tech and AI sectors this year.\n\nToday we will be revisiting this list of stocks to see how each of these companies has performed over the period between March and August and check if ChatGPT really was right in recommending these names. By doing this, we will see if these really can be considered stocks that will make you rich in 2023 and beyond. 10 Stocks ChatGPT Said Will Make Me Rich in 10 Years\n\nOur Methodology\n\nIn March 2023 we asked ChatGPT to act like an expert stock picker and recommend some stocks that could make us rich in 10 years. To be specific, we asked the chatbot, \"Which stocks will make me rich in 10 years?\" In this article, we calculated the returns of these stocks from the date of our previous article's publication, March 16, to August 16. We then ranked these stocks based on these calculated returns, from the lowest to the highest. Hedge fund information from Insider Monkey's second-quarter data is also mentioned for these companies.\n\nStocks ChatGPT Said Will Make Me Rich in 10 Years\n\n10. Procter & Gamble Company (NYSE:PG)\n\nNumber of Hedge Fund Holders: 74\n\nReturns Since March 16: 8%\n\nProcter & Gamble Company (NYSE:PG) is a consumer staples company based in Cincinnati, Ohio. It provides branded consumer packaged goods such as conditioners, shampoos, deodorants, and skin care products under various brands. The company's brands include Pantene, Olay, and Head & Shoulders, among more.\n\nAn Overweight rating was reiterated on shares of Procter & Gamble Company (NYSE:PG) on August 1 by Dara Mohsenian, an analyst at Morgan Stanley. The analyst also maintains a price target of $174 on the stock.\n\nWe saw 74 hedge funds holding stakes in Procter & Gamble Company (NYSE:PG) at the end of the second quarter. Their total stake value in the company was $5.3 billion.\n\nLike Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and NVIDIA Corporation (NASDAQ:NVDA), Procter & Gamble Company (NYSE:PG) was a ChatGPT-recommended stock that has gone up over the past five months.\n\n9. Visa Inc. (NYSE:V)\n\nNumber of Hedge Fund Holders: 171\n\nReturns Since March 16: 10.6%\n\nJames Faucette, an analyst at Morgan Stanley, maintains an Overweight rating on shares of Visa Inc. (NYSE:V) as of July 26. The analyst also raised his price target on the stock from $290 to $292.\n\nVisa Inc. (NYSE:V) is a financial company operating as a payments technology provider across the globe. It is based in San Francisco, California. The company operates VisaNet, a transaction processing network, to offer authorization, clearing, and settlement of payment transaction services.\n\nThere were 171 hedge funds holding stakes in  Visa Inc. (NYSE:V) in the second quarter, with a total stake value of $24.9 billion.\n\nAt the end of the second quarter, TCI Fund Management was the largest shareholder in Visa Inc. (NYSE:V), holding 17.8 million shares in the company.\n\n8. Johnson & Johnson (NYSE:JNJ)\n\nNumber of Hedge Fund Holders: 88\n\nReturns Since March 16: 11.7%\n\nOur hedge fund data for the second quarter shows 88 hedge funds holding stakes in Johnson & Johnson (NYSE:JNJ). Their total stake value in the company was $4.1 billion.\n\nJohnson & Johnson (NYSE:JNJ) is a healthcare and pharmaceutical company based in New Brunswick, New Jersey. The company researches, develops, manufactures, and sells pharmaceutical products, including health and beauty products, globally.\n\nAs of July 31, Louise Chen, an analyst at Cantor Fitzgerald, holds an Overweight rating on shares of Johnson & Johnson (NYSE:JNJ). The analyst also maintains a price target of $215 on the shares.\n\nLike Microsoft Corporation (NASDAQ:MSFT), Apple Inc. (NASDAQ:AAPL), and NVIDIA Corporation (NASDAQ:NVDA), Johnson & Johnson (NYSE:JNJ) is a ChatGPT-recommended stock that is highly popular among hedge funds today.\n\n7. Apple Inc. (NASDAQ:AAPL)\n\nNumber of Hedge Fund Holders: 135\n\nReturns Since March 16: 15.4%\n\nBerkshire Hathaway was the most prominent shareholder in Apple Inc. (NASDAQ:AAPL) at the end of the second quarter, holding 915.6 million shares in the company.\n\nApple Inc. (NASDAQ:AAPL) is a big tech company based in Cupertino, California. It manufactures iPhones, Macs, iPads, AirPods, Apple Watches, and more.\n\nOn August 4, Michael Walkley, an analyst at Canaccord Genuity, maintained a Buy rating on shares of Apple Inc. (NASDAQ:AAPL). The analyst also raised his price target on the stock from $185 to $205.\n\nApple Inc. (NASDAQ:AAPL) was spotted in the 13F holdings of 135 hedge funds during the second quarter, with a total stake value of $193.9 billion.\n\n6. Microsoft Corporation (NASDAQ:MSFT)\n\nNumber of Hedge Fund Holders: 300\n\nReturns Since March 16: 16%\n\nMicrosoft Corporation (NASDAQ:MSFT) is another big tech company on our list of ChatGPT-recommended stocks. The company develops and supports software, services, devices, and solutions globally. It is based in Redmond, Washington.\n\nA total of 300 hedge funds were long Microsoft Corporation (NASDAQ:MSFT) in the second quarter. Their total stake value in the company was $69.8 billion.\n\nAlex Haissl, an analyst at Redburn Partners, maintains a Buy rating on shares of Microsoft Corporation (NASDAQ:MSFT) as of August 11. The analyst also placed a price target of $440 on the stock.\n\nBill & Melinda Gates Foundation Trust was the largest shareholder in Microsoft Corporation (NASDAQ:MSFT) at the end of the second quarter, holding 39.3 million shares in the company.\n\nThird Point Management made the following comments about Microsoft Corporation (NASDAQ:MSFT) in its second quarter 2023 investor letter:\n\n“While our gross equity exposure is still modest (below 100% on the long side), we have increased our nets to 70% as of this writing and 77% on a beta adjusted basis. About 45% of that net long exposure is composed of direct and indirect AI beneficiaries trading at reasonable valuations. We have sized up our investments in certain cloud software businesses including Microsoft Corporation (NASDAQ:MSFT), a clear AI winner as a result of its rapidly growing Azure cloud business, upside from applying AI features to its core Office products, investment in Open AI, and ability to provide AI services to other companies (for example, Microsoft holds a stake in one of our portfolio companies, LSE, which it is also assisting in harnessing greater value in its data via AI).”\n\nClick to continue reading and see the 5 Stocks ChatGPT Said Will Make Me Rich in 10 Years.\n\nSuggested articles:\n\n15 Countries That Banned ChatGPT ChatGPT Stock Portfolio: Top 10 Picks 10 Stocks ChatGPT Says Will Make Me Rich in 10 Years\n\nDisclosure: None. 10 Stocks ChatGPT Said Will Make Me Rich in 10 Years is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/10-stocks-chatgpt-said-rich-202351994.html", "symbols": ["3V64.F", "3V64.XETRA", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.016, "neu": 0.865, "pos": 0.119}}, {"date": "2023-08-20T20:14:48+00:00", "title": "10 Stocks That Will Change the Future", "content": "In this article, we will be taking a look at 10 stocks that will change the future. To skip our detailed analysis of how the market is transforming this year, you can go directly to see the 5 Stocks That Will Change the Future.\n\nTechnological Advancements\n\nFrom the start of the year, we have been hearing about how new technology, artificial intelligence, robotics, and automation are some of the things that will significantly transform the world as we know it. Those who are skeptical about the impact of new technologies hold that such assertions are mere exaggerations. However, others are more inclined to believe that we may currently be in the midst of a new tech revolution. With the rise of new technologies, everything is beginning to change, ranging from how you interact with other people and live day-to-day to how you work and go about your professional life. Because new technological advancements are rapidly taking over the world, many companies are incorporating new tech and artificial intelligence in their operations, while those that have been operating in this space since their inception are continuing to get ahead.\n\nAn example of one such company is NVIDIA Corporation (NASDAQ:NVDA), a semiconductor company that has been the talk of the town since the start of the year because of its stellar work in the artificial intelligence field. The company offers AI chips that have become increasingly popular among its customers and investors alike. Building on its momentum, on August 8, NVIDIA Corporation (NASDAQ:NVDA) also announced its release of an updated AI processor that is even more efficient than its earlier products. This move is being considered an attempt by the company to retain its dominance in the AI chips space. The new processor is called the Grace Hopper Superchip, and it is a combination graphics chip and processor. This is the world's first HBM3e processor and is designed specifically for the \"era of accelerated computing and generative AI.\" The new chip is expected to be 50% faster than the company's current HBM3 processors, making it well-positioned to handle complex generative AI workloads. According to NVIDIA Corporation's (NASDAQ:NVDA) report, the chip will begin to be produced in the second quarter of 2024.\n\nStory continues\n\nInvestments In New Tech\n\nThe creation of products like the Grace Hopper Superchip highlights how tech companies today are embracing the way new developments in their field are changing consumer expectations. This is also leading to companies like NVIDIA Corporation (NASDAQ:NVDA) now working on meeting these changing expectations to offer faster, more efficient, and more cutting-edge technologies. At the same time, other major companies like Microsoft Corporation (NASDAQ:MSFT) are doing their part in this area by developing their own technologies while investing in other companies that are steadily becoming leaders in this space. For instance, Microsoft Corporation (NASDAQ:MSFT) made an early move in generative AI with a $1 billion investment in OpenAI, the company behind ChatGPT, in 2019. While this investment did not garner much attention at the time it was made, with the virality of ChatGPT today, both OpenAI and Microsoft Corporation (NASDAQ:MSFT) have come under the spotlight. By this April, the latter's investment in the former was estimated to be about $13 billion, according to CNBC. This immense investment has also given the big tech giant an edge over other tech companies investing in AI since it now has access to OpenAI's generative AI technology, which it has steadily been incorporating into its own Bing search engine. The same technology has also been integrated into other Microsoft Corporation (NASDAQ:MSFT) offerings, such as its sales and marketing software and the Azure cloud.\n\nWith the way companies like these are rapidly incorporating new technologies into their products and services, it is highly likely that before long, the technology sector, along with several others, will become absolutely unrecognizable, exponentially faster, and immensely more efficient. Even healthcare companies like Medtronic plc (NYSE:MDT) are integrating artificial intelligence into their products. For example, the Medtronic Touch Surgery Enterprise is the first AI-powered surgical video management and analytics platform for operating rooms globally. At the same time, tech startups and companies are bringing highly innovative products and technologies to the table. DeepMind is one example of an AI company that has been working to combine machine learning and systems neuroscience to build learning algorithms. The company's AI system uses raw pixels as data input in its deep learning process, online other AI systems which are pre-programmed. DeepMind's success in the AI field and its ability to make innovative and different products in the area resulted in its acquisition by Alphabet Inc. (NASDAQ:GOOG) in 2014.\n\nAnother interesting private company is Numenta, which has been developing powerful neuroscience-based AI solutions. The company leverages the structures and efficiencies found in the brain to accelerate deep learning networks and make advanced AI systems. Numenta's work, if carried on as it is right now, may result in the creation of an AI system that functions similarly to the human brain, more so than any other AI system does today. These are just a few examples of how we are currently seeing the world change, but they are enough to highlight the fact that today there are many companies that are working hard to become part of a tech-oriented future. Considering the above, we have compiled a list of some stocks that will change the future for the long term based on their current operations. Many of these companies may even be considered some of the best growth stocks for the next five years. 10 Stocks That Will Change the Future\n\nPhoto by Maximalfocus on Unsplash\n\nOur Methodology\n\nWe used a consensus opinion-based approach to find stocks that most sources online think will change the future. Sources we used include Investor Placearticles, Barron's, and Motley Fool, among others. To rank these stocks, we used Insider Monkey's hedge fund data for the first quarter. The stocks are thus ranked based on the number of hedge funds holding stakes in them, from the lowest to the highest number.\n\nStocks That Will Change the Future\n\n10. SenseTime Group Inc. (OTC:SNTMF)\n\nNumber of Hedge Fund Holders: N/A\n\nSenseTime Group Inc. (OTC:SNTMF) is an investment holding company based in Shanghai, China. The company engages in developing and selling artificial intelligence software platforms in China, Northeast Asia, Southeast Asia, and internationally.\n\nSenseTime Group Inc. (OTC:SNTMF) offers a range of AI products and services that are making it a leading company in the Chinese AI market. Its SenseFoundry Enterprise Platform facilitates and accelerates the digital transformation of enterprise customers. It also offers a SenseFoundry Platform for smart cities and a SenseME product for various Internet of Things devices to facilitate perceptual intelligence and content enhancement.\n\n9. ABB Ltd (NYSE:ABB)\n\nNumber of Hedge Fund Holders: 17\n\nABB Ltd (NYSE:ABB) is an electrical components and equipment company based in Zurich, Switzerland. The company manufactures and sells electrification, automation, robotics, and motion products in the utilities, industry and transport, and infrastructure sectors.\n\nBarclays analysts have maintained an Equal Weight rating on shares of ABB Ltd (NYSE:ABB) as of August 7.\n\nThe company's electrification and automation products and services are helping its customers move towards a more sustainable future. ABB Ltd (NYSE:ABB) offers innovative digitally connected and enabled industrial equipment and systems, which can change the way many industries operate in the coming years.\n\nThere were 17 hedge funds holding stakes in ABB Ltd (NYSE:ABB) at the end of the first quarter. Their total stake value in the company was $53.4 million.\n\nQuantinno Capital held 25,729 shares in ABB Ltd (NYSE:ABB) at the end of the first quarter, making it the largest shareholder in the company for the quarter.\n\n8. Mobileye NV (NYSE:MBLY)\n\nNumber of Hedge Fund Holders: 22\n\nAs of July 28, Tom Narayan, an analyst at RBC Capital, maintains an Outperform rating on shares of Mobileye NV (NYSE:MBLY). The analyst also raised his price target on the stock from $42 to $48.\n\nMobileye NV (NYSE:MBLY) is an automotive parts and equipment company that is developing and deploying advanced driver assistance systems (ADAS) and autonomous driving technologies and solutions. The company is based in Jerusalem, Israel. Its solutions offer features such as real-time detection of road users. Cloud-Enhanced Driver Assist, one of its solutions, offers drivers real-time scene interpretations. These products are set to significantly change the way autonomous driving cars develop in the future.\n\nWe saw 22 hedge funds holding stakes in Mobileye NV (NYSE:MBLY) in the first quarter, with a total stake value of $140.4 million.\n\nLike Medtronic plc (NYSE:MDT), NVIDIA Corporation (NASDAQ:NVDA), and Microsoft Corporation (NASDAQ:MSFT), Mobileye NV (NYSE:MBLY) is a stock that is revolutionizing its sector today.\n\n7. InMode Ltd. (NASDAQ:INMD)\n\nNumber of Hedge Fund Holders: 34\n\nRoyce & Associates was the most prominent shareholder in InMode Ltd. (NASDAQ:INMD) at the end of the first quarter, holding 110,000 shares in the company.\n\nInMode Ltd. (NASDAQ:INMD) is a healthcare equipment company. It develops, manufactures, and markets minimally invasive aesthetic medical products. The company is based in Yokne'am, Israel. Its radio frequency devices used for cosmetic surgery can help revolutionize the medical aesthetic products sector.\n\nInMode Ltd. (NASDAQ:INMD) was spotted in the 13F holdings of 34 hedge funds in the first quarter. Their total stake value in the company was $212.1 million.\n\nMatt Miksic, an analyst at Barclays, holds an Overweight rating on shares of InMode Ltd. (NASDAQ:INMD) as of August 1. The analyst also raised his price target on the stock from $47 to $54.\n\n6. Rockwell Automation Inc. (NYSE:ROK)\n\nNumber of Hedge Fund Holders: 34\n\nOur hedge fund data for the first quarter shows 34 hedge funds holding stakes in Rockwell Automation Inc. (NYSE:ROK), with a total stake value of $399.3 million.\n\nRockwell Automation Inc. (NYSE:ROK) is a provider of industrial automation and digital transformation solutions. It is based in Milwaukee, Wisconsin. The company is a leader in the discrete automation business, which assembles highly engineered components into valuable final product configurations. Its products and solutions are set to change the way the automotive and industrial sectors function by introducing sustainability in automation.\n\nAn Overweight rating was maintained on shares of Rockwell Automation Inc. (NYSE:ROK) by Joshua Pokrzywinski, an analyst at Morgan Stanley, on August 2. The analyst also raised his price target on the stock from $340 to $345.\n\nImpax Asset Management was the largest shareholder in Rockwell Automation Inc. (NYSE:ROK) at the end of the first quarter, holding 528,121 shares in the company.\n\nHere's what Artisan Partners said about Rockwell Automation Inc. (NYSE:ROK) in its first-quarter 2023 investor letter:\n\n“Rockwell Automation, Inc. (NYSE:ROK) is a leading provider of industrial automation technology. The company has a strong brand, installed base and distribution network and is expanding its product offering to include more cloud-based software to complement its leading hardware business. In the coming years, we expect the company to benefit from an acceleration in US manufacturing investment to support customers’ nearshoring initiatives and in response to federal government incentive programs to manufacture energy transition products domestically. In addition, we expect Rockwell to experience revenue and margin tailwinds in 2023 from easing supply chain constraints, which limited its ability to meet customer demand in 2022.”\n\nLike Medtronic plc (NYSE:MDT), NVIDIA Corporation (NASDAQ:NVDA), and Microsoft Corporation (NASDAQ:MSFT), Rockwell Automation Inc. (NYSE:ROK) is a cutting-edge stock that is set to change the world.\n\nClick to continue reading and see the 5 Stocks That Will Change the Future.\n\nSuggested articles:\n\n12 Stocks That Will Benefit From AI 20 Biggest Internet of Things Companies in the World 10 Industries Being Revolutionized By AI and Automation Technologies\n\nDisclosure: None. 10 Stocks That Will Change the Future is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/10-stocks-change-future-201448931.html", "symbols": ["2M6.F", "2M6.XETRA", "ABB.ST", "ABB.US", "ABBN.SW", "ABJA.F", "ABLZF.US", "GOOG.US", "INMD.US", "MBLY.US", "MDT.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NVD.F", "NVD.XETRA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.01, "neu": 0.898, "pos": 0.091}}, {"date": "2023-08-20T19:02:05+00:00", "title": "Dow futures steady after losing week", "content": "Investing.com - U.S. stock futures were trading slightly higher during Sunday's evening deals, following a weekly decline among benchmark averages as monitored rising bond yields and continued economic weakness in China.\n\nBy 6:55pm ET (10:55pm GMT) Dow Jones Futures were flat, S&P 500 Futures added 0.1% and Nasdaq 100 Futures were up 0.2%.\n\nAhead in the week, investors will be closely monitoring new and existing home sales, building permits, preliminary manufacturing and services PMIs, core durable goods orders and Michigan consumer sentiment and expectations, as well as a speech from FOMC member Bowman.\n\nAmong earnings, companies including Zoom Video Communications Inc (NASDAQ:ZM), Lowe’s Companies Inc (NYSE:LOW), Dick’s Sporting Goods Inc (NYSE:DKS), Macy’s Inc (NYSE:M), Urban Outfitters Inc (NASDAQ:URBN), NVIDIA Corporation (NASDAQ:NVDA), Autodesk Inc (NASDAQ:ADSK), Intuit Inc (NASDAQ:INTU), Marvell Technology Group Ltd (NASDAQ:MRVL) and Dell Technologies Inc (NYSE:DELL).\n\nOn Friday, U.S. indices posted a mixed session with the Dow Jones Industrial Average up 25.8 points or 0.1% to 34,500.7, the S&P 500 finished flat at 4,369.7 and the NASDAQ Composite dipped 26.2 points or 0.2% to 13,290.8.\n\nFor the week, the Dow and S&P 500 lost 2.1% apiece while the NASDAQ shed 2.2%.\n\nOn the bond markets, United States 10-Year rates were nearing fresh 15 year highs of 4.257%.\n\nRelated Articles\n\nDow futures steady after losing week\n\nAustralia to buy U.S. Tomahawk missiles to boost long-range strike capability\n\nDuPont to sell Delrin resins unit to PE firm for around $1.8 billion - Bloomberg News", "link": "https://finance.yahoo.com/news/dow-futures-steady-losing-week-190205259.html", "symbols": ["ADSK.US", "DELL.US", "DJI.INDX", "DKS.US", "GSPC.INDX", "INTU.US", "IXIC.INDX", "LOW.US", "M.US", "MRVL.US", "NVDA.US", "URBN.US", "ZM.US"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0.037, "neu": 0.923, "pos": 0.04}}, {"date": "2023-08-20T18:51:00+00:00", "title": "Nvidia analyst says the AI chipmaker has a 'real shot' to top earlier highs", "content": "Wall Street darling Nvidia is set to report its fiscal quarterly results on August 23. Investors will likely watch the news closely, given that Nvidia surprisingly soared after its last earnings conference call. Last time, those lucky enough to own Nvidia before its post-EPS stunner were handsomely rewarded, including long-time analyst Stephen Guilfoyle.\n\nContinue reading", "link": "https://finance.yahoo.com/m/148bb333-9fc7-39de-8658-02c445bd0149/nvidia-analyst-says-the-ai.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.931, "neg": 0, "neu": 0.77, "pos": 0.23}}, {"date": "2023-08-20T18:09:00+00:00", "title": "This stock hailed as the 'kingmaker' of all the AI chipmakers", "content": "Semiconductor giant Nvidia reports earnings on August 23 and thanks to the promise of artificial intelligence, analysts are bullish on the stock.\n\nContinue reading", "link": "https://finance.yahoo.com/m/3269e9f5-b016-3ec0-ae17-c0a8ea0807d1/this-stock-hailed-as-the.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.807, "neg": 0, "neu": 0.717, "pos": 0.283}}, {"date": "2023-08-20T18:00:00+00:00", "title": "Nvidia, Lowe’s, Analog Devices, Ulta Beauty, Dollar Tree, and More Stocks to Watch This Week", "content": "The Federal Reserve's Jackson Hole Economic Policy Symposium begins on Thursday. Plus, earnings from Lowe's, Nvidia, Dollar Tree, Intuit, and Ulta Beauty.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1dc60ed5-5dd2-36ae-bdb9-f622759f33b6/nvidia%2C-lowe%E2%80%99s%2C-analog.html", "symbols": ["DLTR.MX", "DLTR.US", "DT3.F", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.586, "neg": 0, "neu": 0.858, "pos": 0.142}}, {"date": "2023-08-20T16:00:00+00:00", "title": "Missed Out on the Nvidia Rally? My Best AI Stock to Buy and Hold Now", "content": "Artificial Intelligence (AI) has been the buzzword of the year in the stock market, and one stock has emerged as the focal point of the AI stock rally. If you missed out on the Nvidia surge, there's another AI chip stock worth buying now. Broadcom (NASDAQ: AVGO) may not have the name recognition of Nvidia or Intel in the semiconductor sector, but the stock has been a consistent winner, up more than 2,000% over the last decade.\n\nContinue reading", "link": "https://finance.yahoo.com/m/981fe2b0-e40a-3118-972e-7ce879627d0a/missed-out-on-the-nvidia.html", "symbols": ["AVGO.US", "AVGO34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.796, "neg": 0.019, "neu": 0.878, "pos": 0.103}}, {"date": "2023-08-20T14:30:50+00:00", "title": "Nvidia reports earnings, Fed gathers in Jackson Hole: What to know this week", "content": "The final full week of August will bring investors two key events — earnings from Nvidia (NVDA) and the Federal Reserve's annual confab in Jackson Hole.\n\nThe Jackson Hole Economic Symposium will kick off on Thursday, with Fed Chair Jay Powell's speech Friday morning serving as the event's main highlight.\n\nPowell's commentary on the path forward for interest rates, the overall state of the economy, and any suggestion inflation pressures are prompting a rethink of the Fed's current goals will be in focus.\n\nOn the corporate side, Nvidia leads the earnings story this week with the company set to report results from a quarter that prompted the chipmaker to raise its revenue outlook by 50%.\n\nElsewhere on the corporate calendar, Lowe's (LOW), BJ's Wholesale Club (BJ), and Peloton (PTON) are also expected to report in the week ahead.\n\nAugust is so far shaping up to be the worst month of the year for stocks.\n\nAll three of the major averages closed last week lower as a hawkish read of the minutes from the Federal Reserve's July meeting sent stocks lower and Treasury yields higher in the back half of the week.\n\nPowell is set to speak as economic data continues to come in stronger than expected.\n\nLast week, the July retail sales report showed sales grew 0.7% during the month, nearly double what economists had predicted. The report sent the AtlantaFed's GDPNow forecast higher, with the tracker now estimating third quarter GDP growth will reach an annualized rate of 5.8%, the fastest pace since the fourth quarter of 2021.\n\nAnother sign that, in the view of some experts, the economy might be too strong for the Federal Reserve's liking.\n\n\"Powell should sound less balanced at Jackson Hole in our view, since the latest data raise the risk of a fresh increase in inflation,\" Bank of America's economics team wrote in a note on Friday.\n\nInflation has fallen significantly since last year's Jackson Hole speech, during which Powell said rates would rise until the \"job is done\" bringing down inflation. As recently as July, Powell has noted inflation remains \"well above\" the Fed's long-run goal of 2%.\n\nStory continues\n\nImportantly, Powell's speech comes before PCE inflation data is released on August 31 and the August jobs report is released on September 1.\n\n\"We don't see Powell giving much direction about where policy is headed at next week’s Jackson Hole meeting,\" JPMorgan's chief US economist Michael Feroli wrote on Friday. \"Perhaps the one thing he could say that would have the support of the Committee is that policy will remain restrictive for as long as it takes to squeeze undue inflation pressures out of the economy.\" Federal Reserve Chair Jerome Powell arrives for a news conference at the William McChesney Martin Jr. Federal Reserve Board Building following a Federal Open Market Committee meeting on Wednesday, July 26, 2023 in, Washington. (AP Photo/Nathan Howard)\n\nOn the corporate side, all eyes will be on Nvidia. In May, the chipmaker said it expected artificial intelligence demand to push its current quarter sales forecast from ~$7 billion to ~$11 billion. This forecast which capped off what had already been a manic spring for investor enthusiasm around AI. On Wednesday, the bill comes due.\n\nNvidia stock is up nearly 200% on the year, though its gains have moderated alongside the broader market since mid-July. And how the company follows up its surprise news from May could have broader market implications.\n\n\"NVDA is quite literally serving as 'kingmaker' as a huge wave of capital and new financing vehicles are chasing new AI software and specialized cloud infrastructure models while enterprises are still very early in a struggle to access enough capacity to build out AI at scale — this likely lasts well into next year,\" UBS analyst Timothy Arcuri wrote in a note last week.\n\n\"Even for more tactical investors, it still seems early to get off this train because (year-over-year) comps won’t get tough until year-end and the stock has rarely peaked prior to (year-over-year) comps peaking.\"\n\nNvidia's earnings report in late May also marked a shift in overall market sentiment for the year.\n\nAfter the stock carried tech names higher, Wall Street strategists became more openly bullish on the outlook for stocks in 2023. Many boosted their year-end targets for the S&P 500, specifically citing Artificial Intelligence.\n\nWith this year's rally pausing in August, the exuberance around AI appears to have lost some of its luster.\n\nAnd the way for the market to get its mojo back, according to Evercore ISI's Julian Emanuel, would be Nvidia stock to begin a new march higher.\n\n\"Given that the public has begun to sell stocks in recent weeks into the challenging [seasonality], we would expect anything besides a decisive breakout [in NVDA stock] toward $500 as being neutral to negative for the broader market, keeping uncertainty 'bid,'\" Emanuel wrote in a note on Friday.\n\nWeekly calendar\n\nMonday\n\nEarnings: Zoom (ZM)\n\nEconomic data: No notable economic data.\n\nTuesday\n\nEarnings: BJ's Wholesale Club (BJ) , COTY (COTY), Dick's Sporting Goods (DKS), Lowe's (LOW), Macy's (M), Toll Brothers (TOL), La-Z-Boy (LZB), Urban Outfitters (URBN)\n\nEconomic news: Existing home sales, July (4.15 million expected, 4.16 million previously); Existing homes sales month-over-month, July (-0.2% expected, -3.3% previously); Richmond Fed Manufacturing Index, August (-9 prior)\n\nWednesday\n\nEarnings: Advance AutoParts (AAP), Bath and Body Works (BBWI), Foot Locker (FL), Kohl's (KSS), Nvidia (NVDA), Snowflake (SNOW), Williams-Sonoma (WSM)\n\nEconomic news: S&P Global US Manufacturing PMI, preliminary read, August (49 expected, 49 previously); S&P Global US Services PMI, preliminary read, August (52 expected, 52.3 previously); New home sales, July (707,000 expected, 697,000 previously)\n\nThursday\n\nEarnings: Affirm(AFRM), Burlington Stores (BURL), Dollar Tree (DLTR), GAP (GPS), Intuit (INTU), Marvell Technology (MRVL), Nordstrom (JWN), TD Bank (TD), Workday (WDAY), Ulta Beauty (ULTA)\n\nEconomic news: Initial jobless claims, Week ending August 19 (239,000 previously), Durable goods orders, July (-4.0% expected, +4.6% previously)\n\nFriday\n\nEarnings: No notable earnings\n\nEconomic news: University of Michigan consumer sentiment, August, final reading (71.2 expected, 71.2 previously); Fed Chair Jerome Powell speaks in Jackson Hole.\n\nJosh Schafer is a reporter for Yahoo Finance.\n\nClick here for the latest economic news and economic indicators to help you in your investing decisions\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/nvidia-reports-earnings-fed-gathers-in-jackson-hole-what-to-know-this-week-143050927.html", "symbols": ["DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.969, "neg": 0.035, "neu": 0.908, "pos": 0.057}}, {"date": "2023-08-20T13:00:00+00:00", "title": "Bruised Stocks Face Week Full of Tests, From Nvidia to Powell", "content": "(Bloomberg) -- Equity traders reeling from the market’s worst stretch since February face some pivotal events in the days ahead, and a closely watched speech by Federal Reserve Chair Jerome Powell may not even be the biggest test of all.\n\nMost Read from Bloomberg\n\nRolls-Royce Debuts Droptail Roadster, Priced at Over $30 Million China Urges More Loans, Debt Risk Reduction as Woes Compound US Consumers Near Day of Reckoning as Pandemic Cash Stash Shrinks Russia’s Luna-25 Lander Fails to Enter Pre-Landing Orbit of Moon A Global Stock Trader’s Guide to Navigating Food Inflation\n\nAhead of Powell’s address Friday at a Fed symposium in Wyoming, traders are going to look to a crucial earnings report Wednesday from Nvidia Corp. to set the tone. A blowout forecast for surging revenue in May from the chipmaker, now the fourth-largest component of the S&P 500 Index, helped ignite the artificial-intelligence rally that’s powered the benchmark’s roughly 14% advance this year.\n\nPowell then caps off the week. A Fed chair’s speech at the conference has typically buoyed stocks since the turn of the millennium, with the S&P 500 gaining 0.4% on average in the following week, data compiled by Bloomberg Intelligence show. But last year’s appearance is still fresh in traders’ minds: Stocks slumped 3.2% in the week following Powell’s remarks, according to BI, after he warned of keeping policy restrictive to battle inflation.\n\nThe risk this time is he leans into the prospect of additional tightening this year, which may crimp expectations for growth at a time when worries are mounting over China. It’s a scenario that would also jeopardize Wall Street profit forecasts, especially for high-flying tech shares.\n\n“Investors are betting on a narrative that inflation is under control and the Fed can declare victory, but it has yet to become a reality — and that’s the biggest risk to the stock market,” said Stephanie Lang, chief investment officer at Homrich Berg. At the same time, “it’s going to be tough for this rally to continue unless Nvidia can translate the power of AI into earnings growth.”\n\nStory continues\n\nOver the long haul, however, the path of the Fed is paramount, with three policy-setting meetings left in 2023. In the interest-rate market, traders are leaning toward a pause next month and have priced in less than half of a quarter-point hike for the following decision in November.\n\nA report on consumer prices this month showed that inflation was tame in July. But robust retail sales data also showed that US consumers remain resilient, which could push the Fed to pursue more aggressive policy should inflationary pressures prove sticky.\n\nAs the selloff in US stocks gained momentum last week, with the S&P 500 posting its first three-week slide since February, so did the appetite for options contracts betting on more losses.\n\nMore than 25 million put options traded on US exchanges on Thursday, the most since the banking tumult in March — while the demand for calls remained about average, according to data compiled by Bloomberg. The measure rose even further Friday when contracts tied to stocks and indexes expired.\n\n“The elevated put volume was a function of markets selling off into a new, lower-than-we’ve seen recently spot range,” Rocky Fishman, founder of derivatives analytical firm Asym 500, said by email. “The proximity to the monthly expiration helped push it above the previous highs.”\n\nThe S&P 500 has dropped 4.8% in August, on pace for the worst month this year, and the Cboe VIX Index — a measure of expected swings in the benchmark — is near the highest since May. While the weakness in stocks is hardly fostering panic, derivatives traders are definitely taking notice.\n\nCall buying to open a position — seen as a gauge of bullish wagers — has dropped to the lowest level this year relative to puts to open a position, Options Clearing Corp. data analyzed by Citigroup Inc. show. A similar trend can be seen in a broader measure that also includes put and call selling as a barometer for upside and downside bets.\n\nThe positioning puts the Fed symposium under an even brighter spotlight. The setup going into the meeting is “complex,” says Dennis Debusschere, president of 22V Research LLC, with rising Treasury yields pressuring long-duration equities and the fight against inflation far from over.\n\n“Do not expect Powell to deliver the hammer as he did in 2022,” he said in a note to clients. “We don’t think Powell will change his tone away from data dependency, which won’t be perceived to be as hawkish when yields are rising and risk assets underperforming.”\n\nMost Read from Bloomberg Businessweek\n\n‘Don’t You Remember Me?’ The Crypto Hell on the Other Side of a Spam Text GOP Presidential Hopeful Ramaswamy Sued Over Strive’s Practices The Legendary, Wildly Profitable QQQ Fund Makes No Money for Its Owner Brookfield Chases Rivals for Private Equity’s New Money-Spinner Sam’s Club’s War Against Costco Started With $1.38 Hot Dog Combo\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/bruised-stocks-face-week-full-130000617.html", "symbols": ["GSPC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": -0.99, "neg": 0.089, "neu": 0.867, "pos": 0.044}}, {"date": "2023-08-20T11:00:55+00:00", "title": "Surging demand for AI creating shortage of high-powered chips", "content": "Much of the talk about the semiconductor shortages that plagued the globe during the pandemic may have subsided, but now a new chip shortage has emerged.\n\nAs more companies scramble to develop advanced generative artificial intelligence models or integrate them into their systems amid the popularity of new tools like OpenAI's ChatGPT, demand for the high-powered graphics processing units (GPUs) needed to deploy them is surging.\n\nThe souped-up computer chips are critical for running the countless calculations involved in training and deploying AI algorithms, but very few companies make them. A Nvidia Corp. chip during the Taipei Computex expo in Taipei, Taiwan, May 29, 2023.\n\nThe shortage is one that many businesses and investors saw coming as interest in AI grew.\n\nWHAT IS ARTIFICIAL INTELLIGENCE (AI)?\n\nSanta Clara, California-based company Nvidia is the dominant powerhouse in the AI chip space because of its GPUs used to train AI, and that recognition drove its market capitalization above $1 trillion in May 2023. Industry analysts estimate Nvidia controls somewhere between 80% to 95% of the market and is set for further growth given its hold on the industry.\n\nREAD ON THE FOX BUSINESS APP\n\nNvidia has vowed to ramp up production to meet the spike in demand from AI, but so far it is not enough to keep up in the ongoing boom.\n\nMicrosoft's latest annual report pointed to the shortage of GPUs as a potential risk factor for investors, and even OpenAI CEO Sam Altman told Congress in testimony earlier this year that the dearth of GPUs was making it difficult for ChatGPT to handle its workload.\n\nWHAT IS CHATGPT?\n\nMeanwhile, deep pockets continue to enter the AI market, gobbling up chips and driving prices even higher.\n\nThe Financial Times reported this week Saudi Arabia purchased at least 3,000 of NVIDIA's high-powered H100 chips for $40,000 each, and last week the outlet reported four Chinese tech titans, including Alibaba and TikTok parent Bytedance, ordered some $5 billion in GPUs from the firm. The Nvidia Corporation logo during the annual Computex computer exhibition in Taipei, Taiwan, May 30, 2017.\n\nThe soaring demand is creating significant concern from startups seeking to enter the AI space over fears they will not be able to access the chips they need when ready to launch.\n\n\"There’s a lot of worry from AI startups that there may not be enough GPUs available to serve inference [the process of generating answers from AI models] when they find commercial success,\" CoreWeave co-founder and CTO Brian Venturo told Barron's Tech in a recent interview.", "link": "https://finance.yahoo.com/news/surging-demand-ai-creating-shortage-110055931.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.661, "neg": 0.075, "neu": 0.849, "pos": 0.076}}, {"date": "2023-08-20T11:00:00+00:00", "title": "The AI Trade Faces Its First Major Test With Nvidia Earnings", "content": "The chip maker’s rosy forecast lifted markets in a turbulent time—but the bar to dazzle investors is higher now.\n\nContinue reading", "link": "https://finance.yahoo.com/m/12d2355c-371f-38bf-8777-0ccb9033531f/the-ai-trade-faces-its-first.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-20T06:38:19+00:00", "title": "Top 5 things to watch in markets in the week ahead", "content": "Investing.com -- Federal Reserve officials gather for the central bank’s annual get-together at Jackson Hole, Wyoming with a speech by Federal Reserve Chairman Jerome Powell the main highlight. The deepening crisis in China’s property sector will remain to the fore, while PMI data out of the Eurozone and the UK will likely add to the gloom. Here’s what you need to know to start your week.\n\nJackson Hole\n\nInvestors will be looking to a speech by Fed Chair Jerome Powell for clarity on the economic outlook and the future path of interest rates.\n\nPowell’s speech, set for 10:05 am ET on Friday, comes after last week’s minutes of the central bank’s July meeting showed that most policymakers are still concerned about upside risks to inflation, indicating that further rate hikes cannot be ruled out.\n\nInvestors will be focusing on whether the Fed head believes more policy tightening will be needed to bring down inflation, or if enough progress has been made to keep rates on hold. Market watchers will also be on the lookout for any clues on whether the Fed is weighing the prospect of rate cuts in 2024.\n\nTraders see an 89% chance of the Fed holding rates at current levels at its September meeting, according to Investing.com's fed rate monitor tool.\n\nEquity markets\n\nWith no major catalysts driving markets, investors will be focusing on Powell's speech on Friday for clues on the interest rate outlook as well as earnings from chip designer Nvidia (NASDAQ:NVDA), which is due to report on Wednesday.\n\nNvidia has had a stunning rally on expected growth in artificial intelligence, nearly tripling in value year-to-date.\n\nWall Street’s three main indices ended lower last week after a spate of strong economic data caused investors to dial back expectations of rate cuts and drove up government bond yields.\n\nAnxiety over China’s worsening property crisis and its impact on the country’s weakening economy also weighed on market sentiment after embattled developer China Evergrande Group (HK:3333) filed for U.S. bankruptcy protection on Thursday.\n\nStory continues\n\nChina woes\n\nExpectations are mounting that China could make a cut to the loan prime rate - meaning lower mortgage rates - as soon as Monday, amid fears that the unprecedented debt crisis in the country's property sector, which accounts for roughly a quarter of the economy, is starting to spill over into its financial system.\n\nChina unexpectedly lowered several key interest rates last week, but analysts say moves so far have been too little, too late, with much more forceful measures needed to stem the economy's downward spiral.\n\nThe deepening crisis in the property sector along with worries about contagion risks could have a destabilizing impact on the world’s second largest economy, which has already weakened amid tepid domestic and foreign demand, faltering factory activity and rising unemployment.\n\nPMI data\n\nThe Eurozone and the UK are to release PMI data on Wednesday, which could provide insights into whether the European Central Bank will hike interest rates again in September and if the Bank of England opts for a big rate increase.\n\nEurozone and UK PMIs have been sliding in recent months, amid stagnation in the service sector coupled with a contraction in the manufacturing activity.\n\nECB President Christine Lagarde is to speak at Jackson Hole on Friday with investors looking for clues on the central bank’s next move in September.\n\nIn July, Lagarde said the ECB would keep an \"open mind\" when it came to future rate decisions, adding that policymakers were \"moving to a stage where we are going to be data dependent\".\n\nOil prices\n\nOil prices posted their first weekly loss since June last week as growing concerns over the global demand outlook offset expectations of tightening supply on the back of output cuts by OPEC+ linchpins Saudi Arabia and Russia.\n\nOil prices were pressured lower as the worsening property crisis in China weighed on risk appetite. Meanwhile, Wednesday’s Fed minutes boosted Treasury yields and propelled the dollar to a fifth week of gains, weighing on the allure of commodities for overseas buyers.\n\n\"Concerns for investors remain focused on the tension between slowing global growth and still-tight global supplies,\" Rob Haworth, senior portfolio manager at U.S. Bank Asset Management told Reuters.\n\n\"Prices are likely to remain range-bound for now,\" Haworth added, noting that demand is in question for investors worried by the weak data from China.\n\n--Reuters contributed to this report\n\nRelated Articles\n\nTop 5 things to watch in markets in the week ahead\n\nChina vows to coordinate support to resolve local government debt risks\n\nHurricane Hilary threatens Mexico, California with 'catastrophic floods'", "link": "https://finance.yahoo.com/news/top-5-things-watch-markets-063819091.html", "symbols": ["3333.HK", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": -0.994, "neg": 0.131, "neu": 0.796, "pos": 0.073}}, {"date": "2023-08-20T05:25:39+00:00", "title": "This week in tech: Analysts sweet on Nvidia; Tesla cuts prices again", "content": "By Louis Juricic and Sarina Isaacs\n\nInvesting.com -- Here is your weekly Pro Recap on the biggest headlines out of tech this week: analysts bump up price targets for Nvidia; Cisco bumps higher even after missing guidance targets; Tesla cuts prices again; and Coinbase wins a regulatory battle.\n\nInvestingPro subscribers get tech headlines like these in real time. Never miss another market-moving alert.\n\nNvidia goosed by rising price targets\n\nThis past week, ahead of earnings due out on Wednesday, Oppenheimer analysts boosted Nvidia's (NASDAQ:NVDA) price target to $500, writing that Nvidia “remains the purest scale play on AI adoption.” And Rosenblatt hiked Nvidia's price target to as much as $800 per share, which is a new Street high.\n\nRosenblatt analysts wrote that investor expectations for earnings per share in fiscal 2025 (calendar year 2024) \"have risen substantially, but we recommend investors stay the course here and remain bullish amid the recent pullback in the stock over the past month.\"\n\nThe analysts added, \"Demand will dictate NVDA's long-term AI revenue opportunity, but supply should be the primary determinant for its data center revenue at least through C2024.\"\n\nAnalysts are looking for second-quarter earnings of $2.07 per share on revenue of $11.17 billion. For the current quarter, the Street is seeking EPS of $2.35 on revenue of $12.49B.\n\nShares rose 7% for the week to $432.99.\n\nCisco Systems rises on hopeful talk from management, even after soft sales forecast\n\nCisco (NASDAQ:CSCO) on Thursday issued disappointing full-year revenue guidance, but it topped Wall Street targets for the fiscal fourth quarter and the stock gained on management optimism across several areas, including AI.\n\nThe company said adjusted earnings per share came to $1.14 - $0.08 better than consensus - on revenue of $15.2B, above the $15.05B average target, on the strength of a growing enterprise appetite for AI, security, and cloud.\n\nStory continues\n\nEarnings guidance for Q1 topped expectations at $1.02 to $1.04 per share - the Street was looking for $0.99 - and revenue of $14.5B to $14.7B was in line with targets. Full-year expectations were for earnings of $4.01 to $4.08 per share on sales of $57B to $58.2B; analysts were seeking $4.04 per share on $58.4B in revenue.\n\nThe stock took a hit on the soft revenue guidance until management talked up the company's future prospects across several areas, including AI.\n\nCEO Chuck Robbins said on the earnings call that Cisco is poised for \"further share gains\" in campus switching, wireless LAN, and SP routing, having gained \"over 3 percentage points of market share\" vs. the prior year in those key areas, and he also said he believes the company is \"super well positioned\" on AI.\n\nFollowing these results, analysts at BofA, Citi, and KeyBanc all kept their neutral ratings on the stock.\n\nBofA and KeyBanc highlighted the company's solid execution and innovation, but BofA sees \"additional risk to estimates\" given a \"diminishing backlog contribution\" that would necessitate a \"significant order recovery throughout F24, which might not materialize.\" And KeyBanc is staying neutral until it sees \"more consistent signs of share gains and improved visibility into F2H24 order growth ramp.\"\n\nCiti similarly said it is staying on the sidelines until it sees further market share gains in \"switch and security,\" adding that Cisco's talk of AI share gains was \"encouraging,\" but \"we await third party data verification to get more excited about share gains.\"\n\nEvercore, however, maintained its Outperform rating on Cisco and raised the target price by $3 to $63, arguing that the fiscal 2024 guidance is \"fairly conservative with room for upside\" across multiple segments. It also believes the company's commitment to \"showing operating leverage,\" and more consistent share buyback of some $1.5B quarterly, \"will resonate with investors and provide higher predictability for CSCO shareholders going forward.\"\n\nCisco shares climbed 2.3% to $55.04 for the week.\n\nTesla cuts prices in China, spurring concerns\n\nTesla (NASDAQ:TSLA) announced price cuts on its vehicles in China last week, further fueling worries of a potential price war in the country's lucrative electric vehicle (EV) market.\n\nOn Monday, the Elon Musk-led EV giant slashed prices for its Model Y long-range and performance editions in China by CNY 14,000, reinvigorating concerns that the firm's rivals in the world's biggest auto market will also be persuaded to roll out similar moves.\n\nAnd two days later, it lowered the price of its Model X sport utility vehicles and Model S sedans in inventory by as much as CNY 70,000 (CNY 1 = $0.1371), a statement on the company's WeChat account read.\n\nTesla has been racing to secure its share of a fiercely competitive Chinese market. The firm's shipments in the country slipped by 31% in July, touching their lowest level this year, while global production is expected to fall in the third quarter.\n\nIn a call with analysts last month, Musk said it made sense to \"sacrifice margins to make more vehicles,\" arguing that the value of Tesla's cars will go up once its Full Self-Driving mode is perfected.\n\nEvercore ISI analysts predicted in a research note that comparable targeted price reductions might be seen in the U.S. and Europe.\n\nAnd Morgan Stanley said on Thursday that \"Investors are becoming more cautious on China EVs after a solid run in the past 3 months, with Tesla's further promotional activity of particular concern.\"\n\nShares slid 8.5% to $215.49 for the week.\n\nCoinbase clears critical regulatory hurdle\n\nCoinbase (NASDAQ:COIN) announced Wednesday it has successfully obtained regulatory approval from the National Futures Association (NFA) to operate as a Futures Commission Merchant (FCM).\n\nThis new status, which the company called a \"critical milestone,\" enables eligible customers in the US to access cryptocurrency futures via Coinbase’s platforms.\n\nCoinbase filed an application with the NFA for registration as an FCM in September 2021. Nearly two years later, the company received the green light from regulators.\n\nShares gained on the announcement, but were still down 8.5% for the week to $73.19.\n\nSenad Karaahmetovic, Yasin Ebrahim, and Scott Kanowsky contributed to this report.\n\n***\n\nGet ready to supercharge your investment strategy with our exclusive discounts.\n\nDon't miss out on this limited-time opportunity to access cutting-edge tools, real-time market analysis, and expert insights. Join InvestingPro today and unlock your investing potential. Hurry, the Summer Sale won't last forever!\n\nRelated Articles\n\nThis week in tech: Analysts sweet on Nvidia; Tesla cuts prices again\n\nKuwait Airways plans to lease eight Airbus jets within 10 years\n\nAdobe co-founder John Warnock dies at 82", "link": "https://finance.yahoo.com/news/week-tech-analysts-sweet-nvidia-052539650.html", "symbols": ["CIS.F", "CIS.XETRA", "COIN.US", "CSCO.MX", "CSCO.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.045, "neu": 0.792, "pos": 0.163}}, {"date": "2023-08-19T14:05:14+00:00", "title": "What Nvidia, Intel, AMD, and TSMC Stock Investors Should Know About Recent Chip Updates", "content": "In today's video, I discuss numerous updates impacting popular semiconductor companies. Check out the short video to learn more, consider subscribing, and click the special offer link below. *Stock prices used were the market prices of Aug.\n\nContinue reading", "link": "https://finance.yahoo.com/m/103c1bc7-a2f7-39ca-a821-167557299dfd/what-nvidia%2C-intel%2C-amd%2C-and.html", "symbols": ["2330.TW", "A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TSFA.F", "TSFA.STU", "TSM.US", "TSMC34.SA"], "tags": [], "sentiment": {"polarity": 0.671, "neg": 0, "neu": 0.867, "pos": 0.133}}, {"date": "2023-08-19T12:18:38+00:00", "title": "Dow Jones Futures: Market In Correction As Nvidia Earnings, Powell Speech Loom; What To Do", "content": "Nvidia earnings and Fed chief Jerome Powell's speech loom with the market in correction. Here's what to do now.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d98e0143-cbce-327e-bc3f-d4fb353e7a80/dow-jones-futures%3A-market-in.html", "symbols": ["117.F", "5AP.F", "ANET.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "PANW.US"], "tags": [], "sentiment": {"polarity": -0.226, "neg": 0.087, "neu": 0.913, "pos": 0}}, {"date": "2023-08-19T12:00:00+00:00", "title": "FS Insight Weekly Roadmap: Nvidia Earnings and Jackson Hole Key for Market", "content": "Tom Lee, CFA FS Insight Head of Research August is proving to be even more treacherous than our \"be wary\" view. There has been little sign of market stabilization since the start of August. For us, the key now is whether this is the start of a major equity rout (-10% to 4,150) or this is just another \"choppy\" August (-5% is close to as bad as it gets).\n\nContinue reading", "link": "https://finance.yahoo.com/m/2700b8f4-200e-3777-b23b-a9e3e215060b/fs-insight-weekly-roadmap%3A.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": -0.542, "neg": 0.048, "neu": 0.952, "pos": 0}}, {"date": "2023-08-19T10:45:00+00:00", "title": "AMD Will Likely Announce New Graphics Cards Next Week", "content": "Jon Peddie Research reported that graphics card unit shipments, the vast majority of which are PC graphics cards, tumbled 38.2% year over year in the first quarter. While market leader Nvidia and perennial runner-up Advanced Micro Devices (NASDAQ: AMD) are suffering declines in sales of gaming graphics cards, AMD is feeling more pain. AMD's last-gen graphics cards have fallen in price, making them compelling options for gamers, particularly at the lower end of the market.\n\nContinue reading", "link": "https://finance.yahoo.com/m/39f40009-d11b-3ce7-9fc7-0515bfa7a40c/amd-will-likely-announce-new.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": -0.805, "neg": 0.134, "neu": 0.804, "pos": 0.062}}, {"date": "2023-08-19T10:14:00+00:00", "title": "The Bull Market in Artificial Intelligence Is Just Getting Started: 2 Big Reasons to Buy Nvidia Stock Right Now", "content": "Wall Street's growth projections for the generative AI leader are high, but perhaps not high enough.\n\nContinue reading", "link": "https://finance.yahoo.com/m/38cbe3c4-a556-3265-a8e2-6e32cdc87d46/the-bull-market-in-artificial.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0, "neu": 0.904, "pos": 0.096}}, {"date": "2023-08-19T09:50:00+00:00", "title": "Opinion: These Will Be the 5 Largest Stocks by 2030", "content": "All of these megacap monster stocks should enjoy tremendous growth throughout the rest of the decade.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9d11b807-da42-3d5e-90cb-26935a0e93c3/opinion%3A-these-will-be-the-5.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "MSF.F"], "tags": [], "sentiment": {"polarity": 0.724, "neg": 0, "neu": 0.725, "pos": 0.275}}, {"date": "2023-08-19T09:00:00+00:00", "title": "The computer chip the world’s superpowers are scrambling to own", "content": "H100 chip\n\nAncient civilisations hunted for spice; in the 20th century we fought wars for oil. In 2023, the world’s most precious commodity is an envelope-sized computer chip.\n\nThe H100, a rectangular black maze of circuits with a shimmering microchip at its centre, is a niche piece of equipment even by Silicon Valley’s nerdy standards.\n\nIts $40,000 price tag is exceptional for a computer processor, although even if you have the cash, good luck getting your hands on one. The half a million H100s expected to be made this year are already sold out.\n\nNot that one chip would do you much good. Last week, it emerged that Saudi Arabia had ordered some 3,000 H100s.\n\nAlmost all of the chips are being snapped up by the richest companies in the world: Microsoft, Amazon, Google and Mark Zuckerberg’s Meta are believed to account for the vast majority of demand.\n\nJoe Biden has banned their export to China, under rules designed to prevent sensitive technology ending up in enemy hands.\n\nWhile more than a trillion microchips – the brains of our electronics – are made each year, the H100 is at the centre of a global race for intelligence.\n\nThe chip is described by its maker, the Silicon Valley giant Nvidia, as the world’s first designed for “generative” artificial intelligence, the type of powerful, “creative” AI behind technologies such as ChatGPT that has taken the world by storm.\n\nThis year, the rise of systems like ChatGPT have rekindled warnings that artificial intelligence should be treated with the same seriousness as nuclear weapons and climate change.\n\nIts makers have been summoned to Downing Street and the White House and threatened with new regulations.\n\nThe strikes that have ground Hollywood to a halt, for example, are driven partly because actors and writers fear being replaced by AI replicas that do not demand wages.\n\nHow the chip works\n\nType a query into ChatGPT and it will confidently spit out an erudite answer in a split second. The heavy lifting, though, is being done by thousands of Nvidia chips in an enormous humming server farm hundreds of miles away.\n\nStory continues\n\nThe AI boom has catapulted the Californian company into one of an elite group of businesses worth more than one trillion dollars and made its founder, Jensen Huang, the world’s 32nd-richest person – with a $39bn fortune. Despite the emergence of rivals, Jensen Huang’s Nvidia dominates to the point that it’s frequently seen as ‘the only game in town’ - I-Hwa Cheng/Bloomberg\n\nThe H100’s position as the key to the AI boom is really a happy accident. For most of its 30 years, Nvidia has produced chips, known as GPUs, used to power 3D graphics in video games.\n\nTraditional computer processors, known as CPUs, can perform complicated calculations, but generally only one at a time. In contrast GPUs can carry out hundreds of simple calculations at once.\n\nThat made them adept at tasks like modifying colourful pixels in a video game. What the company did not count on was that its chips would also be perfect for the rapid data processing required for artificial intelligence.\n\nIn 2012, Google researchers used 16,000 CPUs to train rudimentary AI software that could recognise pictures of cats. A year later, researchers achieved the same results with four GPUs.\n\n“It’s partially incredible foresight, and partially just blind luck,” says Jay Goldberg, a Silicon Valley chip industry expert.\n\n“The way that AI works is it’s the same maths equation, just done over and over and over again in vast quantities. And GPUs are really good at that.”\n\nLuck notwithstanding, people are now buying the chips as fast as Nvidia can make them. “GPUs at this point are considerably harder to get than drugs,” Elon Musk told a conference in May.\n\nWhile rival companies make GPUs, one technology investor describes Nvidia as “the only game in town”. And for those that want the best, only the H100 will do.\n\nThe state of the art model that powers ChatGPT, for example, was developed using an estimated 25,000 A100s, the chip’s predecessor.\n\nThe new version is an order of magnitude more powerful: accomplishing in 20 hours what would take the A100 a week.\n\nFor all their ascribed “intelligence”, the best AI systems are really a product of the best training, and that is really a matter of having the best computer.\n\nThe first version of the model behind ChatGPT had around 100 million variables known as parameters; the latest is believed to have trillions.\n\nNo surprise, then, that tracking down the best chips has become an act of desperation. “There’s one thing that can provide competition to H100 GPUs: Taylor Swift concert tickets,” Aravind Srinivas, an AI entrepreneur, tweeted.\n\nOne online commentator refers to it as the “Opec of GPUs”.\n\nSilicon Valley bosses trade stories of their efforts to obtain the fabled chips: some tap up their well connected venture capital investors for contacts, others beg friends at universities for a chance to plug in to their research labs.\n\nThere is only one guaranteed way to obtain a steady supply, however: hundreds of millions of dollars. That means there are now broadly two camps of customers that can buy chips in the quantities that matter: tech giants, and nation states.\n\nThe global race for AI supremacy\n\nWithin a few years, AI has moved from a promising technology to a critical national priority.\n\nIn 2017, China outlined a “new generation AI plan” vowing to make the country the “primary” centre for innovation by 2030. According to the US-based Center for Security and Emerging Technology, Beijing is seeking to push towards “artificial general intelligence”, a system capable of matching human intelligence.\n\nThe plan has been met with a volley of US sanctions designed to cripple Chinese efforts in AI.\n\nLast year the White House barred Nvidia from selling its H100 and A100 chips to China without a licence. The company has rushed out new versions of the chips to evade the controls, and the Biden administration is now expected to respond with a new set of rules.\n\nSaudi Arabia and the United Arab Emirates are both investing heavily in chips, developing their own “large language models” similar to ChatGPT.\n\nAccording to the Financial Times, the Saudi software, being developed at the oil-rich state’s Kaust research institution, is largely being created by Chinese researchers whose education bars them from working in America.\n\nIn the US, the Biden administration is spending tens of billions to encourage microchip companies to set up factories in America, a plan that has been described as “one of the biggest government interventions since the Second World War”.\n\nNvidia may be an American company, but its highest-powered chips are exclusively made in Taiwan, making the entire AI industry dangerously exposed to the threat of Chinese invasion.\n\nAI weapons are an obvious example of just how important the new tech is. Autonomous drones that can see the world around them and respond accordingly have already changed the battlefield in Ukraine, and AI has successfully flown F-16 fighter jets.\n\nBut the risks are wider: generative AI programmes similar to ChatGPT threaten mass-scale cyber attacks and the industrialisation of fake images.\n\nMike Wooldridge, of the Alan Turing Institute, says widespread disinformation is the greatest immediate risk from AI.\n\nIn 2016, Russia was accused of meddling in Donald Trump’s election using armies of internet trolls in Moscow offices. By next year’s election, AI is likely to be capable of spinning up infinite numbers of divisive online comments and hoax pictures that are indistinguishable from the real thing.\n\nOld fashioned economic conflict is also a concern, however.\n\nSam Altman, the chief executive of OpenAI, the company behind ChatGPT, has predicted that once AI software gets to a level of sophistication where it can improve itself, it will kick off a “recursive loop of innovation” that will see it create “phenomenal wealth”, not to mention instant scientific breakthroughs. Sam Altman, chief executive of OpenAI, predicts that bots will reach a point of critical mass after which it will teach itself - JOEL SAGET/AFP\n\nNot everyone is as optimistic, but if even the less radical predictions about how AI will change economies come true, countries will not want to be left behind.\n\nBritain left behind\n\nAs for Britain? Five years ago, the British technology investor Ian Hogarth predicted that the rise of machine learning systems would lead to what he called “AI nationalism”.\n\nHogarth suggested that the rise of AI would mean an “accelerated arms race” that would lead to more closed economies, prevention of foreign takeovers and restrictions on talent leaving, adding that “AI policy will become the single most important area of government policy.”\n\nHe warned that Britain was getting its own AI strategy wrong by allowing the sale of companies such as London-based Deepmind, one of the world’s top AI labs, which Google bought for a comparatively paltry £400m in 2014.\n\nIf his ideas seemed outlandish five years ago, they are now being taken seriously. This year, Hogarth was appointed the chairman of Rishi Sunak’s AI Foundation Taskforce, designed to encourage cutting edge safety research.\n\nThe UK may have founded one of the world’s top AI companies, and a government review last year described the field as a “top-level economic, security, health and wellbeing priority”.\n\nBut when it comes to the computing power needed for today’s technology, experts warn that we are dangerously behind. A review into the UK’s computing capabilities published this year pointed out that there were fewer than 1,000 top-spec Nvidia GPUs available to researchers in the UK – a fraction of what it took to train the latest ChatGPT model.\n\nArcher-2, Britain’s most powerful computer, was designed four years ago, and did not anticipate the AI boom.\n\n“The UK is not well set up at the moment for large scale GPU-focused computing,” says Mark Parsons, the executive director at the Edinburgh Parallel Computing Centre, the UK’s leading supercomputer hub, where Archer-2 is based. “We just don’t have that capability anywhere.”\n\nOne industry source warns that within a few years, “there will be a compute crunch in the economy that is as damaging as the energy crunch has been over the last year.”.\n\nThe Government has set aside £900m for a new supercomputer and research infrastructure, although these are unlikely to come online for at least a year, a lifetime in AI terms.\n\nInstead Rishi Sunak is focusing on other areas, such as putting the UK at the centre of global efforts to rein in the risk of runaway AI breaking free of human control.\n\nOne of the options likely to be discussed at a global safety summit in November is a UK-based global agency modelled on the International Atomic Energy Agency, the body set up in the early Cold War to prevent nuclear winter.\n\nPreparations for the summit are behind schedule but proceeding rapidly, with officials debating at what level China will be invited.\n\nThe new superpowers\n\nThis all may be a sideshow, however. For unlike nuclear weapons, it is not nation states at the forefront of AI development, but a handful of giant technology companies.\n\nThis year, Google will spend $33bn on buildings and equipment, with spending on infrastructure such as Nvidia chips rising by around a third.\n\nNetflix – satirised in an episode of Black Mirror that imagined a future where actors were replaced by AI holograms – is advertising machine learning jobs that pay up to $900,000, more than four times the prime minister’s salary.\n\nIf AI power is a product of the computing strength behind it, national governments pale compared to the resources available to private enterprises.\n\nInflection AI, a start-up run by DeepMind’s co-founder Mustafa Suleyman and funded by Microsoft, is building an AI supercomputer with 22,000 H100 chips.\n\nAmazon, Microsoft and Google, the so-called “hyperscalers” that run the data centres an increasing proportion of the world’s IT runs on, are lining up orders for tens of thousands each.\n\nMeta may require 100,000, according to one analysis.\n\nGoldberg says that the “super seven” giant IT companies – adding in the three Chinese companies of Baidu, Alibaba and Tencent – are responsible for approaching 100pc of demand for Nvidia’s top chips.\n\nAltman, perhaps the most prominent figure in AI today, talks about OpenAI in the same language one would typically reserve for nation states. He says that in future its leader could be democratically elected.\n\nFor now, though they are answerable to shareholders and employees, which has led to questions about whose side these companies are really on.\n\nIn 2019, employees at Microsoft opposed the company’s work with the US military, writing that “we did not sign up to develop weapons”.\n\nThe prior year, protests at Google forced the company to halt work on a drone contract for the Pentagon. Palantir chief Alex Karp has warned that delays due to moral qualms in the an AI arms race will not impede rivals like China - Eddie Mulholland\n\nAlex Karp, the chief executive of Palantir, an AI company used by the CIA to help track down Osama bin Laden, recently warned that such indecision would be comparable to Robert Oppenheimer refusing to build the atomic bomb, and that no such quandary exists in China.\n\n“Our hesitation, perceived or otherwise, to move forward with military applications of artificial intelligence will be punished,” he said.\n\nTime may be running out for this to be decided.\n\nDemis Hassabis, the founder of DeepMind and Britain’s most prominent AI figurehead, says artificial general intelligence, the point at which AI development reaches a potentially unstoppable velocity, could happen within a decade.\n\nAs for the company powering this revolution, this month Nvidia unveiled a yet more powerful version “GH200”. The world is scrambling for the superchip at the heart of the AI race, but it may soon be yesterday’s news.", "link": "https://uk.finance.yahoo.com/news/computer-chip-world-superpowers-scrambling-090000729.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.061, "neu": 0.841, "pos": 0.098}}, {"date": "2023-08-19T01:02:33+00:00", "title": "JANUS HENDERSON GROUP PLC Acquires New Stake in Benitec Biopharma Inc", "content": "Introduction to the Transaction\n\nOn August 9, 2023, JANUS HENDERSON GROUP PLC, a London-based investment firm, made a significant move in the biotechnology sector by acquiring 206,170 shares of Benitec Biopharma Inc (NASDAQ:BNTC). This transaction marked a new holding for the firm, with the shares purchased at a price of $3.2 each. Despite the substantial share acquisition, the impact on the firm's portfolio was not significant, with the position in BNTC representing 0% of the total portfolio. The firm now holds 9.90% of Benitec Biopharma Inc's total shares.\n\nProfile of the Guru\n\nWarning! GuruFocus has detected 5 Warning Signs with BNTC. Click here to check it out.  BNTC 30-Year Financial Data The intrinsic value of BNTC\n\nJANUS HENDERSON GROUP PLC, located at 201 BISHOPSGATE, LONDON, X0 EC2M 3AE, is a renowned investment firm with a diverse portfolio. The firm currently holds 2,591 stocks, with a total equity of $160.73 billion. Its top holdings include tech giants like Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN), Microsoft Corp (NASDAQ:MSFT), NVIDIA Corp (NASDAQ:NVDA), and Mastercard Inc (NYSE:MA). The firm's investment strategy is primarily focused on the Technology and Healthcare sectors. JANUS HENDERSON GROUP PLC Acquires New Stake in Benitec Biopharma Inc\n\nOverview of the Traded Stock\n\nBenitec Biopharma Inc (NASDAQ:BNTC), a US-based biotechnology company, was first listed on the stock market on July 11, 2012. The company is engaged in developing a proprietary therapeutic technology platform that combines RNA interference with gene therapy. This innovative approach aims to provide sustained, long-lasting silencing of disease-causing genes from a single administration. As of August 19, 2023, the company has a market cap of $7.16 million and a stock price of $2.84. Despite the company's current PE percentage being 0.00, indicating a loss, the stock is considered fairly valued according to the GF-Score, with a GF Value of 2.87 and a Price to GF Value ratio of 0.99. JANUS HENDERSON GROUP PLC Acquires New Stake in Benitec Biopharma Inc\n\nPerformance of the Traded Stock\n\nSince the transaction, BNTC's stock has seen a decrease of 11.25%. The stock has also experienced a significant drop of 99.95% since its IPO. The year-to-date performance shows a decrease of 4.54%. The stock's GF-Score is 49/100, indicating a poor future performance potential. The stock's Financial Strength is ranked 4/10, while its Profitability Rank and Growth Rank are both at 1/10. The GF Value Rank is 5/10, and the Momentum Rank is 2/10. The stock's Piotroski F-Score is 3, and its Altman Z score is -33.98, indicating financial distress.\n\nStory continues\n\nFinancial Health of the Traded Stock\n\nBenitec Biopharma Inc's cash to debt ratio is 10.52, ranking 723rd in the biotechnology industry. The company's ROE and ROA are -257.84 and -183.95, respectively, with respective ranks of 1304 and 1470. The company has not shown any growth in gross margin or operating margin.\n\nGrowth of the Traded Stock\n\nOver the past three years, Benitec Biopharma Inc has experienced a significant decrease in revenue growth, with a rate of -91.30%. The company's EBITDA and earning growth over the same period are both at 0.00. The company's 3-year revenue growth rank is 761, and its predictability rank is not available.\n\nMomentum of the Traded Stock\n\nThe stock's RSI 5 Day, RSI 9 Day, and RSI 14 Day are 53.91, 47.61, and 45.07, respectively. The Momentum Index 6 - 1 Month is 6.15, while the Momentum Index 12 - 1 Month is -71.58. The stock's RSI 14 Day Rank is 948, and its Momentum Index 6 - 1 Month Rank is 369.\n\nIn conclusion, JANUS HENDERSON GROUP PLC's acquisition of Benitec Biopharma Inc shares represents a strategic move into the biotechnology sector. Despite the stock's current performance and financial health, the firm's investment could yield potential returns in the long run, given the innovative nature of Benitec Biopharma Inc's business.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/janus-henderson-group-plc-acquires-010233214.html", "symbols": ["AAPL.US", "AMZN.US", "BNTC.US", "HDJ.F", "JHG.AU", "JHG.US", "MA.US", "MSFT.US", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.988, "neg": 0.043, "neu": 0.854, "pos": 0.103}}]