[{"date": "2023-06-02T22:54:00+00:00", "title": "The 2 Most Surprising Stock Winners In the Dow Today", "content": "Stocks soared on Friday, with investors breathing a sigh of relief at the apparent end of worries about a government default. All three major market averages were up significantly. Index Daily Percentage Change Daily Point Change Dow +2.", "link": "https://finance.yahoo.com/m/ba3082d1-c313-3bf7-99a8-4d8fd9eec37a/the-2-most-surprising-stock.html", "symbols": ["CAT.MX", "CAT.US", "CAT1.F", "CAT1.XETRA", "CATR.PA", "DJI.INDX", "MMM.F", "MMM.MX", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.103, "neg": 0.07, "neu": 0.825, "pos": 0.105}}, {"date": "2023-06-02T22:38:11+00:00", "title": "Could This Multibillion-Dollar Settlement Be the Spark 3M Stock Needs to Shoot Higher?", "content": "The company is reportedly near a deal to resolve some of its \"forever chemicals\" concerns.", "link": "https://finance.yahoo.com/m/d4994922-a8e7-3871-aa39-c3120eb06cd2/could-this.html", "symbols": ["MMM.F", "MMM.MX", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0, "neu": 0.833, "pos": 0.167}}, {"date": "2023-06-02T21:03:00+00:00", "title": "Here's Why I Bought This Struggling Stock", "content": "I was looking for an industrial stock to replace 3M in my portfolio and decided that Leggett & Platt would fit the bill.", "link": "https://finance.yahoo.com/m/2d50b674-b01d-3b48-a573-47774091a931/here%27s-why-i-bought-this.html", "symbols": ["LEG.US", "LP1.F", "MMM.F", "MMM.MX", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.361, "neg": 0, "neu": 0.889, "pos": 0.111}}, {"date": "2023-06-02T20:21:49+00:00", "title": "Why 3M, Caterpillar, and Deere &amp; Company Rallied Today", "content": "3M may get a better-than-feared settlement on a legal issue, and another blowout jobs report fueled cyclical stocks like these industrial leaders.", "link": "https://finance.yahoo.com/m/896df3d1-e570-3017-92e8-7925fdd70e21/why-3m%2C-caterpillar%2C-and.html", "symbols": ["CAT.MX", "CAT.US", "CAT1.F", "CAT1.XETRA", "CATR.PA", "DCO.F", "DCO.XETRA", "DE.US", "MMM.F", "MMM.MX", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.459, "neg": 0, "neu": 0.818, "pos": 0.182}}, {"date": "2023-06-02T19:32:15+00:00", "title": "Potential 'Forever Chemicals' Settlement Boosts Shares of 3M", "content": "3M shares jumped following a report of a settlement over claims of water pollution from \"forever chemicals.\"", "link": "https://finance.yahoo.com/m/64f99f57-c4b8-33b1-b057-7597b22bf895/potential-%27forever-chemicals%27.html", "symbols": ["2CU.F", "2X0.F", "2X0.STU", "6D81.F", "CC.US", "CTVA.US", "DD.BA", "DD.US", "DDNB34.SA", "MMM.F", "MMM.MX", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.864, "pos": 0.136}}, {"date": "2023-06-02T18:23:00+00:00", "title": "3M, DuPont Stocks Are Soaring on PFAS Settlement. A Big Overhang Is Gone.", "content": "DuPont, Corteva, Chemours, and 3M shares are up after a $1.2 billion legal settlement over PFAS chemicals. Here's how investors can make sense of that.", "link": "https://finance.yahoo.com/m/8bfceb9e-ff8f-36f3-b4de-3a7cb240db61/3m%2C-dupont-stocks-are-soaring.html", "symbols": ["2CU.F", "6D81.F", "CC.US", "DD.BA", "DD.US", "DDNB34.SA", "MMM.F", "MMM.MX", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.402, "neg": 0, "neu": 0.856, "pos": 0.144}}, {"date": "2023-06-02T16:53:00+00:00", "title": "Top Research Reports for Exxon Mobil, AstraZeneca &amp; Netflix", "content": "Friday, June 2, 2023\r\n\r\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including Exxon Mobil Corporation (XOM), AstraZeneca PLC (AZN) and Netflix, Inc. (NFLX). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today’s research reports here >>>\r\n\r\nExxon Mobil shares have outperformed the Zacks Oil and Gas - Integrated - International industry over the past year (+7.9% vs. -0.9%). This company’s bellwether status and an optimal integrated capital structure that has historically produced industry-leading returns make it a relatively lower-risk energy sector play. The firm has made more than 30 discoveries in offshore Guyana since 2015.\r\n\r\nExxonMobil also has a strong presence in the Permian Basin, the most prolific resource in the United States. It recently reported strong first-quarter earnings, thanks to solid contributions from the Energy Products business line. This was offset partially by lower earnings from upstream operations.\r\n\r\nAlso, weak industry margins and lower sales from the Chemical Products business line are hurting the energy major’s operations. Moreover, the integrated firm’s dividend yield is lower than the composite stocks belonging to the industry. As such, the stock warrants a cautious stance.\r\n\r\n(You can read the full research report on Exxon Mobil here >>>)\r\n\r\nShares of AstraZeneca have outperformed the Zacks Large Cap Pharmaceuticals industry over the past year (+13.3% vs. +9.0%). The company’s key drugs, mainly cancer medicines, Lynparza, Tagrisso and Imfinzi, should keep driving revenues. Its pipeline is strong with several phase III data readouts lined up for 2023.\r\n\r\nIt has also been engaged in external acquisitions and strategic collaborations to boost its pipeline while investing in geographic areas of high growth like emerging markets. Cost-cutting efforts should drive earnings. The Alexion buyout strengthened its immunology franchise, adding several rare disease drugs that are boosting its top line.\r\n\r\nHowever, AstraZeneca’s diabetes franchise faces stiff competition while pricing pressure hurts sales in the respiratory unit. Sales are slowing down in its key market, China.\r\n\r\n(You can read the full research report on AstraZeneca here >>>)\r\n\r\nShares of Netflix have outperformed the Zacks Broadcast Radio and Television industry over the year-to-period (+36.7% vs. +16.4%) as the company is widely seen as having come out of ahead of its competitors in the 'streaming war'. The company is expected to continue dominating the, courtesy of its diversified content portfolio, which is attributable to heavy investments in the production and distribution of localized, foreign-language content.\r\n\r\nHowever, Netflix is suffering from stiff competition in the streaming space from the likes of Apple, Amazon Prime Video, HBO Max, Disney+, Peacock, Paramount+ and TikTok. It launched paid sharing in four countries during the first quarter.\r\n\r\nAlthough it witnessed cancellations at the initial stage of the launch, engagement gradually improved. Netflix’s leveraged balance sheet and a higher streaming obligation are concerns. Additionally, unfavorable forex is expected to hurt operating income in the second quarter of 2023.\r\n\r\n(You can read the full research report on Netflix here >>>)\r\n\r\nOther noteworthy reports we are featuring today include American Express Company (AXP), 3M Company (MMM) and NetApp, Inc. (NTAP).\r\n\r\nDirector of Research\r\n\r\nSheraz Mian\r\n\r\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\n\nToday's Must Read\n\nExxonMobil (XOM) Gains From Discoveries at Stabroek Block\n\nCancer Drugs Aid AstraZeneca (AZN) Sales; Pipeline Strong\n\nRobust Content Aids Netflix (NFLX) Amid Stiff Competition\n\nFeatured Reports\n\nRobust Revenues & Cash Flows Aid American Express (AXP)\r\nPer the Zacks analyst, several growth-related initiatives such as product launches coupled with increased consumer spending aid revenue growth. Robust cash flows have enabled business investments.\n\nEnd Market Strength Drives 3M Company (MMM), Amid Forex Woes\r\nPer the Zacks analyst, strength in 3M's end markets, including electrical, automotive aftermarkets and abrasives is likely to drive its revenues. However, forex woes remain a concern.\n\nWeak IT Spending Environment Ails NetApp (NTAP) Performance\r\nPer the Zacks analyst, NetApp's performance was affected by weak IT spending environment. However, the company remains well-poised to gain from data-driven digital and cloud transformations.\n\nQIAGEN (QGEN) Thrives on Verogen Buyout, Forex Woes Ail\r\nThe Zacks analyst is optimistic about acquisition of Verogen, fortifying QIAGEN's position in the fast-growing field of Human ID and forensics. Yet, foreign exchange woes remain a concern.\n\nStrong Bookings Aid Norwegian Cruise (NCLH), High Cost Ail\r\nPer the Zacks analyst, solid booking environment, robust onboard revenue generation and fleet-expansion efforts are aiding Norwegian Cruise. However, high cost and geopolitical tensions hurt.\n\nRates, Loans Aid Hancock Whitney (HWC), Asset Quality a Woe\r\nPer the Zacks analyst, Hancock Whitney benefits from robust loans and deposit balances, business expansion initiatives and higher interest rates. Rising costs and weak asset quality are concerns.\n\nUpbeat Air-Travel Demand Aids SkyWest (SKYW), High Costs Ail\r\nUpbeat air-travel demand is driving SKYW's top line. The Zacks analyst is, however, worried about escalated fuel costs that are limiting bottom-line growth.\n\nNew Upgrades\n\nSolid Top Line, Strong Cash Flows Aid Unum Group (UNM) \r\nPer the Zacks analyst, its strong revenues driven by higher overall persistency, disciplined sales trends have led to significant growth. Moreover, healthy balance sheet should drive long-term growth.\n\nSolid Demand for its Storage Solutions Boost Sunpower (SPWR)\r\nPer the Zacks analyst, with the solar-plus-storage market expanding, SunPower has been increasingly attaching its Helix and Equinox storage systems its solar systems, thereby boosting revenue growth\n\nAMERISAFE (AMSF) Rides on Premium Growth & Policy Retention\r\nPer the Zacks analyst, AMERISAFE's intensified focus on hazardous industries will keep fetching higher premiums. Also, its solid policy retention rates will provide a strong platform for growth.\n\nNew Downgrades\n\nEscalating Costs and Seasonality Trouble H&R Block (HRB)\r\nPer the Zacks analyst, the increasing costs have been acting as a headwind to H&R Block's performance. The seasonality of the business adds to such friction.\n\nLionsgate (LGF.A) Suffers from Lower Spending By Streamers\r\nPer the Zacks analyst, Lionsgate is suffering from lower spending on content by streaming platforms like Disney+ and Netflix amid rising macroeconomic challenges.\n\nVolatile Capital Markets, Costs Hurt LPL Financial (LPLA)\r\nPer the Zacks analyst, rising costs due to an increase in compensation costs will hurt LPL Financial's profits. Ambiguity over the performance of the capital markets might hamper commission revenues.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAstraZeneca PLC (AZN) : Free Stock Analysis Report\n\nExxon Mobil Corporation (XOM) : Free Stock Analysis Report\n\nNetflix, Inc. (NFLX) : Free Stock Analysis Report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nAmerican Express Company (AXP) : Free Stock Analysis Report\n\nNetApp, Inc. (NTAP) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/top-research-reports-exxon-mobil-165300914.html", "symbols": ["AZN.LSE", "AZN.ST", "AZN.US", "AZNCF.US", "AZNN.MX", "EXXO34.SA", "MMM.F", "MMM.MX", "MMM.US", "MMM.XETRA", "MMMC34.SA", "NFC.F", "NFC.XETRA", "NFLX.MX", "NFLX.US", "NFLX34.SA", "XOM.MX", "XOM.US", "XONA.F", "XONA.XETRA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.075, "neu": 0.77, "pos": 0.155}}, {"date": "2023-06-02T16:08:56+00:00", "title": "3M reaches tentative $10 billion pollution settlement with US cities -Bloomberg News", "content": "By Clark Mindock and Brendan Pierson\n\n(Reuters) - 3M Co has struck a tentative settlement of at least $10 billion with a host of U.S. cities and towns to resolve water pollution claims tied to \"forever chemicals,\" Bloomberg News reported on Friday, citing people familiar with the matter.\n\nShares of 3M were up 8.4% at $102.16 on Friday afternoon.\n\nReuters could not immediately confirm the report. A 3M spokesperson said the company \"does not comment on rumors or speculation.\"\n\nHours earlier, chemical companies including Chemours Co, DuPont de Nemours Inc and Corteva Inc reached an agreement in principle for $1.19 billion to settle claims that they contaminated U.S. public water systems with the potentially harmful chemicals.\n\n3M was scheduled to face trial on Monday against the City of Stuart, Florida. It was not immediately clear whether the trial will proceed.\n\nStuart claims that company made or sold firefighting foams containing per- and polyfluoroalkyl substances, or PFAS, despite knowing for decades that the chemicals can cause cancer and other ailments. The city has said it is seeking more than $100 million from 3M to pay for water filtration and soil remediation.\n\n3M has said in court documents that PFAS have not been linked with health problems at the levels being discovered in drinking water.\n\nStuart's lawsuit is one of more than 4,000 filed against 3M and other chemical companies by local municipalities, state governments and individuals from across the U.S. that have been consolidated in federal court in South Carolina. The Stuart case was selected as the first \"bellwether\" or test case in that litigation.\n\n3M in December set a 2025 deadline to stop producing PFAS - used in everything from cell phones to semiconductors - amid increasing legal scrutiny on the substances that are commonly called “forever chemicals” because they do not easily break down in the human body or environment.\n\nLitigation over them threatens companies like 3M, DuPont and others with billions of dollars in liabilities.\n\nStuart, a coastal city of about 20,000 people roughly 40 miles (64 km) north of West Palm Beach, Florida, sued 3M and others in 2018. The city claims firefighting foams containing PFAS were regularly sprayed at a local fire station, leading the chemicals to seep into the groundwater.\n\n(Reporting by Priyamvada C in Bengaluru and Clark Mindock and Brendan Pierson in New York; Editing by Devika Syamnath, Alexia Garamfalvi and Matthew Lewis)", "link": "https://finance.yahoo.com/news/3m-reaches-tentative-10-billion-160856284.html", "symbols": ["MMM.F", "MMM.MX", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": -0.885, "neg": 0.068, "neu": 0.897, "pos": 0.035}}, {"date": "2023-06-02T15:55:53+00:00", "title": "S&amp;P 500 Dividend Aristocrats List: Sorted By Hedge Fund Popularity", "content": "In this article, we will discuss the best dividend aristocrat stocks sorted by hedge fund popularity. You can skip our detailed analysis of dividend aristocrats and their past performance, and go directly to read S&P 500 Dividend Aristocrats List: Top 10 Among Hedge Funds.\n\nDividend aristocrats are companies in the S&P 500 that have a track record of consistently raising their dividends for 25 years or more. Dividend growers become top choices for investors, especially during bearish markets, because of their ability to generate stable cash flows and return profits to shareholders. When the market was down from December 1999 to March 2022, the S&P High Yield Dividend Aristocrats outperformed the S&P Composite 1500 by an average of 140 basis points per month, according to a report by S&P Dow Jones Indices.\n\nDividend growth is one of the most important aspects of dividend investing. It is often associated with high-quality companies that have sustainable business models and solid financial health. In addition to this, companies with proven track records of dividend growth help protect during inflationary periods. For these reasons, investors often gravitate towards some of the best dividend aristocrat stocks such as Walmart Inc. (NYSE:WMT), Johnson & Johnson (NYSE:JNJ), and AbbVie Inc. (NYSE:ABBV). These companies have demonstrated strong profitability through the years, which has contributed to their ability to raise their payouts regularly. In our previous article titled 25 Things Every Dividend Investor Should Know, we cited Washington Crossing Advisors’ data, which showed that dividend growers and initiators delivered an annual average return of 11.6% from 1972 to 2014. In comparison, dividend cutters underperformed and delivered an annual average return of 3.4%.\n\nAlso read: Dividend Aristocrats Ranked: Top 15 According to Analysts\n\nVarious studies have shown the outperformance of reliable dividend stocks relative to other equities. According to a report by T. Rowe Price, dividend growers delivered a 12.07% annual average return from March 1972 to March 2020, compared with an 11.50% annualized return of the S&P 500. During this period, non-dividend payers returned 10.24% on average, underperforming dividend growth stocks. The report further analyzed market conditions from 1985 to 2019 and highlighted that dividend growers showed strong performance than their peers in down markets during this period. S&P 500 Dividend Aristocrats List: Sorted By Hedge Fund Popularity\n\nPhoto by Austin Distel on Unsplash\n\nOur Methodology:\n\nFor this list, we scanned Insider Monkey’s database of 943 hedge funds updated to reflect Q1 portfolios and picked the top 25 dividend aristocrats in terms of hedge fund popularity. The list is ranked in ascending order of the number of hedge funds having stakes in the companies as of the end of the first quarter.\n\n25. Emerson Electric Co. (NYSE:EMR)\n\nNumber of Hedge Fund Holders: 47\n\nEmerson Electric Co. (NYSE:EMR) is a Missouri-based manufacturing company that provides engineering services and products to different markets. On May 3, the company announced a quarterly dividend of $0.52 per share, which was in line with its previous dividend. It is one of the best dividend aristocrat stocks on our list with 66 years of dividend growth. The stock has a dividend yield of 2.62%, as of May 29.\n\nWalmart Inc. (NYSE:WMT), Johnson & Johnson (NYSE:JNJ), and AbbVie Inc. (NYSE:ABBV) are some other best dividend aristocrat stocks according to hedge funds.\n\nThe number of hedge funds tracked by Insider Monkey owning stakes in Emerson Electric Co. (NYSE:EMR) grew to 47 in Q1 2023, from 32 in the previous quarter. The collective value of these stakes is nearly $2 billion. With over 4.2 million shares, Citadel Investment Group was the company's leading stakeholder in Q1.\n\n24. Air Products and Chemicals, Inc. (NYSE:APD)\n\nNumber of Hedge Fund Holders: 48\n\nAir Products and Chemicals, Inc. (NYSE:APD) is an American chemical industry company that sells gases and chemicals for industrial uses. Deutsche Bank maintained a Buy rating on the stock in May with a $325 price target, expressing concerns about higher costs.\n\nAir Products and Chemicals, Inc. (NYSE:APD), one of the best dividend aristocrat stocks, currently pays a quarterly dividend of $1.75 per share. The company's dividend growth streak stands at 41 years. The stock's dividend yield on May 29 came in at 2.56%.\n\nAt the end of Q1 2023, 48 hedge funds in Insider Monkey's database reported having stakes in Air Products and Chemicals, Inc. (NYSE:APD), up from 41 in the previous quarter. These stakes are collectively valued at over $490.2 million.\n\n23. International Business Machines Corporation (NYSE:IBM)\n\nNumber of Hedge Fund Holders: 49\n\nAn American technology company, International Business Machines Corporation (NYSE:IBM) experienced a positive hedge fund sentiment in Q1 2023. As per Insider Monkey's database, 49 elite funds held stakes in the company in Q1, compared with 43 in the preceding quarter. The consolidated value of these stakes is over $1.47 billion.\n\nInternational Business Machines Corporation (NYSE:IBM) is among the best dividend aristocrat stocks on our list with 28 years of consecutive dividend growth. It currently pays a quarterly dividend of $1.66 per share and has a dividend yield of 5.15%, as of May 29.\n\n22. Cardinal Health, Inc. (NYSE:CAH)\n\nNumber of Hedge Fund Holders: 50\n\nCardinal Health, Inc. (NYSE:CAH) is an American multinational healthcare services company, based in Ohio. This year in May, the company raised its dividend for the 37th consecutive year, which makes it one of the best dividend aristocrat stocks. It pays a quarterly dividend of $0.5006 per share for a dividend yield of 2.42%, as of May 29.\n\nIn May, UBS lifted its price target on Cardinal Health, Inc. (NYSE:CAH) to $93 and kept a Buy rating on the shares, following the company's recent quarterly earnings.\n\nAs of the close of Q1 2023, 50 hedge funds tracked by Insider Monkey reported having stakes in Cardinal Health, Inc. (NYSE:CAH), worth collectively over $1.36 billion.\n\nAriel Investments mentioned Cardinal Health, Inc. (NYSE:CAH) in its Q3 2022 investor letter. Here is what the firm has to say:\n\n“Additionally, distributor of pharmaceutical and medical products Cardinal Health, Inc. (NYSE:CAH) advanced in the period as leadership changes were viewed to be a positive for shares. Management provided a new profit outlook for Fiscal 2023 and announced an improvement plan for the medical segment. We are encouraged by these changes and think CAH’s underlying fundamentals and competitive advantages around preventative maintenance screenings and medication management will continue to improve. We believe valuations of health care companies like CAH that focus on cost optimization and promote technological efficiency across the supply chain will be rewarded over the long term.”\n\n21. 3M Company (NYSE:MMM)\n\nNumber of Hedge Fund Holders: 51\n\n3M Company (NYSE:MMM) manufactures a broad range of products belonging to different industries. The company holds one of the longest dividend growth streaks of 65 years. It currently pays a quarterly dividend of $1.50 per share with a dividend yield of 6.19%. MMM is among the best dividend aristocrat stocks on our list.\n\nAt the end of March 2023, 51 hedge funds in Insider Monkey's database reported having stakes in 3M Company (NYSE:MMM), compared with 52 in the previous quarter. The collective worth of these stakes is over $697.3 million. Citadel Investment Group was the company's leading stakeholder in Q1.\n\n20. Medtronic plc (NYSE:MDT)\n\nNumber of Hedge Fund Holders: 52\n\nMedtronic plc (NYSE:MDT) is a Minnesota-based medical device company that also provides other medical-related services and products. In May, Stifel appreciated the company's performance in the most recent quarter and its guidance. In view of this, the firm raised its price target on the stock to $92 with a Buy rating on the shares.\n\nOn May 25, Medtronic plc (NYSE:MDT) announced a quarterly dividend of $0.69 per share, having raised it by 1.5%. This was the company's 46th consecutive year of dividend growth. With a dividend yield of 3.39%, MDT is among the best dividend aristocrat stocks on our list.\n\nAccording to Insider Monkey's Q1 2023 database, 52 hedge funds owned stakes in Medtronic plc (NYSE:MDT), worth over $1.64 billion collectively.\n\n19. Caterpillar Inc. (NYSE:CAT)\n\nNumber of Hedge Fund Holders: 52\n\nCaterpillar Inc. (NYSE:CAT) is an American construction and mining equipment company, headquartered in Texas. At the end of Q1 2023, the company was a part of 52 hedge fund portfolios, up from 50 in the preceding quarter, as per Insider Monkey's data. The stakes owned by these funds have a consolidated value of over $2.88 billion.\n\nEvercore ISI presented a positive outlook on the industrial machinery group in May. Given this, the firm maintained an Outperform rating on Caterpillar Inc. (NYSE:CAT) with a $263 price target. One of the best dividend aristocrat stocks on our list, CAT also attracted a Buy rating from Stifel in May.\n\nCaterpillar Inc. (NYSE:CAT) currently pays a quarterly dividend of $1.20 per share and has a dividend yield of 2.27%, as of May 29. The company maintains a 28-year streak of consistent dividend growth.\n\n18. Ecolab Inc. (NYSE:ECL)\n\nNumber of Hedge Fund Holders: 53\n\nEcolab Inc. (NYSE:ECL) offers services related to the treatment, cleaning, and hygiene of water in a wide range of applications. After the company posted solid quarterly earnings, BMO Capital and Deutsche Bank raised their price targets on the stock to $188 and $182, respectively.\n\nOne of the best dividend aristocrat stocks, Ecolab Inc. (NYSE:ECL) declared a quarterly dividend of $0.53 per share on May 4. In 2022, the company took its dividend growth streak to 31 years. The stock's dividend yield on May 29 came in at 1.27%.\n\nAt the end of Q1 2023, 53 hedge funds in Insider Monkey's database were long Ecolab Inc. (NYSE:ECL), up from 47 in the previous quarter. The stakes held by these funds have a collective value of $2.15 billion. With over 5.2 million shares, Bill & Melinda Gates Foundation Trust was the company's leading stakeholder in Q1.\n\n17. Automatic Data Processing, Inc. (NASDAQ:ADP)\n\nNumber of Hedge Fund Holders: 53\n\nAutomatic Data Processing, Inc. (NASDAQ:ADP) is next on our list of the best dividend aristocrat stocks. The management services company offers a per-share dividend of $1.25 every quarter for a dividend yield of 2.35%, as of May 29. It has been rewarding shareholders with growing dividends for the past 48 years.\n\nAs of the close of Q1 2023, 53 hedge funds reported having stakes in Automatic Data Processing, Inc. (NASDAQ:ADP), compared with 49 in the previous quarter, according to Insider Monkey's database. These stakes are collectively worth over $3.7 billion.\n\nMadison Investments mentioned Automatic Data Processing, Inc. (NASDAQ:ADP) in its Q1 2023 investor letter. Here is what the firm has to say:\n\n“We eliminated Automatic Data Processing, Inc. (NASDAQ:ADP) from the portfolio due to concerns that the economy is close to a peak job market and interest income on the company’s float has also peaked along with interest rates. The company’s valuation does not reflect the potential downside in the job market from a weakening economy.”\n\n16. Colgate-Palmolive Company (NYSE:CL)\n\nNumber of Hedge Fund Holders: 55\n\nColgate-Palmolive Company (NYSE:CL) is a multinational consumer products company that manufactures household, healthcare, and other consumer products. Evercore ISI highlighted the company's volume recovery in the first quarter and raised its price target on the stock to $91. The firm reiterated its Outperform rating on CL, which is among the best dividend aristocrat stocks on our list.\n\nColgate-Palmolive Company (NYSE:CL) pays a quarterly dividend of $0.48 per share, having raised it by 2% in March this year. The company has raised its payouts for 61 years running. The stock's dividend yield on May 29 was 2.52%.\n\nAt the end of March 2023, 55 hedge funds in Insider Monkey's database owned stakes in Colgate-Palmolive Company (NYSE:CL), with a collective value of over $3.2 billion. Jean-Marie Eveillard, Dan Loeb, and Guardian Capital were some of the company's leading stakeholders in Q1.\n\n15. Becton, Dickinson and Company (NYSE:BDX)\n\nNumber of Hedge Fund Holders: 56\n\nBecton, Dickinson and Company (NYSE:BDX) is an American medical technology company that specializes in the production of medical devices. The company also provides other medical-related services to its consumers. It has been raising its dividends consistently for the past 51 years and currently pays a quarterly dividend of $0.91 per share. The stock has a dividend yield of 1.51%, as of May 29.\n\nThe number of hedge funds tracked by Insider Monkey holding stakes in Becton, Dickinson and Company (NYSE:BDX) stood at 56 in Q1 2023, growing from 52 in the previous quarter. These stakes have a consolidated value of roughly $3 billion.\n\n14. NextEra Energy, Inc. (NYSE:NEE)\n\nNumber of Hedge Fund Holders: 59\n\nNextEra Energy, Inc. (NYSE:NEE) is a renewable energy company, based in Florida. In April, BMO Capital kept its Outperform rating on the stock with a $90 price target, presenting a neutral stance on the company's performance in the upcoming quarters.\n\nNextEra Energy, Inc. (NYSE:NEE), one of the best dividend aristocrat stocks, currently offers a quarterly dividend of $0.4675 per share. The company has a 27-year-long dividend growth streak. The stock's dividend yield on May 29 came in at 2.53%.\n\nAs of the close of Q1 2023, 59 hedge funds tracked by Insider Monkey owned investments in NextEra Energy, Inc. (NYSE:NEE), worth over $1.11 billion collectively.\n\n13. The Coca-Cola Company (NYSE:KO)\n\nNumber of Hedge Fund Holders: 61\n\nThe Coca-Cola Company (NYSE:KO) has been raising its dividends for 61 years. The company pays a quarterly dividend of $0.46 per share and has a dividend yield of 3.05%, as of May 29. It is among the best dividend aristocrat stocks on our list.\n\nWarren Buffett's Berkshire Hathaway was the leading stakeholder of The Coca-Cola Company (NYSE:KO) with 400 million shares at the end of Q1 2023. Overall, 61 hedge funds in Insider Monkey's database owned stakes in the company, with a collective value of over $24.8 billion.\n\nHere is what Rown Street had to say about The Coca-Cola Company (NYSE:KO) in its Q4 2022 investor letter.\n\n“Let’s take The Coca-Cola Company (NYSE:KO) for example. Its dividend yield is 2.8%, earnings are estimated to grow at only 3.6% rate per year over next 4 years, and its earnings multiple is currently at 24x (based on next years forecasted earnings). KO has an anemic growth, so we can argue that paying 24x earnings is not very attractive. Let’s assume that the multiple will stay constant over the next 3-5 years, thus our expected annual returns will be 2.8%+3.6% = 6.4% (that is below the current reported inflation rate and only slightly above the risk-free rate of 4%).”\n\n12. McDonald's Corporation (NYSE:MCD)\n\nNumber of Hedge Fund Holders: 64\n\nMcDonald's Corporation (NYSE:MCD) ranks twelfth on our list of the best dividend aristocrat stocks. The multinational fast-food chain declared a $1.52 per share quarterly dividend on May 26. The company maintains a 46-year streak of consistent dividend growth. MCD has a dividend yield of 2.13%, as of May 29.\n\nHighlighting the company's same-store sales growth over the past quarters, Loop Capital maintained its Buy rating on MCD in May with a $346 price target.\n\nAt the end of Q1 2023, 64 hedge funds tracked by Insider Monkey reported having stakes in McDonald’s Corporation (NYSE:MCD), up from 57 in the previous quarter. These stakes have a collective value of over $4 billion.\n\n11. Chevron Corporation (NYSE:CVX)\n\nNumber of Hedge Fund Holders: 64\n\nChevron Corporation (NYSE:CVX) is an American oil and natural gas company, based in California. On May 17, the company declared a quarterly dividend of $1.51 per share, which was in line with its previous dividend. The company's shares boast a dividend yield of 3.92%, as of May 29. It is one of the best dividend aristocrat stocks on our list as it holds a 36-year track record of consistent dividend growth.\n\nIn addition to CVX, analysts and hedge funds are paying attention to Walmart Inc. (NYSE:WMT), Johnson & Johnson (NYSE:JNJ), and AbbVie Inc. (NYSE:ABBV).\n\nInsider Monkey's Q1 2023 database shows that 64 hedge funds owned stakes in Chevron Corporation (NYSE:CVX), up from 54  a quarter earlier. These stakes are worth over $23.6 billion collectively. With over 132.4 million shares, Berkshire Hathaway was the company's leading stakeholder in Q1.\n\nClick to continue reading and see S&P 500 Dividend Aristocrats List: Top 10 Picks by Hedge Funds.\n\nSuggested articles:\n\n12 Undervalued Dividend Aristocrats To Buy Dividend Aristocrats Ranked: Top 15 According to Analysts Top 20 High Dividend Stocks To Buy According To Analysts\n\nDisclosure. None. S&P 500 Dividend Aristocrats List: Top 10 Among Hedge Funds is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/p-500-dividend-aristocrats-list-155553966.html", "symbols": ["2M6.F", "2M6.XETRA", "4AB.F", "4AB.XETRA", "ABBV.MX", "ABBV.US", "ADP.F", "ADP.US", "AP3.F", "APD.US", "BDX.US", "BOX.F", "CAH.US", "CAT.MX", "CAT.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.003, "neu": 0.875, "pos": 0.122}}, {"date": "2023-06-02T11:00:00+00:00", "title": "3M Heads to Trial in ‘Existential’ $143 Billion Forever-Chemicals Litigation", "content": "(Bloomberg) -- 3M Co. faces an existential threat from lawsuits over allegedly cancer-linked “forever chemicals” that have leached into municipal water supplies, with the company’s liability possibly hitting $143 billion for cleanup alone.\n\nMost Read from Bloomberg\n\nChina Is Drilling a 10,000-Meter-Deep Hole Into the Earth Inside the Making of Redfall, Xbox’s Latest Misfire Debt-Limit Deal Clears Congress, Ending Threat of US Default Hedge Funds at War for Top Traders Dangle $120 Million Payouts Rich Latin Americans Transform Laid-Back Madrid Into a New Miami\n\nThe first trial out of some 4,000 lawsuits against 3M, many by state and local governments, over pollution caused by per- and polyfluoroalkyl substances, or PFAS, is set to start June 5 in federal court in Charleston, South Carolina. PFAS have been used for decades in products ranging from nonstick pans to cosmetics, but they don’t break down naturally and can settle in soil, water or human bodies.\n\nStuart, Florida, the plaintiff in the trial, is suing 3M over a PFAS-containing foam used by firefighting crews across the US to suppress fuel fires. The city claims 3M failed to warn of PFAS’s risks and designed defective products. A verdict for Stuart could help determine what 3M must pay to settle other cases.\n\nLawyers for Stuart are seeking $105 million to cover the cost of removing PFAS and as much as $500 million in punitive damages, court filings show.\n\nFinancial research firm CreditSights estimates that 3M could ultimately be on the hook for nationwide PFAS cleanup costs of up to $142.7 billion. That’s almost triple the company’s $53 billion market capitalization, and that’s before any personal injury claims and other lawsuits.\n\nUS District Judge Richard Gergel, who’s overseeing the Stuart case and thousand of others, said at a 2019 hearing that the litigation poses an “existential threat” to 3M and other companies that manufactured PFAS, like DuPont de Nemours Inc., its spinoff Chemours Co., and Chemguard Inc. Gergel severed DuPont from the Stuart case, leaving 3M as the only defendant.\n\n“They may not be able to settle their way out of this,” said Chuck Tatelbaum, a bankruptcy lawyer who has dealt with mass-tort cases. “Bankruptcy may be the only real alternative to deal with this kind of bet-the-company threat.”\n\nDisputed Findings\n\nSt. Paul, Minnesota-based 3M maintains that PFAS are safe and that PFAS contamination poses no significant threat to public health and welfare. The EPA says PFAS are linked to developmental delays in children and increased cancer risks, and some researchers have linked PFAS to specific cancers, but 3M disputes those findings.\n\n3M has said it will stop making the chemicals by 2025 because of “regulatory trends focused on reducing or eliminating the presence of PFAS in the environment.” The company started winding down production of some of the compounds in 2000, court filings show.\n\nIn a statement, a 3M spokesman said the company would contest claims by cities, states and individuals but also held out the possibility of settlement. “We are in active, ongoing and confidential mediation sessions regarding the resolution” of the Stuart case and “multiple other water supplier cases and claims,” he said.\n\nThe company settled another PFAS lawsuit on the eve of trial in 2018, agreeing to pay $850 million to resolve claims by Minnesota’s attorney general that the chemicals damaged drinking water and natural resources. 3M admitted no wrongdoing. Earlier this week, 3M, DuPont and other companies agreed to pay more than $100 million to settle a PFAS suit by the city of Rome, Georgia.\n\nRead More: 3M, DuPont to Pay $100 Million to End Georgia PFAS Suit\n\nGary Douglas and Wes Bowden, two lawyers for Stuart, declined to comment on the possibility of a settlement. “We look forward to presenting our case to the jury and seeking justice for our client,” they said in a statement.\n\nCarl Tobias, a University of Richmond professor who teaches product-liability law, said a settlement would make sense for 3M. “I think any jury that actually gets to hear the case against the makers of PFAS is likely to come back with a huge verdict against them,” he said.\n\nThe firefighting foam at issue in the Stuart case often runs off into water sources during training exercises, according to court filings. According to court filings, tests on some Stuart wells in 2021 found PFAS levels at 1,600 parts per trillion. The US Environmental Protection Agency in March proposed a nationwide cap on two of the most widely used and studied PFAS compounds — PFOA and PFOS — at 4 parts per trillion.\n\n‘Uninvestible’\n\nPotential PFAS liability prompted Kidde-Fenwal Inc. — a distributor of firefighting foam that never made the substance – to file for Chapter 11 bankruptcy protection in May.\n\nIf 3M does file for bankruptcy to manage its legal exposure, it wouldn’t be the first time. A 3M unit is currently in bankruptcy protection while it tries to resolve more than 230,000 lawsuits by soldiers over allegedly faulty ear protection sold to the US military.\n\nThe litigation risks have already taken a toll with investors. Shares have declined by about 60% since their high in January 2018, in part due to liability concerns, erasing about $100 billion in market value.\n\n“I get calls all the time asking ‘what inning are we in with this?’ We’re still in spring training,” RBC Capital Markets analyst Deane Dray said about the litigation. “It renders the stock uninvestible.”\n\nThe case is Aqueous Film-Forming Foams Products Liability Litigation, No. 18-mn-2873, US District Court, District of South Carolina (Charleston).\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/3m-heads-trial-existential-143-110000116.html", "symbols": ["6D81.F", "DD.BA", "DD.US", "DDNB34.SA", "MMM.F", "MMM.MX", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": -0.99, "neg": 0.11, "neu": 0.825, "pos": 0.065}}, {"date": "2023-06-01T21:45:20+00:00", "title": "3M (MMM) Outpaces Stock Market Gains: What You Should Know", "content": "3M (MMM) closed at $94.28 in the latest trading session, marking a +1.04% move from the prior day. This move outpaced the S&P 500's daily gain of 0.99%.\n\nComing into today, shares of the maker of Post-it notes, industrial coatings and ceramics had lost 9.26% in the past month. In that same time, the Conglomerates sector lost 1.44%, while the S&P 500 gained 0.42%.\n\nWall Street will be looking for positivity from 3M as it approaches its next earnings report date. The company is expected to report EPS of $1.74, down 29.84% from the prior-year quarter. Our most recent consensus estimate is calling for quarterly revenue of $7.81 billion, down 10.2% from the year-ago period.\n\nMMM's full-year Zacks Consensus Estimates are calling for earnings of $8.66 per share and revenue of $32.09 billion. These results would represent year-over-year changes of -14.26% and -6.25%, respectively.\n\nIt is also important to note the recent changes to analyst estimates for 3M. Recent revisions tend to reflect the latest near-term business trends. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\n\nResearch indicates that these estimate revisions are directly correlated with near-term share price momentum. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\n\nThe Zacks Rank system, which ranges from #1 (Strong Buy) to #5 (Strong Sell), has an impressive outside-audited track record of outperformance, with #1 stocks generating an average annual return of +25% since 1988. Within the past 30 days, our consensus EPS projection remained stagnant. 3M is currently a Zacks Rank #3 (Hold).\n\nInvestors should also note 3M's current valuation metrics, including its Forward P/E ratio of 10.78. This valuation marks a discount compared to its industry's average Forward P/E of 14.83.\n\nAlso, we should mention that MMM has a PEG ratio of 1.13. This metric is used similarly to the famous P/E ratio, but the PEG ratio also takes into account the stock's expected earnings growth rate. The Diversified Operations industry currently had an average PEG ratio of 1.67 as of yesterday's close.\n\nThe Diversified Operations industry is part of the Conglomerates sector. This group has a Zacks Industry Rank of 178, putting it in the bottom 30% of all 250+ industries.\n\nThe Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nMake sure to utilize Zacks.com to follow all of these stock-moving metrics, and more, in the coming trading sessions.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/3m-mmm-outpaces-stock-market-214520163.html", "symbols": ["GSPC.INDX", "MMM.F", "MMM.MX", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.987, "neg": 0.017, "neu": 0.891, "pos": 0.092}}, {"date": "2023-06-01T18:37:52+00:00", "title": "3M, DuPont to Pay $100 Million to End Georgia Lawsuit Over Polluted Drinking Water", "content": "(Bloomberg) -- 3M Co., DuPont de Nemours Inc. and other makers of per-and polyfluoroalkyl substances, or PFAS, have agreed to pay more than $100 million to resolve a Georgia city’s lawsuit claiming the chemicals polluted its drinking water, according to a person familiar with the matter.\n\nMost Read from Bloomberg\n\nChina Is Drilling a 10,000-Meter-Deep Hole Into the Earth Inside the Making of Redfall, Xbox’s Latest Misfire Wall Street Banks Are Using AI to Rewire the World of Finance Debt-Limit Deal Passes the House, Easing US Default Concerns Billionaire Perot Warns of Real Estate Recession as Loans Dry Up\n\nRome, Georgia settled with 3M, DuPont, DuPont spinoff Chemours Co. and other PFAS makers on May 30. The city sued the companies in Floyd County Superior Court over PFAS were used as stain-proofing agents in carpeting produced in local plants. The settlement comes on the eve of trial in the case, which had been scheduled to begin Monday.\n\nThe city was seeking to recoup nearly $100 million it spent building a reverse-osmosis system to clear the chemicals from the Oostanaula and Etowah Rivers. The city sought more than $300 million in damages over the pollution, according to court filings.\n\nThe Environmental Protection Agency has said PFAS can cause developmental delays in children and increase cancer risks. But the companies dispute those findings and maintain that PFAS are safe.\n\nSean Lynch, a spokesman for St. Paul, Minnesota–based 3M, confirmed the manufacturer had reached a deal in the Rome case. “3M has reached an agreement on the principal terms of a settlement,” Lynch said in an emailed statement. “We will continue to fulfill our PFAS remediation commitments and address litigation by defending ourselves in court or through negotiated resolutions, all as appropriate.”\n\nDan Turner, a DuPont spokesman, also confirmed the manufacturer participated in the confidential settlements, but wouldn’t comment on the amount. Chemours representatives didn’t immediately respond to an email for comment on Thursday.\n\nThe Rome trial would have started the same day as the first federal trial over PFAS, which is set to begin Monday in US District Court in Charleston, South Carolina. That case, by the city of Stuart, Florida, is one of thousands of PFAS suits consolidated in that court.\n\nLegal experts say the outcome in the Stuart case could help determine how much 3M ultimately may have to pay to resolve the PFAS litigation.\n\nResearchers have found PFAS — an industrial product used since the 1950s in products ranging from computer chips and non-stick frying pans to cosmetics – never breaks down naturally and has to be removed from waterways to landfills or destroyed by burning.\n\nThe Georgia accord adds to 3M’s burgeoning PFAS exposure, which some analysts estimate at about $143 billion. The largest maker of PFAS already has paid close to $1 billion over the last four years to resolve state’s and cities’ claims PFAS has fouled groundwaters and waterways.\n\nState and municipal officials argue 3M and other PFAS makers knew for decades that the compounds posed a health risk, but continued to reap billions of dollars in sales without warning the public about the dangers.\n\nThe Georgia case is The City of Rome Georgia v. 3M Company, No. 19CV02405JFL003, Superior Court of Floyd County, Georgia (Rome)\n\n(Updates with company statements, background)\n\nMost Read from Bloomberg Businessweek\n\nHow Summer Camp Became Such a Hot Mess for Parents Harvard MBA Grads Enter a Tepid Job Market Hoping for the Best Goldman CEO Loves Summer Camp So Much He’s Expanded His Portfolio Can Workplace Ketamine Retreats Improve Vibes in the Office? Assault Allegations Plague a $1.4 Billion Home Eldercare Startup\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/3m-dupont-pay-100-million-183752538.html", "symbols": ["2CU.F", "6D81.F", "CC.US", "DD.BA", "DD.US", "MMM.F", "MMM.MX", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.889, "neg": 0.071, "neu": 0.84, "pos": 0.089}}, {"date": "2023-06-01T14:04:00+00:00", "title": "3M (MMM) to Invest $146M in Biotech Manufacturing Capabilities", "content": "3M Company MMM is set to invest $146 million to expand its capabilities in biotech manufacturing. This highlights the company’s commitment to customer-oriented innovation in health care. The investment will cater to facility and equipment improvements and help in the creation of 60 full-time positions in 3M manufacturing facilities in Europe.\r\n\r\nThe investment will facilitate 3M’s development and delivery of vital filtration equipment designed for bioprocessing, biological and small molecule pharmaceutical manufacturing applications. This, in turn, will help biotech customers introduce innovative therapies for the treatment of critical conditions, such as rheumatoid arthritis, multiple sclerosis and certain cancers.\r\n\r\nThe manufacturing process of biopharmaceutical drugs uses a unique filter material that captures impurities and allows the necessary drug substances to pass through.\n\n3M Company Price 3M Company Price\n\n3M Company price | 3M Company Quote\n\nLately, 3M’s Healthcare unit has been grappling with operational weakness due to reduced consumer spending. Weakness in the Health Information Systems business is weighing on the Healthcare segment’s performance. Revenues from the unit declined 5.6% year over year in the first quarter of 2023. Organic sales growth in the medical solutions and oral care business is partly offsetting the adversities in the segment.\n\nZacks Rank & Key Picks\n\n3M presently carries a Zacks Rank #3 (Hold).\r\n\r\nSome better-ranked stocks within the broader Industrial Products sector are as follows:\r\n\r\nIngersoll Rand IR currently sports a Zacks Rank #1 (Strong Buy). The company pulled off a trailing four-quarter earnings surprise of 12.6%, on average. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nIngersoll Rand has an estimated earnings growth rate of 14.8% for the current year. The stock has rallied 16.7% in a year.\r\n\r\nFlowserve FLS currently flaunts a Zacks Rank #1. The company pulled off a trailing four-quarter earnings surprise of 2.5%, on average.\r\n\r\nFlowserve has an estimated earnings growth rate of 64.5% for the current year. The stock has gained 4% in a year.\r\n\r\nGraco Inc. GGG sports a Zacks Rank #1 at present. The company pulled off a trailing four-quarter earnings surprise of 7.9%, on average.\r\n\r\nGraco has an estimated earnings growth rate of 16.3% for the current year. The stock has gained 19.1% in a year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nFlowserve Corporation (FLS) : Free Stock Analysis Report\n\nGraco Inc. (GGG) : Free Stock Analysis Report\n\nIngersoll Rand Inc. (IR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/3m-mmm-invest-146m-biotech-140400946.html", "symbols": ["FLS.US", "FWV.F", "GA8.F", "GGG.US", "MMM.F", "MMM.MX", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.021, "neu": 0.823, "pos": 0.156}}, {"date": "2023-06-01T12:20:00+00:00", "title": "I Lost Money on 3M Stock: Here's What I Learned", "content": "Buying companies facing hard times is part of my investment approach, but 3M taught me that I need to avoid certain types of risk.", "link": "https://finance.yahoo.com/m/ce765801-0ff0-3ab7-9ee8-f66c7d3e1944/i-lost-money-on-3m-stock%3A.html", "symbols": ["MMM.F", "MMM.MX", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": -0.459, "neg": 0.235, "neu": 0.671, "pos": 0.094}}, {"date": "2023-05-31T17:36:00+00:00", "title": "3M Invests $146M To Expand Biopharma Filtration Technology", "content": "3M Co (NYSE: MMM) plans to invest $146 million to expand its capabilities to support biotech manufacturing. The investment will include facility and equipment improvements and the addition of 60 full-time positions in 3M manufacturing facilities in Europe. The new investment is expected to boost 3M's development and delivery of vital filtration equipment designed for bioprocessing, biological and small molecule pharmaceutical manufacturing applications. Also Read: 3M Lets Go Of Executive For Inappropriate Personal Conduct 3M’s Zeta Plus depth filtration technology, in cartridge systems and sheets, play an important role in clarifying cell-derived protein therapeutic products worldwide. \"Our technologies improve the lives of people all over the world, and we are helping biotech customers do more, faster, to advance their specialized medicines,” said Robert Befidi, President, 3M Separation and Purification Sciences Division. Price Action: MMM shares are trading lower by 2.6% at $93.55 on the last check Wednesday.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article 3M Invests $146M To Expand Biopharma Filtration Technology originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/3m-invests-146m-expand-biopharma-173600353.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.987, "neg": 0.01, "neu": 0.804, "pos": 0.187}}, {"date": "2023-05-31T14:05:00+00:00", "title": "3M to invest nearly $150 million to advance capabilities in biopharma filtration technology", "content": "ST. PAUL, Minn., May 31, 2023 /PRNewswire/ -- Applying its leadership in biopharma filtration technology, 3M (NYSE: MMM) today announced it will invest $146 million dollars to expand its capabilities to further support biotech manufacturing, a fast-growing area of health care which is bringing breakthrough therapies to patients. 3M (PRNewsfoto/3M)\n\nThe investment will include facility and equipment improvements and the addition of 60 full-time positions in 3M manufacturing facilities in Europe.\n\nThe new investment will accelerate 3M's development and delivery of vital filtration equipment designed for bioprocessing, biological and small molecule pharmaceutical manufacturing applications, which will enable biotech customers to continue to innovate therapies used for the treatment of conditions such as rheumatoid arthritis, multiple sclerosis, and certain cancers. Filtration and purification is essential in manufacturing biopharmaceutical drugs. The process uses a unique filter material that captures impurities while allowing the necessary drug substances to pass through.\n\n\"Our investment further demonstrates 3M's continued market leadership and ongoing commitment to customer-centric innovation in health care,\" said Robert Befidi, President, 3M Separation and Purification Sciences Division. \"Our technologies improve the lives of people all over the world, and we are helping biotech customers do more, faster, to advance their specialized medicines.\"\n\n3M offers the most comprehensive portfolio of depth filters for cell culture clarification in the biopharmaceutical industry. Zeta Plus™ depth filtration technology, in cartridge systems and sheets, play an important role in the clarification of cell-derived protein therapeutic products around the world.\n\nAbout 3M 3M (NYSE: MMM) believes science helps create a brighter world for everyone. By unlocking the power of people, ideas and science to reimagine what's possible, our global team uniquely addresses the opportunities and challenges of our customers, communities, and planet. Learn how we're working to improve lives and make what's next at 3M.com/news or on Twitter at @3M or @3MNews. Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/3m-to-invest-nearly-150-million-to-advance-capabilities-in-biopharma-filtration-technology-301837484.html\n\nSOURCE 3M", "link": "https://finance.yahoo.com/news/3m-invest-nearly-150-million-140500143.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0, "neu": 0.859, "pos": 0.141}}, {"date": "2023-05-31T13:01:00+00:00", "title": "Coastal Town Brings Mass Litigation—and an ‘Existential Threat’—to Chemical Giants", "content": "Compounds used in firefighting foam seeped into the groundwater in Stuart, Fla. Now it’s at the forefront of thousands of suits against the makers.", "link": "https://finance.yahoo.com/m/2f0f06bc-e3a1-3165-a5e8-d951ad3c2408/coastal-town-brings-mass.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-05-31T13:00:11+00:00", "title": "3M Company (MMM) Is a Trending Stock: Facts to Know Before Betting on It", "content": "3M (MMM) is one of the stocks most watched by Zacks.com visitors lately. So, it might be a good idea to review some of the factors that might affect the near-term performance of the stock.\n\nOver the past month, shares of this maker of Post-it notes, industrial coatings and ceramics have returned -6.7%, compared to the Zacks S&P 500 composite's +1.1% change. During this period, the Zacks Diversified Operations industry, which 3M falls in, has lost 3.9%. The key question now is: What could be the stock's future direction?\n\nAlthough media reports or rumors about a significant change in a company's business prospects usually cause its stock to trend and lead to an immediate price change, there are always certain fundamental factors that ultimately drive the buy-and-hold decision.\n\nRevisions to Earnings Estimates\n\nRather than focusing on anything else, we at Zacks prioritize evaluating the change in a company's earnings projection. This is because we believe the fair value for its stock is determined by the present value of its future stream of earnings.\n\nOur analysis is essentially based on how sell-side analysts covering the stock are revising their earnings estimates to take the latest business trends into account. When earnings estimates for a company go up, the fair value for its stock goes up as well. And when a stock's fair value is higher than its current market price, investors tend to buy the stock, resulting in its price moving upward. Because of this, empirical studies indicate a strong correlation between trends in earnings estimate revisions and short-term stock price movements.\n\nFor the current quarter, 3M is expected to post earnings of $1.74 per share, indicating a change of -29.8% from the year-ago quarter. The Zacks Consensus Estimate remained unchanged over the last 30 days.\n\nFor the current fiscal year, the consensus earnings estimate of $8.66 points to a change of -14.3% from the prior year. Over the last 30 days, this estimate has remained unchanged.\n\nFor the next fiscal year, the consensus earnings estimate of $9.50 indicates a change of +9.7% from what 3M is expected to report a year ago. Over the past month, the estimate has changed +0.7%.\n\nWith an impressive externally audited track record, our proprietary stock rating tool -- the Zacks Rank -- is a more conclusive indicator of a stock's near-term price performance, as it effectively harnesses the power of earnings estimate revisions. The size of the recent change in the consensus estimate, along with three other factors related to earnings estimates, has resulted in a Zacks Rank #3 (Hold) for 3M.\n\nThe chart below shows the evolution of the company's forward 12-month consensus EPS estimate:\n\n12 Month EPS 12-month consensus EPS estimate for MMM _12MonthEPSChartUrl\n\nRevenue Growth Forecast\n\nWhile earnings growth is arguably the most superior indicator of a company's financial health, nothing happens as such if a business isn't able to grow its revenues. After all, it's nearly impossible for a company to increase its earnings for an extended period without increasing its revenues. So, it's important to know a company's potential revenue growth.\n\nFor 3M, the consensus sales estimate for the current quarter of $7.81 billion indicates a year-over-year change of -10.2%. For the current and next fiscal years, $32.09 billion and $33.28 billion estimates indicate -6.3% and +3.7% changes, respectively.\n\nLast Reported Results and Surprise History\n\n3M reported revenues of $8.03 billion in the last reported quarter, representing a year-over-year change of -9%. EPS of $1.97 for the same period compares with $2.65 a year ago.\n\nCompared to the Zacks Consensus Estimate of $7.64 billion, the reported revenues represent a surprise of +5.19%. The EPS surprise was +23.13%.\n\nOver the last four quarters, 3M surpassed consensus EPS estimates three times. The company topped consensus revenue estimates three times over this period.\n\nValuation\n\nWithout considering a stock's valuation, no investment decision can be efficient. In predicting a stock's future price performance, it's crucial to determine whether its current price correctly reflects the intrinsic value of the underlying business and the company's growth prospects.\n\nComparing the current value of a company's valuation multiples, such as its price-to-earnings (P/E), price-to-sales (P/S), and price-to-cash flow (P/CF), to its own historical values helps ascertain whether its stock is fairly valued, overvalued, or undervalued, whereas comparing the company relative to its peers on these parameters gives a good sense of how reasonable its stock price is.\n\nAs part of the Zacks Style Scores system, the Zacks Value Style Score (which evaluates both traditional and unconventional valuation metrics) organizes stocks into five groups ranging from A to F (A is better than B; B is better than C; and so on), making it helpful in identifying whether a stock is overvalued, rightly valued, or temporarily undervalued.\n\n3M is graded B on this front, indicating that it is trading at a discount to its peers. Click here to see the values of some of the valuation metrics that have driven this grade.\n\nConclusion\n\nThe facts discussed here and much other information on Zacks.com might help determine whether or not it's worthwhile paying attention to the market buzz about 3M. However, its Zacks Rank #3 does suggest that it may perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/3m-company-mmm-trending-stock-130011441.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.008, "neu": 0.866, "pos": 0.125}}, {"date": "2023-05-31T10:40:00+00:00", "title": "2 Bargain Dow Jones Stocks to Buy Now", "content": "The Dow Jones Industrial Average (^DJI) may only contain 30 stocks, but it's still one of the most watched U.S. stock indices. The Dow is full of mature, profitable companies, which means it's a nice place to look for good deals when the stock market comes under pressure. Two Dow stocks that look like bargains right now are 3M (NYSE: MMM) and International Business Machines (NYSE: IBM).", "link": "https://finance.yahoo.com/m/8ae39c1b-dbac-30ba-bdd8-ff07a3147515/2-bargain-dow-jones-stocks-to.html", "symbols": ["IBM.F", "IBM.LSE", "IBM.MX", "IBM.US", "IBM.XETRA", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.948, "neg": 0.035, "neu": 0.739, "pos": 0.226}}]