[{"date": "2023-10-24T19:29:03+00:00", "title": "GE, 3M, RTX, Verizon: Earnings Rundown", "content": "General Electric (GE) and 3M (MMM) shares jump after both companies topped their respective earnings expectations and raised guidance. Aerospace developer RTX (RTX) stock moves higher Tuesday afternoon following an earnings beat and announcing a $10 billion share buyback plan. Lastly, Verizon (VZ) stock is on pace for its best-performing day since October 2008 after beating third-quarter earnings estimates.\n\nYahoo Finance Live anchors Josh Lipton and Julie Hyman take a look at several of Tuesday's top trending stocks.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/ge-3m-rtx-verizon-earnings-192903438.html", "symbols": ["5UR.F", "BAC.F", "BAC.XETRA", "GE.MX", "GE.SW", "GE.US", "GEC.LSE", "GEC.XETRA", "GEOO34.SA", "GNE.PA", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "RTX.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.612, "neg": 0.029, "neu": 0.883, "pos": 0.087}}, {"date": "2023-10-24T16:29:00+00:00", "title": "3M (MMM) Beats on Q3 Earnings &amp; Revenues, Revises '23 View", "content": "3M Company’s MMM third-quarter 2023 adjusted earnings (excluding $6.42 from non-recurring items) of $2.68 per share surpassed the Zacks Consensus Estimate of $2.34.\r\n\r\n3M’s net sales of $8,312 million outperformed the Zacks Consensus Estimate of $7,952.7 million. However, the top line declined 3.6% year over year due to a 3.7% decrease in organic sales. Foreign currency translation had a positive impact of 0.6%, while divestitures hurt the top line by 0.5%.\r\n\r\nRegion-wise, sales in the Americas inched up 0.6% year over year, while that in the Asia Pacific declined 15.6%. Sales from business in Europe, the Middle East and Africa climbed 3.9%.\n\n3M Company Price, Consensus and EPS Surprise\n\n3M Company price-consensus-eps-surprise-chart | 3M Company Quote\n\nSegmental Results\n\nThe company reports top-line results under four business segments — Safety & Industrial, Transportation & Electronics, Health Care and Consumer.\r\n\r\nRevenues from Safety and Industrial totaled $2,751 million, decreasing 4.9% year over year. The decline can be attributed to a 5.8% decrease in organic revenues. The Zacks Consensus Estimate for Safety and Industrial segment revenues was pegged at $2,778 million.\r\n\r\nRevenues from Transportation & Electronics totaled $2,171 million, reflecting a year-over-year decrease of 3%. The decline is attributable to a 4.1% decrease in organic sales. Acquisitions boosted segmental revenues by 1.4%, while divestitures had a 0.4% negative impact. The Zacks Consensus Estimate for Transportation & Electronics segment revenues was pegged at $2,043 million.\r\n\r\nRevenues from Health Care were $2,073 million, down 0.2% year over year. The results were hurt by a 3.4% negative impact from divestitures. Organic sales climbed 2.4%. The Zacks Consensus Estimate for Health Care revenues was pegged at $2,035 million.\r\n\r\nRevenues from the Consumer segment fell 6.7% year over year to $1,315 million. Organic sales decreased 5.4%. Movements in foreign currencies had a negative impact of 0.6%. The Zacks Consensus Estimate for Consumer segment revenues was pegged at $1,401 million.\n\nStory continues\n\nMargin Profile\n\nIn the quarter under review, 3M’s cost of sales decreased 3.1% year over year to $4,580 million. Selling, general and administrative expenses jumped more than 100% to $5,992 million. Research, development and related expenses decreased 6.7% year over year to $430 million.\r\n\r\nIn the third quarter, 3M reported an operating loss of $2.65 billion against the operating income of $4.16 billion in the year-ago period. The downside was due to pre-tax charges of $4.2 billion related to its settlement of Combat Arms lawsuits.\r\n\r\nMMM’s adjusted operating income in the quarter ascended 3.8% year over year to $1,859 million. The adjusted operating margin was 23.2% compared with 21.6% in the year-ago quarter. The adjusted tax rate in the quarter was 18.1% compared with 15.9% in the year-ago period.\n\nBalance Sheet and Cash Flow\n\nExiting the third quarter, 3M had cash and cash equivalents of $5,140 million compared with $3,655 million at the end of December 2022. Long-term debt was $12,876 million at the end of the third quarter compared with $14,001 million at the end of December 2022.\r\n\r\nAt the end of the third quarter, 3M generated net cash of $4,694 million from its operating activities, reflecting an increase of 27.9% from the year-ago quarter. Capital used for purchasing property, plant and equipment increased 1.1% to $1.26 billion in the first nine months of 2023.\r\n\r\nAdjusted free cash flow at the end of the third quarter was $4,339 million, up 36.8% year over year. Adjusted free cash flow conversion was 115% at the end of the same period.\r\n\r\nIn the first nine months of 2023, 3M rewarded its shareholders with $2.48 billion in dividend payments. The company did not repurchase shares in the third quarter.\n\n2023 EPS Guidance Raised\n\nFollowing robust year-to-date performance and due to strong operational execution, 3M has raised its adjusted earnings guidance for 2023. The company expects adjusted earnings of $8.95-$9.15 per share for the current year compared with $8.60-$9.10 anticipated earlier. The mid-point of the guided range — $9.05 — lies above the Zacks Consensus Estimate of $8.93.\r\n\r\nAdjusted total sales are expected to decline approximately 5% compared with a decline of 1-5% anticipated earlier. This implies an adjusted organic sales decline of around 3%.\r\n\r\n3M estimates adjusted operating cash flow of $6.5-$6.9 billion compared with $5.9-$6.3 billion anticipated earlier.\n\nZacks Rank & Key Picks\n\n3M currently carries a Zacks Rank #3 (Hold).\r\n\r\nHere are some better-ranked stocks from the Industrial Products sector:\r\n\r\nApplied Industrial Technologies AIT flaunts a Zacks Rank #1 (Strong Buy) at present. The company delivered a trailing four-quarter earnings surprise of 15%, on average. You can see the complete list of today’s Zacks #1 Rank stocks.\r\n\r\nApplied Industrial has an estimated earnings growth rate of 4.3% for the current fiscal year. The stock has gained 33.4% in a year.\r\n\r\nAxon Enterprise AXON carries a Zacks Rank #2 (Buy) at present. The company pulled off a trailing four-quarter earnings surprise of 60.2%, on average.\r\n\r\nAxon has an estimated earnings growth rate of 62.1% for the current year. The stock has surged around 52.4% in a year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nApplied Industrial Technologies, Inc. (AIT) : Free Stock Analysis Report\n\nAxon Enterprise, Inc (AXON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/3m-mmm-beats-q3-earnings-162900957.html", "symbols": ["AIT.US", "AT4.F", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.037, "neu": 0.876, "pos": 0.087}}, {"date": "2023-10-24T16:07:36+00:00", "title": "Stock Market Today: Dow closes higher amid better-than-expected corporate earnings", "content": "Investing.com -- The Dow closed higher Tuesday as a slew of better-than-expected corporate earnings and steady Treasury yields lifted sentiment on the stocks ahead of the big tech earnings.\n\nThe Dow Jones Industrial Average rose 0.6% or 204 points, and the Nasdaq rose 0.9%, and the S&P 500 rose 0.7%.\n\nTech adds to gains as Microsoft and Alphabet set for earnings stage\n\nTechnology stocks added to gains from a day earlier as investors looked ahead to quarterly results from Microsoft and Google (NASDAQ:GOOGL) due after the market closes.\n\nFor Microsoft Corporation (NASDAQ:MSFT), the focus will likely be on the growth of its cloud segment Azure at a time when the proliferation of artificial intelligence is expected to ease the drag from still-modest enterprise spending.\n\n“We expect Microsoft to continue to communicate optimizations are ongoing and new workloads remain modest as IT budgets stay tight, resulting in prudence around core Azure growth for F2Q24,” RBC said in a Tuesday note.\n\nGoogle, meanwhile, is “well positioned” heading into earnings, Wedbush says, supported by ongoing digital advertising growth in 3Q and 4Q.\n\nTreasury yields steady after recent selloff\n\nTreasury yields steadied after a selloff a day earlier, but the move lower doesn’t appear to be a “fundamental shift in investors’ sentiment of policy or the underlying economy, but rather a number of larger players shifting positions,” Stifel said in a note.\n\nTreasury yields sold off sharply on Monday, with the yield on the 10-year Treasury retreating after famed investor Bill Ackman announced that he had closed his bet on lower bond prices, citing “too much risk.”\n\nThe Federal Open Market Committee two- day meeting gets underway on Oct. 31, and is expected to culminate in unchanged decision next month.\n\nBitcoin continues to ride ETF optimism\n\nBitcoin (BitfinexUSD) jumped more than 7% briefly rising above $35,000 for the first since time since 2022 amid ongoing optimism that a spot-bitcoin ETF may soon be approved.\n\nStory continues\n\nThe surge in bitcoin lifted other cryptocurrencies, with Ethereum and Solana sharply higher.\n\nCoca-Cola, GE and 3M lift guidance after delivering quarterly earnings beat\n\nCoca-Cola Co (NYSE:KO) closed nearly 3% higher as the beverage giant upgraded its annual guidance after reporting better-than-expected quarterly results, underpinned by price hikes.\n\nGeneral Electric Company (NYSE:GE) also raised its guidance on full-year performance following earnings and revenue that topped Wall Street estimates. The conglomerate also said it was targeting a planned spinoff of its renewable energy business, GE Vernova, in Q2 next year,\n\n3M Company (NYSE:MMM) sidestepped its recent legal troubles to deliver a Q3 report that topped analyst estimates, sending its share price more than 5% higher.\n\nRelated Articles\n\nStock Market Today: Dow closes higher amid better-than-expected corporate earnings\n\nUniCredit's record profit surges 67.7% YoY in first three quarters of 2023\n\nInsurer Chubb posts quarterly profit beat on higher investment returns", "link": "https://finance.yahoo.com/news/stock-market-today-dow-closes-160736550.html", "symbols": ["CCC3.F", "CCC3.XETRA", "COCA34.SA", "DJI.INDX", "GE.MX", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "GOOGL.US", "KO.MX", "KO.US", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA"], "tags": [], "sentiment": {"polarity": 0.985, "neg": 0.027, "neu": 0.864, "pos": 0.108}}, {"date": "2023-10-24T16:03:41+00:00", "title": "Why 3M Stock Was Climbing Today", "content": "Seasoned investors know that a stock's performance can be driven as much by relative expectations as it is by the company's actual results, and that was clearly the case for 3M (NYSE: MMM) stock Tuesday morning in the wake of the company's third-quarter earnings report. 3M also raised its guidance on the bottom line. 3M is still reeling from a pair of multibillion-dollar lawsuit resolutions earlier this year, but the company's cost-cutting efforts -- among them, multiple rounds of layoffs, cost controls in its factories, and other moves to drive efficiencies -- seem to be paying off.\n\nContinue reading", "link": "https://finance.yahoo.com/m/23d4119e-71fb-3b12-bf58-5b6d047c038d/why-3m-stock-was-climbing.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.586, "neg": 0.014, "neu": 0.933, "pos": 0.052}}, {"date": "2023-10-24T15:42:37+00:00", "title": "3M Beats Estimates and Raises Its Outlook on Higher Prices and Cost-Cutting Measures", "content": "3M (MMM) posted better-than-expected results and boosted its guidance as the diversified manufacturing giant benefited from higher prices and cost savings. 3M reported third quarter fiscal 2023 earnings per share (EPS) of $2.68, with revenue falling 3.6% to $8.02 billion. The company said the results reflected “strong operational execution, restructuring actions, and proactive spending discipline.\"\n\nContinue reading", "link": "https://finance.yahoo.com/m/d0a06752-3364-322e-9ac7-800ef6b834e2/3m-beats-estimates-and-raises.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.71, "neg": 0.026, "neu": 0.853, "pos": 0.121}}, {"date": "2023-10-24T15:06:00+00:00", "title": "S&amp;P 500 rises as investors eye big tech earnings", "content": "Investing.com -- The S&P 500 rose Tuesday as investors digested a wave of quarterly corporate earnings, with Microsoft and Google (NASDAQ:GOOGL) set to kick off earnings for big tech.\n\nThe Nasdaq rose 0.9%, the S&P 500 rose 0.8%, and the Dow Jones Industrial Average rose 0.8% or 252 points.\n\nTech adds to gains as Microsoft and Alphabet set for earnings stage\n\nTechnology stocks added to gains from a day earlier as investors looked ahead to quarterly results from Microsoft and Google due after the market closes.\n\nFor Microsoft Corporation (NASDAQ:MSFT), the focus will likely be on the growth of its cloud segment Azure at a time when the proliferation of artificial intelligence is expected to ease the drag from still-modest enterprise spending.\n\n“We expect Microsoft to continue to communicate optimizations are ongoing and new workloads remain modest as IT budgets stay tight, resulting in prudence around core Azure growth for F2Q24,” RBC said in a Tuesday note.\n\nGoogle, meanwhile, is “well positioned” heading into earnings, Wedbush says, supported by ongoing digital advertising growth in 3Q and 4Q.\n\nTreasury yields steady after recent selloff\n\nTreasury yields steadied after a selloff a day earlier, but the move lower doesn’t appear to be a “fundamental shift in investors’ sentiment of policy or the underlying economy, but rather a number of larger players shifting positions,” Stifel said in a note.\n\nTreasury yields sold off sharply on Monday, with the yield on the 10-year Treasury retreating after famed investor Bill Ackman announced that he had closed his bet on lower bond prices, citing “too much risk.”\n\nThe Federal Open Market Committee two- day meeting gets underway on Oct. 31, and is expected to culminate in unchanged decision next month.\n\nBitcoin continues to ride ETF optimism\n\nBitcoin (BitfinexUSD) jumped more than 7% briefly rising above $35,000 for the first since time since 2022 amid ongoing optimism that a spot-bitcoin ETF may soon be approved.\n\nStory continues\n\nThe surge in bitcoin lifted other cryptocurrencies, with Ethereum and Solana sharply higher.\n\nCoca-Cola, GE and 3M lift guidance after delivering quarterly earnings beat\n\nCoca-Cola Co (NYSE:KO) rose more than 3% as the beverage giant upgraded its annual guidance after reporting better-than-expected quarterly results, underpinned by price hikes.\n\nGeneral Electric Company (NYSE:GE) also raised its guidance on full-year performance following earnings and revenue that topped Wall Street estimates. The conglomerate also said it was targeting a planned spinoff of its renewable energy business, GE Vernova, in Q2 next year,\n\n3M Company (NYSE:MMM) sidestepped its recent legal troubles to deliver a Q3 report that topped analyst estimates, sending its share price more than 5% higher.\n\nRelated Articles\n\nChubb earnings beat by $0.52, revenue topped estimates\n\nUAW strikes GM's Escalade factory, turning up pressure for higher wages", "link": "https://finance.yahoo.com/news/p-500-rises-investors-eye-150600717.html", "symbols": ["CCC3.F", "CCC3.XETRA", "COCA34.SA", "GE.MX", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "GOOGL.US", "KO.MX", "KO.US", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.952, "neg": 0.041, "neu": 0.866, "pos": 0.093}}, {"date": "2023-10-24T13:50:40+00:00", "title": "Dow Jones Giants 3M And Coca-Cola Poised To Rebound On Earnings Surprises", "content": "3M and Coca-Cola both reported better-than-expected Q3 earnings and raised their full-year outlooks Tuesday.\n\nContinue reading", "link": "https://finance.yahoo.com/m/5fd31910-bf1e-3123-893b-994e299b39a3/dow-jones-giants-3m-and.html", "symbols": ["CCC3.F", "CCC3.XETRA", "COCA34.SA", "DJI.INDX", "KO.MX", "KO.US", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-24T13:45:18+00:00", "title": "3M Stock Jumps After Company Boosts Earnings Forecast", "content": "The conglomerate behind Post-it Notes and Scotch tape boosted its earnings forecast after a stronger-than-expected quarter, saying efforts to improve performance and control costs were bearing fruit.\n\nContinue reading", "link": "https://finance.yahoo.com/m/3b74d12d-5dc8-3e37-95d3-5c4241ac1a2d/3m-stock-jumps-after-company.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.66, "neg": 0, "neu": 0.828, "pos": 0.172}}, {"date": "2023-10-24T13:41:09+00:00", "title": "3M Co (MMM) Q3 2023 Earnings: Strong Operational Execution Despite Challenges", "content": "3M Co (NYSE:MMM) reports Q3 2023 results, showing strong operational execution and proactive spending discipline. The company raises its full-year 2023 adjusted earnings and cash flow expectations. Despite a GAAP loss per share of $3.74, adjusted earnings per share (EPS) rose 3 percent year-on-year to $2.68. 3M returned $828 million to shareholders via dividends.\n\nWarning! GuruFocus has detected 5 Warning Signs with MMM.\n\nOn October 24, 2023, 3M Co (NYSE:MMM) released its third-quarter earnings report for 2023. Despite facing challenges, the company demonstrated strong operational execution, restructuring actions, and proactive spending discipline. The company's results reflect its continued execution of its priorities, including driving operational performance, spinning off Health Care, and reducing risk and uncertainty.\n\nFinancial Highlights\n\nThe company reported a GAAP loss per share of $3.74 and an operating margin of minus 31.9%, largely due to the previously announced settlement for Combat Arms, resulting in a pre-tax charge of $4.2 billion. However, the adjusted EPS of $2.68, which includes pre-tax restructuring-related charges of $68 million, was up 3 percent year-on-year. The adjusted operating income margin of 23.2% includes a 0.8 percentage point headwind from pre-tax restructuring-related charges.\n\n3M's net sales for the quarter were $8.3 billion, down 3.6 percent year-on-year, with an organic sales decline of 3.7 percent year-on-year. Adjusted sales were $8.0 billion, down 3.0 percent year-on-year with an adjusted organic sales decline of 3.1 percent year-on-year. Despite these declines, the company's operating cash flow was up 25 percent year-on-year to $1.9 billion, and adjusted free cash flow was up 39 percent year-on-year to $1.9 billion.\n\nShareholder Returns and Outlook\n\nDuring the quarter, 3M returned $828 million to shareholders via dividends. Based on the company's year-to-date performance and continued strong operational execution, 3M is raising its full-year 2023 adjusted EPS and adjusted free cash flow conversion expectations. The company anticipates adjusted EPS to be in the range of $8.95 to $9.15, up from the previous range of $8.60 to $9.10. Adjusted operating cash flow is estimated in the range of $6.5 to $6.9 billion, contributing to 100 to 110 percent adjusted free cash flow conversion.\n\nStory continues\n\nLegal Matters and Restructuring\n\n3M also addressed legal matters with the announced Combat Arms settlement and received preliminary court approval for the PFAS Public Water Systems agreement. The company is progressing with its Health Care spin-off, with leadership appointments already in place and an expected completion during the first half of 2024.\n\nDespite the challenges faced in Q3 2023, 3M's strong operational execution and proactive spending discipline have positioned the company for a solid close to 2023. The company's strengths in material science innovation align with global trends in high-growth markets and sustainability, enabling it to develop indispensable products in attractive areas such as automotive electrification, climate technology, and industrial automation.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/3m-co-mmm-q3-2023-134109003.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.045, "neu": 0.823, "pos": 0.132}}, {"date": "2023-10-24T13:08:36+00:00", "title": "3 Dow Jones Stocks Are Celebrating Tuesday Morning", "content": "For many investors, the 30 stocks in the Dow Jones Industrial Average (DJINDICES: ^DJI) are the focal point of their investing process. With earnings season in full bloom, several Dow Jones stocks reported their latest financial results. Verizon Communications (NYSE: VZ), 3M (NYSE: MMM), and Coca-Cola (NYSE: KO) all performed well enough to give their shareholders a nice boost on Tuesday morning.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e84331d9-ddd4-3725-9ffd-71defcd5e95d/3-dow-jones-stocks-are.html", "symbols": ["BAC.F", "BAC.XETRA", "CCC3.F", "CCC3.XETRA", "COCA34.SA", "DJI.INDX", "KO.MX", "KO.US", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.765, "neg": 0, "neu": 0.888, "pos": 0.112}}, {"date": "2023-10-24T12:38:00+00:00", "title": "3M leaps on Q3 earnings beat, profit forecast boost powered by cost cuts", "content": "Industrial group 3M lifted its full year profit forecast as a cost-cutting drive to offset slumping sales, as well as billions in legal liabilities, looks to have supported third quarter earnings.\n\nContinue reading", "link": "https://finance.yahoo.com/m/abd3c8fe-c683-3571-bcbf-16eda7520b08/3m-leaps-on-q3-earnings-beat%2C.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.718, "neg": 0.048, "neu": 0.718, "pos": 0.234}}, {"date": "2023-10-24T12:35:40+00:00", "title": "Two Dow Jones Giants Poised To Rebound On Earnings Surprises", "content": "3M and Coca-Cola both reported better-than-expected Q3 earnings and raised their full-year outlooks Tuesday.\n\nContinue reading", "link": "https://finance.yahoo.com/m/5fd31910-bf1e-3123-893b-994e299b39a3/two-dow-jones-giants-poised.html", "symbols": ["DJI.INDX", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-24T11:50:06+00:00", "title": "3M (MMM) Tops Q3 Earnings and Revenue Estimates", "content": "3M (MMM) came out with quarterly earnings of $2.68 per share, beating the Zacks Consensus Estimate of $2.34 per share. This compares to earnings of $2.69 per share a year ago. These figures are adjusted for non-recurring items.\n\nThis quarterly report represents an earnings surprise of 14.53%. A quarter ago, it was expected that this maker of Post-it notes, industrial coatings and ceramics would post earnings of $1.65 per share when it actually produced earnings of $2.17, delivering a surprise of 31.52%.\n\nOver the last four quarters, the company has surpassed consensus EPS estimates three times.\n\n3M , which belongs to the Zacks Diversified Operations industry, posted revenues of $8.31 billion for the quarter ended September 2023, surpassing the Zacks Consensus Estimate by 4.52%. This compares to year-ago revenues of $8.62 billion. The company has topped consensus revenue estimates four times over the last four quarters.\n\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\n\n3M shares have lost about 28.6% since the beginning of the year versus the S&P 500's gain of 9.8%.\n\nWhat's Next for 3M?\n\nWhile 3M has underperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\n\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\n\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\n\nStory continues\n\nAhead of this earnings release, the estimate revisions trend for 3M: mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $2.42 on $7.84 billion in revenues for the coming quarter and $8.93 on $31.61 billion in revenues for the current fiscal year.\n\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Diversified Operations is currently in the top 27% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nAnother stock from the same industry, Honeywell International Inc. (HON), has yet to report results for the quarter ended September 2023. The results are expected to be released on October 26.\n\nThis company is expected to post quarterly earnings of $2.22 per share in its upcoming report, which represents a year-over-year change of -1.3%. The consensus EPS estimate for the quarter has been revised 1.1% lower over the last 30 days to the current level.\n\nHoneywell International Inc.'s revenues are expected to be $9.21 billion, up 2.9% from the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/3m-mmm-tops-q3-earnings-115006530.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.012, "neu": 0.894, "pos": 0.094}}, {"date": "2023-10-24T11:25:00+00:00", "title": "3M Says Business Is Improving, Boosts Earnings Guidance", "content": "3M boosted its earnings forecast after a stronger-than-expected quarter, saying efforts to improve performance and control costs are bearing fruit. The Minnesota-based company reported adjusted earnings per share of $2.68 for the third quarter, higher than its guidance and predictions by analysts surveyed by FactSet. 3M said it now expects its year-end earnings per share to be between $8.95 and $9.15, better than its previous guidance of $8.60 to $9.10.\n\nContinue reading", "link": "https://finance.yahoo.com/m/ae87b5e7-dedd-3dfc-9b6e-4e1b5e26d43f/3m-says-business-is.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.893, "neg": 0, "neu": 0.839, "pos": 0.161}}, {"date": "2023-10-24T10:42:35+00:00", "title": "3M Raises Its Full-Year Profit Target After Deep Spending Cuts", "content": "(Bloomberg) -- 3M Co. boosted its full-year adjusted profit and cash flow targets as it reported third-quarter results that easily topped Wall Street estimates, lifted by sweeping cost cuts and efforts to combat an ongoing sales slump.\n\nMost Read from Bloomberg\n\nAn Oil Giant Quietly Ditched the World’s Biggest Carbon Capture Plant China Repeats Its View That Israel Must Protect Civilians Nobody Wants Mutual Funds Now Xi Makes Unprecedented Central Bank Visit in Sign of Focus on Economy Disney Said to Near Multibillion-Dollar Deal With Reliance\n\nAdjusted earnings in 2023 will be $8.95 to $9.15 per share, 3M said in a statement Tuesday. That compares with its earlier forecast of $8.60 to $9.10, and an average of $8.88 based on analyst estimates compiled by Bloomberg.\n\nThe company also expects its adjusted operating cash flow will be from $6.5 billion to $6.9 billion, up from a range of $5.9 billion to $6.3 billion.\n\n“We are building momentum through strong operational execution,” 3M Chief Executive Officer Mike Roman said in a statement. The results “position us for a solid close to 2023.”\n\n3M shares rose 3.9% as of 6:35 a.m. in New York time before the start of normal trading.\n\nThe higher targets reflect deep cost cuts, thousands of layoffs and other actions taken by Roman to streamline the complex company amid a lengthy sales slump.\n\nRead More: 3M to Cut 6,000 Jobs in CEO’s Latest Restructuring Push\n\n3M reported a third-quarter adjusted profit of $2.68 per share, blowing past the $2.34 estimated by Wall Street. The company attributed its improved bottom line to operational improvements at its factories, restructuring actions gaining traction and spending controls.\n\nSales of $8.02 billion were at the high end of 3M’s third-quarter forecast and slightly above the average analysts estimate. Full-year sales will be down about 3% on an organic basis, a change from 3M’s previous forecast of a 3% decline to no better than flat, the company said.\n\nShares of the St. Paul, Minnesota-based manufacturing giant had declined 29% this year through Monday’s close on meager sales growth, uneven earnings and billions of dollars in legal settlements to resolve environmental and product liability claims.\n\nStory continues\n\nThe company took a major step toward resolving its legal entanglements in August when it by agreed to pay $6 billion to resolve hundreds of thousands of lawsuits alleging it supplied defective earplugs to US combat troops.\n\nThe company took a $4.2 billion pretax charge in the third quarter because of the agreement, which was adjusted out of its reported results.\n\nMost Read from Bloomberg Businessweek\n\nLululemon’s Founder Is Racing to Cure the Rare Disease Destroying His Muscles Inflation Raging at 130% Is Pushing Argentina Down a Radical Path The Price of Money Is Going Up, and It’s Not Because of the Fed The Ozempic Effect Is Coming for Everything From Kidney to Heart Disease Treatments UBS Looks Beyond Credit Suisse to Bank Even More Billionaires\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/3m-raises-full-profit-target-104235493.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.985, "neg": 0.053, "neu": 0.828, "pos": 0.119}}, {"date": "2023-10-24T10:35:57+00:00", "title": "3M raises full-year profit forecast, beats quarterly estimates", "content": "(Reuters) -3M Co on Tuesday raised its full-year adjusted profit forecast and reported better-than-expected quarterly earnings, as the diversified manufacturer was able to offset slow demand with price hikes and cost-cut measures, sending its shares up 4%.\n\n3M hiked prices to offset high raw material and labor costs, and undertook a workforce reduction amid waning demand for consumer electronics.\n\nHowever, more price hikes would be difficult for the company as U.S. households are delaying big-ticket purchases and cutting back on discretionary spending amid recessionary fears.\n\n3M, which makes electronic displays for smartphones and tablets, last month flagged weakness in its electronics and consumer segments for the fourth quarter.\n\nAdditionally, the company is facing thousands of lawsuits related to defective earplugs that caused hearing loss for U.S. military members and its use of \"forever chemicals\", which are linked to cancer, hormonal dysfunction and environmental damage.\n\n3M reported a third-quarter loss of $3.74, compared to a year-ago profit of $6.77, as it took a pretax charge of $4.2 billion related to its Combat Arms earplugs settlement.\n\nThe St. Paul, Minnesota-based company now expects full-year adjusted earnings per share to be in the range of $8.95 to $9.15 per share, versus prior forecast of $8.60 to $9.10 per share.\n\nAdjusted profit for the third quarter came in at $2.68 per share, above analysts' estimates of $2.34. Adjusted revenue of $8.02 billion also beat Street estimates of $7.98 billion.\n\n(Reporting by Kannaki Deka in Bengaluru; Editing by Maju Samuel)", "link": "https://finance.yahoo.com/news/3m-reports-quarterly-loss-hit-103557754.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": -0.915, "neg": 0.126, "neu": 0.802, "pos": 0.072}}, {"date": "2023-10-24T10:29:00+00:00", "title": "3M Reports Third Quarter 2023 Results; Company Increases Full Year Adjusted Earnings and Cash Flow Expectations", "content": "Q3 results reflect strong operational execution, restructuring actions, and proactive spending discipline Progressing Health Care spin with leadership appointments; expect to complete spin during first half of 2024 Addressing legal matters with announced Combat Arms settlement; received preliminary court approval for PFAS Public Water Systems agreement\n\nST. PAUL, Minn., Oct. 24, 2023 /PRNewswire/ -- 3M (NYSE: MMM) today reported third quarter 2023 results.\n\n\"We are building momentum through strong operational execution. In the third quarter 3M again delivered for our customers in an uncertain environment, positioning us for a solid close to 2023. Our actions led to underlying earnings ahead of our expectations, as well as better than expected margins and cash flow,\" said 3M chairman and CEO Mike Roman. \"Our results reflect continued execution of our priorities -- driving operational performance, spinning off Health Care, and reducing risk and uncertainty. Our strengths in material science innovation align with global trends in high-growth markets and sustainability, enabling us to develop indispensable products in attractive areas such as automotive electrification, climate technology, and industrial automation.\"\n\nThird Quarter Highlights:\n\nQ3 2023 Q3 2022 GAAP earnings (loss) per share $        (3.74) $          6.77 Special items: Impact of Combat Arms Earplug settlement 5.80 — Other net costs for significant litigation  0.33 0.37 Other special items, net 0.29 (4.54) Adjusted earnings per share (EPS) $          2.68 $          2.60 Memo: GAAP operating income (loss) margin (31.9) % 48.2 % Adjusted operating income margin 23.2 % 21.6 %\n\nGAAP loss per share of $3.74 and operating margin of minus 31.9% include the previously announced settlement for Combat Arms, resulting in a pre-tax charge of $4.2 billion, negatively impacting EPS by $5.80. Adjusted EPS of $2.68 includes pre-tax restructuring related charges of $68 million, or negative $0.10 per share; restructuring program on track including forecasted full-year 2023 pre-tax restructuring charges and associated benefits.\n\nAdjusted EPS up 3 percent year-on-year. Adjusted operating income margin of 23.2% includes a 0.8 percentage point headwind from pre-tax restructuring related charges.\n\nAdjusted operating income margin expanded 1.6 percentage points year-on-year.\n\nStory continues\n\nGAAP Adjusted (Non-GAAP) Net sales (Millions) $8,312 $8,020 Sales change Total sales  (3.6) % (3.0) % Components of sales change: Organic sales1 (3.7) % (3.1) % Acquisitions/divestitures (0.5) % (0.5) % Translation 0.6 % 0.6 % Adjusted sales excludes manufactured PFAS products. 1Above adjusted organic sales decline includes a 1.7 percentage point headwind from the decline in \r\ndisposable respirator demand, along with the 2022 exit of Russia.\n\nSales of $8.3 billion, down 3.6 percent year-on-year, with organic sales decline of 3.7 percent year-on-year. Adjusted sales of $8.0 billion, down 3.0 percent year-on-year with adjusted organic sales decline of 3.1 percent year-on-year. Operating cash flow of $1.9 billion, up 25 percent year-on-year; adjusted free cash flow of $1.9 billion, up 39 percent year-on-year. 3M returned $828 million to shareholders via dividends.\n\nThe above includes reference to certain non-GAAP measures. See the \"Supplemental Financial Information Non-GAAP Measures\" section for applicable information.\n\nFull-Year 2023 Outlook\n\nAs a result of 3M's year-to-date performance and the continued strong operational execution, the company is raising its full-year 2023 adjusted EPS2 and adjusted free cash flow conversion2 expectations.\n\n3M anticipates adjusted EPS2 to be in the range of $8.95 to $9.15 versus $8.60 to $9.10 prior.\n\nAdjusted operating cash flow2 is estimated in the range of $6.5 to $6.9 billion, contributing to 100 to 110 percent adjusted free cash flow conversion2. This compares to a prior expected range for adjusted operating cash flow2 of $5.9 to $6.3 billion, contributing to an adjusted free cash flow conversion2 range of 90 to 100 percent.\n\nAdjusted full-year total sales growth2 is forecasted to decline by approximately -5 percent versus a decline of -5 to -1 percent prior, reflecting a decline in adjusted organic sales2 of approximately -3 percent versus the lower end of -3 percent to flat prior.\n\n2As further discussed at 6 within the \"Supplemental Financial Information Non-GAAP Measures\" section, 3M cannot, without unreasonable effort, forecast certain items required to develop meaningful comparable GAAP financial measures and, therefore, does not provide them on a forward-looking basis reflecting these items.\n\nNotification and Registration Process Progressing On the Combat Arms Earplug Agreement\n\nOn August 29, 2023, 3M issued a press release announcing that it reached an agreement with the court-appointed negotiating plaintiffs' counsel to resolve the Combat Arms Earplug litigation against Aearo Technologies (Aearo) and 3M. Under the agreement, 3M will contribute consideration totaling $6.0 billion between 2023 and 2029. As a result of the agreement, the company recorded a pre-tax charge of $4.2 billion in the third quarter of 2023. The charge reflected the $5.3 billion pre-tax present value of contributions under the agreement net of 3M's then-existing accrual of $1.1 billion related to this matter.\n\nConference Call\n\n3M will conduct an investor teleconference at 9 a.m. EDT (8 a.m. CDT) today. Investors can access this conference via the following:\n\nLive webcast at https://investors.3M.com Live telephone:\r\nCall 800-762-2596 within the U.S. or +1 212-231-2916 outside the U.S. Please join the call at least 10 minutes before the start time. Webcast replay at https://investors.3m.com/financials/quarterly-earnings Telephone replay:\r\nCall 800-633-8284 within the U.S. or +1 402-977-9140 outside the U.S. (for both U.S. and outside the U.S., the access code is 22024176). The telephone replay will be available until 11:30 a.m. EDT (10:30 a.m. CDT) on October 31, 2023.\n\nConsolidated Financial Statements and Supplemental Financial Information Non-GAAP Measures\n\nView the Financial Statement Information on 3M's website: https://investors.3m.com/financials/quarterly-earnings\n\nForward-Looking Statements\n\nThis news release contains forward-looking information about 3M's financial results and estimates and business prospects that involve substantial risks and uncertainties. You can identify these statements by the use of words such as \"plan,\" \"expect,\" \"aim,\" \"believe,\" \"project,\" \"target,\" \"anticipate,\" \"intend,\" \"estimate,\" \"will,\" \"should,\" \"could,\" \"would,\" \"forecast\" and other words and terms of similar meaning in connection with any discussion of future operating or financial performance or business plans or prospects. Among the factors that could cause actual results to differ materially are the following: (1) worldwide economic, political, regulatory, international trade, geopolitical, capital markets and other external conditions and other factors beyond the Company's control, including inflation, recession, military conflicts, natural and other disasters or climate change affecting the operations of the Company or its customers and suppliers; (2) risks related to unexpected events such as the public health crises associated with the coronavirus (COVID-19) global pandemic; (3) foreign currency exchange rates and fluctuations in those rates; (4) risks related to certain fluorochemicals, including liabilities related to claims, lawsuits, and government regulatory proceedings concerning various PFAS-related products and chemistries, as well as risks related to the Company's plans to exit PFAS manufacturing and discontinue use of PFAS across its product portfolio; (5) risks related to the proposed class-action settlement (\"PWS Settlement\") to resolve claims by public water systems in the United States regarding PFAS, including whether court approval of the PWS Settlement will be obtained, whether the number of plaintiffs that opt out of the PWS Settlement will exceed current expectations or will exceed the level that would permit 3M to terminate the PWS Settlement (and whether 3M will elect to terminate the PWS Settlement if this occurs), whether the PWS Settlement is appealed, the timing and amount of payments made under the PWS Settlement, and the impact of the PWS Settlement on other PFAS-related matters; (6) legal proceedings, including significant developments that could occur in the legal and regulatory proceedings described in the Company's Annual Report on Form 10-K for the year ended Dec. 31, 2022 and any subsequent quarterly reports on Form 10-Q (the \"Reports\"); (7) competitive conditions and customer preferences; (8) the timing and market acceptance of new product and service offerings; (9) the availability and cost of purchased components, compounds, raw materials and energy due to shortages, increased demand and wages, supply chain interruptions, or natural or other disasters; (10) unanticipated problems or delays with the phased implementation of a global enterprise resource planning (ERP) system, or security breaches and other disruptions to the Company's information technology infrastructure; (11) the impact of acquisitions, strategic alliances, divestitures, and other strategic events resulting from portfolio management actions and other evolving business strategies; (12) operational execution, including the extent to which the Company can realize the benefits of planned productivity improvements, as well as the impact of organizational restructuring activities; (13) financial market risks that may affect the Company's funding obligations under defined benefit pension and postretirement plans; (14) the Company's credit ratings and its cost of capital; (15) tax-related external conditions, including changes in tax rates, laws or regulations; (16) matters relating to the proposed spin-off of the Company's Health Care business; and (17) matters relating to Combat Arms Earplugs (\"CAE\"), including those relating to the voluntary chapter 11 proceedings of the Company's subsidiary Aearo Technologies and certain of its affiliates (\"Aearo Entities\"), as well as those related to the August 2023 settlement that is intended to resolve, to the fullest extent possible, all litigation and alleged claims involving the CAE sold or manufactured by the Aearo Entities and/or 3M (\"CAE Settlement\"), including, but not limited to, whether the anticipated participation by plaintiffs in the CAE Settlement will be achieved, whether the number of plaintiffs that participate in the CAE Settlement will meet current expectations or will fall below the level that would permit 3M to terminate the CAE Settlement (and whether 3M will elect to terminate the CAE Settlement if this occurs), whether there will be a significant number of future claims by plaintiffs that decline to participate in the CAE Settlement, whether the CAE Settlement is appealed or challenged, whether the requirements applicable to the issuance of the equity securities that are contemplated to be part of the CAE Settlement will be met, the filing of additional, or the outcome of any other pending or future, litigation relating to the products that are the subject of the CAE Settlement, or changes in related laws or regulations. Changes in such assumptions or factors could produce significantly different results. A further description of these factors is located in the Reports under \"Cautionary Note Concerning Factors That May Affect Future Results\" and \"Risk Factors\" in Part I, Items 1 and 1A (Annual Report) and in Part I, Item 2 and Part II, Item 1A (Quarterly Reports). The Company assumes no obligation to update any forward-looking statements discussed herein as a result of new information or future events or developments.\n\nAbout 3M\n\n3M (NYSE: MMM) believes science helps create a brighter world for everyone. By unlocking the power of people, ideas and science to reimagine what's possible, our global team uniquely addresses the opportunities and challenges of our customers, communities, and planet. Learn how we're working to improve lives and make what's next at 3M.com/news or at @3M or @3MNews.\n\nPlease note that the company announces material financial, business and operational information using the 3M investor relations website, SEC filings, press releases, public conference calls and webcasts. The company also uses the 3M News Center and social media to communicate with our customers and the public about the company, products and services and other matters. It is possible that the information 3M posts on the News Center and social media could be deemed to be material information. Therefore, the company encourages investors, the media and others interested in 3M to review the information posted on 3M's news center and the social media channels such as @3M or @3MNews.\n\nContacts 3M Investor Contacts: Bruce Jermeland, 651-733-1807\r\nor\r\nDiane Farrow, 612-202-2449\r\nor\r\nEric Herron, 651-233-0043\r\nMedia Contact: Sean Lynch, slynch2@mmm.com\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/3m-reports-third-quarter-2023-results-company-increases-full-year-adjusted-earnings-and-cash-flow-expectations-301965141.html\n\nSOURCE 3M Company", "link": "https://finance.yahoo.com/news/3m-reports-third-quarter-2023-102900855.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.035, "neu": 0.881, "pos": 0.084}}, {"date": "2023-10-24T08:29:48+00:00", "title": "Stocks to Watch Tuesday: Alphabet, Microsoft, Coca-Cola, Coinbase", "content": "🔎 [**Alphabet (GOOG)**](https://www.wsj.com/market-data/quotes/GOOG), [**(GOOGL)**](https://www.wsj.com/market-data/quotes/GOOGL), [**Microsoft (MSFT)**](https://www.wsj.com/market-data/quotes/MSFT), [**General Electric (GE)**](https://www.\n\nContinue reading", "link": "https://finance.yahoo.com/m/56ad1fe9-b979-3b3c-a4eb-9dc25d6f2d7a/stocks-to-watch-tuesday%3A.html", "symbols": ["5UR.F", "BAC.F", "BAC.XETRA", "BARC.LSE", "BCLYF.US", "BCS.US", "BCSN.MX", "BCY.F", "BCY.STU", "BCY.XETRA", "BCY2.F", "CCC3.F", "CCC3.XETRA", "COCA34.SA", "GE.MX", "GE.SW", "GE.US", "GEC.LSE", "GEC.XETRA", "GEOO34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-24T07:30:10+00:00", "title": "Verizon, 3M, General Electric, Coca-Cola rise premarket; Spotify, Barclays fall", "content": "Investing.com -- U.S. futures rose Tuesday, helped by falling bond yields ahead of quarterly earnings from some tech giants later in the session.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nGeneral Electric (NYSE:GE)  (GE) stock rose 5.1% after the conglomerate raised its full-year profit forecast on robust demand for jet engine spare parts and services and improved performance in its renewable business.\n\n3M Company (NYSE:MMM) stock rose 4% after the conglomerate raised its full-year adjusted profit forecast as it looks to benefit from cost-cutting measures and price hikes.\n\nVerizon (NYSE:VZ) stock rose 3.7% after the telecoms giant raised its annual free cash flow forecast as promotions and its high-speed 5G network helped it attract more subscribers than expected in the third quarter.\n\nSpotify (NYSE:SPOT) stock fell 2.6% even after the streaming giant reported quarterly monthly active users and subscribers ahead of expectations as it grew in all regions, as well as a quarterly profit. The stock is up over 95% year-to-date.\n\nGeneral Motors (NYSE:GM) stock rose 1.6% after the auto giant reported a rise in third-quarter revenues of 5.4% to $44.1 billion. However, it withdrew its previous guidance for 2023 profits and near-term electric vehicle production as costs related to the United Auto Workers strikes jumped to $200 million a week during October.\n\nCoca-Cola (NYSE:KO) stock rose 2.3% after the soft drinks giant raised its annual sales and profit forecasts, benefiting from consumers snapping up its products at higher prices.\n\nCoinbase (NASDAQ:COIN) stock rose 8.2%, with the cryptocurrency exchange benefiting from the speculation that a Bitcoin ETF is shortly to be authorized by the U.S. SEC.\n\nDow (DOW) stock rose 2.5% after the chemicals company beat expectations for third-quarter profit, benefiting from higher prices for its products used in making goods ranging from plastics and paints to building materials.\n\nNvidia (NASDAQ:NVDA) stock rose 1.8% after Reuters reported that the chipmaker has begun designing central processing units that would run Microsoft (NASDAQ:MSFT)'s Windows operating system, using technology from  Arm Holdings (NASDAQ:ARM), up 2.4%.\n\nStory continues\n\nRTX stock rose 8.1% after the aerospace supplier approved a $10 billion share repurchase program, even as it reported a near billion dollar quarterly loss due to a major quality crisis at its subsidiary Pratt and Whitney.\n\nBarclays (BCS) ADRs fell 5.6% after the U.K.-based bank signaled another restructuring round in the coming months to mitigate the effects of margin pressure from competition in the savings market and another lackluster performance from its investment bank.\n\nRelated Articles\n\nVerizon, 3M, General Electric, Coca-Cola rise premarket; Spotify, Barclays fall\n\nNvidia says U.S. speeded up new export curbs on AI chips\n\nSpotify Shares Dip Despite Robust Q3 Results and Promising Q4 Outlook", "link": "https://finance.yahoo.com/news/verizon-3m-general-electric-coca-073010214.html", "symbols": ["639.F", "639.XETRA", "8GM.F", "ARM.US", "BAC.F", "BAC.XETRA", "BARC.LSE", "BCLYF.US", "BCS.US", "BCY.F", "BCY.XETRA", "BCY2.F", "CCC3.F", "CCC3.XETRA", "COCA34.SA", "COIN.US", "GE.MX", "GE.US", "GEC.LSE"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.033, "neu": 0.865, "pos": 0.103}}, {"date": "2023-10-23T16:10:10+00:00", "title": "Why 3M (MMM) Could Beat Earnings Estimates Again", "content": "Looking for a stock that has been consistently beating earnings estimates and might be well positioned to keep the streak alive in its next quarterly report? 3M (MMM), which belongs to the Zacks Diversified Operations industry, could be a great candidate to consider.\n\nThis maker of Post-it notes, industrial coatings and ceramics has seen a nice streak of beating earnings estimates, especially when looking at the previous two reports. The average surprise for the last two quarters was 27.32%.\n\nFor the most recent quarter, 3M was expected to post earnings of $1.65 per share, but it reported $2.17 per share instead, representing a surprise of 31.52%. For the previous quarter, the consensus estimate was $1.60 per share, while it actually produced $1.97 per share, a surprise of 23.13%.\n\nThanks in part to this history, there has been a favorable change in earnings estimates for 3M lately. In fact, the Zacks Earnings ESP (Expected Surprise Prediction) for the stock is positive, which is a great indicator of an earnings beat, particularly when combined with its solid Zacks Rank.\n\nOur research shows that stocks with the combination of a positive Earnings ESP and a Zacks Rank #3 (Hold) or better produce a positive surprise nearly 70% of the time. In other words, if you have 10 stocks with this combination, the number of stocks that beat the consensus estimate could be as high as seven.\n\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a version of the Zacks Consensus whose definition is related to change. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\n\n3M currently has an Earnings ESP of +1.29%, which suggests that analysts have recently become bullish on the company's earnings prospects. This positive Earnings ESP when combined with the stock's Zacks Rank #3 (Hold) indicates that another beat is possibly around the corner. We expect the company's next earnings report to be released on October 24, 2023.\n\nStory continues\n\nWith the Earnings ESP metric, it's important to note that a negative value reduces its predictive power; however, a negative Earnings ESP does not indicate an earnings miss.\n\nMany companies end up beating the consensus EPS estimate, but that may not be the sole basis for their stocks moving higher. On the other hand, some stocks may hold their ground even if they end up missing the consensus estimate.\n\nBecause of this, it's really important to check a company's Earnings ESP ahead of its quarterly release to increase the odds of success. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/why-3m-mmm-could-beat-161010870.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.038, "neu": 0.771, "pos": 0.191}}, {"date": "2023-10-22T13:33:45+00:00", "title": "12 Best Dividend Aristocrats with Over 3% Yield", "content": "In this article, we discuss 12 best dividend aristocrats with over 3% yield. You can skip our detailed analysis of dividend stocks and their strong performance over the years, and go directly to read 5 Best Dividend Aristocrats with Over 3% Yield.\n\nAmid rising recession risks and sticky inflation, dividend stocks are becoming relevant again. According to a report by S&P Dow Jones Indices, dividends have made up about 32% of the overall returns of the S&P 500 since 1926, with the remaining 68% coming from capital appreciation. The S&P 500 Dividend Aristocrat Index, which tracks the performance of companies that have raised their payouts for 25 consecutive years or more, offers a combination of growing capital and regular dividend payments. This is different from other strategies that might focus solely on getting a high yield or only on capital growth. In the long run, the S&P 500 Dividend Aristocrats have shown better returns with lower volatility compared to the broader market, which means they offer a better balance between risk and reward. The S&P report highlighted that the S&P 500 Dividend Aristocrats have performed better than the S&P 500 69.34% of the time when the market was down and 43.61% of the time when the market was up. Additionally, they experienced smaller declines in value compared to the benchmark index.\n\nInvestors generally avoid stocks that have a history of reducing or cutting their dividends over time. A dividend cut is often seen as a red flag, signaling financial difficulties or challenges within the company. It may indicate that the company is struggling to generate enough profits to sustain its dividend payments. According to Fidelity research, stocks that reduce or completely stop paying dividends have typically performed 20% to 25% worse than the market in the year before making that decision. The report also highlighted the importance of payout ratios, which refers to the proportion of a company's net income or free cash flow that it distributes as dividends to shareholders. A low payout ratio is generally considered favorable because it indicates that the company has the potential to maintain its dividend payments and even increase them in the future.\n\nStory continues\n\nAlso read: Best Dividend Aristocrats According to Analysts\n\nWhen investing in dividend stocks, investors consider dividend yields, which measure how much income the stock can generate. It is calculated by expressing the annual dividend as a percentage of the stock's price. According to analysts, yields between 3% and 6% are healthy. Having an excessively high yield is generally a warning sign and not a good choice for investors. If a stock has a high yield, it could be because the company's financial troubles are pushing down its stock price. When this happens, the company might have to reduce or stop paying dividends due to its difficulties.\n\nSome of the best dividend aristocrat stocks with strong balance sheets and consistent cash flows include The Procter & Gamble Company (NYSE:PG), Colgate-Palmolive Company (NYSE:CL), and PepsiCo, Inc. (NASDAQ:PEP). These companies have rewarded shareholders with growing dividends for decades, becoming top choices for them. In this article, we will discuss dividend aristocrat stocks with over 3% yield.\n\nPhoto by Dan Dennis on Unsplash\n\nOur Methodology:\n\nFor this list, we looked at a group of 68 dividend aristocrat companies, which are known for raising dividends for 25 years or more. From this list, we chose companies with dividend yields above 3%, as of October 21, and arranged them in ascending order of the number of hedge fund investors having stakes in them, according to Insider Monkey's database of Q2 2023.\n\n12. Amcor plc (NYSE:AMCR)\n\nNumber of Hedge Fund Holders: 24\n\nDividend Yield as of October 21: 5.76%\n\nAmcor plc (NYSE:AMCR) is a global packaging company that specializes in developing and producing a wide range of packaging solutions for various industries. On August 16, the company declared a quarterly dividend of $0.1225 per share, which was consistent with its previous dividend. The company has been raising its dividends consistently for the past 39 years. As of October 21, the stock has a dividend yield of 5.76%.\n\nAt the end of Q2 2023, 24 hedge funds tracked by Insider Monkey reported having stakes in Amcor plc (NYSE:AMCR), up from 22 in the previous quarter. These stakes have a collective value of over $237 million. With over 14.6 million shares, Polaris Capital Management was the company's leading stakeholder in Q2.\n\n11. T. Rowe Price Group, Inc. (NASDAQ:TROW)\n\nNumber of Hedge Fund Holders: 24\n\nDividend Yield as of October 21: 5.07%\n\nT. Rowe Price Group, Inc. (NASDAQ:TROW) is a Maryland-based investment management firm that provides a wide range of financial services and products. The company's dividend growth streak currently stands at 37 years and it pays a quarterly dividend of $1.22 per share. With a dividend yield of 5.07% as of October 21, TROW is one of the best dividend aristocrat stocks on our list.\n\nT. Rowe Price Group, Inc. (NASDAQ:TROW) was a part of 24 hedge fund portfolios at the end of Q2 2023, up from 21 in the previous quarter, as per Insider Monkey's database. The stakes owned by these hedge funds have a total value of over $309 million.\n\n10. Kimberly-Clark Corporation (NYSE:KMB)\n\nNumber of Hedge Fund Holders: 38\n\nDividend Yield as of October 21: 3.83%\n\nKimberly-Clark Corporation (NYSE:KMB) is a multinational consumer goods company that specializes in the production of a wide range of products related to personal care, hygiene, and well-being. In the first six months of 2023, the company generated $1.4 billion in operating cash flow, compared with $944 million from the same period last year. It ended the quarter with over $580 million available in cash and cash equivalents.\n\nKimberly-Clark Corporation (NYSE:KMB), one of the best dividend aristocrat stocks, has been raising its dividends consistently for the past 51 years. It currently pays a quarterly dividend of $1.18 per share and has a dividend yield of 3.83%, as of October 21.\n\nAs of the close of Q2 2023, 38 hedge funds owned stakes in Kimberly-Clark Corporation (NYSE:KMB), compared with 40 in the previous quarter, according to Insider Monkey's database. The consolidated value of these stakes is over $817.5 million. Among these hedge funds, Two Sigma Advisors was the company's leading stakeholder in Q2.\n\n9. Altria Group, Inc. (NYSE:MO)\n\nNumber of Hedge Fund Holders: 43\n\nDividend Yield as of October 21: 9.18%\n\nAltria Group, Inc. (NYSE:MO) is a large American corporation primarily known for its involvement in the tobacco and related industries. The company currently pays a quarterly dividend of $0.98 per share, having raised it by 4.3% in August this year. This marked the company's 54th consecutive year of dividend growth, which makes MO one of the best dividend aristocrat stocks on our list. The stock has a dividend yield of 9.18%, as of October 21.\n\nAt the end of June 2023, 43 hedge funds in Insider Monkey's database owned investments in Altria Group, Inc. (NYSE:MO), down from 49 in the previous quarter. The overall value of these stakes is over $446.2 million.\n\n8. Target Corporation (NYSE:TGT)\n\nNumber of Hedge Fund Holders: 45\n\nDividend Yield as of October 21: 4.04%\n\nTarget Corporation (NYSE:TGT) is a Minnesota-based retail company with a diverse range of offerings. The company declared a quarterly dividend of $1.10 per share on September 20, which was in line with its previous dividend. Overall, it has been raising its payouts for 52 years running. The stock's dividend yield on October 21 came in at 4.04%.\n\nAccording to Insider Monkey's database of Q2 2023, 45 hedge funds owned stakes in Target Corporation (NYSE:TGT), compared with 46 in the previous quarter. The consolidated value of these stakes is over $882.8 million.\n\n7. 3M Company (NYSE:MMM)\n\nNumber of Hedge Fund Holders: 49\n\nDividend Yield as of October 21: 6.93%\n\n3M Company (NYSE:MMM) is an American multinational conglomerate that operates in various industries. The company pays a quarterly dividend of $1.50 per share and has a dividend yield of 6.93%, as of October 21. It has raised its dividends for 65 years straight, which makes MMM one of the best dividend aristocrat stocks on our list. In fiscal Q1 2023, the company returned $856 million to shareholders through dividends and share repurchases.\n\nAt the end of Q2 2023, 49 hedge funds tracked by Insider Monkey owned stakes in 3M Company (NYSE:MMM), down from 51 in the previous quarter. The consolidated value of these stakes is over $726.7 million.\n\n6. International Business Machines Corporation (NYSE:IBM)\n\nNumber of Hedge Fund Holders: 51\n\nDividend Yield as of October 21: 4.84%\n\nAn American multinational tech company, International Business Machines Corporation (NYSE:IBM) is next on our list of the best dividend aristocrat stocks. The company offers a quarterly dividend of $1.66 per share and has a dividend yield of 4.84%, as of October 21. Its dividend growth streak currently stands at 28 years.\n\nOf the 910 hedge funds in Insider Monkey's database at the end of Q2 2023, 51 hedge funds owned stakes in International Business Machines Corporation (NYSE:IBM), up from 49 a quarter earlier. These stakes have a collective value of roughly $814 million.\n\nClick to continue reading and see 5 Best Dividend Aristocrats with Over 3% Yield.\n\nSuggested articles:\n\n12 Best Performing Biotech Stocks in 2023 14 Best Consumer Staples Stocks To Buy Now 12 Cheap Biotech Stocks Smart Investors Are Piling Into\n\nDisclosure. None. 12 Best Dividend Aristocrats with Over 3% Yield is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/12-best-dividend-aristocrats-over-133345876.html", "symbols": ["485.F", "485B.F", "4FX.F", "AMC.AU", "AMCR.US", "CL.US", "DYH.F", "GSPC.INDX", "IBM.F", "IBM.LSE", "IBM.MX", "IBM.US", "IBM.XETRA", "KCDMF.US", "KCDMY.US", "KMB.US", "KMY.F"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.025, "neu": 0.875, "pos": 0.1}}]