[{"date": "2023-09-13T21:21:57+00:00", "title": "Airlines slash outlooks, Las Vegas outage, 3M: Top Stories", "content": "Spirit Airlines (SAVE) and American Airlines (AAL) slash their third-quarter outlooks over rising jet fuel prices. Cyberattacks have left Las Vegas casinos and hotels like MGM Grand (MGM) limiting their daily operations 3M (MMM) shares slide after lowering sales guidance on China's slower-than-expected economic recovery.\n\nYahoo Finance Live anchor Seana Smith breaks down several of the day's biggest stories.", "link": "https://finance.yahoo.com/video/airlines-slash-outlooks-las-vegas-212157053.html", "symbols": ["A1G.F", "AAL.US", "MGG.F", "MGM.MX", "MGM.US", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.649, "neg": 0.062, "neu": 0.797, "pos": 0.141}}, {"date": "2023-09-13T20:14:00+00:00", "title": "Why 3M Stock Was Sliding Today", "content": "Shares of 3M (NYSE: MMM) were heading lower today after the company warned of \"a slow growth environment\" in 2024 and weakness in its consumer and electronics segments through the rest of 2023. Management made the comments at Morgan Stanley's11th Annual Laguna Conference this morning. The comments from CFO Monish Patolawala seemed to rekindle fears that the core 3M business is still struggling even as the company reported good news on a number of fronts recently.\n\nContinue reading", "link": "https://finance.yahoo.com/m/70f349f8-5e61-329b-9d48-20bff974a8e8/why-3m-stock-was-sliding-today.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": -0.572, "neg": 0.142, "neu": 0.758, "pos": 0.1}}, {"date": "2023-09-13T15:58:12+00:00", "title": "3M warns of 'slow growth environment' in 2024, shares drop", "content": "(Reuters) -U.S. industrial conglomerate 3M Co on Wednesday warned of \"a slow growth environment\" in 2024 and forecast weakness in its electronics and consumer segments for the current and following quarter.\n\nShares of the diversified manufacturer fell 5.7% in afternoon trade after the company also said current-quarter sales are expected to come in between $7 billion and $8 billion, compared with its previous guidance of $8 billion, due to a slow recovery in China.\n\n\"The consumer has shifted spending from discretionary to staples and other experimental activities,\" 3M CFO Monish Patolawala said. \"Based on China and FX, we are a little down from where we said.\"\n\n3M raised its full-year profit forecast in July and exceeded second-quarter earnings estimates by offsetting high raw material and labor costs by hiking prices.\n\nThe company has also said it is seeing a significant drop in U.S. retailer inventories as spending on consumer electronics has dropped off due to inflation and higher borrowing rates.\n\nThe dour outlook comes as the company grapples with the fallout from lawsuits related to its Combat Arms earplugs and water pollution claims tied to \"forever chemicals\".\n\nThe St. Paul, Minnesota-based company in June reached a $10.3 billion settlement related to the water pollution claims.\n\n3M last month also agreed to pay $6 billion to settle lawsuits by U.S. military veterans and service members who said they suffered hearing loss from using the company's earplugs. The firm was expected to take a charge of $4.2 billion in the current quarter related to the settlement.\n\n(Reporting by Kannaki Deka in Bengaluru; Editing by Shinjini Ganguli and Devika Syamnath)", "link": "https://finance.yahoo.com/news/3m-warns-slow-growth-environment-155812611.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": -0.671, "neg": 0.07, "neu": 0.884, "pos": 0.047}}, {"date": "2023-09-13T00:03:47+00:00", "title": "7 Dividend Aristocrats Sporting the Highest Yields", "content": "History proves there is no better way to create generational wealth than buying dividend stocks — especially the Dividend Aristocrats. There has not been a single decade over the last 93 years where dividend-paying stocks on the S&P 500 did not outperform non-dividend stocks.\n\nMore recently, JPMorgan Chase found stocks that initiated and then raised their payouts over the 40-year period between 1972 and 2012 returned an average of 9.5% annually, versus just 1.6% non-dividend-paying stocks.\n\nThat’s why you should buy Dividend Aristocrats. These are stocks that are part of the S&P 500 that have raised their dividends every single year for at least 25 years. It’s a surprisingly select group of companies. Only 67 stocks make the cut. Simply chasing yield is a dangerous pursuit since a higher yield often entails higher risk. So, ideally, you want to balance the yield with risk. Fortunately, Dividend Aristocrats tend to do that, even if it’s not a foolproof strategy.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nFor example, AT&T was booted from the list last year after cutting its payout in half following the spinoff of its Warner Media business. The deal, though, actually strengthened the telecom’s remaining dividend payment and may give AT&T a chance to grow again.\n\nSo let’s look at each of these high-yielding Dividend Aristocrats.\n\nDividend Aristocrats: International Business Machines (IBM) Photo of IBM (IBM) building as seen through the canopy of a tree. IBM logo is in large letters on side of building.\n\nSource: shutterstock.com/LCV\n\nIBM (NYSE:IBM) is a highly profitable business that essentially created the information technology industry. Yet it has been too late to recognize today’s leading tech trends. For example, it missed the transition to cloud computing and scrambled to become a hybrid cloud company offering both physical and cloud-based solutions. There’s potential in the field, but IBM is not the leader.\n\nIn fact, a lot of IBM’s offerings reek of a “me too” strategy. It gloms onto whatever is popular at the moment without putting any distinctive IBM imprimatur on it. But its operations do throw off a lot of cash. Trailing 12-month free cash flow stands at $10.3 billion. While that’s less than a few years ago, it’s more than in 2022, and it handily supports its dividend that yields 4.5% annually. IBM has increased its dividend for 30 straight years.\n\nStory continues\n\nFranklin Resources (BEN) A photo of a young boy wearing sunglasses, jeans, a blazer, a white shirt and suspenders holding money in various denominations in one hand and sitting in a plush chair.\n\nSource: Dmitry Lobanov/Shutterstock.com\n\nBest known as the owner of  Franklin Templeton, one of the world’s largest investment managers with $1.4 trillion in assets under management (AUM), Franklin Resources (NYSE:BEN) is benefiting from an improving market. AUM increased in the latest period while outflows stabilized and remained flat.\n\nThe asset manager suffered from strong long-term net outflows earlier this year as consumer confidence in the economy wavered. Since much of Franklin’s revenue is dependent upon investment management fees, market volatility can work for the company as well as against it. A heady feeling amongst investors gets them to put money into the market, boosting AUM. Angst over the economy’s direction has them pulling money out. But bull markets always follow bears, and the long-term directory for this premiere asset manager is up.\n\nFranklin Resources is seeking new lines of business to diversify. It recently acquired a retirement asset business; a credit and private debt manager; and additional real estate, private credit, and hedge fund lines. The firm has raised its dividend for 41 years and counting. The payout yields 4.6% annually.\n\nAmcor (AMCR) sheet of paper marked \"dividends\" with a $20 bill on top of it to represent dividend stocks\n\nSource: Shutterstock\n\nThere’s a good chance you’ve never heard of Amcor (NYSE:AMCR). Involved in the packaging industry for food, beverages, pharmaceuticals, and personal care products, its business is suffering as a result of persistent high inflation and continued rising food costs. Consumers are not buying the same kinds of foods they were previously. Or, they’re cutting back, as pocketbooks are hit hard.\n\nAmcor is being hit with high raw material costs as well. That led the packaging expert to raise prices where it could to offset the impact. It resulted in growing adjusted operating earnings for the year. The company has been through these business cycles before and weathered them just fine. Its dividend is stellar too. Amcor has raised its dividend for 40 consecutive years and yields 5.4%. Over the past three years, the payout has risen at an average rate of 27% annually.\n\nRealty Income (O) realty income logo highlighted by a magnifying glass on a web browser\n\nSource: Shutterstock\n\nReal estate investment trust Realty Income (NYSE:O) is a unique Dividend Aristocrat in that it makes its payout monthly. In fact, it dubbed itself “The Monthly Dividend Company.” It’s not the only REIT to pay dividends every 30 days, but it’s done it the longest. Better, the REIT has now declared 638 consecutive monthly dividends and increased the payout 121 times. The dividend yields 5.6%.\n\nIt owns more than 13,100 real estate properties. The commercial tenants occupying its space do so under long-term net lease agreements. It also just agreed to buy Blackstone‘s 22% stake in the Bellagio casino in Las Vegas for $300 million. Realty Income will also contribute $650 million in preferred equity into the venture with Blackstone. Las Vegas is making a strong comeback and Realty Income’s investment should help it benefit from the new relationship.\n\n3M (MMM) 3M logo on top of a corporate building. MMM stock\n\nSource: JPstock / Shutterstock.com\n\nAlthough 3M (NYSE:MMM) was well-known previously for products like Post-It Notes and Scotch brand tape, the industrial conglomerate really gained consumer mindshare during the pandemic. Everyone wanted one of its N95 masks for protection and they were in short supply.\n\nWith the situation normalized once more, 3M’s stock is now under pressure from potential legal liabilities related to contaminated drinking water and faulty earplugs for the military that were manufactured by a company it acquired. It agreed to pay out $10.3 billion for the so-called “forever chemicals” found in the water, and it has set aside up to $1 billion for claims on the earplugs. Some analysts, though, think that might not be nearly enough.\n\nDespite the headwinds, 3M remains exceedingly profitable. Earnings in the second quarter took a hit because of the one-time charges related to the settlement, but it was still able to report adjusted profits of $2.17 per share. While that was down 12% year over year, it includes pre-tax restructuring charges of $0.31 per share.\n\n3M also returned $828 million to shareholders through dividends. The conglomerate has raised its dividend for 66 years running. It yields 5.6% annually.\n\nLeggett & Platt (LEG) dividend stocks\n\nSource: Shutterstock\n\nLike Amcor, many investors may not be familiar with Leggett & Platt (NYSE:LEG) even though they may use its products every day. It’s one of the leading manufacturers of innerspring coils for mattresses and sofas. Leggett & Platt also makes ​​mechanical and lumbar support for car seats, steel mechanisms and motion hardware for chairs, and synthetic fabrics for ground stabilization, drainage protection, erosion, and weed control.\n\nWith the housing and auto industries in a weakened state, the diversified manufacturer took a hit to sales. Consumer demand for mattresses, furniture, and flooring were all much less than anticipated in the second quarter resulting in sales falling 8% from last year. It should be noted that last year’s earnings saw sales hit a record $1.33 billion for the period.\n\nLeggett & Platt lowered full-year guidance because of volatility in the marketplace. It also said it did not have much visibility into how long these conditions will last. Housing doesn’t look like it will turn around anytime soon, but the auto industry is seeing some improvement. New car sales surged 15% higher in August compared to last year. Aerospace and hydraulic cylinder segments are also enjoying growth, but they comprise the two smallest businesses Leggett & Pratt operates.\n\nHowever, investors are sustained by its dividend, which currently yields 6.9%. It’s paid a dividend every year since 1939 and raised it for 52 years straight (also making it a Dividend King).\n\nWalgreens Boots Alliance (WBA) Walgreens (WBA) store exterior and sign in Pompano Beach, Florida\n\nSource: saaton / Shutterstock.com\n\nThe Dividend Aristocrat with the highest dividend yield is Walgreens Boots Alliance (NASDAQ:WBA) at 8.7% as compared to the S&P 500’s 1.5% yield. But Walgreens did something notable this past July that it hasn’t done in the past 47 years: it didn’t raise the payout.\n\nThe company’s stated policy is “to increase its dividend each year.” It even points out it has made a payment every quarter since 1933. The inaction indicates the pharmacy chain is hurting. In fact, the CEO quit to kick off September.\n\nTechnically, Walgreens just needs to pay out more dividends per share from one year to the next to continue qualifying as a Dividend Aristocrat. That means there is still time to raise it. That it didn’t do so when it normally does is telling. As I said before, Dividend Aristocrats tend to keep raising their payouts, but not always.\n\nSales were up 9% in the fiscal third quarter and adjusted profits rose 3%. However, declining demand for Covid vaccines caused a 20% headwind. President Biden is requesting funding for a new and improved vaccine, but the public may not line up to take yet another booster shot. Officials, though, want people taking one at least every year.\n\nTo contain costs now, Walgreens is targeting $4.1 billion in annual cost savings by the end of fiscal 2024. It is also expanding its focus beyond its pharmacies, moving into primary, specialty, and urgent care. A bet now on Walgreens Boots Alliance is one that sees the pharmacy chain turning it around.\n\nOn the date of publication, Rich Duprey held a LONG position in T, BEN, AMCR, O, MMM, LEG, and WBA stock. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.comPublishing Guidelines.\n\nRich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 7 Dividend Aristocrats Sporting the Highest Yields appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-dividend-aristocrats-sporting-highest-000347762.html", "symbols": ["485.F", "485B.F", "AMC.AU", "AMCR.US", "BEN.US", "FRK.F", "IBM.F", "IBM.LSE", "IBM.MX", "IBM.US", "IBM.XETRA", "LEG.US", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.038, "neu": 0.851, "pos": 0.111}}, {"date": "2023-09-12T00:00:00+00:00", "title": "7 Dividend Aristocrats Sporting the Highest Yields", "content": "History proves there is no better way to create generational wealth than buying dividend stocks &#8212; especially the Dividend Aristocrats. There has not been a single decade over the last 93 years where dividend-paying stocks on the S&amp;P 500 did not outperform non-dividend stocks. More recently, JPMorgan Chase found stocks that initiated and then raised their....", "link": "https://investorplace.com/2023/09/7-dividend-aristocrats-sporting-the-highest-yields/", "symbols": ["AMCR.US", "BEN.US", "IBM.US", "LEG.US", "MMM.US", "O.US", "WBA.US"], "tags": [], "sentiment": {"polarity": 0.718, "neg": 0.036, "neu": 0.828, "pos": 0.136}}, {"date": "2023-09-11T21:45:19+00:00", "title": "3M (MMM) Outpaces Stock Market Gains: What You Should Know", "content": "3M (MMM) closed the most recent trading day at $107.89, moving +1.55% from the previous trading session. This change outpaced the S&P 500's 0.67% gain on the day. Elsewhere, the Dow gained 0.25%, while the tech-heavy Nasdaq added 1.14%.\n\nPrior to today's trading, shares of the maker of Post-it notes, industrial coatings and ceramics had gained 1.62% over the past month. This has outpaced the Conglomerates sector's loss of 2.42% and the S&P 500's loss of 0.73% in that time.\n\n3M will be looking to display strength as it nears its next earnings release. On that day, 3M is projected to report earnings of $2.36 per share, which would represent a year-over-year decline of 12.27%. Our most recent consensus estimate is calling for quarterly revenue of $8.02 billion, down 6.91% from the year-ago period.\n\nMMM's full-year Zacks Consensus Estimates are calling for earnings of $8.95 per share and revenue of $32.04 billion. These results would represent year-over-year changes of -11.39% and -6.4%, respectively.\n\nInvestors might also notice recent changes to analyst estimates for 3M. These revisions typically reflect the latest short-term business trends, which can change frequently. As a result, we can interpret positive estimate revisions as a good sign for the company's business outlook.\n\nBased on our research, we believe these estimate revisions are directly related to near-team stock moves. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\n\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate remained stagnant. 3M is currently sporting a Zacks Rank of #2 (Buy).\n\nDigging into valuation, 3M currently has a Forward P/E ratio of 11.87. This represents a discount compared to its industry's average Forward P/E of 16.84.\n\nStory continues\n\nInvestors should also note that MMM has a PEG ratio of 1.65 right now. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. Diversified Operations stocks are, on average, holding a PEG ratio of 1.95 based on yesterday's closing prices.\n\nThe Diversified Operations industry is part of the Conglomerates sector. This industry currently has a Zacks Industry Rank of 102, which puts it in the top 41% of all 250+ industries.\n\nThe Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nYou can find more information on all of these metrics, and much more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/3m-mmm-outpaces-stock-market-214519903.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.016, "neu": 0.877, "pos": 0.107}}, {"date": "2023-09-11T19:18:21+00:00", "title": "26 Most Dangerous Jobs in the World", "content": "In this article, we will look at the 26 most dangerous jobs in the world. If you want to skip our detailed analysis, head straight to the 10 Most Dangerous Jobs in the World.\n\nWhile we live in a world where safety often takes the forefront of our priorities, there remain jobs that defy the norm. These exist some of the deadliest jobs, where every day on the job is a high-stakes gamble with life and limb. From firefighters battling towering infernos to deep-sea fishermen confronting the unforgiving oceans, some jobs require individuals to play with dangers every now and then. This puts organizations and companies to the test that must ensure safety precautions for their workers and thus, observe no negligence.\n\nHistorical Evidence of How Negligence Costed Workers’ Lives at Workplaces\n\nOne of the most notorious instances of corporate negligence that resulted in worker fatalities occurred at the Triangle Shirtwaist Factory in New York City. The factory's owners, Max Blanck and Isaac Harris, prioritized profit over the well-being of their workers which eventually led to a catastrophic loss of life on March 25, 1911. The absence of adequate fire escapes and extinguishing equipment left the predominantly young immigrant women employees in a dire situation when a fire erupted on the eighth floor.\n\nWith locked exits and stairwells, they were trapped in a burning building which rendered escape impossible for many. As a result, 146 lives, mostly those of Italian and Jewish immigrant women and girls aged 14 to 23, were lost. The absence of proper safety measures not only contributed to the high casualty count but also highlighted the callous disregard for worker safety during that era. However, it is worth mentioning how this horrific incident catalyzed significant changes in labor laws and regulations while emphasizing the critical importance of workplace safety standards to protect workers from such avoidable catastrophes.\n\nIn addition, the Bhopal Gas Tragedy in India remains one of the most devastating industrial disasters in history. Union Carbide, an American chemical company, operated a pesticide plant in Bhopal. Negligence in maintaining safety standards, poor equipment maintenance, and inadequate employee training contributed to a massive gas leak of methyl isocyanate on December 2, 1984. Thousands died, and many suffered lifelong health issues as a result. In this case, the company's negligence and delayed response have pushed the global urgency to realize the need for stringent safety measures and corporate accountability.\n\nStory continues\n\nCompanies Committed to Worker Safety\n\nWhile there has been an irresponsible attitude toward workers' safety by corporations around the world, there are some names that have always been at the forefront of addressing the safety concerns of their employees. 3M Co (NYSE:MMM) cares for worker safety by producing an extensive range of safety products that include N95 respirators, ear protection, innovative fall protection gear, and reflective materials to improve visibility for workers.\n\nTransitioning to their financial performance in the second quarter of 2023, 3M Co (NYSE:MMM) reported adjusted earnings of $2.17 per share and surpassed the Zacks Consensus Estimate despite a double-digit decline year over year. This decrease can be attributed to pre-tax restructuring charges of $212 million. On the revenue front, 3M Co (NYSE:MMM)’'s quarterly net sales of $8,325 million exceeded expectations but still with a 4.3% year-over-year decline. Regionally, the Americas experienced a 1.5% decline in sales, while the Asia Pacific region saw a 12.8% decrease. Sales from Europe, the Middle East, and Africa, on the other hand, observed a modest increase of 0.6%.\n\nLike 3M Co (NYSE:MMM), Honeywell International Inc (NASDAQ:HON) is also dedicated to ensuring worker safety through their comprehensive range of services and products. They not only provide the right Personal Protective Equipment (PPE) but also educate workers on its proper usage. Honeywell Safety Services offers expert guidance by conducting assessments and training to help employees understand the most suitable PPE for their specific work environments and associated hazards.\n\nHoneywell International Inc (NASDAQ:HON)’s safety measures for their employees extend to real-time monitoring solutions for gas detection management to offer support, calibration assistance, device repairs, and troubleshooting. Their extensive safety training programs educate thousands of workers on-site, at customer locations, and in training centers. With a focus on individualized hearing conservation programs, Honeywell International Inc (NASDAQ:HON) takes worker safety to the edge, as they recognize how each worker's safety needs are unique.\n\nEnsuring workers' safety is one of the integral aspects of a company's ESG indicators. Socially conscious investors have been paying increasing attention to how companies have been improving their ESG indicators. Many, however, still question whether ESG-based investments are financially rewarding. In this regard, Stern School of Business did a meta-analysis of a 1,000 studies on ESG, carried out between 2015-2020, and arrived at the conclusion that the correlation between ESG and corporate financial performance was positive and statistically significant for 58% of the studies. 26 Most Dangerous Jobs in the World\n\nNestor Rizhniak/Shutterstock.com\n\nMethodology\n\nTo determine the most dangerous jobs in the world, we acquired data of Fatal Injury Rate per 100,000 people from the U.S. Bureau of Labor Statistics Census of Fatal Occupational Injuries. The list is presented in ascending order.\n\nIn case of similar fatal injury rates, the job with higher total fatalities in 2019 was ranked higher. For data on total fatalities in 2019, we acquired our data from Advisorsmith.\n\nImportant Note: Please note that our list does not include any military or security contractor jobs despite the perceived relatively high-risk nature of these jobs. Data shows that the fatality rate in the US Army for on-duty soliders is 1.3 per 100,000 individuals, which is actually much lower than those of many of the civilian professions.\n\n26. Security Guard\n\nFatal Injury Rate: 7 per 100,000\n\nSecurity guards are frequently exposed to potential threats like theft, vandalism, and violent confrontations. They work in high-risk environments, like banks or nightclubs, where conflicts can escalate quickly. Moreover, limited access to advanced training and protective gear compared to law enforcement personnel also adds to their vulnerability.\n\n25. Carpenters\n\nFatal Injury Rate: 8 per 100,000\n\nCarpenters often work with heavy machinery, power tools, sharp objects, and at heights, which can lead to injuries. Fatalities can occur from falls, electrical accidents, equipment malfunctions, and inadequate safety measures. To read about the most demanded jobs, check our article on the 20 Most In-Demand Jobs for the Future.\n\n24. Mining Machine Operators\n\nFatal Injury Rate: 11 per 100,000\n\nMining machine operators face difficulty and danger due to working in confined, unstable underground environments with heavy machinery, explosives, and exposure to toxic gases. Their job demands precision, constant vigilance, and adherence to safety protocols to avoid accidents and health hazards.\n\n23. Construction Workers\n\nFatal Injury Rate: 13 per 100,000\n\nConstruction workers face a number of dangers like falls from heights, heavy machinery accidents, electrical shocks, and exposure to toxic substances. Insufficient safety measures, inadequate training, and rushed deadlines can contribute to fatalities in the construction industry, making it one of the most dangerous professions globally.\n\n22. Heavy Vehicle Mechanics\n\nFatal Injury Rate: 14 per 100,000\n\nHeavy vehicle mechanics work with heavy machinery, potentially toxic chemicals, and high-pressure equipment. Thus, the job involves serious risks like crushing injuries, burns, and exposure to harmful substances. Additionally, working in tight spaces or at heights can increase the likelihood of accidents. The number of total fatal injuries in 2019 was 27.\n\n21. General Maintenance and Repair Workers\n\nFatal Injury Rate: 14 per 100,000\n\nRepair and maintenance work can be dangerous because of the exposure to toxic materials, while working with heavy machinery. These workers sometimes work at elevated heights which further adds to the danger at their jobs. Moreover, inadequate training, equipment malfunction, and poor safety protocols can increase the risk of accidents. It is one of the riskiest jobs in the world. The number of total fatal injuries in 2019 was 78.\n\n20. Police Officers\n\nFatal Injury Rate: 14 per 100,000\n\nThe high fatality rate among police officers is influenced by their exposure to potentially life-threatening situations while enforcing the law. The widespread prevalence of firearms in the region can also lead to armed confrontations and thus, also contribute to the danger involved. The number of total fatal injuries in 2019 was 186.\n\n19. Grounds Maintenance Workers\n\nFatal Injury Rate: 14 per 100,000\n\nGround maintenance workers face danger because of the high fatality rates involved, often caused by car accidents while traveling to job sites or falls, slips, and trips during work. It is one of the most dangerous jobs in the world. The number of total fatal injuries in 2019 was 229.\n\n18. Small Engine Mechanics\n\nFatal Injury Rate: 15 per 100,000\n\nSmall engine mechanics work with potentially volatile fuels, sharp tools, and intricate machinery, They must troubleshoot complex systems and often work in cramped spaces which require technical expertise, precision, and safety precautions to prevent accidents and injuries. The number of total fatal injuries in 2019 was 8.\n\n17. First-Line Supervisors of Mechanics, Installers, and Repairers\n\nFatal Injury Rate: 15 per 100,000\n\nThe job of supervisors of mechanics, installers and repairers can be potentially fatal due to their responsibilities involving oversight of potentially hazardous industrial machinery and operations. They must ensure safety protocols are followed, and any lapse in supervision can lead to accidents, injuries, or even fatalities among the workers they oversee. The number of total fatal injuries in 2019 was 44.\n\n16. Cement Masons\n\nFatal Injury Rate: 17 per 100,000\n\nCement masons are involved in heavy lifting and are exposed to toxic materials like wet concrete while working in adverse weather conditions. Their job demands physical stamina, skill in concrete finishing, and strict adherence to safety measures to prevent injuries and health risks. It is one of the top dangerous jobs in the world.\n\n15. Landscaping Supervisors\n\nFatal Injury Rate: 18 per 100,000\n\nLandscaping supervisors oversee outdoor projects with potential dangers like heavy machinery operation, tree work, and pesticide use. They're responsible for safety protocols, and their job often includes coordinating activities in potentially risky environments. The number of total fatal injuries in 2019 was 20.\n\n14. Highway Maintenance Workers\n\nFatal Injury Rate: 18 per 100,000\n\nHighway maintenance workers play with danger as they work in fast-moving traffic, and extreme weather conditions, and are frequently exposed to heavy machinery and hazardous materials. Their job requires constant vigilance and manual labor. The number of total fatal injuries in 2019 was 21.\n\n13. Construction Helpers\n\nFatal Injury Rate: 18 per 100,000\n\nA construction helper's job is dangerous owing to their exposure to heavy machinery, heights, and hazardous materials. They face risks like falls, equipment accidents, and exposure to chemicals. It is one of the most deadliest jobs in the world.\n\n12. Crane Operators\n\nFatal Injury Rate: 19 per 100,000\n\nThe job of a crane operator can have fatal risks of accidents like crane collapses, load failures, or contact with power lines. Operator errors, equipment malfunctions, or adverse weather conditions can lead to deadly incidents. The number of total fatal injuries in 2019 was 8.\n\n11. Crossing Guards\n\nFatal Injury Rate: 19 per 100,000\n\nCrossing guards are in close proximity to moving vehicles and are responsible for the safety of pedestrians, especially children. They face risks from distracted or reckless drivers, tough weather conditions, and the unpredictable behavior of pedestrians. The number of total fatal injuries in 2019 was 20.\n\nClick here to see the 10 Most Dangerous Jobs in the World.\n\nSuggested Articles:\n\n20 Most Dangerous Countries in Asia 20 Most Dangerous Countries in Europe 12 Most Dangerous Countries in Central America and South America\n\nDisclosure: None. 26 Most Dangerous Jobs in the World is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/26-most-dangerous-jobs-world-191821770.html", "symbols": ["HON.MX", "HON.US", "HONB34.SA", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": -1, "neg": 0.225, "neu": 0.662, "pos": 0.113}}, {"date": "2023-09-11T16:33:00+00:00", "title": "Here's Why 3M (MMM) Stock Should Grace Your Portfolio Now", "content": "3M Company MMM is poised for growth on the back of its cost-control actions, portfolio reshaping actions and improving supply chains.\r\n\r\nLet’s delve deeper to unearth the factors that make investing in this Zacks Rank #2 (Buy) company a smart choice now.\r\n\r\nBusiness Strength: Within the Safety and Industrial unit, strength in the automotive aftermarket business bodes well for 3M. Growth in the auto OEM (Original Equipment Manufacturer) business should aid the Transportation and Electronics segment. Organic sales growth in the medical solutions and oral care business is benefiting the Healthcare segment, while muted growth in home, health and auto care should aid the Consumer unit. With improving supply chains, the company anticipates improvements in organic growth, operating margins, earnings and cash flow in due course of the year.\r\n\r\nRestructuring Actions: 3M is undertaking restructuring actions to reduce costs and improve margins and cash flow in the long term. The organizational restructuring has impacted approximately 6,000 positions globally. This is in addition to the reduction of 2,500 global manufacturing roles announced this January. MMM expects these actions to yield annual pre-tax savings of $700 million-$900 million, approximately half of which is expected to be realized in 2023. The company’s pricing actions (to mitigate the adverse impact of raw material and logistics cost inflation), restructuring savings and spending discipline should support its margins.\r\n\r\nRewards to Shareholders: 3M is committed to rewarding its shareholders handsomely through dividend payments and share buybacks. In the first half of 2023, MMM rewarded its shareholders with $1,655 million in dividend payments and $29 million in buybacks. Strong free cash flow generation supports its shareholder-friendly measures. Adjusted free cash flow at the end of the second quarter was $2409 million, up 35.3% year over year. The company anticipates an adjusted operating cash flow of $5.9-$6.3 billion for 2023. In February 2023, MMM hiked its quarterly dividend by 0.7% to $1.50 per share.\n\nStory continues\n\n3M Company Price and Consensus 3M Company Price and Consensus\n\n3M Company price-consensus-chart | 3M Company Quote\n\nPortfolio Reshaping Actions: 3M’s portfolio reshaping actions are expected to enhance its shareholder value over time. In August, the company sold certain assets from its dental local anesthetic portfolio (formerly part of the dental materials business within the Oral Care Solutions division) to Pierrel. The divestment will help 3M divert resources to the Health Care business' core Oral Care technologies. In October 2022, MMM completed the sale of its Neoplast and Neobun brands to Selic Corp. The company also divested the manufacturing assets of its Ladlumkaew, Thailand, facility to Selic Corp.\r\n\r\nNorthbound Estimate Revision: The Zacks Consensus Estimate for 3M’s 2023 earnings has been revised upward by 3.5% in the past 60 days.\n\nOther Stocks to Consider\n\nBelow we discuss some other stocks worth considering within the Industrial Products sector:\r\n\r\nFlowserve Corporation FLS presently sports a Zacks Rank #1 (Strong Buy). The company pulled off a trailing four-quarter earnings surprise of 6.2%, on average. You can see the complete list of today’s Zacks #1 Rank stocks.\r\n\r\nFlowserve has an estimated earnings growth rate of 79.1% for the current year. The stock has jumped 31.2% so far this year.\r\n\r\nGraham Corporation GHM currently flaunts a Zacks Rank #1. The company pulled off a trailing four-quarter earnings surprise of 243.1%, on average.\r\n\r\nGraham has an estimated earnings growth rate of 400% for the current fiscal year. The stock has rallied 68.7% so far this year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nFlowserve Corporation (FLS) : Free Stock Analysis Report\n\nGraham Corporation (GHM) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/heres-why-3m-mmm-stock-163300169.html", "symbols": ["FLS.US", "FWV.F", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.004, "neu": 0.812, "pos": 0.185}}]