[{"date": "2023-07-25T21:22:00+00:00", "title": "Dow’s Winning Streak Extends to 12 Sessions", "content": "Coming earnings reports from big technology companies and the start of a two-day Federal Reserve meeting loomed over the trading day.", "link": "https://finance.yahoo.com/m/ec511ebf-92f3-31f9-ba07-0d5749d82154/dow%E2%80%99s-winning-streak-extends.html", "symbols": ["2OY.F", "2OY.STU", "DOW.US", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "RTE.F", "RTX.CO"], "tags": [], "sentiment": {"polarity": -0.273, "neg": 0.1, "neu": 0.9, "pos": 0}}, {"date": "2023-07-25T20:21:36+00:00", "title": "3M Adjusted Profit and Sales Exceed Estimates as the Firm Streamlines Operations", "content": "3M posted a loss because of \"forever chemical\" charges, but its adjusted earnings beat forecasts as the firm streamlined operations.", "link": "https://finance.yahoo.com/m/bee29abe-6a25-3a8e-b66f-d5c3a2c6bf81/3m-adjusted-profit-and-sales.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": -0.296, "neg": 0.158, "neu": 0.842, "pos": 0}}, {"date": "2023-07-25T20:19:58+00:00", "title": "Spotify price hikes &amp; job cuts, 3M raises outlook, Disney downgrade: Top stocks", "content": "Spotify shares tumble on its recent decisions to raise prices for premium subscriptions and lay off two percent of its podcast workforce. 3M stock remains boosted after an earnings beat. Atlantic Equities analysts downgrade Disney's stock and lower its price target. Yahoo Finance's Alexandra Canal, Akiko Fujita, and Brad Smith look at several trending stocks after the closing bell.", "link": "https://finance.yahoo.com/video/spotify-price-hikes-job-cuts-201958597.html", "symbols": ["639.F", "639.XETRA", "DIS.MX", "DIS.US", "DISB34.SA", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "SPOT.US", "WDP.F", "WDP.XETRA"], "tags": [], "sentiment": {"polarity": 0.361, "neg": 0.035, "neu": 0.89, "pos": 0.075}}, {"date": "2023-07-25T20:00:21+00:00", "title": "US STOCKS-AI mania drives Wall Street to higher close ahead of earnings", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nGE, 3M up on strong full-year profit forecasts\n\n*\n\nRTX shares tumble on Pratt & Whitney jet engine problem\n\n*\n\nUS consumer confidence rises to two-year high in July\n\n*\n\n(Updated at 4:00 p.m. ET/2000 GMT)\n\nBy Carolina Mandl and Bansari Mayur Kamdar\n\nJuly 25 (Reuters) - The tech-heavy Nasdaq closed higher, leading gains on Wall Street amid investor excitement about artificial intelligence ahead of earnings reports from megacap technology companies Alphabet and Microsoft after the bell.\n\nBoth Microsoft and Alphabet have launched an array of AI products since OpenAI, backed by Microsoft, released ChatGPT in late 2022. Investors expect the new products will help tech giants offset a slowdown in their cloud businesses.\n\nShares in the owner of Google and the maker of Windows climbed. \"When you have this much enthusiasm for a specific investing theme, you don't need much of a reason for markets to move. It's inertia,\" said Steve Sosnick, chief strategist at Interactive Brokers.\n\n\"The Federal Reserve meeting tomorrow is reminding the market that it will be the second to last, if not the last, interest rate increase, and that has been a major concern for markets, particularly for tech stocks,\" said Rishi Sadarangani, chief investment officer at hedge fund R/Evolution Gate.\n\nWith the U.S. central bank on track for another 25-basis point interest rate hike on Wednesday, policymakers face a choice over how much weight to put on recent economic data.\n\nA survey showed consumer confidence increased to a two-year high in July, amid continued optimism about the labor market despite worries about a recession.\n\nThe tech-heavy Nasdaq Composite index has rallied this year, helped by outsized gains in rate-sensitive megacap growth companies and hopes for an end to the U.S. Federal Reserve's tightening cycle.\n\nCompanies outside tech are also performing well as lower valuations attract investors.\n\nThe blue-chip Dow inched up even as a slide in Boeing capped gains.\n\nRTX tumbled after saying many of its Pratt & Whitney GTF engines that power Airbus A320neo jets will need \"accelerated removals and inspections\".\n\nThe S&P composite 1500 passenger airlines sub index dropped, bogged down by a fall in Alaska Air after the airline's annual revenue growth outlook missed expectations. According to preliminary data, the S&P 500 gained 13.68 points, or 0.29%, to end at 4,568.32 points, while the Nasdaq Composite gained 87.95 points, or 0.63%, to 14,146.82. The Dow Jones Industrial Average rose 33.07 points, or 0.09%, to 35,442.25.\n\nMost of the 11 major S&P 500 sectors were subdued. But materials stocks gained, tracking rising metal prices as investors cheered pledges of support from a politburo meeting in China.\n\nGeneral Electric jumped after raising its annual adjusted profit forecast, while General Motors slumped after it posted a decline in adjusted pre-tax profit and margins in its key North American market from the previous quarter.\n\n3M Co rose as the industrial conglomerate raised its annual adjusted profit forecast.\n\nThe S&P 500 earnings are now expected to decline 7.7% for the second quarter, as per Refinitiv data. (Reporting by Carolina Mandl, in Sao Paulo, Bansari Mayur Kamdar and Johann M Cherian in Bengaluru; Editing by Shinjini Ganguli, Shounak Dasgupta and Cynthia Osterman)", "link": "https://finance.yahoo.com/news/us-stocks-ai-mania-drives-200021453.html", "symbols": ["DJI.INDX", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.015, "neu": 0.839, "pos": 0.146}}, {"date": "2023-07-25T18:24:00+00:00", "title": "Why 3M Stock Was Climbing Today", "content": "Shares of 3M (NYSE: MMM) were moving higher today after the conglomerate topped low expectations in its second-quarter earnings report and put a multibillion-dollar lawsuit behind it. 3M has been struggling with the slowdown in the economy. Organic sales, which exclude the impact of acquisitions, divestitures, and currency exchange, were down 2.2%.", "link": "https://finance.yahoo.com/m/11affd6e-0635-3dad-8004-ed6950cd18ff/why-3m-stock-was-climbing.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": -0.671, "neg": 0.153, "neu": 0.808, "pos": 0.039}}, {"date": "2023-07-25T18:04:38+00:00", "title": "US STOCKS-Wall Street climbs on Big Tech enthusiasm", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nGE, 3M up on strong full-year profit forecasts\n\n*\n\nRTX shares tumble on Pratt & Whitney jet engine problem\n\n*\n\nUS consumer confidence rises to two-year high in July\n\n*\n\nIndexes up: Dow up 0.25%, S&P 500 up 0.43%, Nasdaq up 0.85%\n\n(Updated at 01:45 p.m. ET/1745 GMT)\n\nBy Carolina Mandl and Bansari Mayur Kamdar\n\nJuly 25 (Reuters) - U.S. stocks rose on Tuesday on investors' renewed enthusiasm for expected earnings reports from megacap technology companies Alphabet and Microsoft amid signs of economic resilience.\n\nA survey showed consumer confidence increased to a two-year high in July, amid continued optimism about the labor market despite worries about a recession.\n\nU.S. tech giants are expected to signal an end to a nearly year-long slowdown in their cloud businesses as technology spending and digital ads are likely to pick up.\n\nResults from Alphabet and Microsoft are due after the bell. Shares in the owner of Google and the maker of Windows climbed 0.99% and 1.45%, respectively.\n\nInvestor fascination with artificial intelligence is a positive influence for megacap tech firms, said Steve Sosnick, chief strategist at Interactive Brokers. \"When you have this much enthusiasm for a specific investing theme, you don't need much of a reason for markets to move. It's inertia.\"\n\nWith the U.S. central bank on track for another 25-basis point interest rate hike on Wednesday, policymakers face a choice over how much weight to put on recent economic data.\n\nThe tech-heavy Nasdaq Composite index has rallied nearly 35.2% this year, helped by outsized gains in rate-sensitive megacap growth companies on optimism over artificial intelligence and hopes of an end to the U.S. Federal Reserve's tightening cycle.\n\n\"Tech sold off horribly in 2022, so it's no surprise that it has come back so strong because investors believe the Fed is either done or close to being done with its tightening cycle and that's all the market wants,\" said M. Jake Dollarhide, chief executive officer at Longbow Asset Management.\n\nCompanies outside tech are also performing well as lower valuations attract investors.\n\nAfter logging its longest winning streak in over six years on Monday, the blue-chip Dow inched up even as a 0.99% slide in Boeing capped gains.\n\nRTX tumbled 12.24% after saying many of its Pratt & Whitney GTF engines that power Airbus A320neo jets will need \"accelerated removals and inspections\".\n\nThe S&P composite 1500 passenger airlines sub index dropped 3.45%, bogged down by a 9.64% fall in Alaska Air after the airline's annual revenue growth outlook missed expectations.\n\nThe Dow Jones Industrial Average rose 78.93 points, or 0.22%, to 35,490.17, the S&P 500 gained 18.03 points, or 0.40%, to 4,572.67 and the Nasdaq Composite added 111.07 points, or 0.79%, to 14,169.94.\n\nMost of the 11 major S&P 500 sectors were subdued. But materials stocks gained 1.93% tracking rising metal prices as investors cheered pledges of support from a politburo meeting in China.\n\nGeneral Electric jumped 6% after raising its annual adjusted profit forecast, while General Motors slumped 4.24% after it posted a decline in adjusted pre-tax profit and margins in its key North American market from the previous quarter.\n\n3M Co rose 5.29% as the industrial conglomerate raised its annual adjusted profit forecast.\n\nThe S&P 500 earnings are now expected to decline 7.7% for the second quarter, as per Refinitiv data.\n\nAdvancing issues outnumbered declining ones on the NYSE by a 1.38-to-1 ratio; on Nasdaq, a 1.12-to-1 ratio favored advancers.\n\nThe S&P 500 posted 31 new 52-week highs and no new lows; the Nasdaq Composite recorded 63 new highs and 72 new lows.\n\n(Reporting by Carolina Mandl, in Sao Paulo, Bansari Mayur Kamdar and Johann M Cherian in Bengaluru; Editing by Shinjini Ganguli, Shounak Dasgupta and Cynthia Osterman)", "link": "https://finance.yahoo.com/news/us-stocks-wall-street-climbs-180438793.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "DJI.INDX", "GE.MX", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "GSPC.INDX", "IXIC.INDX", "MMM.F", "MMM.MX", "MMM.SW"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.024, "neu": 0.832, "pos": 0.145}}, {"date": "2023-07-25T17:02:44+00:00", "title": "GF Score Analysis: A Deep Dive into 3M Co's Financial Performance", "content": "3M Co (NYSE:MMM), a leading player in the Conglomerates industry, is currently trading at $109.73 with a market capitalization of $60.83 billion. The company's stock price has seen a gain of 5.24% today and a 10.04% increase over the past four weeks. This article will provide a comprehensive analysis of 3M Co's financial performance using the GF Score, a stock performance ranking system developed by GuruFocus.\n\nUnderstanding 3M Co's GF Score\n\nWarning! GuruFocus has detected 5 Warning Signs with MMM. Click here to check it out.  MMM 30-Year Financial Data The intrinsic value of MMM\n\n3M Co has a GF Score of 84 out of 100, indicating good outperformance potential. The GF Score is a comprehensive measure of a company's financial performance, taking into account five key aspects: Financial Strength, Profitability Rank, Growth Rank, GF Value Rank, and Momentum Rank. A higher GF Score generally suggests higher returns, making 3M Co an attractive investment option. GF Score Analysis: A Deep Dive into 3M Co's Financial Performance\n\nFinancial Strength Analysis\n\n3M Co's Financial Strength Rank stands at 6 out of 10. This rank, provided by GuruFocus, measures the robustness of a company's financial situation. It takes into account the company's debt burden, debt to revenue ratio, and Altman Z-Score. With an interest coverage of 8.40 and a debt to revenue ratio of 0.50, 3M Co demonstrates a manageable debt burden. The company's Altman Z-Score of 3.81 further indicates financial stability.\n\nProfitability Rank Analysis\n\nThe company's Profitability Rank is 9 out of 10, suggesting high profitability. This rank is based on factors such as operating margin, Piotroski F-Score, and the trend of the operating margin. With an operating margin of 11.86% and a Piotroski F-Score of 6, 3M Co exhibits strong profitability. The company has also maintained consistent profitability over the past 10 years.\n\nGrowth Rank Analysis\n\n3M Co's Growth Rank is 6 out of 10, indicating moderate growth prospects. The Growth Rank measures a company's growth in terms of revenue and profitability. With a 5-year revenue growth rate of 3.20% and a 3-year revenue growth rate of 3.20%, 3M Co has demonstrated steady growth over the years.\n\nGF Value Rank Analysis\n\nThe company's GF Value Rank is 8 out of 10, suggesting that the stock is fairly valued. The GF Value Rank is determined by the price-to-GF-Value ratio, a proprietary metric calculated based on historical multiples and an adjustment factor based on a company's past returns and growth.\n\nMomentum Rank Analysis\n\n3M Co's Momentum Rank is 4 out of 10, indicating moderate momentum. The Momentum Rank is determined using the standardized momentum ratio and other momentum indicators, providing insights into the company's stock price performance.\n\nCompetitor Analysis\n\nWhen compared to its main competitors in the Conglomerates industry, 3M Co holds its ground with a GF Score of 84. Valmont Industries Inc (NYSE:VMI) has a higher GF Score of 90, while Seaboard Corp (SEB) and MDU Resources Group Inc (NYSE:MDU) have GF Scores of 84 and 86, respectively.\n\nIn conclusion, 3M Co's strong GF Score, coupled with its robust financial strength, high profitability, and moderate growth prospects, make it a compelling investment option. However, investors should also consider the company's momentum and valuation before making investment decisions.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/gf-score-analysis-deep-dive-170244163.html", "symbols": ["MDU.US", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "VMI.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.039, "neu": 0.769, "pos": 0.192}}, {"date": "2023-07-25T16:44:00+00:00", "title": "3M Is Making Progress in Tackling Liability Lawsuits, CEO Says", "content": "3M said a more than $10 billion settlement to resolve contamination claims related to so-called forever chemicals showed progress in the company’s efforts to resolve waves of litigation that have weighed on its stock. The St. Paul, Minn.-based maker of consumer and industrial products agreed last month to settle allegations by about 300 cities that 3M -manufactured PFAS chemicals tainted drinking water. Chief Executive Mike Roman said Tuesday the move aligned with 3M’s broader strategy of managing the lawsuits and resolving claims through mediation when it makes sense.", "link": "https://finance.yahoo.com/m/f882a090-9d2d-30c3-95e7-c89e444ca0f5/3m-is-making-progress-in.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.852, "neg": 0.035, "neu": 0.832, "pos": 0.132}}, {"date": "2023-07-25T16:32:52+00:00", "title": "3M Co (MMM): A Significantly Undervalued Gem in the Market", "content": "As of July 25, 2023, 3M Co (NYSE:MMM) has experienced a notable gain of 5.39%, with its stock price reaching $109.89. The company's market cap stands at $60.6 billion, with sales amounting to $33.4 billion. However, according to the GF Value, the stock's fair value is estimated at $168.61, indicating that 3M Co is significantly undervalued. This valuation is based on crucial factors such as historical trading multiples, an adjustment factor from GuruFocus based on past performance and growth, and estimates of future business performance.\n\nWarning! GuruFocus has detected 5 Warning Signs with MMM. Click here to check it out.  MMM 30-Year Financial Data The intrinsic value of MMM\n\n3M Co, also known as Minnesota Mining and Manufacturing, is a multinational conglomerate with operations since 1902. The company is renowned for its research and development laboratory, leveraging its science and technology across multiple product categories. As of 2020, 3M Co is organized into four business segments: safety and industrial, transportation and electronics, healthcare, and consumer. Nearly 50% of the company's revenue comes from outside the Americas, with the safety and industrial segment constituting a plurality of net sales.\n\nGF Value of 3M Co\n\nAccording to GuruFocus' valuation method, the stock of 3M Co is significantly undervalued. The GF Value estimates the stock's fair value based on historical multiples, an internal adjustment based on the company's past business growth, and analyst estimates of future business performance. If the share price is significantly above the GF Value Line, the stock may be overvalued and have poor future returns. Conversely, if the share price is significantly below the GF Value calculation, the stock may be undervalued and have higher future returns. Given its current price of $109.89 per share, 3M Co stock is believed to be significantly undervalued.\n\nBecause 3M Co is significantly undervalued, the long-term return of its stock is likely to be much higher than its business growth. 3M Co (MMM): A Significantly Undervalued Gem in the Market\n\nLink: These companies may deliver higher future returns at reduced risk.\n\nFinancial Strength of 3M Co\n\nCompanies with poor financial strength offer investors a high risk of permanent capital loss. To avoid permanent capital loss, an investor must do their research and review a companys financial strength before deciding to purchase shares. Both the cash-to-debt ratio and interest coverage of a company are a great way to understand its financial strength. 3M Co has a cash-to-debt ratio of 0.24, which ranks worse than 65.92% of companies in the Conglomerates industry. The overall financial strength of 3M Co is 6 out of 10, indicating fair financial strength. 3M Co (MMM): A Significantly Undervalued Gem in the Market\n\nProfitability of 3M Co\n\nIt is less risky to invest in profitable companies, especially those with consistent profitability over the long term. A company with high profit margins is usually a safer investment than those with low profit margins. 3M Co has been profitable 10 over the past 10 years. Over the past twelve months, the company had a revenue of $33.4 billion and Earnings Per Share (EPS) of $9.65. Its operating margin is 11.86%, which ranks better than 76.4% of companies in the Conglomerates industry. Overall, the profitability of 3M Co is ranked 9 out of 10, indicating strong profitability.\n\nGrowth of 3M Co\n\nGrowth is probably the most important factor in the valuation of a company. A faster growing company creates more value for shareholders, especially if the growth is profitable. The 3-year average annual revenue growth of 3M Co is 3.2%, which ranks worse than 55.14% of companies in the Conglomerates industry. The 3-year average EBITDA growth rate is 5.2%, which ranks worse than 61.52% of companies in the Conglomerates industry.\n\nROIC vs WACC of 3M Co\n\nAnother way to evaluate a companys profitability is to compare its return on invested capital (ROIC) to its weighted cost of capital (WACC). Return on invested capital (ROIC) measures how well a company generates cash flow relative to the capital it has invested in its business. The weighted average cost of capital (WACC) is the rate that a company is expected to pay on average to all its security holders to finance its assets. If the ROIC is higher than the WACC, it indicates that the company is creating value for shareholders. Over the past 12 months, 3M Cos ROIC was 9.44, while its WACC came in at 8. 3M Co (MMM): A Significantly Undervalued Gem in the Market\n\nConclusion\n\nIn conclusion, the stock of 3M Co (NYSE:MMM) is believed to be significantly undervalued. The company's financial condition is fair and its profitability is strong. Its growth ranks worse than 61.52% of companies in the Conglomerates industry. To learn more about 3M Co stock, you can check out its 30-Year Financials here.\n\nTo find out the high quality companies that may deliver above average returns, please check out GuruFocus High Quality Low Capex Screener.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/3m-co-mmm-significantly-undervalued-163252127.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.045, "neu": 0.78, "pos": 0.175}}, {"date": "2023-07-25T16:24:00+00:00", "title": "3M's (MMM) Q2 Earnings &amp; Revenues Beat Estimates, '23 EPS View Up", "content": "3M Company’s MMM second-quarter 2023 adjusted earnings (excluding $14.52 from non-recurring items) of $2.17 per share surpassed the Zacks Consensus Estimate of $1.65. The bottom line declined in double digits year over year. This includes a negative impact from pre-tax restructuring charges of $212 million.\r\n \r\n3M’s net sales of $8,325 million outperformed the Zacks Consensus Estimate of $7,955 million. However, the top line declined 4.3% year over year due to an adverse foreign currency impact of 0.9% and a 1.2% negative impact from divestitures. Organic sales fell 2.2%.\r\n\r\nRegion-wise, sales in the Americas decreased 1.5% year over year, while that in the Asia Pacific declined 12.8%. Sales from business in Europe, the Middle East and Africa inched up 0.6%.\n\n3M Company Price, Consensus and EPS Surprise 3M Company Price, Consensus and EPS Surprise\n\n3M Company price-consensus-eps-surprise-chart | 3M Company Quote\n\nSegmental Results\n\nThe company reports top-line results under four business segments — Safety & Industrial, Transportation & Electronics, Health Care and Consumer.\r\n\r\nRevenues from Safety and Industrial totaled $2,765 million, decreasing 5.5% year over year. The decline can be attributed to a 0.9% negative impact from adverse movements in foreign currencies. Organic sales declined 4.6% for the segment. The Zacks Consensus Estimate for Safety and Industrial segment revenues was $2,865.25 million.\r\n\r\nRevenues from Transportation & Electronics totaled $2,191 million, reflecting a year-over-year decrease of 3.4%. The decline is attributable to a 1.3% adverse impact from movements in foreign currencies. Divestitures had a negative impact of 1.3%, while acquisitions benefited segmental revenues by 0.5%. Organic sales declined 1.3%. The Zacks Consensus Estimate for Transportation & Electronics segment revenues was pegged at $1975.34 million.\r\n \r\nRevenues from Health Care were $2,075 million, down 4.8% year over year. The results were hurt by 0.8% and 4.1% impact from adverse foreign currency translation and divestitures, respectively. Organic sales were nearly flat in the reported quarter. The Zacks Consensus Estimate for Health Care revenues was pegged at $2,101.65 million.\r\n \r\nRevenues from Consumer fell 2.7% year over year to $1,293 million. Organic sales decreased 2.2%. Movements in foreign currencies had a negative impact of 0.5%. The Zacks Consensus Estimate for Consumer segment revenues was $1,359.47 million.\n\nMargin Profile\n\nIn the quarter under review, 3M’s cost of sales decreased 9.5% year over year to $4,606 million. Selling, general and administrative expenses jumped more than 100% to $12,204 million. Research, development and related expenses were nearly flat at $473 million.\r\n\r\nIn the second quarter, 3M reported an operating loss of $8.95 billion against the operating income of $110 million in the year-ago period. The downside was due to pre-tax charges of $10.3 billion related to its settlement with PWS on PFAS.\r\n\r\nMMM’s adjusted operating income in the quarter dropped 14.5% year over year to $1,545 million. The adjusted operating margin was 19.3% compared with 21.6% in the year-ago quarter. The adjusted tax rate in the quarter was 19.1% compared with 19.8% in the year-ago quarter.\n\nBalance Sheet and Cash Flow\n\nExiting the second quarter, 3M had cash and cash equivalents of $4,258 million compared with $3,655 million at the end of December 2022. Long-term debt was $12,954 million at the end of the second quarter compared with $14,001 million at the end of December 2022.\r\n\r\nAt the end of the second quarter, 3M generated net cash of $2,784 million from its operating activities, reflecting an increase of 30.2% from the year-ago quarter. Capital used for purchasing property, plant and equipment increased 5.4% to $852 million in the second quarter.\r\n\r\nAdjusted free cash flow at the end of the second quarter was $2409 million, up 35.3% year over year. Adjusted free cash flow conversion was 105% at the end of the same period.\r\n\r\nIn the first half of 2023, 3M rewarded its shareholders with $1,655 million in dividend payments. The company did not repurchase shares in the second quarter.\n\n2023 EPS Guidance Raised\n\nBenefiting from strong operational execution and cost discipline, 3M has raised its adjusted earnings guidance for 2023. The company expects adjusted earnings of $8.60-$9.10 per share for the current year compared with $8.50-$9.00 anticipated earlier. The mid-point of the guided range — $8.85 — lies above the Zacks Consensus Estimate of $8.73.\r\n\r\nAdjusted total sales are expected to decline 1-5% from the year-ago period. This implies an adjusted sales growth of (3)-0% from the year-ago period.\r\n\r\nFor 2023, MMM anticipates an adjusted operating cash flow of $5.9-$6.3 billion with conversion of 90% to 100%.\n\nZacks Rank & Key Picks\n\n3M presently carries a Zacks Rank #3 (Hold).\r\n\r\nSome better-ranked industrial stocks are as follows:\r\n\r\nEnersys ENS presently flaunts a Zacks Rank #1 (Strong Buy). The company delivered a trailing four-quarter earnings surprise of 8%, on average. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nEnersys has an estimated earnings growth rate of 9.9% for the current fiscal year. Shares of the company have surged 73.7% in a year.\r\n\r\nXylem Inc. XYL currently carries a Zacks Rank #2 (Buy). The company delivered a trailing four-quarter earnings surprise of 17.7%, on average.\r\n\r\nXylem has an estimated earnings growth rate of 20% for the current year. Shares of the company have jumped 35.2% in a year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nEnersys (ENS) : Free Stock Analysis Report\n\nXylem Inc. (XYL) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/3ms-mmm-q2-earnings-revenues-162400864.html", "symbols": ["ENS.US", "FDN.F", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "XY6.F", "XY6.XETRA", "XYL.US"], "tags": [], "sentiment": {"polarity": 0.982, "neg": 0.048, "neu": 0.87, "pos": 0.082}}, {"date": "2023-07-25T14:41:55+00:00", "title": "GE, 3M earnings: Industrial stocks in focus", "content": "Shares of General Electric and 3M are rising after both industrial conglomerates reported earnings beats. Langenberg & Company Principal Brian Langenberg proclaims General Electric's stock is \"no longer a dog\" while analyzing the trajectory of GE's spin-off companies. Langenberg also shares his outlook on 3M amid various legal battles, calling it \"a chemical company on steroids.\"", "link": "https://finance.yahoo.com/video/ge-3m-earnings-industrial-stocks-144155429.html", "symbols": ["GE.MX", "GE.SW", "GE.US", "GEC.LSE", "GEC.XETRA", "GEOO34.SA", "GNE.PA", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.026, "neg": 0.08, "neu": 0.821, "pos": 0.099}}, {"date": "2023-07-25T14:25:14+00:00", "title": "US STOCKS-Nasdaq, S&amp;P 500 climb ahead of Big Tech results, Fed rate hike", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nGE, 3M up on strong full-year profit forecasts\n\n*\n\nVerizon climbs on surprise rise in subscriber additions\n\n*\n\nRTX shares tumble on Pratt & Whitney jet engine problem\n\n*\n\nIndexes: Dow down 0.03%, S&P up 0.13%, Nasdaq up 0.52%\n\n(Updated at 9:49 a.m. ET/1349 GMT)\n\nBy Bansari Mayur Kamdar and Johann M Cherian\n\nJuly 25 (Reuters) - The tech-heavy Nasdaq and the S&P 500 edged up amid choppy trading on Tuesday as investors geared up for quarterly earnings reports from megacap technology companies Alphabet and Microsoft, and a rate hike by the Federal Reserve.\n\nWith the central bank on track for another 25-basis point interest rate hike on Wednesday, policymakers face a choice over how much weight to put on recent economic data.\n\n\"Inflation is coming down and the economy is softening and there are those that believe that no further rate hikes are necessary,\" said Robert Pavlik, senior portfolio manager at Dakota Wealth.\n\nGiven the signs of economic resilience, U.S. tech giants are expected to signal an end to a nearly year-long slowdown in their cloud businesses as technology spending and digital ads are likely to pick up.\n\nResults from Google-owner Alphabet and Microsoft are due after the bell. Their shares rose 0.4% and 0.9%, respectively.\n\nThe tech-heavy Nasdaq Composite index has rallied nearly 35.3% this year, helped by outsized gains in rate-sensitive megacap growth companies on optimism over artificial intelligence and hopes of an end to the U.S. Federal Reserve's tightening cycle.\n\nAt 9:49 a.m. ET, the Dow Jones Industrial Average was down 12.33 points, or 0.03%, at 35,398.91, the S&P 500 was up 6.07 points, or 0.13%, at 4,560.71, and the Nasdaq Composite was up 72.63 points, or 0.52%, at 14,131.49.\n\nAfter logging its longest winning streak in over six years on Monday, the Dow edged lower in early trading, weighed down by a 1.7% slide in Boeing.\n\nFour of the eleven major S&P 500 sectors advanced in early trading, led by a 1.3% gain in materials stocks tracking rising metal prices as investors cheered pledges of support in the readout from a Politburo meeting in China.\n\nU.S.-listed shares of Chinese companies such as Alibaba and Bilibili added 0.1% and 0.6%, respectively.\n\nGeneral Electric jumped 5.5% after raising its annual adjusted profit forecast, betting on steady demand for aircraft engine spare parts and services from airlines looking to cash in on surging air travel.\n\nVerizon Communications rose 0.4% after the company posted a surprise rise in wireless subscriber additions as more users upgraded their mobile phones and plan to access its 5G network.\n\nRTX tumbled 14.5% after the defense firm said many of its Pratt & Whitney GTF engines that power Airbus A320neo jets will need \"accelerated removals and inspections\".\n\nThe S&P 500 earnings are now expected to decline 7.7% for the second quarter, as per Refinitiv data.\n\n3M Co rose 4.8% after the industrial conglomerate raised its annual adjusted profit forecast, while Alaska Air tanked 11% after the airline's annual revenue growth outlook missed expectations.\n\nDeclining issues outnumbered advancers for a 1.28-to-1 ratio on the NYSE and for a 1.03-to-1 ratio on the Nasdaq.\n\nThe S&P index recorded 18 new 52-week highs and no new lows, while the Nasdaq recorded 27 new highs and 30 new lows. (Reporting by Bansari Mayur Kamdar and Johann M Cherian in Bengaluru; Editing by Shinjini Ganguli and Shounak Dasgupta)", "link": "https://finance.yahoo.com/news/us-stocks-nasdaq-p-500-142514947.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "BAC.F", "BAC.XETRA", "DJI.INDX", "GE.MX", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "GSPC.INDX", "IXIC.INDX", "MMM.F"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.027, "neu": 0.863, "pos": 0.11}}, {"date": "2023-07-25T14:17:00+00:00", "title": "3M Earnings Weighed Down by ‘Forever Chemicals’ Settlement", "content": "3M raised its earnings expectations for the year despite swinging to a quarterly loss because of a large litigation settlement. The company’s tentative agreement with plaintiffs settled claims that the company had contaminated drinking water with PFAS, also called “forever chemicals” because they take a long time to break down. Despite the charge, 3M said it expected adjusted per-share earnings of $8.60 to $9.10, higher than prior guidance of $8.50 to $9.", "link": "https://finance.yahoo.com/m/f882a090-9d2d-30c3-95e7-c89e444ca0f5/3m-earnings-weighed-down-by.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.026, "neg": 0.056, "neu": 0.9, "pos": 0.044}}, {"date": "2023-07-25T13:37:56+00:00", "title": "These 2 Stocks Are Trying to Lift the Dow Tuesday", "content": "This is an important week for the stock market, as many investors are looking at the Federal Reserve to determine whether they'll see another interest rate hike from its monetary policy committee. With rates already having risen 5 full percentage points since early 2022, the bear market for the Dow Jones Industrial Average (DJINDICES: ^DJI) last year expressed fear about economic weakness, and this year's recovery has hinged on the notion that even a recession won't be catastrophic for the business community. Among Dow stocks, you'll find a variety of different industries represented.", "link": "https://finance.yahoo.com/m/06f5b028-efea-35d0-84c5-e0edb5729398/these-2-stocks-are-trying-to.html", "symbols": ["BAC.F", "BAC.XETRA", "DJI.INDX", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": -0.52, "neg": 0.089, "neu": 0.846, "pos": 0.065}}, {"date": "2023-07-25T13:36:00+00:00", "title": "3M Stock Powers Higher After Q2 Earnings Beat, 2023 Profit Outlook Lift", "content": "\"We are progressing the planned spin of our Health Care business and addressing a significant portion of PFAS litigation,\" said CEO Mike Roman.", "link": "https://finance.yahoo.com/m/6148ff02-7dca-35f1-a7a7-2cf606d58615/3m-stock-powers-higher-after.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.612, "neg": 0, "neu": 0.8, "pos": 0.2}}, {"date": "2023-07-25T13:30:30+00:00", "title": "3M (MMM) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates", "content": "3M (MMM) reported $8.33 billion in revenue for the quarter ended June 2023, representing a year-over-year decline of 4.3%. EPS of $2.17 for the same period compares to $2.48 a year ago.\n\nThe reported revenue represents a surprise of +4.65% over the Zacks Consensus Estimate of $7.95 billion. With the consensus EPS estimate being $1.65, the EPS surprise was +31.52%.\n\nWhile investors closely watch year-over-year changes in headline numbers -- revenue and earnings -- and how they compare to Wall Street expectations to determine their next course of action, some key metrics always provide a better insight into a company's underlying performance.\n\nSince these metrics play a crucial role in driving the top- and bottom-line numbers, comparing them with the year-ago numbers and what analysts estimated about them helps investors better project a stock's price performance.\n\nHere is how 3M performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\n\nNet Sales- Safety and Industrial: $2.77 billion versus the two-analyst average estimate of $2.82 billion. The reported number represents a year-over-year change of -5.4%. Net Sales- Consumer: $1.29 billion versus $1.25 billion estimated by two analysts on average. Compared to the year-ago quarter, this number represents a -2.8% change. Net Sales- Health Care: $2.08 billion versus $2.05 billion estimated by two analysts on average. Compared to the year-ago quarter, this number represents a -4.8% change. Net Sales- Transportation and Electronics: $2.19 billion versus the two-analyst average estimate of $1.89 billion. The reported number represents a year-over-year change of -3.4%. Operating Income- Safety and Industrial: $534 million versus $523.07 million estimated by two analysts on average. Operating Income- Consumer: $235 million versus the two-analyst average estimate of $169.82 million. Operating Income- Health Care: $411 million versus the two-analyst average estimate of $355.88 million. Operating Income- Transportation and Electronics: $410 million compared to the $257.86 million average estimate based on two analysts.\n\nView all Key Company Metrics for 3M here>>>\r\n\r\nShares of 3M have returned +3.8% over the past month versus the Zacks S&P 500 composite's +4.9% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/3m-mmm-q2-earnings-taking-133030559.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0, "neu": 0.901, "pos": 0.099}}, {"date": "2023-07-25T13:19:13+00:00", "title": "GM &amp; Spotify results, big day for earnings: Top stories", "content": "General Motors outpaces Wall Street expectations while looking to boost EV production in its full-year guidance. Music streamer Spotify posts a revenue miss after announcing plans to hike its subscription fees. Yahoo Finance Live anchor Julie Hyman previews some of the day's top earnings stories.", "link": "https://finance.yahoo.com/video/gm-spotify-results-big-day-131913732.html", "symbols": ["639.F", "639.XETRA", "8GM.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "GOGL34.SA", "GOGL35.SA", "GOOG.MI", "GOOG.MX", "GOOG.US", "GOOGL.US", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US"], "tags": [], "sentiment": {"polarity": 0.44, "neg": 0.034, "neu": 0.87, "pos": 0.096}}, {"date": "2023-07-25T12:54:25+00:00", "title": "US STOCKS-S&amp;P 500 and Nasdaq eye higher open ahead of Big Tech earnings", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window)\n\n*\n\nGE, 3M up on strong full-year profit forecasts\n\n*\n\nVerizon climbs on surprise rise in subscriber additions\n\n*\n\nFutures: Dow down 0.03%, S&P up 0.04%, Nasdaq up 0.27%\n\n(Updated at 8:32 a.m. ET/1232 GMT)\n\nBy Bansari Mayur Kamdar and Johann M Cherian\n\nJuly 25 (Reuters) - The S&P 500 and the Nasdaq were set for a slightly higher open on Tuesday after multiple companies forecast upbeat annual profits, while investors also awaited quarterly earnings reports from megacap technology companies.\n\nResults from Google-owner Alphabet and Microsoft are due after the bell. Their shares rose 0.4% and 0.9%, respectively, in premarket trading.\n\nU.S. tech giants are expected to signal an end to a nearly year-long slowdown in their cloud businesses as signs of economic resilience encourage clients to boost technology spending, while a pickup in digital ads will also aid their profits.\n\nThe tech-heavy Nasdaq Composite index has rallied 34.3% this year, helped by outsized gains in rate-sensitive megacap growth companies on optimism over artificial intelligence and hopes of an end to the U.S. Federal Reserve's tightening cycle.\n\nWith the central bank on track for another 25-basis point interest rate hike on Wednesday, policymakers face a choice over how much weight to put on recent economic data.\n\n\"Inflation is coming down and the economy is softening and there are those that believe that no further rate hikes are necessary,\" said Robert Pavlik, senior portfolio manager at Dakota Wealth.\n\nAt 8:32 a.m. ET, Dow e-minis were down 9 points, or 0.03%, S&P 500 e-minis were up 1.75 points, or 0.04%, and Nasdaq 100 e-minis were up 42.75 points, or 0.27%.\n\nAll three indexes kicked off the busy earnings and data-heavy week higher in the previous session, with a jump in oil major Chevron helping the Dow log its longest winning streak in over six years.\n\nGeneral Electric climbed 3.8% after raising its annual adjusted profit forecast, betting on steady demand for aircraft engine spare parts and services from airlines looking to cash in on surging air travel.\n\nVerizon Communications rose 2.4% after the company posted a surprise rise in wireless subscriber additions as more users upgraded their mobile phones and plan to access its 5G network.\n\nBiogen climbed 1.5% after the drugmaker announced layoffs, under a fresh cost-cutting program, while also posting strong earnings for the quarter.\n\nU.S.-listed shares of Chinese companies such as Alibaba and Bilibili added 1.6% and 3.2%, respectively, as investors cheered pledges of support in the readout from a Politburo meeting in China.\n\n3M Co rose 2.7% after the industrial conglomerate raised its annual adjusted profit forecast.\n\nOn tap at 10 a.m. ET is consumer confidence data that is expected to rise to 111.8 in July from 109.7 in June. (Reporting by Bansari Mayur Kamdar and Johann M Cherian in Bengaluru; Editing by Shinjini Ganguli and Shounak Dasgupta)", "link": "https://finance.yahoo.com/news/us-stocks-p-500-nasdaq-125425162.html", "symbols": ["BAC.F", "BAC.XETRA", "GE.MX", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "GSPC.INDX", "IXIC.INDX", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.009, "neu": 0.842, "pos": 0.149}}, {"date": "2023-07-25T12:16:37+00:00", "title": "3M posts loss on 'forever chemicals' settlement, but hikes full-year guidance", "content": "3M Co. posted a big loss for the second quarter as the manufacturer absorbed a $10 billion settlement for a class-action suit related to water pollution. However, the company's operations performed better than analysts had expected, and it boosted its outlook for the full year.", "link": "https://finance.yahoo.com/m/da7c6a55-ddcf-3a0e-b1f9-24b7d0577a7f/3m-posts-loss-on-%27forever.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0.049, "neu": 0.835, "pos": 0.116}}, {"date": "2023-07-25T11:55:05+00:00", "title": "3M (MMM) Q2 Earnings and Revenues Surpass Estimates", "content": "3M (MMM) came out with quarterly earnings of $2.17 per share, beating the Zacks Consensus Estimate of $1.65 per share. This compares to earnings of $2.48 per share a year ago. These figures are adjusted for non-recurring items.\n\nThis quarterly report represents an earnings surprise of 31.52%. A quarter ago, it was expected that this maker of Post-it notes, industrial coatings and ceramics would post earnings of $1.60 per share when it actually produced earnings of $1.97, delivering a surprise of 23.13%.\n\nOver the last four quarters, the company has surpassed consensus EPS estimates three times.\n\n3M , which belongs to the Zacks Diversified Operations industry, posted revenues of $8.33 billion for the quarter ended June 2023, surpassing the Zacks Consensus Estimate by 4.65%. This compares to year-ago revenues of $8.7 billion. The company has topped consensus revenue estimates three times over the last four quarters.\n\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\n\n3M shares have lost about 13.1% since the beginning of the year versus the S&P 500's gain of 18.6%.\n\nWhat's Next for 3M?\n\nWhile 3M has underperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\n\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\n\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\n\nAhead of this earnings release, the estimate revisions trend for 3M: mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $2.42 on $8.08 billion in revenues for the coming quarter and $8.73 on $32.11 billion in revenues for the current fiscal year.\n\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Diversified Operations is currently in the top 43% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nCarlisle (CSL), another stock in the same industry, has yet to report results for the quarter ended June 2023. The results are expected to be released on July 26.\n\nThis diversified manufacturer is expected to post quarterly earnings of $4.81 per share in its upcoming report, which represents a year-over-year change of -21.8%. The consensus EPS estimate for the quarter has been revised 0.1% lower over the last 30 days to the current level.\n\nCarlisle's revenues are expected to be $1.56 billion, down 15.4% from the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nCarlisle Companies Incorporated (CSL) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/3m-mmm-q2-earnings-revenues-115505678.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.012, "neu": 0.893, "pos": 0.095}}, {"date": "2023-07-25T11:33:58+00:00", "title": "US STOCKS-Dow futures lackluster after scorching rally; Big Tech earnings in focus", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window)\n\n*\n\nGM edges up as it puts profit ahead of growth\n\n*\n\nGE rides aviation boom to lift 2023 profit forecast\n\n*\n\n3M up after raising annual profit outlook\n\n*\n\nFutures up: Dow 0.03%, S&P 0.09%, Nasdaq 0.25%\n\n(Updated at 06:58 a.m. ET/1058 GMT)\n\nBy Bansari Mayur Kamdar and Johann M Cherian\n\nJuly 25 (Reuters) - Dow futures were subdued on Tuesday, lagging Wall Street peers, following an 11-day rally by the blue-chip index, while investors awaited quarterly earnings from megacap technology companies.\n\nResults from Google-owner Alphabet and Microsoft , due after the bell, will be a test for their hefty valuations. The megacaps rose 0.5% and 0.8%, respectively, in premarket trading.\n\nU.S. tech giants are expected to signal an end to a nearly year-long slowdown in their cloud businesses as signs of economic resilience encourage clients to boost technology spending, while a pickup in digital ads will also aid their profits.\n\n\"The results, so far, have been much better than expected. In fact, corporate guidance is pointing to a rosy outlook for Q3 results,\" said Peter Cardillo, chief market economist at Spartan Capital.\n\n\"Nonetheless, while we expect the summer rally to continue, investor exuberance is likely to lessen in the near-term, portending a less vigorous rally.\"\n\nThe tech-heavy Nasdaq Composite index has rallied 34.3% this year, helped by outsized gains in rate-sensitive megacap growth companies on optimism over artificial intelligence and hopes of an end to the U.S. Federal Reserve's tightening cycle.\n\nWith the central bank on track for another 25-basis point interest rate hike this week, policymakers face a choice over how much weight to put on recent economic data.\n\nAt 06:58 a.m. ET, Dow e-minis were up 11 points, or 0.03%, S&P 500 e-minis were up 4 points, or 0.09%, and Nasdaq 100 e-minis were up 39.5 points, or 0.25%.\n\nAll three indexes kicked off the busy earnings and data week higher in the previous session, with a jump in oil major Chevron helping the Dow log its longest winning streak in over six years.\n\nGeneral Electric climbed 4.8% after raising its annual adjusted profit forecast, betting on steady demand for aircraft engine spare parts and services from airlines looking to cash in on surging air travel.\n\nGeneral Motors inched up 0.5% after the automaker lifted its full-year profit outlook as it plans to invest less in new products and cut operating costs through the end of next year.\n\nRivals Tesla and Ford added 1.3% and 0.4%, respectively.\n\nU.S.-listed shares of Chinese companies such as Alibaba and Bilibili added 1.3% and 3.6%, respectively, as investors cheered pledges of support in the readout from a Politburo meeting in China.\n\n3M Co rose 2.2% after the industrial conglomerate raised its annual adjusted profit forecast.\n\nOn tap at 10 a.m. ET is consumer confidence data that is expected to rise to 111.8 in July from 109.7 in June. (Reporting by Bansari Mayur Kamdar and Johann M Cherian in Bengaluru; Editing by Shinjini Ganguli and Shounak Dasgupta)", "link": "https://finance.yahoo.com/news/us-stocks-dow-futures-lackluster-113358870.html", "symbols": ["IXIC.INDX", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.012, "neu": 0.853, "pos": 0.134}}, {"date": "2023-07-25T11:30:34+00:00", "title": "U.S. stocks were rising as Microsoft and Alphabet kick off tech earnings", "content": "Investing.com -- U.S. stocks were rising ahead of quarterly earnings reports from Microsoft Corporation (NASDAQ:MSFT) and Alphabet (NASDAQ:GOOGL) (NASDAQ:GOOG), which could shed more light on the state of business spending on big tech.\n\nAt 11:12 ET (15:12 GMT) Dow Jones Industrial Average was up 4 points, or flat, while the S&P 500 was up 0.1% and the NASDAQ Composite was up 0.4%.\n\nTech sector boosted by AI, hopes about Fed rate hikes\n\nThe two tech giants are expected to report strength in their cloud businesses as businesses spend on tech. Analysts also hope to see an improvement in digital advertising, and they want to hear more about AI spending and strategy.\n\nInvestors have pushed the Nasdaq up 34% so far this year on the promise of AI technology to be the next transformative trend in the sector.\n\nTech stocks are also getting a boost from expectations that the Federal Reserve is nearing the end of its interest rate increases, though it is expected to announce another quarter of a percentage point hike when its two-day meeting ends tomorrow.\n\nFed kicks off two-day meeting\n\nInvestors will be listening closely to what Fed Chair Jerome Powell says during his press conference tomorrow for clues on the Fed’s next rate move later this year. Futures traders are divided on whether the Fed will end its rate hikes after this month or raise another quarter of a point at one of its fall meetings.\n\nConsumer confidence rose to 117, more than the 111.8 expected and above the 110.1 recorded in a previous reading. Other economic data this week includes reports on gross domestic product for the second quarter, initial jobless claims, and the personal consumption expenditures index, a key inflation gauge.\n\nGeneral Electric raises profit outlook\n\nIn other stock moves on Tuesday, General Electric Company (NYSE:GE) was rising 5.9% after it raised its adjusted profit outlook. It is forecasting solid demand from airlines for engine parts and other services.\n\nShares of Verizon Communications Inc (NYSE:VZ) rose 0.8% after the telecommunications giant said wireless subscriber numbers rose more than expected as more people upgrade their devices.\n\n3M Company (NYSE:MMM) shares rose 5.4% after it raised its annual adjusted profit forecast.\n\nRelated Articles\n\nU.S. stocks were rising as Microsoft and Alphabet kick off tech earnings\n\nUPS, union avert strike with planned 5-year deal, pay increase\n\nGlobal equities, U.S. yields gain ahead of Fed, corporate results", "link": "https://finance.yahoo.com/news/u-stocks-were-rising-microsoft-113034847.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "DJI.INDX", "GE.US", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "IXIC.INDX", "MMM.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US"], "tags": [], "sentiment": {"polarity": 0.988, "neg": 0.022, "neu": 0.867, "pos": 0.111}}, {"date": "2023-07-25T10:43:00+00:00", "title": "UPDATE 2-3M raises full-year profit forecast on higher prices, cost-cut measures", "content": "(Recasts paragraph 1 with profit forecast, adds shares in paragraph 2)\n\nJuly 25 (Reuters) - U.S. industrial conglomerate 3M Co on Tuesday raised its full-year profit forecast, benefiting from higher prices and cost-cut measures including significant layoffs.\n\nThe company, which makes everything from power tools to medical products, has been raising prices to offset a hit from mounting commodity costs. To counter the surge, 3M also reduced its total global workforce by 10% over two rounds of layoffs.\n\nThe maker of 'Scotch' tape and 'Post-it' note said it now expects its full-year profit to be between $8.60 and $9.10 per share, up from its prior guidance of $8.50 to $9.00.\n\n\"In the second quarter, the actions we took to strengthen our supply chain and restructure the company led to improved service for customers, reduced costs across 3M, and better-than-expected margins and cash flow,\" said 3M Chairman and Chief Executive Officer Mike Roman.\n\nShares of the company were up 1.5% at $105.80 in premarket trading.\n\nBut the diversified manufacturer reported a quarterly loss compared to a year-ago profit, as it took a hit from a $10.3 billion settlement related to water pollution claims tied to \"forever chemicals\".\n\nLast month, the diversified manufacturer agreed to settle with a host of U.S. public water systems to resolve water pollution claims.\n\nThe St. Paul, Minnesota-based company reported a loss of $12.35 per share in the second quarter, compared with a profit of 14 cents a year earlier.\n\nThe loss includes the settlement amount payable over 13 years, which negatively impacted earnings per share by $14.19.\n\nRevenue fell 4.3% to $8.3 billion. (Reporting by Kannaki Deka in Bengaluru; Editing by Shinjini Ganguli)", "link": "https://finance.yahoo.com/news/1-3m-reports-quarterly-loss-104300031.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.979, "neg": 0.024, "neu": 0.848, "pos": 0.128}}, {"date": "2023-07-25T10:41:14+00:00", "title": "3M raises full-year profit forecast as cost-cut measures pay off", "content": "By Kannaki Deka\n\n(Reuters) -U.S. industrial conglomerate 3M Co on Tuesday raised its full-year profit forecast and reported better-than-expected quarterly results helped by higher prices and cost-cut measures, sending its shares to a four-month high of nearly 6%.\n\n3M, which makes electronic displays for smartphones and tablets, raised prices to offset high raw material and labor costs. It also reduced its total global workforce by 10% this year as demand for consumer electronics waned.\n\nThe diversified manufacturer said in April it expects to save up to $900 million through restructuring by 2025 as it shifts focus to high-growth businesses, including automotive electrification and home improvement, and prioritize emerging growth areas such as climate technology among others.\n\nIt reported adjusted revenue of $7.99 billion in the fourth quarter ended June 30, beating analysts' average expectation of $7.87 billion, according to Refinitiv IBES.\n\n\"Improving supply chain dynamics as well as MMM's past restructuring and productivity actions have started to gain some traction and we think are reflected in the company's relatively better margin performance in the quarter,\" Citi analysts said in a note.\n\nThe company, however, flagged it continues to see slow recovery in China as weakness in consumer electronics demand continues.\n\n3M reported a fourth-quarter loss compared to a year-ago profit, as it took a hit from a $10.3 billion settlement related to water pollution claims tied to \"forever chemicals\".\n\nThe company is facing thousands of lawsuits related to its use of \"forever chemicals\" that are linked to cancer, hormonal dysfunction and environmental damage, and defective earplugs that caused hearing loss for U.S. military members.\n\nStill, the company expects a full-year profit between $8.60 and $9.10 per share, up from its prior guidance of $8.50 to $9.\n\nIt reported fourth-quarter adjusted earnings of $2.17 per share, above Street estimates of $1.72.\n\n(Reporting by Kannaki Deka in Bengaluru; Editing by Shinjini Ganguli)", "link": "https://ca.finance.yahoo.com/news/3m-reports-quarterly-loss-forever-104114843.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.844, "neg": 0.082, "neu": 0.809, "pos": 0.109}}, {"date": "2023-07-25T10:30:00+00:00", "title": "3M Reports Second Quarter 2023 Results; Proactive Initiatives Drive Strong Quarterly Financial Results; Raises Full-Year Adjusted EPS Guidance", "content": "ST. PAUL, Minn., July 25, 2023 /PRNewswire/ -- 3M (NYSE: MMM) today reported second quarter 2023 results.\n\n\"In the second quarter, the actions we took to strengthen our supply chain and restructure the company led to improved service for customers, reduced costs across 3M, and better than expected margins and cash flow,\" said Mike Roman, 3M chairman and chief executive officer. \"As we execute our strategy, we are positioning 3M for long-term performance, including progressing the planned spin of our Health Care business and addressing a significant portion of PFAS litigation.\"\n\nSecond Quarter Highlights:\n\nQ2 2023 Q2 2022 GAAP earnings (loss) per share $      (12.35) $          0.14 Special items: Impact of public water systems (PWS) settlement 14.19 — Other net costs for significant litigation  0.24 2.34 Other special items, net 0.09 (0.03) Adjusted EPS $          2.17 $          2.45 Memo: GAAP operating income (loss) margin (107.6) % 1.3 % Adjusted operating income margin 19.3 % 21.6 %\n\nGAAP loss per share of $12.35 and operating margin of minus 107.6% include the previously announced proposed settlement agreement with PWS in the United States regarding PFAS resulting in a pre-tax charge of $10.3 billion payable over 13 years, negatively impacting earnings per share by $14.19. Adjusted earnings per share of $2.17 includes pre-tax restructuring charges of $212 million, or negative $0.31 per share. Adjusted operating income margin of 19.3% includes a 2.7 percentage point headwind from pre-tax restructuring charges.\n\nGAAP  Adjusted (Non-GAAP) Net sales (Millions) $8,325 $7,993 Sales change Total sales  (4.3) % (4.7) % Components of sales change: Organic sales1 (2.2) % (2.5) % Acquisitions/divestitures (1.2) % (1.3) % Translation (0.9) % (0.9) % Adjusted sales excludes manufactured PFAS products. 1Above adjusted organic sales decline includes a 1.7 percentage point headwind from the decline in \r\ndisposable respirator demand.\n\nSales of $8.3 billion, down 4.3 percent year-on-year, with organic sales decline of 2.2 percent year-on-year. Adjusted sales of $8.0 billion, down 4.7 percent year-on-year with adjusted organic sales decline of 2.5 percent year-on-year. Operating cash flow of $1.5 billion, up 34 percent year-on-year; adjusted free cash flow of $1.5 billion, up 44 percent year-on-year. 3M returned $828 million to shareholders via dividends.\n\nThe above includes reference to certain non-GAAP measures. See the \"Supplemental Financial Information Non-GAAP Measures\" section for applicable information.\n\nFull-Year 2023 Outlook\n\nGiven the company's strong operational execution and cost discipline, 3M raises its full-year adjusted EPS2 expectations for 2023 to $8.60 to $9.10 vs. $8.50 to $9.00 prior.\n\nAdjusted total sales growth2 in the range of -5 to -1 percent, reflecting adjusted organic sales growth of -3 percent to flat, which remains unchanged.\n\nAdjusted operating cash flow2 of $5.9 to $6.3 billion is contributing to 90% to 100% adjusted free cash flow conversion2, which is also unchanged.\n\n2 As further discussed at 6 within the \"Supplemental Financial Information Non-GAAP Measures\" section, 3M cannot, without unreasonable effort, forecast certain items required to develop meaningful comparable GAAP financial measures and, therefore, does not provide them on a forward-looking basis reflecting these items.\n\n3M Resolves Claims by PWS in the United States\n\nOn June 22, 2023, 3M issued a press release announcing a proposed settlement agreement with PWS in the United States regarding PFAS. As a result of this agreement, 3M recorded a pre-tax charge of $10.3 billion in the second quarter of 2023. The charge reflects the present value of the expected $12.5 billion nominal value of 3M's payments over 13 years under the agreement.\n\nConference Call\n\n3M will conduct an investor teleconference at 9 a.m. EDT (8 a.m. CDT) today. Investors can access this conference via the following:\n\nLive webcast at https://investors.3M.com Live telephone:\r\nCall 800-762-2596 within the U.S. or +1 212-231-2916 outside the U.S. Please join the call at least 10 minutes before the start time. Webcast replay at https://investors.3m.com/financials/quarterly-earnings Telephone replay:\r\nCall 800-633-8284 within the U.S. or +1 402-977-9140 outside the U.S. (for both U.S. and outside the U.S., the access code is 22024175). The telephone replay will be available until 11:30 a.m. EDT (10:30 a.m. CDT) on August 1, 2023.\n\nConsolidated Financial Statements and Supplemental Financial Information Non-GAAP Measures\n\nView the Financial Statement Information on 3M's website: https://investors.3m.com/financials/quarterly-earnings\n\nForward-Looking Statements\n\nThis news release contains forward-looking information about 3M's financial results and estimates and business prospects that involve substantial risks and uncertainties. You can identify these statements by the use of words such as \"anticipate,\" \"estimate,\" \"expect,\" \"aim,\" \"project,\" \"intend,\" \"plan,\" \"believe,\" \"will,\" \"should,\" \"could,\" \"target,\" \"forecast\" and other words and terms of similar meaning in connection with any discussion of future operating or financial performance or business plans or prospects. Among the factors that could cause actual results to differ materially are the following: (1) worldwide economic, political, regulatory, international trade, geopolitical, capital markets and other external conditions and other factors beyond the Company's control, including inflation, recession, military conflicts, natural and other disasters or climate change affecting the operations of the Company or its customers and suppliers; (2) risks related to unexpected events such as the public health crises associated with the coronavirus (COVID-19) global pandemic; (3) foreign currency exchange rates and fluctuations in those rates; (4) risks related to certain fluorochemicals, including liabilities related to claims, lawsuits, and government regulatory proceedings concerning various PFAS-related products and chemistries, as well as risks related to the Company's plans to exit PFAS manufacturing and discontinue use of PFAS across its product portfolio; (5) risks related to the proposed class-action settlement (\"Settlement\") to resolve claims by public water systems in the United States regarding PFAS, including whether court approval of the Settlement will be obtained, whether the number of plaintiffs that opt out of the Settlement will exceed current expectations or will exceed the level that would permit 3M to terminate the Settlement (and whether 3M will elect to terminate the Settlement if this occurs), whether the Settlement is appealed, the timing and amount of payments made under the Settlement, and the impact of the settlement on other PFAS-related matters; (6) legal proceedings, including significant developments that could occur in the legal and regulatory proceedings described in the Company's Annual Report on Form 10-K for the year ended Dec. 31, 2022 and any subsequent quarterly reports on Form 10-Q (the \"Reports\"); (7) competitive conditions and customer preferences; (8) the timing and market acceptance of new product and service offerings; (9) the availability and cost of purchased components, compounds, raw materials and energy due to shortages, increased demand and wages, supply chain interruptions, or natural or other disasters; (10) unanticipated problems or delays with the phased implementation of a global enterprise resource planning (ERP) system, or security breaches and other disruptions to the Company's information technology infrastructure; (11) the impact of acquisitions, strategic alliances, divestitures, and other strategic events resulting from portfolio management actions and other evolving business strategies; (12) operational execution, including the extent to which the Company can realize the benefits of planned productivity improvements, as well as the impact of organizational restructuring activities; (13) financial market risks that may affect the Company's funding obligations under defined benefit pension and postretirement plans; (14) the Company's credit ratings and its cost of capital; (15) tax-related external conditions, including changes in tax rates, laws or regulations; (16) matters relating to the proposed spin-off of the Company's Health Care business; and (17) matters relating to the voluntary chapter 11 proceedings of the Company's subsidiary Aearo Technologies and certain of its affiliates. Changes in such assumptions or factors could produce significantly different results. A further description of these factors is located in the Reports under \"Cautionary Note Concerning Factors That May Affect Future Results\" and \"Risk Factors\" in Part I, Items 1 and 1A (Annual Report) and in Part I, Item 2 and Part II, Item 1A (Quarterly Reports). The Company assumes no obligation to update any forward-looking statements discussed herein as a result of new information or future events or developments.\n\nAbout 3M\n\n3M (NYSE: MMM) believes science helps create a brighter world for everyone. By unlocking the power of people, ideas and science to reimagine what's possible, our global team uniquely addresses the opportunities and challenges of our customers, communities, and planet. Learn how we're working to improve lives and make what's next at 3M.com/news or on Twitter at @3M or @3MNews.\n\nPlease note that the company announces material financial, business and operational information using the 3M investor relations website, SEC filings, press releases, public conference calls and webcasts. The company also uses the 3M News Center and social media to communicate with our customers and the public about the company, products and services and other matters. It is possible that the information 3M posts on the News Center and social media could be deemed to be material information. Therefore, the company encourages investors, the media and others interested in 3M to review the information posted on 3M's news center and the social media channels such as Twitter @3M or @3MNews.\n\nContacts 3M Investor Contacts: Bruce Jermeland, 651-733-1807\r\nor\r\nDiane Farrow, 612-202-2449\r\nor\r\nEric Herron, 651-233-0043\r\nMedia Contact: Sean Lynch, slynch2@mmm.com 3M (PRNewsfoto/3M) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/3m-reports-second-quarter-2023-results-proactive-initiatives-drive-strong-quarterly-financial-results-raises-full-year-adjusted-eps-guidance-301884976.html\n\nSOURCE 3M", "link": "https://finance.yahoo.com/news/3m-reports-second-quarter-2023-103000520.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.037, "neu": 0.856, "pos": 0.107}}, {"date": "2023-07-25T07:21:23+00:00", "title": "GE, General Motors, Verizon rise premarket; Goldman Sachs, Dow fall", "content": "Investing.com -- U.S. futures edged higher Tuesday, as investors digest a deluge of corporate earnings ahead of a key Federal Reserve meeting.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nGeneral Motors (NYSE:GM) stock rose 2% after the auto giant lifted its full-year profit guidance, in large part because it plans to invest less in new products and cut operating costs by an additional $1 billion through the end of next year.\n\nGeneral Electric  (NYSE:GE) stock rose 3.8% after the industrial conglomerate raised its full-year adjusted profit forecast, betting on steady demand for aircraft engine spare parts and services from airlines looking to cash in on surging air travel.\n\nVerizon (NYSE:VZ) stock rose 3.1% after the telecoms giant posted a surprise rise in wireless subscriber additions as more users upgraded their mobile phones to access its 5G network.\n\nDow (NYSE:DOW) stock fell 0.7% after the chemicals company reported a lower-than-expected second-quarter profit, hurt by lower prices of its products and weak sales volumes.\n\nGoldman Sachs (NYSE:GS) stock fell 0.4% after Citigroup downgraded the investment bank to ‘Neutral’ from ‘Buy,’ saying its targets will take time to be achieved.\n\nWalmart (NYSE:WMT) stock rose 1.1% after Piper Sandler upgraded its stance on the retail giant to ‘Overweight’ from ‘Neutral’, saying it can rally more than 30% as it gains grocery market share.\n\n3M (NYSE:MMM) stock rose 2.1% after the industrial conglomerate lifted its full-year EPS guidance even after reporting a quarterly loss as it took a hit from a $10.3 billion settlement related to water pollution claims.\n\nLogitech (NASDAQ:LOGI) stock rose 7% after the maker of computer mice and keyboards raised its sales and profit outlook for the first half of the financial year 2024.\n\nBiogen (NASDAQ:BIIB) stock rose 1.4% after the biotech said it expects to cut about 1,000 jobs, or about 11% of its workforce, to save costs as the company ramps up the launch of a new Alzheimer's disease drug.\n\nRelated Articles\n\nGE, General Motors, Verizon rise premarket; Goldman Sachs, Dow fall\n\nAmazon amends iRobot deal to lower offer price by 15%\n\nAlbertsons beats profit, revenue expectations on strong demand for groceries", "link": "https://finance.yahoo.com/news/ge-general-motors-verizon-rise-072123285.html", "symbols": ["2OY.F", "2OY.STU", "BAC.F", "BAC.XETRA", "BIIB.MX", "BIIB.US", "BIIB34.SA", "DOW.US", "GE.US", "GM.US", "GS.US", "IDP.F", "IDP.XETRA", "LOGI.US", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US"], "tags": [], "sentiment": {"polarity": 0.881, "neg": 0.053, "neu": 0.869, "pos": 0.078}}, {"date": "2023-07-24T14:41:00+00:00", "title": "Why Tuesday Is the Most Important Day This Week for Dow Jones Stocks", "content": "Many investors believe that the Dow Jones Industrial Average (DJINDICES: ^DJI) has lost its standing as an important stock index. Its price-weighted methodology means that the Dow gives less weight to some of its gigacap components than to much smaller companies that just happen to have higher share prices. Tuesday is an especially important day for the Dow, because five of its 30 stocks are expected to release their latest numbers.", "link": "https://finance.yahoo.com/m/4e2691f4-6f75-3221-a2b1-a6d537886061/why-tuesday-is-the-most.html", "symbols": ["3V64.F", "3V64.XETRA", "BAC.F", "BAC.XETRA", "DJI.INDX", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "V.MX", "V.US", "VERZ34.SA", "VISA34.SA"], "tags": [], "sentiment": {"polarity": 0.414, "neg": 0.031, "neu": 0.889, "pos": 0.08}}, {"date": "2023-07-24T13:48:04+00:00", "title": "Is 3M's 5.8% Dividend Yield Safe for Long-Term Investors?", "content": "3M might face revenue headwinds in the near term, but is that enough to put its dividend in jeopardy?", "link": "https://finance.yahoo.com/m/2ab1bb17-4ab4-39c5-aca4-e40b26d67927/is-3m%27s-5.8%25-dividend-yield.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": -0.631, "neg": 0.187, "neu": 0.813, "pos": 0}}, {"date": "2023-07-24T12:00:36+00:00", "title": "At US$104, Is 3M Company (NYSE:MMM) Worth Looking At Closely?", "content": "Today we're going to take a look at the well-established 3M Company (NYSE:MMM). The company's stock saw a double-digit share price rise of over 10% in the past couple of months on the NYSE. With many analysts covering the large-cap stock, we may expect any price-sensitive announcements have already been factored into the stock’s share price. However, could the stock still be trading at a relatively cheap price? Today I will analyse the most recent data on 3M’s outlook and valuation to see if the opportunity still exists.\n\nView our latest analysis for 3M\n\nWhat's The Opportunity In 3M?\n\nGood news, investors! 3M is still a bargain right now. According to my valuation, the intrinsic value for the stock is $134.53, but it is currently trading at US$104 on the share market, meaning that there is still an opportunity to buy now. Another thing to keep in mind is that 3M’s share price may be quite stable relative to the rest of the market, as indicated by its low beta. This means that if you believe the current share price should move towards its intrinsic value over time, a low beta could suggest it is not likely to reach that level anytime soon, and once it’s there, it may be hard to fall back down into an attractive buying range again.\n\nWhat kind of growth will 3M generate? earnings-and-revenue-growth\n\nFuture outlook is an important aspect when you’re looking at buying a stock, especially if you are an investor looking for growth in your portfolio. Although value investors would argue that it’s the intrinsic value relative to the price that matter the most, a more compelling investment thesis would be high growth potential at a cheap price. Though in the case of 3M, it is expected to deliver a negative earnings growth of -1.5%, which doesn’t help build up its investment thesis. It appears that risk of future uncertainty is high, at least in the near term.\n\nWhat This Means For You\n\nAre you a shareholder? Although MMM is currently undervalued, the negative outlook does bring on some uncertainty, which equates to higher risk. Consider whether you want to increase your portfolio exposure to MMM, or whether diversifying into another stock may be a better move for your total risk and return.\n\nAre you a potential investor? If you’ve been keeping an eye on MMM for a while, but hesitant on making the leap, I recommend you dig deeper into the stock. Given its current undervaluation, now is a great time to make a decision. But keep in mind the risks that come with negative growth prospects in the future.\n\nKeep in mind, when it comes to analysing a stock it's worth noting the risks involved. Case in point: We've spotted 3 warning signs for 3M you should be aware of.\n\nIf you are no longer interested in 3M, you can use our free platform to see our list of over 50 other stocks with a high growth potential.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nJoin A Paid User Research Session\r\nYou’ll receive a US$30 Amazon Gift card for 1 hour of your time while helping us build better investing tools for the individual investors like yourself. Sign up here", "link": "https://finance.yahoo.com/news/us-104-3m-company-nyse-120036041.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.078, "neu": 0.757, "pos": 0.165}}]