[{"date": "2024-01-23T21:41:48+00:00", "title": "3 High-Yield Dividend Stocks to Buy for Massive Passive Income", "content": "Defining high-yield dividend stocks is an intriguing task. Some loosely define high-yield stocks as those with dividend yields exceeding key benchmarks like the S&P 500 (1.5%) or a 10-year U.S. Treasury note (4.1%). For over a century, dividends played a crucial role in stock returns. Despite this fact, not all dividend stocks prove to be worthwhile investments. Indeed, many high-yield stocks underperformed markets and government bonds over longer time horizons.\n\nToday, many investors focus on sustainability and reliability over all else. Companies with reliable cash flow and growth potential are in high demand. Higher yields can mean higher risk (particularly of dividend cuts). Accordingly, making a list of top high-yielding dividend stocks can result in increasing one’s risk profile, something investors don’t want.\n\nLet’s focus on three higher-yielding dividend stocks that can be viewed as relatively stable in this current market environment.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nDevon Energy (DVN) The logo for Devon Energy (DVN) is displayed on a sign outside an office.\n\nSource: Jeff Whyte / Shutterstock.com\n\nDevon Energy (NYSE:DVN) saw a 26% stock drop in the past year, which resulted in a 1.8% dividend yield. Notably, Devon is an outlier in the energy sector, with a strong history of 18 payouts.\n\nHighlighting its resilience is the company’s 22.74% five-year dividend growth rate, among the best in the sector. Thus, it should be no surprise that Devon continues to be a focal point of many income investors. In particular, the company’s recent Q3 earnings results exceeded expectations.\n\nDespite Devon’s stock drop in 2023, optimism for a 2024 recovery abounds. The company’s earnings, cash flow, and dividends suffered due to a decline in crude prices. However, with prices stabilizing around $70 a barrel, the company’s 5% dividend yield is sustainable.\n\nMordor Intelligence reports the U.S. upstream market produced 12.4 million barrels per day, with a projected 2.3% CAGR through 2028. Despite electrification trends, the world’s reliance on oil, especially in sectors like air transportation, positions Devon as a compelling stock. The 22% loss investors saw over the past year may not fully account for this company’s long-term relevance. Analysts express optimism, rating DVN a moderate buy with a $56.28 average price target.\n\nStory continues\n\nAT&T (T) AT&T logo on wooden background\n\nSource: Lester Balajadia / Shutterstock.com\n\nAT&T’s (NYSE:T) stock, down 18.4% over the past year, is a company that provides contrast, given its robust business performance. Mobile and broadband services show steady growth, with a 5G network covering 200 million Americans. Notably, the company’s third-quarter 2023 results showcased record-high mobility service revenue. These will be key areas investors will continue to focus on moving forward.\n\nAT&T’s broadband business has surpassed its mobility business, now doubling AT&T Fiber subscribers in less than four years. With new services and plans to cover over 30 million locations by 2025, 2024 could see accelerated broadband growth.\n\nDespite the telecom company’s strong performance, the stock trades at 6.2-times trailing free cash flow, offering a substantial 6.7% dividend yield. With a projected $16.5 billion free cash flow in 2023 and a target net debt to adjusted EBITDA ratio of 2.5x by mid-2025, AT&T shows financial strength. On track to achieve the 2.5-times ratio by Q2 2024 (a year earlier than expected) AT&T faces challenges but remains promising. Amid the resurgence of the 5G theme, AT&T is poised for potential growth.\n\n3M Co. (MMM) 3M logo on top of a corporate building. MMM stock\n\nSource: JPstock / Shutterstock.com\n\n3M (NYSE:MMM) flaunts a 5.49% forward dividend yield, sustaining progressive dividends for 65 years. Operating margins improved company-wide, notably in safety and industrial segments, achieving 25.7% in Q3 2023.\n\nThe company’s high-yield payout raises concerns due to legal issues. Settlements last year, totaling $16.3 billion for earplugs and “forever chemicals,” will be paid over several years. Despite improved financial results, credit ratings were affected. S&P Global downgraded to BBB+, while Moody’s maintained an A2 rating with a negative outlook.\n\n3M’s adjusted free cash flow of $4.3 billion in Q3 2023 covered its $2.5 billion dividend payments, allowing for balance sheet strengthening. Additionally, the company’s net debt decreased by 11% to $10.8 billion in the past year. Thus, 3M is trending in the right direction. Despite likely being the highest-risk pick on this list, it’s a stock worthy of attention right now.\n\nOn the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nChris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\n\nThe post 3 High-Yield Dividend Stocks to Buy for Massive Passive Income appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-high-yield-dividend-stocks-214148399.html", "symbols": ["0I8W.LSE", "D1VN34.SA", "DVN.MX", "DVN.US", "DY6.BE", "DY6.DU", "DY6.F", "DY6.MU", "DY6.STU", "MMM.BE", "MMM.F", "MMM.HA", "MMM.HM", "MMM.MU", "MMM.MX", "MMM.STU", "MMM.SW", "MMM.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.03, "neu": 0.847, "pos": 0.122}}, {"date": "2024-01-23T20:59:55+00:00", "title": "Verizon beats on Q4 earnings, 3M down on full-year guidance", "content": "Verizon (VZ) beat expectations for its fourth-quarter earnings, with full-year wireless service revenue coming in at $76.7 billion along with a reported postpaid phone customer net addition of 449,000 customers.\n\n3M (MMM) posted its fourth-quarter earnings with positive adjusted earnings per share of $2.42 from sales of $8 billion, beating Wall Street expectations. However, shares of the stock sank over 10% on Tuesday after Wall Street analysts pointed out weak consumer demand and mixed industrial data. To assure shareholders, CEO Mike Roman said \"We will continue to invest in high-growth markets where 3M's unique capabilities can make a difference, including automotive electrification, climate technology, and industrial automation.\"\n\nYahoo Finance Anchors Josh Lipton and Julie Hyman break down the latest developments for these companies.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Nicholas Jacobino.", "link": "https://finance.yahoo.com/video/verizon-beats-q4-earnings-3m-205955635.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "MMM.BE", "MMM.F", "MMM.HA", "MMM.HM", "MMM.MU", "MMM.MX", "MMM.STU", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.459, "neg": 0.046, "neu": 0.889, "pos": 0.065}}, {"date": "2024-01-23T20:29:24+00:00", "title": "3 Dogs of the Dow With Dividend Yields Above 4%", "content": "The “Dogs of the Dow” strategy consists of investing in the 10 highest-yielding stocks in the Dow Jones Industrial Average. Purchasing the Dogs of the Dow creates higher dividend income, by focusing on high-yielding stocks.\n\nThe following three stocks are part of the 10 Dogs of the Dow for 2024. They are not the highest-yielding Dow stocks, but they are among the top 10 and also have strong dividend growth potential in the years ahead.\n\n3M (MMM)\n\nSource: Pavel Kapysh / Shutterstock.com Large\n\n3M (NYSE:MMM) is a diversified industrial manufacturer that sells more than 60,000 products. The company operates four separate divisions: Safety and Industrial, Healthcare, Transportation and Electronics, and Consumer. 3M is facing several lawsuits, including nearly 300,000 claims that its earplugs used by U.S. combat troops and produced by a subsidiary were defective. On Sept. 18, 2023, 3M agreed to pay $6.01 billion to settle lawsuits regarding the defective ear plugs. Additionally, the company is still waiting to hear if its $10.3 billion water utility settlement will be approved with more than 20 states.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nIn the most recent third quarter, revenue declined 3.6% to $8.3 billion, but this was $280 million above estimates. Adjusted earnings per share (EPS) of $2.68 was 33 cents more than projected. Adjusted organic growth fell 3.1% for the period. Health Care had organic growth of 2.4%, while Transportation and Electronics, Consumer, and Safety and Industrial were down 1.8%, 7.2%, and 5.8%, respectively.\n\n3M updated its outlook for 2023 as well, with the company now expecting adjusted EPS in a range of $8.95 to $9.15 for the year, up from $8.60 to $9.10 previously. 3M’s innovation is one of the company’s greatest competitive advantages. The company targets research and development (R&D) spending equivalent to 6% of sales (about $2 billion annually) to create new products to meet consumer demand. This spending has proven to be very beneficial to the company as 30% of sales during the last fiscal year were from products that did not exist five years ago\n\nStory continues\n\n3M is likely to generate enough cash flow to maintain its dividend. 3M has increased its dividend for over 60 years. MMM stock currently yields 5.5%.\n\nVerizon (VZ) 5G stocks, VZ stock\n\nSource: Ken Wolter / Shutterstock.com\n\nVerizon (NYSE:VZ) is a communication services stock and one of the largest wireless carriers in the country. Wireless contributes three-quarters of all revenues, and broadband and cable services account for about a quarter of sales. The company’s network covers about 300 million people and 98% of the U.S.\n\nOn Oct. 24, 2023, Verizon reported earnings results for the third quarter. For the quarter, revenue declined 2.7% to $33.3 billion, but this was in line with expectations. Adjusted EPS of $1.22 was 4 cents more than anticipated. Verizon had postpaid phone net losses of 51,000, but this was an improvement both on year-over-year and sequential basis.\n\nRevenue for the Consumer segment declined 2.3% to $25.3 billion, though wireless service revenue improved 2.9% due to higher average revenue per account. Broadband totaled 434,000 net new customers during the period, the fourth consecutive quarter of at least 400,000 net adds. Wireless retail postpaid phone churn rate remains low at 0.85%.\n\nVerizon reaffirmed guidance for 2023 as well with the company still expecting adjusted EPS of $4.55 to $4.85 for the year. Wireless service revenue is still projected to grow 2.5% to 4.5%. Free cash flow for 2023 is projected to be $18 billion, $1 billion higher than previously expected.\n\nThe strong free cash flow of the company fuels its high dividend payout. Verizon has increased its dividend for 19 consecutive years. VZ stock currently yields 6.6%.\n\nInternational Business Machines (IBM) Photo of IBM (IBM) building as seen through the canopy of a tree. IBM logo is in large letters on side of building.\n\nSource: shutterstock.com/LCV\n\nInternational Business Machines (NYSE:IBM) is a global information technology company that provides integrated enterprise solutions for software, hardware and services. IBM’s focus is running mission critical systems for large, multi-national customers and governments. IBM typically provides end-to-end solutions. The company now has four business segments: Software, Consulting, Infrastructure and Financing. IBM had annual revenue of about $60.5 billion in 2022.\n\nIBM reported solid results for Q3 2023 on Oct. 25, 2023. Companywide revenue rose 3.5% while diluted adjusted earnings per share climbed 22% on a year-over-year basis. Also, IBM’s revenue and earnings are being impacted by the strong U.S. dollar causing a 1.1% headwind. Software revenue increased 6.3% in comparable quarters due to 7% growth in Hybrid Platform and Solutions and a 5% increase in Transaction Processing. Revenue was up 8% for RedHat, 13% for Automation, 6% for Data and AI, and -3% for Security.\n\nThe firm launched watsonx for generative AI and machine learning. Consulting revenue increased 5% due to a 5% rise in Business Transformation, a 1% increase in Technology Consulting, and 7% growth in Application Operations. The book-to-bill ratio is a healthy 1.15x.\n\nFuture growth will be driven largely by acquisitions. So far in 2023, it has announced the purchase of StepZen and NS1. IBM has acquired 30 companies under the present CEO. Also, IBM is reinforcing its AI offerings as seen by the Apptio acquisition. IBM forecasts revenue growth in the mid-single-digits and free cash flow of about $10.5 billion in 2023.\n\nIBM has increased its dividend for 29 consecutive years, qualifying it as a Dividend Aristocrat. The 2023 dividend payout ratio of approximately 70% indicates a secure dividend. IBM stock yields 4.1%.\n\nOn the date of publication, Bob Ciura did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nBob Ciura has worked at Sure Dividend since 2016. He oversees all content for Sure Dividend and its partner sites. Prior to joining Sure Dividend, Bob was an independent equity analyst. His articles have been published on major financial websites such as The Motley Fool, Seeking Alpha, Business Insider and more. Bob received a bachelor’s degree in Finance from DePaul University and an MBA with a concentration in investments from the University of Notre Dame.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\n\nThe post 3 Dogs of the Dow With Dividend Yields Above 4% appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-dogs-dow-dividend-yields-202924416.html", "symbols": ["IBM.US", "MMM.BE", "MMM.F", "MMM.HA", "MMM.HM", "MMM.MU", "MMM.MX", "MMM.STU", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.026, "neu": 0.835, "pos": 0.139}}, {"date": "2024-01-23T20:21:18+00:00", "title": "3M Stock Crashes Again: Buy, Sell, or Hold the Stock?", "content": "Investors in 3M(NYSE: MMM) hoped the industrial giant's restructuring efforts would show up in its numbers for the fourth quarter and outlook for 2024. However, 3M continues to remind investors about the many problems it is dogged with, particularly legal issues that have weighed heavily on the company's growth and prospects in recent years. That explains why 3M stock crashed by double digits on Tuesday after earnings.\n\nTo be fair, 3M still beat its earnings guidance in 2023 and exited the year with strong cash flows. Management now believes simplifying the organization structure, finalizing legal settlements, and completing strategic moves like spinning off its healthcare business should help 3M deliver a \"successful\" 2024.\n\nKey 3M numbers you must know\n\n3M's sales fell 0.8% year over year in Q4 and were down 4.5% in 2023. Organic sales fell 3% year over year in Q4. End markets played out as expected, with softness lingering in consumer retail and electronics markets. China also continues to be a weak spot for 3M.\n\n3M's adjusted earnings per share (EPS) in Q4, however, rose 11% year over year, driven by restructuring and a lower-than-expected tax rate. For the full year, though, 3M's adjusted EPS fell roughly 6.5% to $9.24 a share. 3M ended 2023 with an adjusted free cash flow of $6.3 billion, versus its original guidance of $4.2 billion to $5 billion.\n\nBuy, sell, or hold 3M stock?\n\n3M expects to earn adjusted EPS of only $9.35 to $9.75 per share. That's below consensus estimates and does not reflect the impact of 3M's upcoming healthcare spinoff and potential lawsuit settlements. Management, however, believes there are \"significant\" opportunities to expand margins and cash flows in 2024 as it continues with its restructuring efforts, identifies low-return products and businesses to exit, invests in newer markets, and focuses on reducing legal risks.\n\nThere's something investors must understand here: There are too many factors at play when it comes to 3M, which makes it harder to build conviction in the stock. To give you an example, 3M's restructuring should largely be complete by the end of 2024, which should save it costs and boost margins. At the same time, divestiture of its healthcare business will mean a loss of earnings and cash flows for the company.\n\nStory continues\n\nHere's what that means: 3M's stock is trading significantly below its five-year average price-to-sales and price-to-cash flow and is offering a dividend yield of 5.6%, which is undeniably a value buy for long-term investors. The keyword here is long term, though: You may not want to expect much from 3M stock in the near term as the company navigates challenges. Instead, base your investing thesis on what management can do in the long term to revive the company.\n\nShould you invest $1,000 in 3M right now?\n\nBefore you buy stock in 3M, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and 3M wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of January 22, 2024\n\nNeha Chamaria has no position in any of the stocks mentioned. The Motley Fool recommends 3M. The Motley Fool has a disclosure policy.\n\n3M Stock Crashes Again: Buy, Sell, or Hold the Stock? was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/3m-stock-crashes-again-buy-202118507.html", "symbols": ["MMM.US"], "tags": [], "sentiment": {"polarity": 0.987, "neg": 0.044, "neu": 0.854, "pos": 0.102}}, {"date": "2024-01-23T17:41:00+00:00", "title": "3M (MMM) Q4 Earnings Beat Estimates, Revenues Decline Y/Y", "content": "3M Company MMM reported fourth-quarter 2023 results, where its revenues and earnings surpassed the Zacks Consensus Estimate. The top line inched down, while the bottom line increased on a year-over-year basis.\n\nInside the Headlines\n\nIn the fourth quarter, 3M delivered adjusted earnings of $2.42 per share, surpassing the Zacks Consensus Estimate of $2.31. The metric increased from $2.18 reported in the year-ago quarter.\r\n\r\nThe company’s net sales of $8,013 million outperformed the Zacks Consensus Estimate of $7,686 million. However, the top line declined 0.8% year over year due to a 1.9% decrease in organic sales. Foreign currency translation had a positive impact of 0.9%, while acquisitions boosted the top line by 0.2%.\r\n\r\nRegion-wise, organic sales in the Americas inched up 0.3% year over year, while that in the Asia Pacific declined 5.8%. Organic sales from businesses in Europe, the Middle East and Africa inched down 0.6%.\n\n3M Company Price, Consensus and EPS Surprise 3M Company Price, Consensus and EPS Surprise\n\n3M Company price-consensus-eps-surprise-chart | 3M Company Quote\n\nSegmental Results\n\nThe company reports top-line results under four business segments — Safety & Industrial, Transportation & Electronics, Health Care and Consumer.\r\n\r\nRevenues from Safety and Industrial totaled $2,661 million, decreasing 2.7% year over year. The decline can be attributed to a 3.9% decrease in organic revenues. The Zacks Consensus Estimate for Safety and Industrial segment revenues was pegged at $2,624 million.\r\n\r\nRevenues from Transportation & Electronics totaled $1,769 million, reflecting a year-over-year increase of 4.5%. The increase is attributable to a 2.7% improvement in organic sales. Acquisitions boosted segmental revenues by 1.3%, while foreign currency translation had a 0.5% positive impact. The Zacks Consensus Estimate for Transportation & Electronics segment revenues was pinned at $1,619 million.\r\n\r\nRevenues from Health Care were $2,037 million, down 0.3% year over year. The results were hurt by an organic sales decline of 1% and a 0.4% negative impact from divestitures. The Zacks Consensus Estimate for Health Care revenues was pegged at $2,108 million.\r\n\r\nRevenues from the Consumer segment fell 1.6% year over year to $1,226 million. Organic sales decreased 2.2%. Movements in foreign currencies had a positive impact of 0.6%. The Zacks Consensus Estimate for Consumer segment revenues was pinned at $1,301 million.\n\nStory continues\n\nMargin Profile\n\nIn the quarter under review, 3M’s cost of sales increased 2% year over year to $4,678 million. Selling, general and administrative expenses declined 24.3% to $1,625 million. Research, development and related expenses increased 4.9% year over year to $467 million.\r\n\r\nIn the fourth quarter, 3M reported an operating income of $1,243 million compared with the operating income of $632 million in the year-ago period. The upside was driven by a decline in the company’s total operational expenses.\r\n\r\nMMM’s adjusted operating income in the quarter ascended 9.1% year over year to $1,608 million. The adjusted operating margin was 20.9% compared with 19.1% in the year-ago quarter. The adjusted tax rate in the quarter was 14.9% compared with 16.6% in the year-ago period.\n\nBalance Sheet and Cash Flow\n\nExiting the fourth quarter, 3M had cash and cash equivalents of $5,933 million compared with $3,655 million at the end of December 2022. Long-term debt was $13,088 million at the end of December 2023 compared with $14,001 million at the end of December 2022.\r\n\r\nIn the quarter, 3M generated net cash of $1,986 million from its operating activities, reflecting an increase of 3.3% from the year-ago quarter. Capital used for purchasing property, plant and equipment decreased 7.7% to $1.6 billion in 2023.\r\n\r\nAdjusted free cash flow at the end of the fourth quarter was $1,955 million, up 17.8% year over year. Adjusted free cash flow conversion was 145% at the end of the same period.\r\n\r\nIn 2023, 3M rewarded its shareholders with $3.3 billion in dividend payments. The company did not repurchase shares in the fourth quarter.\n\n2024 Guidance\n\nMMM expects adjusted earnings of $9.35-$9.75 per share for 2024. The mid-point of the guided range is $9.55, which lies below the Zacks Consensus Estimate of $9.90.\r\n\r\nAdjusted total sales are expected to be in the range of 0.25-2.25%. This implies an adjusted organic sales growth of 0-2%.\r\n\r\n3M estimates adjusted operating cash flow of $6.5-$7.1 billion, representing 95-105% adjusted free cash flow conversion.\n\nZacks Rank & Key Picks\n\nMMM currently carries a Zacks Rank #3 (Hold). Some better-ranked companies are discussed below:\r\n\r\nGriffon Corporation GFF presently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nIt has a trailing four-quarter average earnings surprise of 28.6%. The Zacks Consensus Estimate for GFF’s fiscal 2024 (ending September 2024) earnings increased 13% in the past 60 days. Shares of Griffon have surged 51% in the past year.\r\n\r\nITT Inc. ITT presently carries a Zacks Rank #2 (Buy). ITT delivered a trailing four-quarter average earnings surprise of 8%.\r\n\r\nIn the past 60 days, the Zacks Consensus Estimate for ITT’s 2023 earnings has increased 0.2%. The stock has risen 36.4% in the past year.\r\n\r\nApplied Industrial Technologies, Inc. AIT presently carries a Zacks Rank #2. It has a trailing four-quarter average earnings surprise of 13.9%.\r\n\r\nThe Zacks Consensus Estimate for AIT’s fiscal 2024 (ending June 2024) earnings remained steady in the past 60 days. Shares of Applied Industrial have jumped 43.4% in the past year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nITT Inc. (ITT) : Free Stock Analysis Report\n\nApplied Industrial Technologies, Inc. (AIT) : Free Stock Analysis Report\n\nGriffon Corporation (GFF) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/3m-mmm-q4-earnings-beat-174100760.html", "symbols": ["GFF.BE", "GFF.F", "GFF.US", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.014, "neu": 0.871, "pos": 0.115}}, {"date": "2024-01-23T15:49:01+00:00", "title": "Why 3M Stock Is Crashing Today", "content": "3M (NYSE: MMM) beat earnings expectations for 2023's fourth quarter, but management's outlook for 2024 was well below expectations. In response to the report from the manufacturing giant Tuesday morning, the market -- focused on the future -- sent its shares down. As of 10 a.m. ET, the stock was off by 9.5%.\n\nA mixed message from earnings\n\nIt has been a difficult few years for 3M investors. The company has been bogged down with operational issues that have caused it to miss earnings expectations, and was also navigating multiple extended lawsuits and massive settlements related to product liability claims. Shares of 3M have underperformed the S&P 500 by more than 60 percentage points over the past three years.\n\nInvestors hoping to see signs of a turnaround in the company's most recently completed quarter received mixed messages from the report. 3M reported adjusted fourth-quarter earnings of $2.42 per share, beating the analysts' consensus prediction of $2.31 per share, though revenue fell just short of expectations.\n\n\"Throughout 2023, we executed our priorities and delivered on our commitments -- including expanding underlying operating margins and cash flow,\" CEO Mike Roman said in a statement. \"We initiated actions to restructure our organization and simplify our supply chain, while progressing our healthcare spin and addressing legal matters.\"\n\nBut those moves apparently will not pay off as quickly as Wall Street had hoped. 3M forecast 2024 earnings of between $9.35 per share and $9.75 per share -- short of the consensus estimate of $9.81 per share.\n\nThat estimate was somewhat muddied by the spinoff of 3M's healthcare business (which is expected to be completed in the first half of the year) and potential legal payouts.\n\nIs 3M a buy heading into 2024?\n\nThe bull case for 3M revolves around its impressive collection of industrial assets. Management's current effort to restructure the conglomerate and divest some units should result in a higher-margin mix of operations, which should translate into a higher stock price over time. For value investors seeking a turnaround play, there is a lot to like about 3M.\n\nStory continues\n\nAlas, the issues that have plagued the company for years now continue to linger. We enter 2024 still with questions about how much it will be impacted by its lawsuit settlements and uncertainty about its earnings power. At best, 3M's fourth-quarter report indicates that patience is required. Investors considering buying the stock on this pullback need to be aware of the recent history, and understand there will likely be no quick turnaround.\n\nShould you invest $1,000 in 3M right now?\n\nBefore you buy stock in 3M, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and 3M wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of January 22, 2024\n\nLou Whiteman has no position in any of the stocks mentioned. The Motley Fool recommends 3M. The Motley Fool has a disclosure policy.\n\nWhy 3M Stock Is Crashing Today was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/why-3m-stock-crashing-today-154901392.html", "symbols": ["MMM.US"], "tags": [], "sentiment": {"polarity": 0.983, "neg": 0.071, "neu": 0.812, "pos": 0.117}}, {"date": "2024-01-23T15:25:12+00:00", "title": "3M stocks slides after full-year guidance disappoints", "content": "Shares of 3M (MMM) opened lower after the company issued full-year profit and sales guidance that was below Street expectations. However, 3M's fourth quarter earnings did top analyst estimates, with the company's health care spinoff still on track for the first half of 2024.\n\nYahoo Brad Smith and Seana Smith report explain the results.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Eyek Ntekim\n\nVideo Transcript\n\nSEANA SMITH: All right, time for some of our trending tickers. First up, 3M. And look at that slide out of the open. We're looking at losses of just about 6%. This coming after 3M gave full year guidance for profit and sales that fell below the Street's expectations.\n\nThey talked about lackluster demand that that is continuing to weigh on the company. We're seeing that reflected in the guidance here from 3M. For the fourth quarter earnings though, they did beat the Street's expectations, driven by some of the strength from their restructuring push that they're doing in order to streamline some of the company's operations.\n\nAnd looking ahead down the line here in terms of what 3M is going to look like as they do streamline some of their operations here, Brad. They are spinning off their health care unit. That's on track to be completed in the first half of the year. So again, that guidance, though, really overriding any sort of good news from its most recent quarterly earnings report.\n\nAnd it's also a similar theme to really what we have been seeing playing out in terms of share reaction and share price reaction to some of these results. If they're not beating expectations by a wide margin, a lot of time, you're seeing some of that downside pressure.\n\nBRAD SMITH: Yeah, when you look at some of the hits that we've seen, at least on the revenue and sales side, where ultimately, the company did report sales down by about 8/10 of a percent, year-over-year organic sales decline of about 1.9%, it kind of draws me back to some of the data that we had heard from FactSet, and that we had talked about at the beginning of the show, when we were mentioning the fact that this earnings season is going to be critical to tie into some of the all time highs, and whether or not that continues, at least, in full force in the near term.\n\nStory continues\n\nOne of the huge things that jumped out to me, particularly is how this passes through to the actual net profit margin for the quarter. It is expected by FactSet that if 10.7% is the actual net profit margin for the quarter, it's actually going to mark the lowest net profit margin reported by the index, the S&P 500, since the second quarter of 2020.\n\nWhere were you when-- we all remember where we were. We were at home. So at the--\n\nSEANA SMITH: We weren't doing much.\n\nBRAD SMITH: --end the day, we weren't doing much. However, 3M was shining during that time--\n\nSEANA SMITH: Exactly.\n\nBRAD SMITH: --making a lot of masks. So as you mentioned, this is going to be a company that looks vastly different once they spin off that health care division. And we'll see how some of the Street has to recalibrate the way that we evaluate this company as well.", "link": "https://finance.yahoo.com/video/3m-stocks-slides-full-guidance-152512609.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.984, "neg": 0.025, "neu": 0.893, "pos": 0.081}}, {"date": "2024-01-23T13:45:38+00:00", "title": "Stocks to Watch Tuesday: Verizon, Netflix, United Airlines", "content": "↗️ [**Verizon Communications (VZ)**](https://www.wsj.com/market-data/quotes/VZ): The telecom giant posted a small drop in revenue after lower wireless-equipment sales offset healthy gains wireless subscribers and price increases.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1bf7a3a3-e4d8-3713-90a3-bc9135e01159/stocks-to-watch-tuesday%3A.html", "symbols": ["0NOF.LSE", "0O59.LSE", "0Q1S.LSE", "BAC.F", "BAC.XETRA", "DHI.US", "HO2.F", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "PG.BA", "PG.MX", "PG.US", "PRG.F", "PRG.XETRA", "SAN.PA", "SANF.MI"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0.133, "neu": 0.71, "pos": 0.157}}, {"date": "2024-01-23T13:13:34+00:00", "title": "J&amp;J, P&amp;G, GE, 3M, Verizon, Defense Contractors Report Earnings", "content": "This earnings season is hitting its stride with a swath of the country’s largest companies providing quarterly updates as the [stock market reaches new highs](https://www.wsj.com/livecoverage/stock-market-today-dow-jones-01-22-2024).\n\nContinue reading", "link": "https://finance.yahoo.com/m/b2e6141b-e2ec-3fd7-9c22-b8c1b7a5808e/j%26j%2C-p%26g%2C-ge%2C-3m%2C-verizon%2C.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "GE.MX", "GE.SW", "GE.US", "GEC.LSE", "GEC.XETRA", "GEOO34.SA", "GNE.PA", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0, "neu": 0.954, "pos": 0.046}}, {"date": "2024-01-23T12:40:04+00:00", "title": "3M (MMM) Q4 Earnings and Revenues Beat Estimates", "content": "3M (MMM) came out with quarterly earnings of $2.42 per share, beating the Zacks Consensus Estimate of $2.31 per share. This compares to earnings of $2.28 per share a year ago. These figures are adjusted for non-recurring items.\n\nThis quarterly report represents an earnings surprise of 4.76%. A quarter ago, it was expected that this maker of Post-it notes, industrial coatings and ceramics would post earnings of $2.34 per share when it actually produced earnings of $2.68, delivering a surprise of 14.53%.\n\nOver the last four quarters, the company has surpassed consensus EPS estimates four times.\n\n3M , which belongs to the Zacks Diversified Operations industry, posted revenues of $8.01 billion for the quarter ended December 2023, surpassing the Zacks Consensus Estimate by 4.25%. This compares to year-ago revenues of $8.08 billion. The company has topped consensus revenue estimates four times over the last four quarters.\n\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\n\n3M shares have lost about 1.2% since the beginning of the year versus the S&P 500's gain of 1.7%.\n\nWhat's Next for 3M?\n\nWhile 3M has underperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\n\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\n\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\n\nStory continues\n\nAhead of this earnings release, the estimate revisions trend for 3M: mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $2.11 on $7.89 billion in revenues for the coming quarter and $9.90 on $32.34 billion in revenues for the current fiscal year.\n\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Diversified Operations is currently in the top 20% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nGriffon (GFF), another stock in the same industry, has yet to report results for the quarter ended December 2023.\n\nThis garage door and building products maker is expected to post quarterly earnings of $0.78 per share in its upcoming report, which represents a year-over-year change of -9.3%. The consensus EPS estimate for the quarter has remained unchanged over the last 30 days.\n\nGriffon's revenues are expected to be $597.26 million, down 8% from the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\n3M Company (MMM) : Free Stock Analysis Report\n\nGriffon Corporation (GFF) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/3m-mmm-q4-earnings-revenues-124004120.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.008, "neu": 0.895, "pos": 0.097}}, {"date": "2024-01-23T12:35:04+00:00", "title": "Dow closes above 38,000, Verizon, JNJ, and PG report: Yahoo Finance Live", "content": "Investors are looking to build off yesterday's record close for the Dow (^DJI) after the index closed above 38,000 for the first time. Eyes are on several top Dow components reporting today which include Verizon (VZ), 3M (MMM), Procter & Gamble (PG), and Johnson & Johnson (JNJ). United Airlines (UAL) is once again in the headlines this morning after the air carrier forecasted a first-quarter loss due to the ongoing issues with Boeing (BA) 737 Max 9 planes. Yahoo Finance trending tickers include Digital World Acquisition Corp. (DWAC), Gilead Sciences (GILD), and Bitcoin (BTC-USD).\r\n\r\nKey guests include:\r\n9 a.m. ET - John Staszak, Argus Research Analyst\r\n9:40 a.m. ET - Seema Shah, Principal Asset Management Chief Global Strategist\r\n10:30 a.m. ET - Jack Mallers, Strike CEO\r\n10:40 a.m. ET - Rachel Aguirre, BlackRock U.S. Head of iShares Product\r\n11 a.m. ET - Ken Mahoney, Mahoney Asset Management CEO\r\n11:30 a.m. ET - Rep. Ted Lieu (D) California", "link": "https://finance.yahoo.com/video/dow-closes-above-38-000-123504046.html", "symbols": ["BA.MX", "BA.US", "BAC.F", "BAC.XETRA", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "GILD.MX", "GILD.US", "GILD34.SA", "GIS.F", "GIS.XETRA", "IXIC.INDX", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.7, "neg": 0.025, "neu": 0.913, "pos": 0.063}}, {"date": "2024-01-23T11:35:44+00:00", "title": "3M forecasts downbeat 2024 profit amid slow demand", "content": "(Reuters) — US industrial conglomerate 3M Co forecast full-year earnings below analyst estimates on Tuesday, as the diversified manufacture faces slow demand, sending its shares down 5.7% in premarket trading.\n\nHigher interest rates and inflation have dampened demand for non-essential big-ticket purchases, hurting 3M's electronics business that makes displays for smartphones and tablets.\n\nThe company also took a hit from U.S. retailers realigning their inventories, as they adjust to a slow demand environment.\n\n3M in September warned of \"a slow growth environment\" in 2024 and forecast weakness in its electronics and consumer segments in the third and fourth quarter.\n\nAdditionally, the company is facing thousands of lawsuits related to defective earplugs that caused hearing loss for U.S. military members and its use of \"forever chemicals\", which are linked to cancer, hormonal dysfunction and environmental damage. The 3M logo is pictured on products at an Orchard Supply Hardware store in Pasadena\n\n3M forecast 2024 profit between $9.35 and $9.75 per share, compared with analysts' average estimate of $9.81, according to LSEG data.\n\nThe forecast does not reflect potential impact from funding some of the case settlements, the company said.\n\nThe St. Paul, Minnesota-based company also reported an adjusted profit of $2.42 per share for the fourth quarter, compared with $2.18 per share a year earlier.\n\nRevenue for the quarter fell 0.8% to $8.01 billion.\n\n(Reporting by Kannaki Deka in Bengaluru; Editing by Shinjini Ganguli)", "link": "https://finance.yahoo.com/news/3m-quarterly-profit-rises-price-113544343.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": -0.796, "neg": 0.113, "neu": 0.809, "pos": 0.078}}, {"date": "2024-01-23T11:30:00+00:00", "title": "3M Delivers Strong Fourth-Quarter Results; Improves Operational Performance and Exceeds Earnings and Cash Flow Expectations", "content": "Results reflect strong operational execution, progress on restructuring, and spending discipline Well-positioned to continue improving performance, including continued expansion of adjusted operating margins3 in 2024 Health Care spin remains on track for first half of 2024\n\nST. PAUL, Minn., Jan. 23, 2024 /PRNewswire/ -- 3M (NYSE: MMM) today reported fourth-quarter and full-year 2023 results and provided its 2024 financial outlook.\n\n\"The fourth quarter capped a strong year for 3M,\" said 3M chairman and CEO Mike Roman. \"Throughout 2023, we executed our priorities and delivered on our commitments – including expanding underlying operating margins and cash flow. We initiated actions to restructure our organization and simplify our supply chain, while progressing our Health Care spin and addressing legal matters.\"\n\n\"Our team remains focused on further improving our operational performance, optimizing our portfolio, and reducing risk,\" Roman continued. \"We will continue to invest in high-growth markets where 3M's unique capabilities can make a difference, including automotive electrification, climate technology, and industrial automation. I am confident we will deliver a successful 2024.\"\n\nFourth-Quarter Highlights:\n\nQ4 2023 Q4 2022 GAAP earnings per share $          1.70 $          0.98 Special items: Net costs for significant litigation  0.36 0.07 Other special items, net 0.36 1.13 Adjusted earnings per share (EPS) $          2.42 $          2.18 Memo: GAAP operating income margin 15.5 % 7.8 % Adjusted operating income margin1 20.9 % 19.1 % 1Above adjusted operating income margin for Q4 2023 includes a 1.4 percentage point headwind \r\nfrom restructuring related net charges.\n\nGAAP earnings per share of $1.70 and operating margin of 15.5%. Adjusted EPS of $2.42 includes pre-tax restructuring related net charges of $109 million, or negative $0.17 per share.\n\nAdjusted EPS up 11 percent year-on-year. Adjusted operating income margin of 20.9% includes a 1.4 percentage point headwind from restructuring related net charges.\n\nAdjusted operating income margin expanded 1.8 percentage points year-on-year.\n\nStory continues\n\nGAAP Adjusted (Non-\r\nGAAP) Net sales (Millions) $8,013 $7,693 Sales change Total sales  (0.8) % (0.3) % Components of sales change: Organic sales2 (1.9) % (1.4) % Acquisitions/divestitures 0.2 % 0.2 % Translation 0.9 % 0.9 % Adjusted sales excludes manufactured PFAS products. 2Above adjusted organic sales decline includes a 60 basis point headwind from the decline in \r\ndisposable respirator demand.\n\nSales of $8.0 billion, down 0.8 percent year-on-year, with organic sales decline of 1.9 percent year-on-year. Adjusted sales of $7.7 billion, down 0.3 percent year-on-year with adjusted organic sales decline of 1.4 percent year-on-year. Operating cash flow of $2.0 billion, up 3 percent year-on-year; adjusted free cash flow of $2.0 billion, up 18 percent year-on-year. 3M returned $828 million to shareholders via dividends.\n\nThe above includes reference to certain non-GAAP measures. See the \"Supplemental Financial Information Non-GAAP Measures\" section for applicable information.\n\nFull-Year Highlights:\n\nFull Year \r\n2023 Full Year \r\n2022 GAAP earnings (loss) per share $      (12.63) $        10.18 Special items: Impact of Combat Arms Earplug (CAE) settlement 5.94 — Impact of public water systems (PWS) settlement 14.45 — Other net costs for significant litigation  0.61 3.20 Other special items, net 0.87 (3.50) Adjusted earnings per share (EPS) $          9.24 $          9.88 Memo: GAAP operating income (loss) margin (27.9) % 19.1 % Adjusted operating income margin1 20.3 % 21.1 % 1Above adjusted operating income margin for full year 2023 includes a 1.4 percentage point\r\nheadwind from restructuring related net charges.\n\nGAAP loss per share of $12.63 and operating margin of minus 27.9% includes the previously announced settlements for CAE and PWS in the United States regarding PFAS, resulting in a pre-tax charges of $4.3 billion and $10.5 billion, respectively, negatively impacting EPS by a total of $20.39. Adjusted EPS of $9.24 includes pre-tax restructuring related net charges of $441 million, or negative $0.65 per share. Adjusted operating income margin of 20.3% includes a 1.4 percentage point headwind from restructuring related net charges.\n\nGAAP Adjusted (Non-\r\nGAAP) Net sales (Millions) $32,681 $31,392 Sales change Total sales  (4.5) % (4.5) % Components of sales change: Organic sales2 (3.2) % (3.2) % Acquisitions/divestitures (0.7) % (0.8) % Translation (0.6) % (0.5) % Adjusted sales excludes manufactured PFAS products. 2Above adjusted organic sales decline includes a 1.9 percentage point headwind from the decline in \r\ndisposable respirator demand, along with the 2022 exit of Russia.\n\nSales of $32.7 billion, down 4.5 percent year-on-year, with organic sales decline of 3.2 percent year-on-year. Adjusted sales of $31.4 billion, down 4.5 percent year-on-year with adjusted organic sales decline of 3.2 percent year-on-year. Operating cash flow of $6.7 billion, up 19 percent year-on-year; adjusted free cash flow of $6.3 billion, up 30 percent year-on-year. Year-on-year improvement driven by ongoing focus on working capital management, especially inventory. 3M returned $3.3 billion to shareholders via dividends.\n\nThe above includes reference to certain non-GAAP measures. See the \"Supplemental Financial Information Non-GAAP Measures\" section for applicable information.\n\nFull-Year 2024 Outlook\n\n3M provided the following full-year 2024 expectations. This 2024 outlook continues to reflect the Health Care business as part of the company for the full year, but does not reflect the potential impact of funding amounts due under the PWS and CAE legal settlements absent receipt of cash payments in the Health Care business spin.\n\nAdjusted total sales growth3 in the range of 0.25 to 2.25 percent, reflecting adjusted organic sales3 growth of flat to up 2 percent. Adjusted EPS3 in the range of $9.35 to $9.75. Adjusted operating cash flow3 of $6.5 to $7.1 billion, contributing to 95 to 105 percent adjusted free cash flow conversion3.\n\nThe above does not reflect, for reasons described at 3, the potential impact of funding amounts under the PWS and CAE settlements absent cash received in the Health Care spin. However, for illustrative purposes only, adjusted EPS3 could be impacted up to an estimated ($0.20) from complete debt financing of these settlements based on current market and company expectations.\n\n3As further discussed at 7 within the \"Supplemental Financial Information Non-GAAP Measures\" section, 3M cannot, without unreasonable effort, forecast certain items required to develop meaningful comparable GAAP financial measures and, therefore, does not provide them on a forward-looking basis reflecting these items.\n\nConference Call\n\n3M will conduct an investor teleconference at 9 a.m. EST (8 a.m. CST) today. Investors can access this conference via the following:\n\nLive webcast at https://investors.3M.com Live telephone:\r\nCall 800-762-2596 within the U.S. or +1 212-231-2916 outside the U.S. Please join the call at least 10 minutes before the start time. Webcast replay at https://investors.3m.com/financials/quarterly-earnings Telephone replay:\r\nCall 800-633-8284 within the U.S. or +1 402-977-9140 outside the U.S. (for both U.S. and outside the U.S., the access code is 22028938). The telephone replay will be available until 11:30 a.m. EST (10:30 a.m. CST) on January 30, 2024.\n\nConsolidated Financial Statements and Supplemental Financial Information Non-GAAP Measures\n\nView the Financial Statement Information on 3M's website: https://investors.3m.com/financials/quarterly-earnings\n\nForward-Looking Statements\n\nThis news release contains forward-looking information about 3M's financial results and estimates and business prospects that involve substantial risks and uncertainties. You can identify these statements by the use of words such as \"plan,\" \"expect,\" \"aim,\" \"believe,\" \"project,\" \"target,\" \"anticipate,\" \"intend,\" \"estimate,\" \"will,\" \"should,\" \"could,\" \"would,\" \"forecast\" and other words and terms of similar meaning in connection with any discussion of future operating or financial performance or business plans or prospects. Among the factors that could cause actual results to differ materially are the following: (1) worldwide economic, political, regulatory, international trade, geopolitical, capital markets and other external conditions and other factors beyond the Company's control, including inflation, recession, military conflicts, natural and other disasters or climate change affecting the operations of the Company or its customers and suppliers; (2) foreign currency exchange rates and fluctuations in those rates; (3) risks related to certain fluorochemicals, including liabilities related to claims, lawsuits, and government regulatory proceedings concerning various PFAS-related products and chemistries, as well as risks related to the Company's plans to exit PFAS manufacturing and discontinue use of PFAS across its product portfolio; (4) risks related to the proposed class-action settlement (\"PWS Settlement\") to resolve claims by public water systems in the United States regarding PFAS, including whether court approval of the PWS Settlement will be obtained, whether the number of plaintiffs that opt out of the PWS Settlement will exceed current expectations or will exceed the level that would permit 3M to terminate the PWS Settlement (and whether 3M will elect to terminate the PWS Settlement if this occurs), whether the PWS Settlement is appealed, the timing and amount of payments made under the PWS Settlement, and the impact of the PWS Settlement on other PFAS-related matters; (5) legal proceedings, including significant developments that could occur in the legal and regulatory proceedings described in the Company's Annual Report on Form 10-K for the year ended Dec. 31, 2022 and any subsequent quarterly reports on Form 10-Q (the \"Reports\"); (6) competitive conditions and customer preferences; (7) the timing and market acceptance of new product and service offerings; (8) the availability and cost of purchased components, compounds, raw materials and energy due to shortages, increased demand and wages, supply chain interruptions, or natural or other disasters; (9) unanticipated problems or delays with the phased implementation of a global enterprise resource planning (ERP) system, or security breaches and other disruptions to the Company's information technology infrastructure; (10) the impact of acquisitions, strategic alliances, divestitures, and other strategic events resulting from portfolio management actions and other evolving business strategies; (11) operational execution, including the extent to which the Company can realize the benefits of planned productivity improvements, as well as the impact of organizational restructuring activities; (12) financial market risks that may affect the Company's funding obligations under defined benefit pension and postretirement plans; (13) the Company's credit ratings and its cost of capital; (14) tax-related external conditions, including changes in tax rates, laws or regulations; (15) matters relating to the proposed spin-off of the Company's Health Care business, including whether the transaction will be completed, or if completed, will be on the expected terms; the risk that the expected benefits will not be realized; the risk that the costs or dis-synergies will exceed the anticipated amounts; the ability to satisfy the various closing conditions; potential business disruption; the diversion of management time; the impact of the transaction (or its pendency) on the Company's ability to retain talent; potential impacts on the Company's relationships with its customers, suppliers, employees, regulators and other counterparties; the ability to realize the desired tax treatment (including whether an Internal Revenue Service private letter ruling will be sought or obtained); the risk that any consents or approvals required will not be obtained; risks associated with financings that may be undertaken and indebtedness that may be incurred in connection with the transaction; and (16) matters relating to Combat Arms Earplugs (\"CAE\"), including those relating to, the August 2023 settlement that is intended to resolve, to the fullest extent possible, all litigation and alleged claims involving the CAE sold or manufactured by the Company's subsidiary Aearo Technologies and certain of its affiliates (\"Aearo Entities\") and/or 3M (\"CAE Settlement\"), including, but not limited to, whether the anticipated participation by plaintiffs in the CAE Settlement will be achieved, whether the number of plaintiffs that participate in the CAE Settlement will meet current expectations or will fall below the level that would permit 3M to terminate the CAE Settlement (and whether 3M will elect to terminate the CAE Settlement if this occurs), whether there will be a significant number of future claims by plaintiffs that decline to participate in the CAE Settlement, whether the CAE Settlement is appealed or challenged, matters related to the potential issuance of the equity securities that are contemplated to be part of the CAE Settlement, the filing of additional, or the outcome of any other pending or future, litigation relating to the products that are the subject of the CAE Settlement, or changes in related laws or regulations. Changes in such assumptions or factors could produce significantly different results. A further description of these factors is located in the Reports under \"Cautionary Note Concerning Factors That May Affect Future Results\" and \"Risk Factors\" in Part I, Items 1 and 1A (Annual Report) and in Part I, Item 2 and Part II, Item 1A (Quarterly Reports). The Company assumes no obligation to update any forward-looking statements discussed herein as a result of new information or future events or developments.\n\nAbout 3M\n\n3M (NYSE: MMM) believes science helps create a brighter world for everyone. By unlocking the power of people, ideas and science to reimagine what's possible, our global team uniquely addresses the opportunities and challenges of our customers, communities, and planet. Learn how we're working to improve lives and make what's next at 3M.com/news.\n\nPlease note that the company announces material financial, business and operational information using the 3M investor relations website, SEC filings, press releases, public conference calls and webcasts. The company also uses the 3M News Center and social media to communicate with our customers and the public about the company, products and services and other matters. It is possible that the information 3M posts on the News Center and social media could be deemed to be material information. Therefore, the company encourages investors, the media and others interested in 3M to review the information posted on 3M's news center and the social media channels such as @3M or @3MNews.\n\nContacts 3M Investor Contacts: Bruce Jermeland, 651-733-1807\r\nor\r\nDiane Farrow, 612-202-2449\r\nor\r\nEric Herron, 651-233-0043\r\nMedia Contact: Tim Post, tpost3@mmm.com 3M (PRNewsfoto/3M) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/3m-delivers-strong-fourth-quarter-results-improves-operational-performance-and-exceeds-earnings-and-cash-flow-expectations-302041325.html\n\nSOURCE 3M Company", "link": "https://finance.yahoo.com/news/3m-delivers-strong-fourth-quarter-113000128.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.044, "neu": 0.852, "pos": 0.104}}, {"date": "2024-01-23T08:08:27+00:00", "title": "3M full-year earnings forecast misses Wall Street estimates", "content": "Investing.com -- Diversified manufacturing conglomerate 3M (NYSE:MMM) has unveiled an annual earnings forecast that was below Wall Street estimates, sending shares sharply lower in premarket U.S. trading on Tuesday.\n\nMinnesota-based 3M guided for adjusted income per share of $9.35 to $9.75, missing Bloomberg consensus predictions of $9.81.\n\nIn a statement, the company noted that the outlook does not reflect the potential impact of recent settlements in legal battles involving public water systems and U.S. military earplugs.\n\n3M received preliminary approval last year for a $10.3 billion resolution to claims brought by U.S. public water providers that its products had contaminated drinking water with toxic chemicals. The company also agreed to pay $6.01 billion to settle roughly 260,000 lawsuits from current and former U.S. veterans who said they had developed hearing issues as a result of faulty earplugs.\n\nIn September, 3M flagged that it would face a \"slow growth environment\" in 2024, as well as weakness at its electronics and consumer divisions in the third and fourth quarters.\n\nAdjusted income per share came in at $2.42 in the final three months of 2023, a rise of 11% compared to the corresponding period last year, although net sales slumped by 0.8% to $8.01B.\n\nUpgrade your investing with our groundbreaking, AI-powered InvestingPro+ stock picks. Use coupon PROPLUSBIYEARLY to get a limited time discount on our Pro and Pro+ subscription plans. Click here to find out more, and don't forget to use the discount code when checking out!\n\nRelated Articles\n\n3M full-year earnings forecast misses Wall Street estimates\n\nUS FDA seeks 'boxed warning' for CAR-T cancer therapies\n\nTesla reclaims top spot as best-selling EV startup in China", "link": "https://finance.yahoo.com/news/3m-full-earnings-forecast-misses-080827898.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": -0.704, "neg": 0.089, "neu": 0.839, "pos": 0.072}}, {"date": "2024-01-23T08:00:20+00:00", "title": "United Airlines, Verizon and Fisker rise premarket; 3M, General Electric fall", "content": "Investing.com -- U.S. futures edged lower Tuesday, consolidating after recent gains as the earnings season kicks into full gear.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nUnited Airlines (NASDAQ:UAL) stock rose 6.4% after the carrier reported strong fourth-quarter results, thanks in part to its \"busiest\" travel period ever in the last two weeks of December, but it said it expects a wider-than-expected loss in its current quarter.\n\nVerizon (NYSE:VZ) stock rose 4.6% after the telecommunications giant said it was \"well-positioned\" for growth in 2024, as it unveiled an annual earnings forecast range that was above expectations.\n\nJohnson & Johnson (NYSE:JNJ) stock fell 0.3% after the pharmaceutical giant reiterated its full-year guidance for 2024 even after its fourth-quarter results beat expectations.\n\n3M (NYSE:MMM) stock fell 6.9% after the industrial conglomerate unveiled an annual earnings forecast that was below expectations, noting that the outlook does not reflect the potential impact of recent settlements in legal battles involving public water systems and U.S. military earplugs.\n\nProcter & Gamble (NYSE:PG) stock rose 0.9% despite the consumer goods giant cutting its annual profit forecast as the boost from earlier price hikes fades and on writing down the value of its Gillette business in December.\n\nGeneral Electric  (NYSE:GE) stock fell 3.3% after the industrial conglomerate disappointed with its first-quarter outlook even as its fourth-quarter earnings came in ahead of expectations on strong demand for parts and services at its jet engine business.\n\nCoinbase (NASDAQ:COIN) stock fell 4.3%, with the cryptocurrency exchange hurt after bitcoin, the most popular digital currency, fell below the $40,000-mark, hitting a more than seven-week low.\n\nExxon Mobil  (NYSE:XOM) stock rose 0.2% after TD Cowen upgraded the oil major to ‘outperform’ from ‘market perform’, citing an attractive valuation.\n\nStory continues\n\nArcher-Daniels-Midland (NYSE:ADM) stock rose 2.1%, rebounding after slumping 24% on Monday following the announcement of an investigation into accounting practices in the company’s Nutrition segment.\n\nHalliburton (NYSE:HAL) stock rose 1.7% after the oil services company’s fourth-quarter profit beat expectations on strength for offshore and overseas drilling activities internationally.\n\nFisker (NYSE:FSR) stock rose 9.7% after the EV startup said it expects to sell all its nearly 5,000 unsold vehicles made last year by the end of the first quarter and that its newly announced dealer-partner model has gained traction.\n\nUpgrade your investing with our groundbreaking, AI-powered InvestingPro+ stock picks. Use coupon INVESTINGPRO+24 to get a limited time discount on our Pro+ subscription plans. Click here to find out more, and don't forget to use the discount code when checking out!\n\nRelated Articles\n\nUnited Airlines, Verizon and Fisker rise premarket; 3M, General Electric fall\n\nUS stocks mixed on earnings deluge; Netflix to report after close\n\nWells Fargo downgrades Bill.com on 'growing list of risks'", "link": "https://finance.yahoo.com/news/united-airlines-verizon-fisker-rise-080020995.html", "symbols": ["ADM.F", "ADM.MX", "ADM.US", "ADM.XETRA", "BAC.F", "BAC.XETRA", "COIN.US", "EXXO34.SA", "FSR.US", "GE.MX", "GE.SW", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "HAL.F", "HAL.MX"], "tags": [], "sentiment": {"polarity": 0.982, "neg": 0.056, "neu": 0.83, "pos": 0.114}}, {"date": "2024-01-23T05:04:15+00:00", "title": "Futures muted after stocks surge, earnings wave ahead - what's moving markets", "content": "Investing.com -- U.S. stock were muted on Tuesday, as investors looked ahead to a bevy of quarterly corporate earnings and crucial economic data. Elsewhere, the Securities and Exchange Commission says a bad actor used a SIM-swapping attack to take control of its X account prior to a false post on the social media platform claiming the agency had approved a new Bitcoin-linked investment instrument, while the Bank of Japan maintains a dovish policy stance and lowers its inflation forecast for the coming fiscal year.\n\n1. Futures muted\n\nU.S. stock futures mostly hovered around the flatline on Tuesday, after equities surged in the previous session on hopes for strong upcoming corporate earnings and ongoing enthusiasm around artificial intelligence.\n\nBy 04:52 ET (09:52 GMT), the contracts for S&P 500 futures, Nasdaq 100 futures, and Dow futures were broadly unchanged.\n\nA recent rally in the main averages continued on Monday, with the benchmark S&P 500 in particular jumping to its third-straight positive close for the first time this year. The tech-heavy Nasdaq Composite also rose by 0.3% despite small declines in most of the so-called Magnificent Seven megacap stocks. Meanwhile, the 30-stock Dow Jones Industrial Average climbed above 38,000 for the first time.\n\nStocks had logged a weak start to the year, but have since rebounded, partly due to investor optimism for a \"soft landing\" for the U.S. economy. In this scenario, elevated interest rates would contribute to a cooling in inflation without sparking a steep slowdown in economic activity.\n\n\"The thought of a soft landing actually [materializing] against all odds are supporting risk assets in all corners of the market,\" analysts at ING said in a note.\n\n2. Earnings parade intensifies\n\nThe upbeat sentiment will face a series of tests this week from a fresh batch of corporate earnings and key economic data.\n\nSeveral big-name brands are set to report their latest quarterly results on Tuesday, pharmaceutical giant Johnson & Johnson (NYSE:JNJ), consumer goods behemoth Procter & Gamble (NYSE:PG), and diversified manufacturing conglomerate 3M (NYSE:MMM) before the start of U.S. trading. After the bell, traders will be keeping an eye out for figures from streaming group Netflix (NASDAQ:NFLX) and chipmaker Texas Instruments (NASDAQ:TXN).\n\nStory continues\n\nUnited Airlines (NASDAQ:UAL) post fourth-quarter adjusted profit per share that topped estimates following its \"busiest travel period in history\" last month, boosting shares in premarket U.S. trading. Fellow carriers American Airlines (NASDAQ:AAL) and Delta Air Lines (NYSE:DAL) rose in the wake of the numbers.\n\nLater in the week, traders will be keeping an eye out for the first reading of U.S. gross domestic product in the final three months of 2023, as well as the Federal Reserve's preferred gauge of inflation for December.\n\n3. SEC says false X post linked to phone number swap\n\nThe top U.S. securities regulator said that a false post that appeared to announce its approval of a spot Bitcoin exchange-traded fund came after a bad actor took control of the phone number associated with its account on social media platform X.\n\nIn a statement on Monday, the Securities and Exchange Commission said it was the victim of a \"SIM swap\" attack, a technique used to transfer a person's phone number to another device without authorization. The unauthorized party then reset the password for the X account, the SEC added.\n\n\"Among other things, law enforcement is currently investigating how the unauthorized party got the carrier to change the SIM for the account and how the party knew which phone number was associated with the account,\" the agency noted.\n\nThe fake post on Jan. 9 said the SEC had given a much-anticipated green light to ETFs tracking the spot price of Bitcoin, sparking a frenzy of trading activity around the world's most recognizable cryptocurrency. The validity of the statement was denied by the SEC, which formally approved the ETFs a day later.\n\n4. BOJ leaves dovish stance unchanged\n\nThe Bank of Japan kept interest rates at historical lows on Tuesday and its yield curve control policies unchanged, but slightly lowered its inflation outlook for fiscal 2024.\n\nThe BOJ left its short-term interest rates at negative 0.1%, and said it will maintain its yield curve control mechanism in allowing 10-year yields to fluctuate in a range of negative 1% to 1%, with a target of 0%. The central bank also offered no changes to its asset purchase programs.\n\nIn an announcement on Tuesday, the BOJ added that it expects consumer price index (CPI) inflation to keep trending above its 2% annual target through fiscal 2024, and that price growth will only begin easing by the 2025 fiscal year.\n\nBut a majority of the BOJ's policy board members slashed their CPI inflation forecasts for fiscal 2024. Median forecasts for core CPI inflation, which excludes fresh food prices, were now at 2.4% during the period, down from the October forecast of 2.8%.\n\n5. Oil retreats\n\nOil prices were lower on Tuesday, reversing earlier gains that were driven by a fresh round of strikes by U.S. and British forces on Houthi sites in Yemen.\n\nThe Iran-backed Houthis, who control the most populous parts of Yemen, have disrupted global shipping through the Red Sea, raising concerns that crude supply to the important Asian market will be impacted. The group has said their attacks are in solidarity with Palestinians as Israel strikes Gaza.\n\nBy 04:54 ET, the U.S. crude futures traded 0.6% lower at $74.31 a barrel, while the Brent contract slipped 0.6% to $79.59 per barrel.\n\nThe latest reading of U.S. crude inventories, from the industry body American Petroleum Institute, is due later in the session, and is forecast to fall by about 3 million barrels in the week to Jan. 19.\n\nUpgrade your investing with our groundbreaking, AI-powered InvestingPro+ stock picks. Use coupon PROPLUSBIYEARLY to get a limited time discount on our Pro and Pro+ subscription plans. Click here to find out more, and don't forget to use the discount code when checking out!\n\nRelated Articles\n\nFutures muted after stocks surge, earnings wave ahead - what's moving markets\n\nGerman president, businesses visit Vietnam eyeing investment\n\nMost euro zone banks face risk from climate complacency, ECB finds", "link": "https://finance.yahoo.com/news/futures-muted-stocks-surge-earnings-050415044.html", "symbols": ["AAL.US", "DAL.US", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "JNJ.US", "MMM.US", "NFLX.US", "PG.US", "TXN.US", "UAL.US"], "tags": [], "sentiment": {"polarity": 0.953, "neg": 0.082, "neu": 0.813, "pos": 0.105}}, {"date": "2024-01-23T00:00:00+00:00", "title": "3 Dogs of the Dow With Dividend Yields Above 4%", "content": "These three Dogs of the Down represent companies that sport impressive yields and long histories of dividend increases.", "link": "https://investorplace.com/2024/01/3-dogs-of-the-dow-with-dividend-yields-above-4-percent/", "symbols": ["IBM.US", "MMM.US", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.511, "neg": 0, "neu": 0.837, "pos": 0.163}}, {"date": "2024-01-23T00:00:00+00:00", "title": "3 High-Yield Dividend Stocks to Buy for Massive Passive Income", "content": "Here are three top dividend stocks long-term investors seeking passive income may want to consider as we kick off a new year.", "link": "https://investorplace.com/2024/01/3-high-yield-dividend-stocks-to-buy-for-massive-passive-income/", "symbols": ["DVN.US", "MMM.US", "T.US"], "tags": [], "sentiment": {"polarity": 0.44, "neg": 0, "neu": 0.786, "pos": 0.214}}, {"date": "2024-01-22T22:22:01+00:00", "title": "Netflix earnings, NH primary, Oscar nominees: What to Watch", "content": "Yahoo Finance Live anchors Julie Hyman and Josh Lipton preview the top stories for Tuesday, January 23, which investors should watch closely, including Netflix earnings (NFLX), Nikki Haley's New Hampshire primary race between former President Donald Trump, and the Oscars are revealing its nominations.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Luke Carberry Mogan.", "link": "https://finance.yahoo.com/video/netflix-earnings-nh-primary-oscar-222201012.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "NFC.F"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0, "neu": 0.976, "pos": 0.024}}, {"date": "2024-01-22T18:38:11+00:00", "title": "Income Investors Alert: 3 High-Yield Dividend Stocks to Buy Now", "content": "Inflation is cooling, and there are positive signs of the economy improving. We can expect rate cuts by May, and the ongoing earnings season could take stocks higher. The economy might be showing signs of positivity today, but you need to be prepared for anything that comes your way. As an investor, it helps to build a portfolio of resilient stocks that can thrive in any market situation. If you are an investor like me, you would prefer to build a stock portfolio that not only performs in tough times but also generates steady passive income. Dividend stocks are the best way to build wealth. Choose companies that have been paying dividends for several years and have also increased the payout with time. Here are my top three high-yield dividend stocks to buy.\n\nHigh-Yield Dividend Stocks to Buy: PepsiCo (PEP) Pepsi (PEP) Factory in Samara, Russia. Pepsi logo on a blue warehouse.\n\nSource: FotograFFF / Shutterstock\n\nIf you are looking to buy only one dividend stock, it has to be PepsiCo (NASDAQ:PEP). The global giant has a massive market to cater to and holds a range of brands under its umbrella. Pepsi is so much more than just a beverage stock and it has some of the most popular snack brands under its name. The company enjoys loyalty, pricing power and the ability to keep growing even in times of high inflation. Its snacking division has been a huge winner recently and has witnessed growth when consumer spending was low.\n\nTrading at $165 today, the stock has dropped 13% in the past six months, making it a great buying opportunity. Pepsi has a dividend yield of 3.06% and pays a quarterly dividend of $1.26, which is $5.06 per share annually. The company raised its dividend payments for the past 52 consecutive years. That says a lot about its commitment to reward shareholders.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nFundamentally, PepsiCo is a stable business with organic revenue growth of 8.8% in the third quarter. Its revenue stood at $23 billion, while EPS was $2.25. The company is expecting a 7.4% rise in earnings in the next 12 months.\n\nStory continues\n\nWhile the company is planning modest hikes this year, it has already proved it enjoys a pricing power, and a price hike doesn’t impact the business. Pepsi’s diversified portfolio ensures consistent growth, and we could see solid fourth-quarter results very soon. Buy the stock while it is trading at a discount.\n\n3M (MMM) 3M logo on top of a corporate building. MMM stock\n\nSource: JPstock / Shutterstock.com\n\n3M (NYSE:MMM) is an industrial company that manufactures energy solutions, cleaning supplies, automotive equipment and personal protective equipment. The company has had a tough time with recent lawsuits, but I think it is handling the ups and downs well. It has a strong presence across multiple industries, which shields it during tough times.\n\nMMM stock is trading for $107, and it has an impressive dividend yield of 5.57%. The company pays out an annual dividend of $6 per share, better than several other dividend-paying companies in the industry.\n\n3M has paid dividends for over 100 years, and I think it has enough liquidity to keep rewarding shareholders. Once the company completes the payment of the ear plug lawsuit settlement, it will be in a better financial position. As part of this settlement, the company will have to pay $5 billion in cash and $1 billion in common stock between 2023 and 2029.\n\nFundamentally, the company has shown impressive growth in the third quarter and saw sales of $8.3 billion. Free cash flow came in at $1.9 billion, up 39% year-over-year (YoY). Following the results, management raised the full-year adjusted EPS and free cash flow expectations. The business has also taken restructuring moves, which can help the stock move upwards.\n\nWith a dividend payout of around 66%, 3M is one of the best high-yield dividend stocks to buy now. The stock might take time to soar, but it will continue generating passive income for you in the years to come.\n\nStarbucks (SBUX)\n\nSource: Shutterstock\n\nStarbucks (NASDAQ:SBUX) is a no-brainer dividend stock to own this year. It is a highly underrated stock trading at $93 today. Buying the stock below $100 is a very smart move. The stock is down 11% in the past year and is much lower than its 52-week high of $115. SBUX stock looks cheap to me, considering the high-quality business and global positioning of the company.\n\nThe company plans to increase the locations and ticket volumes and take more orders. It aims to expand to more than 55,000 locations by 2030 and is already on an aggressive expansion spree in India. Starbucks aims to open two stores each week in the country and gain exposure in the most populous nation in the world.\n\nStarbucks has raised dividends for 14 consecutive years and has become a highly reliable dividend stock today. It has a dividend yield of 2.45% and pays an annual dividend of $2.28 per share.\n\nIt reported blowout results in the third quarter with a record-high quarterly revenue of $9.2 billion, up 12% YoY. At the end of the quarter, its store count was 37,000, out of which 588 were newly opened that quarter. Starbucks could have an excellent 2024, and the stock is one of the best buys right now. Piper Sandler (NYSE:PIPR) analysts have a price target of $100 for the stock.\n\nOn the date of publication, Vandita Jadeja did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nVandita Jadeja is a CPA and a freelance financial copywriter who loves to read and write about stocks. She believes in buying and holding for long term gains. Her knowledge of words and numbers helps her write clear stock analysis.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\n\nThe post Income Investors Alert: 3 High-Yield Dividend Stocks to Buy Now appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/income-investors-alert-3-high-183811378.html", "symbols": ["MMM.US", "PEP.MX", "PEP.US", "PEP.XETRA", "PEPB34.SA", "PIPR.US", "SBUB34.SA", "SBUX.MX", "SBUX.US", "SRB.F", "SRB.XETRA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.017, "neu": 0.8, "pos": 0.183}}, {"date": "2024-01-22T17:36:52+00:00", "title": "Tesla earnings, PCE inflation data: What to Watch This Week", "content": "The days ahead are set to be busy as fourth-quarter earnings results roll out. Yahoo Finance’s Rachelle Akuffo and Akiko Fujita break down the top companies set to report earnings this week, including Tesla (TSLA), as well as key inflation data like the Personal Consumption Expenditures (PCE) index due out Friday.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Eyek Ntekim", "link": "https://finance.yahoo.com/video/tesla-earnings-pce-inflation-data-173652088.html", "symbols": ["0M3L.LSE", "0R3C.LSE", "AEC1.F", "AEC1.XETRA", "ALK.F", "ALK.US", "AXP.BA", "AXP.MX", "AXP.US", "AXPB34.SA", "BOH.US", "CL.MX", "CL.US", "CMCS34.SA", "CMCSA.MX", "CMCSA.US", "CPA.F", "CPA.XETRA", "CTP2.F", "IBM.F"], "tags": [], "sentiment": {"polarity": 0.66, "neg": 0, "neu": 0.923, "pos": 0.077}}, {"date": "2024-01-22T15:38:52+00:00", "title": "How To Earn $500 A Month From 3M Stock Ahead Of Q4 Earnings Print", "content": "3M Company (NYSE: MMM) is expected to release earnings results for its fourth quarter before the opening bell on Jan. 23, 2024.\n\nAnalysts expect the Saint Paul, Minnesota-based company to report quarterly earnings at $2.31 per share on revenue of $7.70 billion, according to data from Benzinga Pro.\n\n3M recently received $34.2 million award to improve treatment of traumatic wounds from point-of-injury to hospital.\n\nRead This: Top 4 Tech And Telecom Stocks That May Crash In January\n\nWith the recent buzz around 3M, some investors may be eyeing potential gains from the company’s dividends, too. 3M currently offers an annual dividend yield of 5.57% — a quarterly dividend amount of $1.50 per share ($6.00 a year).\n\nInvestors can exploit this dividend yield to pocket a regular $500 monthly:\n\nTo earn $500 per month or $6,000 annually from dividends alone, you would need an investment of approximately $107,760 or around 1,000 shares. For a more modest $100 per month or $1,200 per year, you would need $21,552 or around 200 shares.\n\nView more earnings on MMM\n\nTo calculate:  Divide the desired annual income ($6,000 or $1,200) by the dividend ($6.00 in this case). So, $6,000 / $6.00 = 1,000 ($500 per month), and $1,200 / $6.00 = 200 shares ($100 per month).\n\nNote that dividend yield can change on a rolling basis, as the dividend payment and the stock price both fluctuate over time.\n\nHow that works:  The dividend yield is computed by dividing the annual dividend payment by the stock's current price.\n\nFor example, if a stock pays an annual dividend of $2 and is currently priced at $50, the dividend yield would be 4% ($2/$50). However, if the stock price increases to $60, the dividend yield drops to 3.33% ($2/$60). Conversely, if the stock price falls to $40, the dividend yield rises to 5% ($2/$40).\n\nSimilarly, changes in the dividend payment can impact the yield. If a company increases its dividend, the yield will also increase, provided the stock price stays the same. Conversely, if the dividend payment decreases, so will the yield.\n\nStory continues\n\nMMM Price Action: Shares of 3M gained 1.2% to close at $107.76 on Friday.\n\nRead More: Hedge funds intend to snatch all pre-IPO shares of future AI unicorns before you can.  But there is one venture product investing on your behalf.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nThis article How To Earn $500 A Month From 3M Stock Ahead Of Q4 Earnings Print originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/earn-500-month-3m-stock-153852531.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.964, "neg": 0.027, "neu": 0.894, "pos": 0.079}}, {"date": "2024-01-22T05:22:20+00:00", "title": "Futures higher, FAA recommends more Boeing safety checks - what's moving markets", "content": "Investing.com -- U.S. stock futures gain on Monday, in a possible sign of ongoing upward momentum after a tech-fueled surge in equities last week. The U.S. aviation authority recommends new safety checks on Boeing (NYSE:BA) planes that have similar features to a jet model involved in a mid-air door plug breach earlier this month. Sony (NYSE:SONY) pulls the plug on a mega-merger with India's Zee Entertainment, sparking a potential legal battle.\n\n1. Futures inch higher\n\nU.S. stock futures edged into the green on Monday, pointing to a continuation in an artificial intelligence-powered rally that pushed the benchmark S&P 500 up to its first record high close in two years in the prior session.\n\nBy 05:17 ET (10:17 GMT), the S&P 500 futures contract had added 14 points or 0.3%, Nasdaq 100 futures had gained 95 points or 0.6%, and Dow futures had climbed by 53 points or 0.1%.\n\nThe main averages on Wall Street all ended Friday more than 1% higher, fueled by an upgraded second-quarter profit forecast from server maker Super Micro Computer (NASDAQ:SMCI). The bullish outlook drove a steep jump in AI chipmakers Nvidia (NASDAQ:NVDA) and Advanced Micro Devices (NASDAQ:AMD), as a well as a surge in the Philadelphia SE Semiconductor Index to a fresh all-time high.\n\nEnthusiasm around AI had been bolstered earlier in the week by top contract chipmaker TSMC, which forecast a 20% increase in revenue this year thanks to soaring demand for the potential applications of the nascent technology.\n\nFollowing a day of heavy volume on U.S. exchanges, the S&P 500 rose by 1.23%, the tech-heavy Nasdaq Composite added 1.7%, and the 30-stock Dow Jones Industrial Average gained 1.05%.\n\n2. FAA recommends further Boeing checks\n\nThe U.S. aviation authority has recommended that airlines carry out inspections of door plugs on Boeing 737-900ER aircraft, saying that they have an identical design to a jet involved in a dangerous mid-air breach earlier this month.\n\nIn a statement released late on Sunday, the Federal Aviation Administration said that operators of the 737-900ER are \"encouraged to conduct a visual inspection\" to ensure that the door plug is \"restrained from any movements.\" The FAA said the move is designed to create \"an added layer of safety.\"\n\nStory continues\n\nThe FAA added that some operators have \"noted findings\" with bolts on the 737-900ER in previous maintenance inspections of mid-exit door plugs. While it is not a part of Boeing's Max fleet, the 737-900ER has the same optional door plug seen in the U.S. planemaker's newer family of jets.\n\nBoeing, which has already come under intense scrutiny in recent years over safety concerns, has faced further pressure since a non-fatal blowout on its 737-9 Max model operated by Alaska Airlines on Jan. 5. The FAA grounded 171 of the 737-9 Max planes after the incident.\n\n3. Earnings season ramps up\n\nInvestors will be looking ahead to a slate of key earnings later this week, with big-name companies like Netflix (NASDAQ:NFLX), Tesla (NASDAQ:TSLA) and 3M (NYSE:MMM) all set to unveil their latest results.\n\nAnalysts have predicted that the quarterly figures will help determine the staying power of the S&P 500's recent rally.\n\n\"If [...] we find out that the market has either gotten ahead of itself [...] or we get guidance from some of these companies that doesn't match the bullish sentiment that's being priced into them, that can be a real risk,” Steve Sosnick, Chief Strategist at Interactive Brokers (NASDAQ:IBKR) told Reuters.\n\nOutside of the U.S., some of Europe's most high-profile tech firms are due to report, including chipmaker ASML (AS:ASML), computer accessories maker Logitech (NASDAQ:LOGI), software developer SAP (ETR:SAPG), and fashion behemoth LVMH (EPA:LVMH).\n\n4. Sony ends Zee merger talks\n\nSony has terminated merger discussions between its Indian unit and Zee Entertainment, putting an end to a long-running series of negotiations over a deal that would have created a $10 billion giant in one of the world's fastest-growing economies.\n\nThe Japanese group said in a statement that it had been unable to extend talks surrounding the agreement beyond a Jan. 21 closing date. First announced in 2021, the tie-up would have brought together two media powerhouses in India during a time of rising competition in the country.\n\nBut Sony told Reuters that unspecified closing conditions of the merger were \"not satisfied,\" adding that it was \"extremely disappointed\" but committed to growing its presence in India.\n\nZee, meanwhile, revealed in a securities filing that Sony was seeking a termination fee of $90 million and \"emergency interim reliefs.\" It refuted Sony's claims and vowed to take \"all necessary steps to safeguard the long-term interests of its stakeholders,\" including by taking legal action.\n\nReports suggested that the two companies were at odds over the leadership of the combined group, with Sony in particular refusing to allow Zee Chief Executive Punit Goenka take the helm of the business. However, Zee said on Monday that Goenka was \"agreeable to step down in the interest of the merger.\"\n\n5. Oil edges up\n\nOil prices moved higher on Monday, as worries about global crude demand were offset by ongoing geopolitical fears.\n\nBy 05:23 ET, the U.S. crude futures had risen 0.2% to $73.38 a barrel, while the Brent contract had climbed 0.2% to $78.68 per barrel.\n\nThe demand outlook remains muted. The U.S. Energy Information Administration, the Internal Energy Agency and the Organization of the Petroleum Exporting Countries all expect demand for crude to slow this year. Analysts have also flagged that growth in the U.S. -- the world's top oil consumer -- is expected to have decelerated in the fourth quarter.\n\nCounterbalancing these downward pressures on prices was continued violence in the Middle East over the weekend, with the U.S. striking another anti-ship missile being prepared to launch by Yemen-based Houthi militants into the Gulf of Aden. Attacks in the region, a crucial artery for shipping between Europe and Asia, have recently threatened to disrupt global trade by causing many firms to divert vessels away from the area.\n\nElsewhere, Ukraine allegedly carried out a drone attack on a Russian fuel export terminal over the weekend. Russian energy company Novatek said it had been forced to suspend some operations at the site due to a fire, Reuters reported.\n\nRelated Articles\n\nFutures higher, FAA recommends more Boeing safety checks - what's moving markets\n\nBrazil's economy to cool this year amid fiscal tug of war - Reuters poll\n\nFutures signal more steam in S&P 500 after record high", "link": "https://finance.yahoo.com/news/futures-higher-faa-recommends-more-052220390.html", "symbols": ["AMD.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "IBKR.US", "IXIC.INDX", "LOGI.US", "MMM.US", "NFLX.US", "NVDA.US", "SMCI.US", "SONY.US", "TSLA.US", "ZEEL.BSE", "ZEEL.NSE"], "tags": [], "sentiment": {"polarity": -0.546, "neg": 0.07, "neu": 0.842, "pos": 0.089}}, {"date": "2024-01-22T00:00:00+00:00", "title": "Income Investors Alert: 3 High-Yield Dividend Stocks to Buy Now", "content": "Consider these three high-yield dividend stocks to buy if you want to enjoy steady passive income throughout 2024.", "link": "https://investorplace.com/2024/01/income-investors-alert-3-high-yield-dividend-stocks-to-buy-now/", "symbols": ["MMM.US", "PEP.US", "SBUX.US"], "tags": [], "sentiment": {"polarity": 0.649, "neg": 0, "neu": 0.704, "pos": 0.296}}, {"date": "2024-01-21T14:12:38+00:00", "title": "3M Company (NYSE:MMM) is favoured by institutional owners who hold 65% of the company", "content": "Key Insights\n\nInstitutions' substantial holdings in 3M implies that they have significant influence over the company's share price The top 25 shareholders own 42% of the company Ownership research along with  analyst forecasts data  help provide a good understanding of opportunities in a stock\n\nA look at the shareholders of 3M Company (NYSE:MMM) can tell us which group is most powerful. The group holding the most number of shares in the company, around 65% to be precise, is institutions. In other words, the group stands to gain the most (or lose the most) from their investment into the company.\n\nBecause institutional owners have a huge pool of resources and liquidity, their investing decisions tend to carry a great deal of weight, especially with individual investors. Hence, having a considerable amount of institutional money invested in a company is often regarded as a desirable trait.\n\nLet's take a closer look to see what the different types of shareholders can tell us about 3M.\n\nSee our latest analysis for 3M  ownership-breakdown\n\nWhat Does The Institutional Ownership Tell Us About 3M?\n\nInstitutions typically measure themselves against a benchmark when reporting to their own investors, so they often become more enthusiastic about a stock once it's included in a major index. We would expect most companies to have some institutions on the register, especially if they are growing.\n\nAs you can see, institutional investors have a fair amount of stake in 3M. This can indicate that the company has a certain degree of credibility in the investment community. However, it is best to be wary of relying on the supposed validation that comes with institutional investors. They too, get it wrong sometimes. When multiple institutions own a stock, there's always a risk that they are in a 'crowded trade'. When such a trade goes wrong, multiple parties may compete to sell stock fast. This risk is higher in a company without a history of growth. You can see 3M's historic earnings and revenue below, but keep in mind there's always more to the story.\n\nStory continues earnings-and-revenue-growth\n\nInvestors should note that institutions actually own more than half the company, so they can collectively wield significant power. We note that hedge funds don't have a meaningful investment in 3M. The Vanguard Group, Inc. is currently the company's largest shareholder with 8.9% of shares outstanding. Meanwhile, the second and third largest shareholders, hold 7.2% and 6.4%, of the shares outstanding, respectively.\n\nOn studying our ownership data, we found that 25 of the top shareholders collectively own less than 50% of the share register, implying that no single individual has a majority interest.\n\nWhile studying institutional ownership for a company can add value to your research, it is also a good practice to research analyst recommendations to get a deeper understand of a stock's expected performance. Quite a few analysts cover the stock, so you could look into forecast growth quite easily.\n\nInsider Ownership Of 3M\n\nWhile the precise definition of an insider can be subjective, almost everyone considers board members to be insiders. Company management run the business, but the CEO will answer to the board, even if he or she is a member of it.\n\nI generally consider insider ownership to be a good thing. However, on some occasions it makes it more difficult for other shareholders to hold the board accountable for decisions.\n\nOur data suggests that insiders own under 1% of 3M Company in their own names. It is a very large company, so it would be surprising to see insiders own a large proportion of the company. Though their holding amounts to less than 1%, we can see that board members collectively own US$20m worth of shares (at current prices). Arguably recent buying and selling is just as important to consider. You can  click here to see if insiders have been buying or selling.\n\nGeneral Public Ownership\n\nWith a 35% ownership, the general public, mostly comprising of individual investors, have some degree of sway over 3M. This size of ownership, while considerable, may not be enough to change company policy if the decision is not in sync with other large shareholders.\n\nNext Steps:\n\nWhile it is well worth considering the different groups that own a company, there are other factors that are even more important. Case in point: We've spotted  2 warning signs for 3M you should be aware of.\n\nIf you would prefer discover what analysts are predicting in terms of future growth, do not miss this freereport on analyst forecasts.\n\nNB: Figures in this article are calculated using data from the last twelve months, which refer to the 12-month period ending on the last date of the month the financial statement is dated. This may not be consistent with full year annual report figures.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.", "link": "https://finance.yahoo.com/news/3m-company-nyse-mmm-favoured-141238861.html", "symbols": ["MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.029, "neu": 0.855, "pos": 0.116}}, {"date": "2024-01-21T11:01:00+00:00", "title": "Will 3M's High-Yielding Dividend Face the Same Fate as Walgreens' Once-Mighty Payout?", "content": "This year marked the end of an era for Walgreens Boots Alliance (NASDAQ: WBA). The pharmacy and retail giant slashed its dividend by 48% to start this year, ending a streak of 47 straight years of increases. Before that reduction, the company had one of the highest dividend yields in the S&P 500 at around 7.5%.\n\nWalgreens' decision to throw in the towel on its long-standing dividend growth streak might make 3M (NYSE: MMM) investors nervous. The industrial giant also pays a big-time dividend (currently yielding 5.7%) that it has grown for more than 60 consecutive years. Here's a look at the likelihood that 3M's payout will face the same fate as Walgreens' dividend in 2024.\n\nA look at what doomed Walgreens' dividend\n\nWalgreens' financial situation has deteriorated in recent years. During its last fiscal year, the company's earnings per share declined more than 20%. Meanwhile, its operational cash flow slumped by over $1.6 billion to less than $2.3 billion. That left it with only $665 million in free cash flow after funding its capital spending ($1.5 billion less than the prior fiscal year).\n\nThe company's free cash flow was about $1 billion short of its total dividend outlay for the year (nearly $1.7 billion). While Walgreens was able to cover that shortfall by selling assets, including nearly $1.8 billion of real estate through sale-leaseback transactions, its issues put pressure on its balance sheet. Credit rating agency Moody's cut Walgreens' credit rating to a noninvestment or junk bond level in December. S&P Global also cut its rating on Walgreens last year to the last level before junk.\n\nWalgreens' financial issues led the company to take additional action to shore up its cash flow and balance sheet in 2024 by slashing its dividend. The move will save the company $800 million annually, which it can use to fund growth capital investments and repay debt. The company also plans to reduce capital expenses by around $600 million while targeting about $1 billion in operational cost savings to further improve its financial situation.\n\nStory continues\n\nIs 3M in a similar predicament?\n\n3M's high-yielding payout suggests it's also at risk of a reduction. The main factor causing concern is the company's legal issues. It has been working to settle litigation claims brought against the company regarding earplugs sold to the military and \"forever chemicals\" that the EPA has designated as hazardous.\n\nThe company reached settlements in both cases last year. It agreed to pay up to $6 billion to settle the Combat Arms earplugs litigation and $10.3 billion for claims relating to the forever chemicals. It will pay these settlements over many years.\n\nOn the one hand, the settlements provided clarity on its future liabilities. However, credit rating agencies deemed them to be negative. S&P Global cut its rating on 3M's credit to BBB+, three levels above junk, while Moody's maintained its A2 rating with a negative outlook on its credit.\n\nMeanwhile, 3M's financial results have started improving over the past year. Its adjusted free cash flow was up 37% to $4.3 billion through the third quarter of last year. That was enough to cover its $2.5 billion in dividend payments, with room to spare. 3M used that excess cash to strengthen its balance sheet. Net debt has declined by 11% over the past year to $10.8 billion.\n\nThese factors all seem to suggest that 3M should be able to maintain its dividend, if not continue to increase the payout. However, that doesn't mean the dividend is safe. A potential catalyst for a cut is the company's upcoming spinoff of its healthcare unit as an independent public company.\n\nOn the one hand, 3M expects to receive a $1 billion cash dividend from that entity following the spinoff to help cover its legal settlements. However, the unit generated $8.4 billion in annual sales in 2022 (about a quarter of its total). Because it's such a meaningful contributor, 3M may opt to reset its dividend following the spinoff to reflect its reduced earnings profile and retain more cash to fund its legal liabilities.\n\nThe risks of a reduction are high\n\nOn balance, 3M is in a better financial position than Walgreens. It generates more than enough free cash flow to cover its dividend and has a higher credit rating. However, given the company's legal liabilities and upcoming spinoff, its dividend could still face the same fate. Because of that, income investors need to prepare themselves for a potential cut, which could come this year following the spinoff of its healthcare unit.\n\nShould you invest $1,000 in 3M right now?\n\nBefore you buy stock in 3M, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and 3M wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of January 16, 2024\n\nMatthew DiLallo has positions in 3M. The Motley Fool has positions in and recommends Moody's and S&P Global. The Motley Fool recommends 3M. The Motley Fool has a disclosure policy.\n\nWill 3M's High-Yielding Dividend Face the Same Fate as Walgreens' Once-Mighty Payout? was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/3ms-high-yielding-dividend-face-110100080.html", "symbols": ["MMM.US", "WBA.US"], "tags": [], "sentiment": {"polarity": 0.972, "neg": 0.072, "neu": 0.835, "pos": 0.093}}]