[{"date": "2023-06-02T23:21:04+00:00", "title": "Dow Jones Today: Index Rallies on Jobs Strength", "content": "The Dow moved up by more than 700 points after the Labor Department's stronger-than-expected jobs report.", "link": "https://finance.yahoo.com/m/419792eb-ec91-3278-9b07-d14020cdd161/dow-jones-today%3A-index.html", "symbols": ["BAC.F", "BAC.XETRA", "CHV.F", "CHV.XETRA", "CVX.MX", "CVX.US", "DJI.INDX", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-06-02T22:19:24+00:00", "title": "Amazon Is Considering a New Offering and it Could Spell Trouble for Verizon and AT&amp;T", "content": "Amazon (NASDAQ: AMZN) rose to prominence on the back of its now sprawling e-commerce business, which has become not only the largest digital retailer in the U.S., but also the world. While not all of its ventures have been successful, Amazon's track record has been sufficient to strike fear into the hearts of those it might rival. Oftentimes, stocks will fall at the mere prospect of having to compete with the company -- a well-documented phenomenon known as \"the Amazon effect.\"", "link": "https://finance.yahoo.com/m/fc308af4-1ca8-3dca-8a9d-73b9ee1198b4/amazon-is-considering-a-new.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.906, "neg": 0.063, "neu": 0.757, "pos": 0.18}}, {"date": "2023-06-02T22:14:00+00:00", "title": "Weekly Roundup", "content": "We took advantage of drops in Lockheed Martin and Elevance to bulk up on our existing positions; we also trimmed some Marvell.", "link": "https://finance.yahoo.com/m/fa288eae-0eca-36a1-b651-b31f42306b42/weekly-roundup.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "APC.F", "APC.XETRA", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.F", "BAC.MX", "BAC.US", "BAC.XETRA", "BML-PL.US", "BOAC34.SA", "CHPT.US"], "tags": [], "sentiment": {"polarity": 0.25, "neg": 0, "neu": 0.913, "pos": 0.087}}, {"date": "2023-06-02T21:27:00+00:00", "title": "Amazon Prime Phone Service? Not So Fast, Analysts Say.", "content": "Is Amazon going to offer free or cheap wireless service to Prime members? Why it's doubtful, according to a veteran telecom analyst.", "link": "https://finance.yahoo.com/m/f88a0ee0-bb93-3df9-b267-76d7e11cb36c/amazon-prime-phone-service%3F.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "BAC.F", "BAC.XETRA", "DISH.MX", "DISH.US", "EOT.F", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TM5.F", "TMUS.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0.094, "neu": 0.709, "pos": 0.197}}, {"date": "2023-06-02T20:22:19+00:00", "title": "US STOCKS-Wall Street ends up on jobs data, debt default averted", "content": "*\n\nNasdaq posts best weekly winning streak since Jan 2020\n\n*\n\nData shows jobless rate at 3.7% in May; wage growth moderates\n\n*\n\nAmazon up on report of its talks for low-cost mobile services\n\n*\n\nMaterials lead S&P sector gains, Nvidia slips again\n\n(Adds final market closing data)\n\nBy Herbert Lash and Shreyashi Sanyal\n\nJune 2 (Reuters) - U.S. stocks closed higher on Friday after a labor market report showing moderating wage growth in May indicated the Federal Reserve may skip a rate hike in two weeks, while investors welcomed a Washington deal that avoided a catastrophic debt default.\n\nThe tech-heavy Nasdaq index surged to a 13-month intraday high and posted its sixth-straight week of gains that marked its best winning streak since January 2020.\n\nU.S. job growth accelerated in May but a surge in the unemployment rate to a seven-month high of 3.7% as more people looking for employment indicated labor market conditions were easing, the Labor Department said.\n\nThe jump in the unemployment rate from a 53-year low of 3.4% in April reflected a drop in household employment and a rise in the overall workforce. A bigger labor pool is easing pressure on businesses to raise wages and helping decelerate inflation.\n\n\"While it appears to be a hot number on the actual number of people employed, the wage rate is not increasing as fast,\" said Kim Forrest, chief investment officer at Bokeh Capital Partners in Pittsburgh. \"That is a softening effect and is this the mythical soft landing? Looks like that.\"\n\nThe data brought relief to investors who mostly expect the Fed to pause hiking rates at its policy meeting on June 13-14. It would be the first halt since the Fed started its aggressive anti-inflation policy tightening more than a year ago.\n\nBut some pointed to the much hotter-than-expected jobs data as a sign the Fed still has not yet tamed inflation.\n\n\"Our view is and has been that the market is completely wrong on assessing what the Federal Reserve is doing,\" said Phil Orlando, chief equity strategist at Federated Hermes in New York.\n\n\"The market's perception is that this economy was going to cool, inflation was going to collapse and the Fed was going to turn around and start cutting interest rates. That's wrong.\"\n\nFed funds futures showed a 71.3% probability that the Fed will hold rates steady in two weeks, down from 79.6% on Thursday, according to CME Group's FedWatch Tool.\n\nMarkets now await data on key consumer prices a day before the Fed's rate decision in two weeks.\n\nThe Senate passing a bill late on Thursday to lift the government's $31.4 trillion debt ceiling avoided what would have been a catastrophic, first-ever default.\n\nPassage of the vote eased investor concerns as Wall Street's fear gauge, the CBOE volatility index, fell to its lowest since November 2021, down 1.1 points at 14.6 points.\n\nThe Dow Jones Industrial Average rose 701.19 points, or 2.12%, to 33,762.76, the S&P 500 gained 61.35 points, or 1.45%, to 4,282.37 and the Nasdaq Composite added 139.78 points, or 1.07%, to 13,240.77.\n\nFor the week, the S&P 500 rose 1.82%, the Dow added 2.02% and the Nasdaq gained 2.04%\n\nVolume on U.S. exchanges was 11.05 billion shares, compared with about 10.58 billion average for the full session over the last 20 trading days.\n\nShares of Verizon Communications Inc, AT&T Inc and T-Mobile US Inc declined after a report said Amazon.com Inc was in talks with the U.S. telecoms to offer low-cost wireless services to its Prime members.\n\nVerizon slid 3.2%, while AT&T and T-Mobile declined 3.8% and 5.6%, respectively; Amazon gained 1.2%.\n\nAll 11 S&P 500 sectors advanced, with the materials index leading, up 3.4%, and the consumer discretionary sector, housing Amazon, close behind, rising 2.2%.\n\nNvidia Corp slid 1.1% for a second day of declines after briefly entering on Wednesday the elite club of megacap stocks valued at $1 trillion or more on hopes artificial intelligence will deliver significant future returns.\n\nBut Nvidia's almost 170% rise year to date highlights investors face of a market dominated by the out-performance of megacaps while most other companies tread water.\n\n\"Nobody’s really explained to me how they’re going to make any money from it,\" said Michael Landsberg, chief investment officer at Landsberg Bennett Private Wealth Management in Punta Gorda, Florida. \"A company like Nvidia going up so much in such a short period of time, that doesn't make any rational sense.\"\n\nAdvancing issues outnumbered declining ones on the NYSE by a 4.75-to-1 ratio; on Nasdaq, a 2.73-to-1 ratio favored advancers.\n\nThe S&P 500 posted 15 new 52-week highs and two new lows; the Nasdaq Composite recorded 74 new highs and 40 new lows.\n\n(Reporting by Herbert Lash, additional reporting by Shreyashi Sanyal, Shristi Achar A and Shashwat Chauhan, in Bengaluru; Editing by Nivedita Bhattacharjee and Maju Samuel)", "link": "https://finance.yahoo.com/news/us-stocks-wall-street-ends-202219171.html", "symbols": ["BAC.F", "BAC.XETRA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0.065, "neu": 0.818, "pos": 0.117}}, {"date": "2023-06-02T20:16:35+00:00", "title": "Why AT&amp;T, Verizon, and T-Mobile Stocks Were Sinking Today", "content": "Telecom stocks including AT&T (NYSE: T), Verizon (NYSE: VZ), and T-Mobile (NASDAQ: TMUS) were all pulling back Friday on some surprising news. According to Bloomberg, Amazon (NASDAQ: AMZN) is considering entering the wireless market, as it's held discussions about offering nationwide mobile phone service to Prime members, either for free or at a discount. Bloomberg said that Amazon is negotiating with Verizon, T-Mobile, and Dish Network (NASDAQ: DISH) to get a low wholesale price for service that it could then turn around and offer to Prime members for $10 a month or even free as an incentive to join and stick with the membership program.", "link": "https://finance.yahoo.com/m/fd2b305b-a4b7-354b-b87e-3bd00fc2dc2f/why-at%26t%2C-verizon%2C-and.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "BAC.F", "BAC.XETRA", "DISH.US", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TM5.F", "TMUS.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.914, "neg": 0.019, "neu": 0.833, "pos": 0.149}}, {"date": "2023-06-02T19:26:08+00:00", "title": "3 Stocks That High-Yield ETFs Are Betting On", "content": "The stock market has roared back to life in 2023 and has largely outperformed expectations. Investors have begun to pour back into the stock market in search of bargains. However, despite high returns in growth stocks, investors are still highly interested in seeking lower-risk securities. A typical way to go about doing that is to invest in high-yield exchange-traded funds (ETFs).\n\nHigh-yield ETFs hold stocks paying above-average dividends or bonds making above-average interest payments. Some common high-yield ETFs include Vanguard High Yield Dividend ETF (NYSEARCA:VYM), which has exposure to well-established large-cap companies, such as JPMorgan Chase (NYSE:JPM) and Johnson & Johnson (NYSE:JNJ), and iShares Select Dividend ETF (NASDAQ:DVY), which has exposure to household names like Verizon (NYSE:VZ).\n\nFor those income investors in search of high yields, below is a list of three stocks that these high-yield ETFs are betting on.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nAltria (MO) Altria office sign in Virginia capital city tobacco business closeup by road street\n\nSource: Kristi Blokhin / Shutterstock.com\n\nAltria (NYSE:MO) manufactures and sells smokable and oral tobacco products. The company provides cigarettes under the well-known Marlboro brand. Its cigars and pipe tobacco are principally sold under the Black & Mild brand. Despite cigarettes and tobacco products being generally frowned upon in the U.S., Altria was able to rake in $25 billion in net revenue in fiscal year 2022.\n\nMost importantly, the company paid a whopping $6.6 billion in dividends that year. These days, Altria’s dividend yield sits around 8.7%. Because of this, the company is included in a number of high-yield ETFs. For example, the iShares Select Dividend ETF has Altria as its largest holding at 2.59% of its $19.5 billion assets under management (AUM). First Trust Morningstar Dividend Leaders Index Fund (NYSEARCA:FDL), a $4 billion high-yield ETF, holds Altria Group at nearly 5% of AUM.\n\nRecessions tend to have varying impact on smokers and non-smokers. Research has showed smokers tend to consume fewer tobacco products during a time of deteriorating economic outlook, while those new to smoking tend to pick up the habit. Although it is not sure which side of the coin will land for Altria, the company will most likely keep its high dividend. After all, it has increased its dividend 53 consecutive times.\n\nBlackstone Secured Lending Fund (BXSL) Business Development Company BDC concept is shown by businessman.\n\nSource: wsf-s / Shutterstock.com\n\nBlackstone Secured LendingFund (NYSE:BXSL) is a business development company (BDC) owned by the major asset management firm Blackstone (NYSE:BX). Acting as a financial services company, BXSL offers mainly senior secured loans to U.S.-based private companies. These companies range across various sectors, including software, healthcare, insurance, aerospace and air freight.\n\nAs of March 31, the company’s portfolio investments were valued at $9.6 billion in fair value. Nearly 98% of these investments are first lien senior secured, with over 99% of the debt investments carrying a floating rate. Currently, BXSL’s portfolio consists of loans provided to 49 companies. Loan amounts ranging from approximately $67 million to over $348 million.\n\nBlackstone Secured Lending’s dividend as of its Q1 2023 net asset value (NAV) was 10.7%. Furthermore, there are many high-yield ETFs holding the stock. The VanEck BDC Income ETF (NYSEARCA:BIZD), for one, has a 4.72% concentration in BXSL.\n\nAlthough the lending markets have cooled since the U.S. Federal Reserve began hiking interest rates, investors have remained committed to reallocating capital to private credit vehicles as they continue to look for high yields. This, coupled with the fact BXSL is backed by a larger, well-established asset manager, should bode well for both the BDC and its high dividend payments in the long term.\n\nPetrobras (PBR) the Petroleo Brasileiro logo on a building during daylight\n\nSource: A.PAES / Shutterstock.com\n\nFounded in 1953 and headquartered in Rio de Janeiro, Petrobras (NYSE:PBR) is the state-run oil and natural gas behemoth from Brazil. Through selling oil and gas domestically and internationally, the company has business operations in exploration, production, refining, transportation, gas and power.\n\nIn 2022, global commodity prices skyrocketed, and elevated energy prices allowed Petrobras to profit immensely. In particular, Petrobras made $121 billion in revenue and $38 billion in net income. Its performance primarily came from the appreciation of the average Brent price for the year and higher sales of oil products, at higher average prices, in the Brazilian domestic market.\n\nPetrobras’s large net income translated into huge dividends for shareholders. The company doled out more than $43 billion in dividend payments in 2022. Although Brent prices are stabilizing, Petrobras remains profitable and undervalued. In fact, PBR’s price-to-earnings (P/E) ratio on a trailing-12-month basis is only around 2x. Its dividend yield is at 32%.\n\nThe Amplify International Enhanced Dividend Income ETF (NYSEARCA:IDVO) is one of the high-yield ETFs betting on Petrobras. The company is the ETF’s third-largest holding.\n\nOn the date of publication, Tyrik Torres did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nTyrik Torres has been studying and participating in financial markets since he was in college, and he has particular passion for helping people understand complex systems. His areas of expertise are semiconductor and enterprise software equities. He has work experience in both investing (public and private markets) and investment banking.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live Did Elon Musk Just Trigger a New Netscape Moment? The $1 Investment You MUST Take Advantage of Right Now The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 3 Stocks That High-Yield ETFs Are Betting On appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-stocks-high-yield-etfs-192608598.html", "symbols": ["BX.US", "BXSL.US", "DVY.US", "JNJ.US", "JPM.US", "MO.MX", "MO.US", "MOOO34.SA", "PBR-A.US", "PBR.US", "PBRN.MX", "PETR3.SA", "PETR4.SA", "PHM7.F", "PHM7.XETRA", "PJX.F", "PJXA.F", "PJXB.F"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.004, "neu": 0.897, "pos": 0.099}}, {"date": "2023-06-02T16:11:05+00:00", "title": "What's Going On With Big Telecom Stocks Today - Dish, Verizon, T-Mobile, AT&amp;T", "content": "Dish Network Corp (NASDAQ: DISH) stock is up Friday amid reports of selling wireless plans for its mobile phone service through Amazon.Com Inc(NASDAQ: AMZN). Amazon has been talking with wireless carriers about offering Prime subscribers $10 a month or possibly for free and bolster loyalty among its biggest spending customers. The company is negotiating with Verizon Communications Inc (NYSE: VZ), T-Mobile US Inc (NYSE: TMUS), and Dish for the lowest possible wholesale prices, Bloomberg reported citing knowledgeable sources. The discussions have been going on for six to eight weeks and have also included AT&T Inc (NYSE: T) at times. Amazon's deal could act as a breather for the wireless industry in the form of wholesale revenue and traffic to newly expanded 5G networks. But it could also chip away at the big carriers' customer base left with minimal bargaining power after pouring billions of dollars into super-fast, high-capacity 5G wireless networks. As a result, TMUS, VZ, and T stocks are trading lower Friday. Analysts say U.S. Prime membership has stagnated since Amazon boosted the annual price from $119 to $139 for privileges like speedy free delivery, video streaming, and access to 100 million songs. Amazon is vying with Walmart Inc (NYSE: WMT), whose $98-a-year Walmart+ membership proved attractive as a lower-cost alternative offering many of the same perks as Prime and free grocery delivery on orders of at least $35. Amazon spokesperson confirms the earlier report to Benzinga, \"We are always exploring adding even more benefits for Prime members, but don’t have plans to add wireless at this time.\" Amazon in February raised its free grocery delivery threshold to $150 from $35. Dish is already working with Amazon, whose AWS division provides cloud computing to run the core network for its wireless service. Dish will also likely start selling its Boost Infinite wireless service on Amazon by July. Price Actions: DISH is trading higher by 20% at $7.55 on the last check Friday. TMUS shares are trading lower by 7% at $128.86, VZ shares are trading lower by 3.25% at $34.50, and T shares are trading lower by 5% at $14.93. Photo via Wikimedia Commons\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article What's Going On With Big Telecom Stocks Today - Dish, Verizon, T-Mobile, AT&T originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/whats-going-big-telecom-stocks-161105271.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "BAC.F", "BAC.XETRA", "DISH.MX", "DISH.US", "EOT.F", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TM5.F", "TMUS.US"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.027, "neu": 0.83, "pos": 0.144}}, {"date": "2023-06-02T16:03:31+00:00", "title": "UPDATE 3-US telecom stocks fall on report Amazon in talks for wireless services", "content": "June 2 (Reuters) - Shares of Verizon Communications Inc , AT&T Inc and T-Mobile US Inc declined on Friday after a report said Amazon.com Inc was in talks with the U.S. telecom firms to offer low-cost wireless services to its Prime members.\n\nBloomberg News reported that Amazon was negotiating to get the lowest possible wholesale prices and could offer wireless plans for $10 a month or lower to Prime members through these partnerships.\n\n\"We are always exploring adding even more benefits for Prime members, but don't have plans to add wireless at this time,\" an Amazon spokesperson said in response to a Reuters query.\n\nSeveral analysts said the online retail giant's entry could lead to major disruption in the telecom space as its deep pockets would enable it to offer cheaper plans in a country with some of the highest wireless charges in the world.\n\n\"Amazon could certainly put a lot of its weight behind it and undercut competitors,\" said Christopher Ali, professor of telecommunications at Penn State University. \"We might actually see cell phone prices go down, which would be a great thing.\"\n\nAmazon's shares rose more than 2% and were among the top boosts for the benchmark S&P 500 Index, while Verizon, AT&T and T-Mobile fell between 3% and 8%.\n\nAT&T declined to comment, while T-Mobile said it was not in discussions with Amazon for inclusion of its wireless in Prime service. Other telecom firms did not immediately respond to Reuters requests for comment.\n\nThe details of the potential deals between Amazon and the wireless carriers were not immediately known.\n\nBrandon Nispel of KeyBanc Capital Markets said that Dish Network Corp, a relatively new entrant in wireless, could be the most likely partner for Amazon.\n\nHe said a deal would give Dish access to financing that could help build out its network, while the other carriers are not incentivized to partner with Amazon as \"they obviously don't want to change the current status quo of the industry.\"\n\nDish's shares were an outlier in telecom stocks with a gain of 22%. The company's shares had also soared in May after a Wall Street Journal report that it was in talks to sell its wireless plans through Amazon.\n\n(Reporting by Yuvraj Malik, Tanya Jain, Akash Sriram and Aditya Soni in Bengaluru; additional reporting by Sheila Dang in Dallas; Editing by Nivedita Bhattacharjee and Shinjini Ganguli)", "link": "https://finance.yahoo.com/news/3-us-telecom-stocks-fall-160331343.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TM5.F", "TMUS.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.988, "neg": 0.025, "neu": 0.856, "pos": 0.119}}, {"date": "2023-06-02T14:18:37+00:00", "title": "Telecom Stocks Drop After Report That Amazon Might Offer Mobile Service", "content": "Amazon.com is reportedly looking into entering mobile phone service, and telecom investors are feeling the pain. Bloomberg News reported Friday that the retailing giant has been talking with wireless carriers about offering low-cost or free mobile to Prime subscribers.", "link": "https://finance.yahoo.com/m/f687298a-a823-3eed-9ecb-da2ba60aff54/telecom-stocks-drop-after.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "BAC.F", "BAC.XETRA", "DISH.MX", "DISH.US", "EOT.F", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TBB.US", "TM5.F", "TMUS.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.128, "neg": 0.075, "neu": 0.816, "pos": 0.109}}, {"date": "2023-06-02T14:10:20+00:00", "title": "Amazon Is in Talks to Offer Free Mobile Service to US Prime Members", "content": "(Bloomberg) -- Amazon.com Inc. has been talking with wireless carriers about offering low-cost or possibly free nationwide mobile phone service to Prime subscribers, according to people familiar with the situation.\n\nMost Read from Bloomberg\n\nChina Is Drilling a 10,000-Meter-Deep Hole Into the Earth Inside the Making of Redfall, Xbox’s Latest Misfire Debt-Limit Deal Clears Congress, Ending Threat of US Default Hedge Funds at War for Top Traders Dangle $120 Million Payouts Amazon Is in Talks to Offer Free Mobile Service to US Prime Members\n\nThe company is negotiating with Verizon Communications Inc., T-Mobile US Inc. and Dish Network Corp. to get the lowest possible wholesale prices. That would let it offer Prime members wireless plans for $10 a month or possibly for free and bolster loyalty among its biggest spending customers, the people said, who requested anonymity to discuss a private matter.\n\nThe talks have been going on for six to eight weeks and have also included AT&T Inc. at times, but the plan may take several more months to launch and could be scrapped, one person said.\n\nDish shares jumped 14% Friday in New York since a deal with the retail giant could help the struggling satellite-TV company as it transitions to become a national wireless carrier. Meanwhile, T-Mobile fell 8.4%, AT&T dropped 5% and Verizon slid 3.5.%. The big three national carriers could see their own subscribers flee to a cheaper option at Amazon. Deutsche Telekom AG, which holds a majority stake in T-Mobile, fell 5.7% in Germany.\n\n“We are always exploring adding even more benefits for Prime members, but don’t have plans to add wireless at this time,” Amazon spokesperson Maggie Sivon said in a statement. Verizon and Dish declined to comment.\n\nAmazon’s US Prime subscribers pay $139 a year for privileges like speedy free delivery, video streaming and access to 100 million songs. Analysts say Prime membership has stagnated in the country since Amazon boosted the annual price from $119, a sign that a subscription is less attractive to consumers struggling with a stubbornly high inflation rate. About 167 million Amazon shoppers had Prime memberships as of March, unchanged from a year earlier, according to Consumer Intelligence Research Partners.\n\nAmazon is competing with Walmart Inc., whose $98-a-year Walmart+ membership is emerging as a lower-cost alternative offering many of the same perks as Prime and free grocery delivery on orders of at least $35. Amazon in February increased its free grocery delivery threshold to $150 from $35.\n\nAmazon’s Influence\n\nFor the wireless industry, an Amazon deal could be seen as a welcome boost to wholesale revenue and a way to attract more traffic to newly expanded 5G networks. But Amazon’s entry could be detrimental if Prime wireless becomes popular and starts to chip away at the big carriers’ customer base.\n\nA deeply below-market price from one of the world’s largest retailers could easily undercut the pricing power of the big three national carriers, making it tempting for subscribers to go to Amazon. Unlimited plans start at $60 a month at Verizon and T-Mobile, with AT&T starting at $65.\n\nWith Prime wireless, Amazon would become a new national brand, reselling mobile service from one of the big three carriers. The retailer could choose to offer wireless to its Prime members at an attractive price, prompting customers to cancel their current mobile service. Or, Amazon could go wider and offer Prime wireless to anyone who wants to switch service and become a Prime member.\n\nAnytime Amazon enters a new market, it sends shivers through the industry because the Seattle-based retail giant has shown it’s willing to absorb billions of dollars in shipping and movie production costs to fuel Prime membership growth. Wireless service could be just one more item that Amazon’s willing to take a hit on if it gives the company a leg up versus Walmart.\n\nCan’t Say No\n\nThe carriers aren’t really in a position to say no to Amazon. Having poured billions of dollars into super-fast, high capacity 5G wireless networks, the mobile operators have little to show for the effort and are eager to find new applications and sales outlets that can generate some return on the investment.\n\nDish has the most to gain from a deal with Amazon. The company is attempting to transform itself into a cloud-based wireless carrier capable of competing with Verizon and AT&T. But it’s carrying a load of distressed debt and is seeking new avenues of funding to be able to launch its Boost Infinite wireless service. Dish is already working with Amazon, whose AWS division is providing cloud computing to run the core network for its wireless service and is expected to start selling Boost Infinite wireless service on Amazon as soon as next month.\n\nAmazon has already made several forays into wireless. In 2014, Amazon introduced the Fire Phone in an attempt to compete with devices from Apple Inc. and Samsung Electronics Co., but it was killed a year later. The company also plans to start testing a satellite-internet service called Project Kuiper next year.\n\nBy taking the approach of a reseller, otherwise known as a mobile virtual network operator or MVNO, Amazon would avoid the huge costs of having to build out its own mobile network.\n\nMVNOs have had a colorful track record. Brands including ESPN Mobile and Virgin Mobile both failed. Alphabet Inc. has the Google Fi service that runs on T-Mobile’s network and has about 2 million customers.\n\nWireless is already starting to sometimes be bundled as a perk in broader service packages. Cable companies like Charter Communications Inc., which resells service from Verizon, have said they see a time soon when the cable bill includes wireless service. Charter and Comcast Corp. have fueled some of the sector’s fastest subscriber growth by offering cheap to free wireless service as a promotion bundled with broadband.\n\n(Updates with opening shares in fourth paragraph.)\n\nMost Read from Bloomberg Businessweek\n\nHow Summer Camp Became Such a Hot Mess for Parents Harvard MBA Grads Enter a Tepid Job Market Hoping for the Best Goldman CEO Loves Summer Camp So Much He’s Expanded His Portfolio Can Workplace Ketamine Retreats Improve Vibes in the Office? Assault Allegations Plague a $1.4 Billion Home Eldercare Startup\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/amazon-talks-offer-free-mobile-141020883.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "BAC.F", "BAC.XETRA", "DISH.MX", "DISH.US", "EOT.F", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TM5.F", "TMUS.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.051, "neu": 0.8, "pos": 0.149}}, {"date": "2023-06-02T13:56:00+00:00", "title": "Verizon and AT&amp;T Shares Slump on Reports Amazon to Offer Wireless to Prime Members", "content": "Amazon.com is reportedly in talks with phone carriers to offer low-cost or free nationwide mobile phone service to Prime subscribers.", "link": "https://finance.yahoo.com/m/3a632f87-a6e3-3905-82fd-6b17a98d1a19/verizon-and-at%26t-shares-slump.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.511, "neg": 0, "neu": 0.852, "pos": 0.148}}, {"date": "2023-06-02T13:18:32+00:00", "title": "UPDATE 2-Amazon in talks to offer low-cost mobile services - Bloomberg News", "content": "(Updates shares in paragraph 3, adds Amazon comment in paragraph 5)\n\nJune 2 (Reuters) - Amazon.com Inc is in talks with several telecom providers to offer low-cost or possibly free mobile phone service to U.S. Prime subscribers, Bloomberg News reported on Friday, citing people familiar with the matter.\n\nThe e-commerce major is engaged with Verizon Communications , T-Mobile US Inc and Dish Network Corp, and looking to offer wireless plans for $10 a month or lower to Prime members, according to the report. Amazon also held talks with AT&T Inc earlier.\n\nShares of Verizon, AT&T and T-Mobile dropped about 4% to 7%, while Amazon was up 2%. Dish Network was up 17%. Talks between Amazon and Dish were reported last week.\n\nThe telecom firms mentioned above did not respond to Reuters requests for comments.\n\n\"We are always exploring adding even more benefits for Prime members, but don't have plans to add wireless at this time,\" an Amazon spokesperson said in response to a Reuters query.\n\nThe reported talks come as Amazon faces a slowdown in new sign-ups for the Prime service, its key loyalty program that offers subscribers faster shipping and video streaming.\n\nFor telecom companies, a resell partnership with Amazon could serve as a means to attract new users and boost revenue. The details of the potential deals between Amazon and the telecom firms were not immediately known.\n\n(Reporting by Tanya Jain, Akash Sriram and Yuvraj Malik in Bengaluru; Editing by Nivedita Bhattacharjee and Shinjini Ganguli)", "link": "https://finance.yahoo.com/news/1-amazon-talks-verizon-others-131832240.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.977, "neg": 0.006, "neu": 0.857, "pos": 0.137}}, {"date": "2023-06-02T13:05:03+00:00", "title": "Amazon Is in Talks to Offer Free Mobile Service to US Prime Members", "content": "(Bloomberg) -- Amazon.com Inc. has been talking with wireless carriers about offering low-cost or possibly free nationwide mobile phone service to Prime subscribers, according to people familiar with the situation.\n\nMost Read from Bloomberg\n\nChina Is Drilling a 10,000-Meter-Deep Hole Into the Earth Inside the Making of Redfall, Xbox’s Latest Misfire Debt-Limit Deal Clears Congress, Ending Threat of US Default Hedge Funds at War for Top Traders Dangle $120 Million Payouts Rich Latin Americans Transform Laid-Back Madrid Into a New Miami\n\nThe company is negotiating with Verizon Communications Inc., T-Mobile US Inc. and Dish Network Corp. to get the lowest possible wholesale prices. That would let it offer Prime members wireless plans for $10 a month or possibly for free and bolster loyalty among its biggest spending customers, the people said, who requested anonymity to discuss a private matter.\n\nDish shares jumped 8.4% in premarket trading on Friday while Verizon, AT&T and T-Mobile all slid more than 5%.\n\nThe talks have been going on for six to eight weeks and have also included AT&T Inc. at times, but the plan may take several more months to launch and could be scrapped, one person said.\n\n“We are always exploring adding even more benefits for Prime members, but don’t have plans to add wireless at this time,” Amazon spokesperson Maggie Sivon said in a statement. Verizon and Dish declined to comment.\n\nAmazon’s US Prime subscribers pay $139 a year for privileges like speedy free delivery, video streaming and access to 100 million songs. Analysts say Prime membership has stagnated in the country since Amazon boosted the annual price from $119, a sign that a subscription is less attractive to consumers struggling with a stubbornly high inflation rate. About 167 million Amazon shoppers had Prime memberships as of March, unchanged from a year earlier, according to Consumer Intelligence Research Partners.\n\nAmazon is competing with Walmart Inc., whose $98-a-year Walmart+ membership is emerging as a lower-cost alternative offering many of the same perks as Prime and free grocery delivery on orders of at least $35. Amazon in February increased its free grocery delivery threshold to $150 from $35.\n\nAmazon’s Influence\n\nFor the wireless industry, an Amazon deal could be seen as a welcome boost to wholesale revenue and a way to attract more traffic to newly expanded 5G networks. But Amazon’s entry could be detrimental if Prime wireless becomes popular and starts to chip away at the big carriers’ customer base.\n\nA deeply below-market price from one of the world’s largest retailers could easily undercut the pricing power of the big three national carriers, making it tempting for subscribers to flee to Amazon. Unlimited plans start at $60 a month at Verizon and T-Mobile, with AT&T starting at $65.\n\nWith Prime wireless, Amazon would become a new national brand, reselling mobile service from one of the big three carriers. The retailer could choose to offer wireless to its Prime members at an attractive price, prompting customers to cancel their current mobile service. Or, Amazon could go wider and offer Prime wireless to anyone who wants to switch service and become a Prime member.\n\nAnytime Amazon enters a new market, it sends shivers through the industry because the Seattle-based retail giant has shown it’s willing to absorb billions of dollars in shipping and movie production costs to fuel Prime membership growth. Wireless service could be just one more item that Amazon’s willing to take a hit on if it gives the company a leg up versus Walmart.\n\nCan’t Say No\n\nThe carriers aren’t really in a position to say no to Amazon. Having poured billions of dollars into super-fast, high capacity 5G wireless networks, the mobile operators have little to show for the effort and are eager to find new applications and sales outlets that can generate some return on the investment.\n\nDish has the most to gain from a deal with Amazon. The struggling satellite-TV company is attempting to transform itself into a cloud-based wireless carrier capable of competing with Verizon and AT&T. But it’s carrying a load of distressed debt and is seeking new avenues of funding to be able to launch its Boost Infinite wireless service. Dish is already working with Amazon, whose AWS division is providing cloud computing to run the core network for its wireless service and is expected to start selling Boost Infinite wireless service on Amazon as soon as next month.\n\nAmazon has already made several forays into wireless. In 2014, Amazon introduced the Fire Phone in an attempt to compete with devices from Apple Inc. and Samsung Electronics Co., but it was killed a year later. The company also plans to start testing a satellite-internet service called Project Kuiper next year.\n\nBy taking the approach of a reseller, otherwise known as a mobile virtual network operator or MVNO, Amazon would avoid the huge costs of having to build out its own mobile network.\n\nMVNOs have had a colorful track record. Brands including ESPN Mobile and Virgin Mobile both failed. Alphabet Inc. has the Google Fi service that runs on T-Mobile’s network and has about 2 million customers.\n\nWireless is already starting to sometimes be bundled as a perk in broader service packages. Cable companies like Charter Communications Inc., which resells service from Verizon, have said they see a time soon when the cable bill includes wireless service. Charter and Comcast Corp. have fueled some of the sector’s fastest subscriber growth by offering cheap to free wireless service as a promotion bundled with broadband.\n\n(Updates with detail on Dish in 13th paragraph.)\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/amazon-talks-offer-free-mobile-123703089.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "BAC.F", "BAC.XETRA", "DISH.MX", "DISH.US", "EOT.F", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.049, "neu": 0.812, "pos": 0.139}}, {"date": "2023-06-02T01:19:48+00:00", "title": "7 Long-Term Stocks to Buy and Hold Until 2033", "content": "Let’s take a quick look at stocks for investment until 2033. All are high-quality firms, meaning they’re stable and have the potential to continue growing. Granted, it might be hard to imagine some of these companies getting bigger. But that’s exactly what some detractors surely said a decade ago. The truth is that many of the best stocks of today will be the best stocks in a decade. Strong companies have many ways to maintain their dominance, including these seven.\n\nStocks for Investment Until 2033: Apple (AAPL) man's hand holding wads of cash. stocks to buy. Stocks With 1000% Upside\n\nSource: Vova Shevchuk / Shutterstock.com\n\nApple (NASDAQ:AAPL) is a no-brainer. Over the last decade alone, it’s become so omnipresent in our way of life that it’s hard to suggest it won’t continue to dominate. Better, its fan base is fervent, which won’t change any time soon. Those simple factors alone suggest that Apple is one of the most obvious long-term stock choices to invest in today. Further, Apple has grown so fast that it’s become very attractive to those determined not to miss out on gains this time around.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nBack in 2013, AAPL shares traded at $15. Today they’re worth $175. No one knows precisely where they’ll be in 10 years but this forecast expects prices near $500. Investors should also consider that as Apple continues to mature that it will continue to raise its dividends as well.\n\nStocks for Investment Until 2033: Microsoft (MSFT) An image of a street sign post with directions labeled \"Buy\", \"Hold\", and \"Sell\"\n\nSource: PX Media / Shutterstock\n\nBig Tech firms, like Microsoft, (NASDAQ:MSFT) have every chance of being just as strong as they are now in 10 years. Thanks in large part to the AI boom.\n\nMicrosoft has arguably set itself apart with a massive foray into AI ahead of others. The OpenAI investment gives it a first-mover advantage that will continue to matter. Google (NASDAQ:GOOG, GOOGL) has responded more slowly even as it makes inroads.\n\nThe other obvious question here is if AI is the future, why not invest in Nvidia (NASDAQ:NVDA)? Granted, there’s a strong case favoring Nvidia after its Q1 results for sure. It continues to make all the sense in the world, honestly. The only issue is that the chip sector’s cyclicality is very unpredictable making NVDA especially volatile. Therefore, holding for a decade may not be the best strategy.\n\nStocks for Investment Until 2033: Block (SQ) Man holding stacks of money. top growth stocks\n\nSource: Epic Cure / Shutterstock\n\nFintech stocks including Block (NYSE:SQ) hold massive potential. Over the next decade or so, consumers will continue to demand more modern methods of banking and financial services. Block’s current size, position, and growth mean that it is the best overall fintech stock to hold over that period.\n\nLet’s pull back and consider the landscape here. Boston Consulting Group expects compound annual growth of 17% for U.S. fintech through 2030. Fintech revenues should grow from $245 billion to $1.5 trillion based on data released in early May. The sector is going to make a lot of investors rich in the coming years.\n\nBlock is the clear U.S. pick here. Truly risk-forward investors should consider Asian firms where 32% annual growth is expected through 2030. Square continues to be a massive part of Block’s performance. But Cash App has become an even bigger profit-generating machine for the company. Block continues to be positioned to capture that growth in the U.S. market.\n\nWalmart (WMT)  hands at desk near laptop computer, with one hand holding a pile of hundred dollar bills. Bank stocks\n\nSource: shutterstock.com/CC7\n\nI once read that Walmart (NYSE:WMT) fairly represents the U.S. economy. The idea was simple — Walmart offers a wide cross-section of the goods and services Americans buy. So, I’m sure there’s some truth to that notion.\n\nHowever, from a growth perspective, Walmart outpaces the U.S. For example, U.S. GDP grew by 1.6% in the first quarter. GDP is a summation of the value of all the goods and services produced so it’s roughly analogous to revenue. And Walmart’s revenues increased by 7.6% in the first quarter so it continues to be a growth machine.\n\nWhat many might not recognize when discussing Walmart is that the company is fast becoming an eCommerce force. eCommerce grew by 27% domestically and by 25% internationally. Walmart is not content to dominate brick-and-mortar retail. It is going to continue to chip away at Amazon (NASDAQ: AMZN) and other eCommerce-first firms well into the future.\n\nJPMorgan Chase (JPM) tree growing on coin of stacking with green bokeh background; growth stocks\n\nSource: Freedom365day / Shutterstock.com\n\nJPMorgan Chase (NYSE:JPM) has already shown investors the strategy it uses when it shrewdly took advantage of the recent banking collapse. While acting as a bulwark against total collapse, the company simultaneously played big brother and calculating advisor. It pledged funds to prevent a collapse of regional banks, sure. But it also swooped in and took what it wanted from First Republic: Wealthy coastal clientele.\n\nJPMorgan Chase intends to get bigger – it’s already the largest bank in the U.S. – and become higher quality. It is getting bigger and making deeper inroads with the coastal elite. Unsurprisingly that has ruffled feathers and furthered divisions with political lines. In fact, GOP states have sent a letter to the company for religious bias in lending practices.\n\nHow does this all relate to JPMorgan Chase’s long-term prospects? It means the bank has become more entrenched with coastal wealth and the political associations therewith. That’s where the money is for the most part with tech in the west and finance in the east. It means the bank should only get stronger.\n\nApplied Materials (AMAT)  a green button on a keyboard has an arrow pointing upward with the word \"Buy\". representing safe stocks to buy\n\nSource: AdityaB. Photography/ShutterStock.com\n\nApplied Materials (NASDAQ:AMAT) provides goods in the form of manufacturing equipment and services as software to the chip sector. It’s basically a high-quality stock that runs adjacent to the semiconductor industry and has growth prospects aplenty. The semiconductor industry should reach $1 trillion in revenues by 2030. That assumes 6% to 10% annual growth over the intervening years.\n\nAMAT has been a tremendous growth stock over the last decade, providing 25.75% returns annually. Any investment placed 10 years ago and left untouched would have multiplied in value nearly 10 times. Some of that growth was due to 20% industry-wide growth in 2021 during the chip boom. Such spikes are unpredictable. But even absent that spike AMAT shares grew rapidly in the run-up.\n\nOne of my favorite ways to predict if a company will produce gains over time is by comparing returns on invested capital to the weighted average cost of capital (WACC). The greater the discrepancy, the better. Applied Materials’ ROIC is 33.92% and its ROIC is 9.68%.\n\nVerizon (VZ) image of businessperson and bar graph with dollar signs to represent undervalued stocks\n\nSource: Wright Studio/Shutterstock.com\n\nThe Verizon (NYSE:VZ) stock has not done well over the last decade. It provided 1.73% returns annually during the last decade. That means $1,000 would have grown to a “massive” $1,137 if left untouched. However, Verizon’s past, hopefully, won’t be its future.\n\nThe reason so many investors are keen on Verizon is 5G. The 5G market is expected to grow by roughly 60% annually between 2023 and 2030. Forget the recent past and embrace the potential of the future in other words. That’s what is required of investors in VZ stock over the coming years.\n\nVerizon, though, is doing its part to sweeten that deal. It offers a dividend yielding 7.43% currently that hasn’t been reduced since 2000. That means investors get an actual return that is much higher in reality as long as Verizon continues to pay shareholders to hold onto their stock. Further, VZ stock has roughly 20% upside right now based on its target price.\n\nOn the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nAlex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live Did Elon Musk Just Trigger a New Netscape Moment? The $1 Investment You MUST Take Advantage of Right Now The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 7 Long-Term Stocks to Buy and Hold Until 2033 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-long-term-stocks-buy-011948338.html", "symbols": ["AAPL.US", "AMAT.MX", "AMAT.US", "AP2.F", "AP2.XETRA", "JPM.US", "MSFT.US", "NVDA.US", "SQ.US", "VZ.US", "WMT.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.031, "neu": 0.821, "pos": 0.148}}, {"date": "2023-06-01T16:15:00+00:00", "title": "Verizon Brings the Small Business Digital Ready Experience To Live Event in Cleveland", "content": "BASKING RIDGE, NJ / ACCESSWIRE / June 1, 2023 / Verizon announced it will host its second Verizon Small Business Digital Ready Summit, an all-day experience for small business owners to network and participate in live events designed to help them grow their businesses, in Cleveland, Ohio on June 12, 2023, at Cleveland State University. In partnership with the global professional education and networking platform, Luminary, the summit aims to bring valuable business insights and strategies to small business owners.\n\nParticipants of the Verizon Small Business Digital Ready: Cleveland Summit will have the opportunity to engage in robust workshops and educational sessions, with the goal of building connections and learning from subject matter experts, including local small business owners. In addition, Verizon is giving away a free Chromebook to five small business registrants who attend the summit1. To learn more about the event and to register, visit Verizon Small Business Digital Ready: Cleveland Summit.\n\n\"At Verizon, we take pride in serving the unique needs of local markets,\" said Jessica Cohen, Director of Community Engagement, Verizon. \"We are thrilled to bring this informative Verizon Small Business Digital Ready Summit to Cleveland-based small businesses. Small businesses are at the heart of Cleveland's economy and, at Verizon, a focus of our responsible business plan is to ensure small businesses have access to the tools and services needed to succeed in the digital economy.\"\n\nLaunched in 2021, Verizon Small Business Digital Ready is a free online resource designed to give small businesses the tools they need to thrive in today's digital economy. Small businesses can access personalized learning through over 40 courses, mentorship, peer networking, 1:1 expert coaching and incentives such as grant funding. In partnership with LISC and Next Street, the Verizon Small Business Digital Ready portal was created with and for small businesses, with a specific focus on helping diverse and under-resourced business owners. Spanish language course offerings, coaching from experts and community events are also available. Since its launch, over 900 Cleveland-based small businesses have registered and engaged with the platform.\n\nThis initiative is part of Verizon's goal to support 1M small businesses by 2030 with the resources to thrive in the digital economy, as part of its responsible business plan: Citizen Verizon. Visit CitizenVerizon.com to learn more about the company's responsible business efforts.\n\n1 No purchase necessary. Must be present to win. Sweepstakes starts June 12, 2023 at 9:00 AM Eastern Time (ET) and ends on June 12, 2023, at 12 PM ET. Must be a legal U.S. resident 18 years or older to enter. Void where prohibited. Sponsor: Verizon Corporate Services Group Inc. For official rules, see weareluminary.com/Verizon-Cleveland-Summit. Verizon, Thursday, June 1, 2023, Press release picture\n\nView additional multimedia and more ESG storytelling from Verizon on 3blmedia.com.\n\nContact Info:\r\nSpokesperson: Verizon\r\nWebsite: https://www.3blmedia.com/profiles/verizon\r\nEmail: info@3blmedia.com\n\nSOURCE: Verizon\n\nView source version on accesswire.com: \r\nhttps://www.accesswire.com/758663/Verizon-Brings-the-Small-Business-Digital-Ready-Experience-To-Live-Event-in-Cleveland", "link": "https://finance.yahoo.com/news/verizon-brings-small-business-digital-161500925.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.004, "neu": 0.832, "pos": 0.164}}, {"date": "2023-06-01T16:12:00+00:00", "title": "Verizon offers exclusive savings via myPlan perks and first-of-its-kind streaming bundle on +play", "content": "Verizon Sourcing LLC\n\nSave on the subscriptions you love on the network you rely on: Choose the myPlan +play perk and get Netflix’s Premium Plan and the Paramount+ with SHOWTIME bundle together at incredible savings – only for Verizon customers, and only on +play\n\nNEW YORK, June 01, 2023 (GLOBE NEWSWIRE) -- Verizon today announced another first in the industry – for the first time, Netflix, Paramount+ and SHOWTIME are offered together as a bundle with exclusive savings and access only on +play, once again innovating on behalf of customers and driving the industry forward. Starting tomorrow and for a limited time, get Netflix’s Premium Plan and the Paramount+ with SHOWTIME bundle together for just $25.991 – all on the Network America relies on.\n\nThis is the first time the streaming giants have been offered together, giving Verizon customers added value on their premium services ($70 in annual savings2) they can’t get elsewhere – and the benefits of being on the network America relies on.\n\n+play is Verizon’s one-stop-shop to discover, purchase and save on subscription services, and now features over 30 partners spanning from entertainment to education, lifestyle to fitness and more. With myPlan, customers can get more savings for subscriptions on +play via myPlan’s +play monthly credit perk – that’s just $10 for $15 in +play credits.\n\nWhy it’s important: \r\n+play gives Verizon customers access to value and savings that they can’t get anywhere else. With over 30 services available on the platform, +play has offers ranging from exclusive free trials to one year of a Netflix Premium subscription on us with the purchase of another service on +play.\n\nWhat executives are saying:\r\nErin McPherson, Chief Content Officer, Verizon Consumer Group: “With partners like Netflix and Paramount+ with SHOWTIME on +play, we’re leading the industry in offering customers the content they want, with never-before-seen bundles they can’t get anywhere else. And now with +play as a perk offered with myPlan, we’re looking forward to even more customers taking advantage of the savings we have to offer. This marks a milestone for both Verizon and the streaming industry, and we’re grateful and excited to be in it with these partners.”\n\nJeff Shultz, Chief Strategy Officer and Chief Business Development Officer at Paramount Streaming: “This new and distinctive streaming bundle on Verizon’s +play is yet another example of our commitment to offering consumers universal distribution and industry-leading deals. By partnering with Verizon, we are making our broad and popular streaming offering on Paramount+ with SHOWTIME just that more accessible.”\n\nWho it’s for:\r\nStreaming fans who want to get in on savings for some of today’s most popular content, like 1923, Yellowjackets, Extraction 2 (streaming on Netflix June 16) and more – all in one place.\n\n+play is available to all Verizon mobile, 5G Home and LTE Home Internet customers who want exciting content from entertainment, lifestyle, gaming and more – all in one place and only on Verizon.\n\nEven more to know and love about +play: \r\nVerizon launched +play as a solution to common customer pain points, such as keeping track of current subscription services and payments, discovering new content and finding ways to save.\n\nIt’s a single place where customers can easily search, subscribe to, save on and pay for their subscription services. It builds on the services we already offer through leading content providers including Disney+, Hulu, ESPN+, discovery+ and AMC+, all of which are featured in the new service, and introduces new subscription service partners, like NFL+, NBA League Pass, Max (formerly HBO Max), Netflix, the Peloton App, A+E Networks (Lifetime Movie Club, HISTORY Vault, and A&E Crime Central), The Athletic, Calm, Starz, AMC and Duolingo, among many others – with more to come later this year.\n\nMore +play discounts for mobile customers via myPlan, with plans starting at $25/line:\r\nmyPlan is the first plan in the U.S. that gives customers freedom and full control to pay for what you want, exactly how you want it. And for a limited time, when you bring your phones to Verizon you can get the new Unlimited Welcome phone plan for $25/line/month when you add four lines (plus taxes and fees with Auto Pay3).\n\nPlus, get even more added savings for subscriptions on +play via the +play monthly credit perk in myPlan, which is $10 for $15 in +play credits. And for customers with multiple lines, the savings only multiply.\n\nLearn more about the Netflix, Paramount+ and SHOWTIME bundle offer – as well as other savings – by visiting plusplay.verizon.com, or myPlan to take advantage of +play perks.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: \r\nCaroline Brooks\r\ncaroline.brooks@verizon.com\n\n______________________________________\n\n1 Plus taxes. Offer only applies to new subscribers of Paramount+ Premium with SHOWTIME® bundle and new or existing subscribers of Netflix Premium. Existing Paramount+ Premium with SHOWTIME® bundle subscribers must first cancel their current subscription to be eligible for this offer; existing Netflix Premium subscribers can link their existing account to this offer. Not combinable with any other promotional offers or pricing. Billing begins from time of activation of first service. Separate activation required for each service. Limited-time offer. Add’l terms apply. Paramount+ Dungeons & Dragons © 2023 Par. Pics. TM Hasbro.\n\n2 Savings based on Netflix Premium and Paramount+ Premium with SHOWTIME® bundle monthly retail plan prices.\n\n3 $180 promo credit per phone applied over 36 mos when you add 4 new smartphone lines with your own 4G/5G smartphone on Unlimited Welcome plan. Promo credit ends if eligibility req’s are no longer met. Limited time offer. 3-yr Price Guarantee: Applies to the then-current base monthly rate charged by Verizon for your talk, text, and data; excludes taxes, fees, surcharges, additional plan discounts or promotions, and third-party services. Price guarantee is void if any of the lines are canceled or moved to an ineligible plan. Plan perks, taxes, fees, and surcharges are subject to change. Unlimited Welcome: $30/line for 4 lines, less $5/line discount. Max 12 lines. Auto Pay (Debit Card, Bank account, or Verizon Visa Card) & paper-free billing req’d. Unlimited 5G / 4G LTE: For Unlimited Welcome plan, in times of congestion, your data may be temporarily slower than other traffic. Mobile Hotspot not included on Unlimited Welcome plan. Domestic data roaming at 2G speeds. 5G access requires a 5G capable device.", "link": "https://finance.yahoo.com/news/verizon-offers-exclusive-savings-via-161200326.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.02, "neu": 0.867, "pos": 0.113}}, {"date": "2023-06-01T16:12:00+00:00", "title": "Verizon offers exclusive savings via myPlan perks and first-of-its-kind streaming bundle on +play", "content": "Save on the subscriptions you love on the network you rely on: Choose the myPlan +play perk and get Netflix’s Premium Plan and the Paramount+ with SHOWTIME bundle together at incredible savings – only for Verizon customers, and only on +play\n\nNEW YORK, June  01, 2023  (GLOBE NEWSWIRE) -- Verizon today announced another first in the industry – for the first time, Netflix, Paramount+ and SHOWTIME are offered together as a bundle with exclusive savings and access only on +play, once again innovating on behalf of customers and driving the industry forward. Starting tomorrow and for a limited time, get Netflix’s Premium Plan and the Paramount+ with SHOWTIME bundle together for just $25.991 – all on the Network America relies on.\n\nThis is the first time the streaming giants have been offered together, giving Verizon customers added value on their premium services ($70 in annual savings2) they can’t get elsewhere – and the benefits of being on the network America relies on.\n\n+play is Verizon’s one-stop-shop to discover, purchase and save on subscription services, and now features over 30 partners spanning from entertainment to education, lifestyle to fitness and more. With myPlan, customers can get more savings for subscriptions on +play via myPlan’s +play monthly credit perk – that’s just $10 for $15 in +play credits.\n\nWhy it’s important: \r\n+play gives Verizon customers access to value and savings that they can’t get anywhere else. With over 30 services available on the platform, +play has offers ranging from exclusive free trials to one year of a Netflix Premium subscription on us with the purchase of another service on +play.\n\nWhat executives are saying:\r\nErin McPherson, Chief Content Officer, Verizon Consumer Group: “With partners like Netflix and Paramount+ with SHOWTIME on +play, we’re leading the industry in offering customers the content they want, with never-before-seen bundles they can’t get anywhere else. And now with +play as a perk offered with myPlan, we’re looking forward to even more customers taking advantage of the savings we have to offer. This marks a milestone for both Verizon and the streaming industry, and we’re grateful and excited to be in it with these partners.”\n\nJeff Shultz, Chief Strategy Officer and Chief Business Development Officer at Paramount Streaming: “This new and distinctive streaming bundle on Verizon’s +play is yet another example of our commitment to offering consumers universal distribution and industry-leading deals. By partnering with Verizon, we are making our broad and popular streaming offering on Paramount+ with SHOWTIME just that more accessible.”\n\nWho it’s for:\r\nStreaming fans who want to get in on savings for some of today’s most popular content, like 1923, Yellowjackets, Extraction 2 (streaming on Netflix June 16) and more – all in one place.\n\n+play is available to all Verizon mobile, 5G Home and LTE Home Internet customers who want exciting content from entertainment, lifestyle, gaming and more – all in one place and only on Verizon.\n\nEven more to know and love about +play: \r\nVerizon launched +play as a solution to common customer pain points, such as keeping track of current subscription services and payments, discovering new content and finding ways to save.\n\nIt’s a single place where customers can easily search, subscribe to, save on and pay for their subscription services. It builds on the services we already offer through leading content providers including Disney+, Hulu, ESPN+, discovery+ and AMC+, all of which are featured in the new service, and introduces new subscription service partners, like NFL+, NBA League Pass, Max (formerly HBO Max), Netflix, the Peloton App, A+E Networks (Lifetime Movie Club, HISTORY Vault, and A&E Crime Central), The Athletic, Calm, Starz, AMC and Duolingo, among many others – with more to come later this year.\n\nMore +play discounts for mobile customers via myPlan, with plans starting at $25/line:\r\nmyPlan is the first plan in the U.S. that gives customers freedom and full control to pay for what you want, exactly how you want it. And for a limited time, when you bring your phones to Verizon you can get the new Unlimited Welcome phone plan for $25/line/month when you add four lines (plus taxes and fees with Auto Pay3).\n\nPlus, get even more added savings for subscriptions on +play via the +play monthly credit perk in myPlan, which is $10 for $15 in +play credits. And for customers with multiple lines, the savings only multiply.\n\nLearn more about the Netflix, Paramount+ and SHOWTIME bundle offer – as well as other savings – by visiting plusplay.verizon.com, or myPlan to take advantage of +play perks.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: \r\nCaroline Brooks\r\ncaroline.brooks@verizon.com\n\n______________________________________\n\n1 Plus taxes. Offer only applies to new subscribers of Paramount+ Premium with SHOWTIME® bundle and new or existing subscribers of Netflix Premium. Existing Paramount+ Premium with SHOWTIME® bundle subscribers must first cancel their current subscription to be eligible for this offer; existing Netflix Premium subscribers can link their existing account to this offer. Not combinable with any other promotional offers or pricing. Billing begins from time of activation of first service. Separate activation required for each service. Limited-time offer. Add’l terms apply. Paramount+ Dungeons & Dragons © 2023 Par. Pics. TM Hasbro.\n\n2 Savings based on Netflix Premium and Paramount+ Premium with SHOWTIME® bundle monthly retail plan prices.\n\n3 $180 promo credit per phone applied over 36 mos when you add 4 new smartphone lines with your own 4G/5G smartphone on Unlimited Welcome plan. Promo credit ends if eligibility req’s are no longer met. Limited time offer. 3-yr Price Guarantee: Applies to the then-current base monthly rate charged by Verizon for your talk, text, and data; excludes taxes, fees, surcharges, additional plan discounts or promotions, and third-party services. Price guarantee is void if any of the lines are canceled or moved to an ineligible plan. Plan perks, taxes, fees, and surcharges are subject to change. Unlimited Welcome: $30/line for 4 lines, less $5/line discount. Max 12 lines. Auto Pay (Debit Card, Bank account, or Verizon Visa Card) & paper-free billing req’d. Unlimited 5G / 4G LTE: For Unlimited Welcome plan, in times of congestion, your data may be temporarily slower than other traffic. Mobile Hotspot not included on Unlimited Welcome plan. Domestic data roaming at 2G speeds. 5G access requires a 5G capable device.", "link": "https://www.globenewswire.com/news-release/2023/06/01/2680663/0/en/Verizon-offers-exclusive-savings-via-myPlan-perks-and-first-of-its-kind-streaming-bundle-on-play.html", "symbols": ["VZ.US"], "tags": ["ARTS & ENTERTAINMENT", "NYSE:VZ", "PRODUCT / SERVICES ANNOUNCEMENT", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.999, "neg": 0.02, "neu": 0.866, "pos": 0.114}}, {"date": "2023-06-01T13:30:00+00:00", "title": "Verizon brings the Small Business Digital Ready experience to live event in Cleveland", "content": "BASKING RIDGE, N.J., June  01, 2023  (GLOBE NEWSWIRE) -- Verizon announced it will host its second Verizon Small Business Digital Ready Summit, an all-day experience for small business owners to network and participate in live events designed to help them grow their businesses, in Cleveland, Ohio on June 12, 2023, at Cleveland State University. In partnership with the global professional education and networking platform, Luminary, the summit aims to bring valuable business insights and strategies to small business owners.\n\nParticipants of the Verizon Small Business Digital Ready: Cleveland Summit will have the opportunity to engage in robust workshops and educational sessions, with the goal of building connections and learning from subject matter experts, including local small business owners. In addition, Verizon is giving away a free Chromebook to five small business registrants who attend the summit1. To learn more about the event and to register, visit Verizon Small Business Digital Ready: Cleveland Summit.\n\n“At Verizon, we take pride in serving the unique needs of local markets,” said Jessica Cohen, Director of Community Engagement, Verizon. “We are thrilled to bring this informative Verizon Small Business Digital Ready Summit to Cleveland-based small businesses. Small businesses are at the heart of Cleveland’s economy and, at Verizon, a focus of our responsible business plan is to ensure small businesses have access to the tools and services needed to succeed in the digital economy.”\n\nLaunched in 2021, Verizon Small Business Digital Ready is a free online resource designed to give small businesses the tools they need to thrive in today’s digital economy. Small businesses can access personalized learning through over 40 courses, mentorship, peer networking, 1:1 expert coaching and incentives such as grant funding. In partnership with LISC and Next Street, the Verizon Small Business Digital Ready portal was created with and for small businesses, with a specific focus on helping diverse and under-resourced business owners. Spanish language course offerings, coaching from experts and community events are also available. Since its launch, over 900 Cleveland-based small businesses have registered and engaged with the platform.\n\nThis initiative is part of Verizon’s goal to support 1M small businesses by 2030 with the resources to thrive in the digital economy, as part of its responsible business plan: Citizen Verizon. Visit CitizenVerizon.com to learn more about the company’s responsible business efforts.\n\n1No purchase necessary. Must be present to win. Sweepstakes starts June 12, 2023 at 9:00 AM Eastern Time (ET) and ends on June 12, 2023, at 12 PM ET. Must be a legal U.S. resident 18 years or older to enter. Void where prohibited. Sponsor: Verizon Corporate Services Group Inc. For official rules, see weareluminary.com/Verizon-Cleveland-Summit.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nCitizen Verizon is the company’s responsible business plan for economic, environmental and social advancement. Citizen Verizon empowers Verizon to deliver on its mission to move the world forward through action by expanding digital access and resources, protecting the climate, and ensuring people have the skills needed for jobs of the future. Through Citizen Verizon, and the key pillars of Digital Inclusion, Climate Protection and Human Prosperity, the company's responsible business goals include providing 10 million youths with digital skills training by 2030, supporting 1 million small businesses with resources to help them thrive in the digital economy by 2030, achieving net zero emissions in its operations by 2035, and preparing 500,000 individuals for jobs of the future by 2030. Learn more at CitizenVerizon.com.\n\nFounded in 2018, Luminary is a global membership-based professional education and networking platform created to address the systemic challenges impacting women across all industries and sectors. Built with the mission to uplift, upskill, and propel women and their allies forward through all phases of their professional journey, Luminary is the ultimate career advocate providing tools and resources to advance, build, connect, and develop -- whether entering or re-entering the workforce, a senior executive or a leader positioned in the \"Power Middle\", embarking on a career transition or entrepreneurship.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: Bernadette Brijlall\r\nbernadette.brijlall@verizon.com\n\nHerbert Nyarko\r\nherbert.aidoo-nyarko@verizon.com", "link": "https://www.globenewswire.com/news-release/2023/06/01/2680462/0/en/Verizon-brings-the-Small-Business-Digital-Ready-experience-to-live-event-in-Cleveland.html", "symbols": ["VZ.US"], "tags": ["CALENDAR OF EVENTS", "NYSE:VZ", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.998, "neg": 0.002, "neu": 0.869, "pos": 0.129}}, {"date": "2023-06-01T13:30:00+00:00", "title": "Verizon brings the Small Business Digital Ready experience to live event in Cleveland", "content": "Verizon Sourcing LLC\n\nBASKING RIDGE, N.J., June 01, 2023 (GLOBE NEWSWIRE) -- Verizon announced it will host its second Verizon Small Business Digital Ready Summit, an all-day experience for small business owners to network and participate in live events designed to help them grow their businesses, in Cleveland, Ohio on June 12, 2023, at Cleveland State University. In partnership with the global professional education and networking platform, Luminary, the summit aims to bring valuable business insights and strategies to small business owners.\n\nParticipants of the Verizon Small Business Digital Ready: Cleveland Summit will have the opportunity to engage in robust workshops and educational sessions, with the goal of building connections and learning from subject matter experts, including local small business owners. In addition, Verizon is giving away a free Chromebook to five small business registrants who attend the summit1. To learn more about the event and to register, visit Verizon Small Business Digital Ready: Cleveland Summit.\n\n“At Verizon, we take pride in serving the unique needs of local markets,” said Jessica Cohen, Director of Community Engagement, Verizon. “We are thrilled to bring this informative Verizon Small Business Digital Ready Summit to Cleveland-based small businesses. Small businesses are at the heart of Cleveland’s economy and, at Verizon, a focus of our responsible business plan is to ensure small businesses have access to the tools and services needed to succeed in the digital economy.”\n\nLaunched in 2021, Verizon Small Business Digital Ready is a free online resource designed to give small businesses the tools they need to thrive in today’s digital economy. Small businesses can access personalized learning through over 40 courses, mentorship, peer networking, 1:1 expert coaching and incentives such as grant funding. In partnership with LISC and Next Street, the Verizon Small Business Digital Ready portal was created with and for small businesses, with a specific focus on helping diverse and under-resourced business owners. Spanish language course offerings, coaching from experts and community events are also available. Since its launch, over 900 Cleveland-based small businesses have registered and engaged with the platform.\n\nThis initiative is part of Verizon’s goal to support 1M small businesses by 2030 with the resources to thrive in the digital economy, as part of its responsible business plan: Citizen Verizon. Visit CitizenVerizon.com to learn more about the company’s responsible business efforts.\n\n1No purchase necessary. Must be present to win. Sweepstakes starts June 12, 2023 at 9:00 AM Eastern Time (ET) and ends on June 12, 2023, at 12 PM ET. Must be a legal U.S. resident 18 years or older to enter. Void where prohibited. Sponsor: Verizon Corporate Services Group Inc. For official rules, see weareluminary.com/Verizon-Cleveland-Summit.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nCitizen Verizon is the company’s responsible business plan for economic, environmental and social advancement. Citizen Verizon empowers Verizon to deliver on its mission to move the world forward through action by expanding digital access and resources, protecting the climate, and ensuring people have the skills needed for jobs of the future. Through Citizen Verizon, and the key pillars of Digital Inclusion, Climate Protection and Human Prosperity, the company's responsible business goals include providing 10 million youths with digital skills training by 2030, supporting 1 million small businesses with resources to help them thrive in the digital economy by 2030, achieving net zero emissions in its operations by 2035, and preparing 500,000 individuals for jobs of the future by 2030. Learn more at CitizenVerizon.com.\n\nFounded in 2018, Luminary is a global membership-based professional education and networking platform created to address the systemic challenges impacting women across all industries and sectors. Built with the mission to uplift, upskill, and propel women and their allies forward through all phases of their professional journey, Luminary is the ultimate career advocate providing tools and resources to advance, build, connect, and develop -- whether entering or re-entering the workforce, a senior executive or a leader positioned in the \"Power Middle\", embarking on a career transition or entrepreneurship.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: Bernadette Brijlall\r\nbernadette.brijlall@verizon.com\n\nHerbert Nyarko\r\nherbert.aidoo-nyarko@verizon.com", "link": "https://finance.yahoo.com/news/verizon-brings-small-business-digital-133000582.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.002, "neu": 0.87, "pos": 0.129}}, {"date": "2023-06-01T13:00:00+00:00", "title": "Join the network America relies on starting at $25/line with savings on gifts for Dads and Grads - only on Verizon", "content": "Verizon Sourcing LLC\n\nNEW YORK, June 01, 2023 (GLOBE NEWSWIRE) --\n\nWhat: Whether it’s a new, flexible phone plan, device discounts, cool accessories or blazing-fast internet savings, Verizon’s got the goods for dads and grads this season.\n\nFor a limited time, when you bring your phones to Verizon get the new Unlimited Welcome phone plan for $25/line/month when you add four lines with Auto Pay (plus taxes and fees).1 With the Unlimited Plus plan, get a three-year price guarantee,(price guarantee excludes taxes and fees),2 Verizon Home Internet starting at $25/mo with Auto Pay, and take advantage of up to 50% off connected device plans. And of course, don’t miss out on the latest audio and gaming accessories for less than $100 including JBL Quantum 400 Gaming Headset; Google Nest Hub and more.\n\nWhy: Unleash the gifts that keep on giving with the peace of mind knowing you’re on America’s most reliable 5G network.3\r\nHow: Visit verizon.com, your local Verizon retail store, or use the My Verizon app. Snag these epic savings before they’re gone!\n\nWith myPlan you get exactly what you want. Only pay for what you need.\n\nCustomize your mobile phone plan with myPlan and make it a personalized gift to remember. Choose your Unlimited network option and your favorite content and streaming services at a price that can’t be beat. Every single perk offers savings ranging between $3 to $35 in value.\n\nmyPlan made for Dad: If Dad loves a content library chock full of incredible movies, shows and sports, match Unlimited Plus with the Disney Bundle perk that features Disney+, ESPN+ and Hulu.4 If online shopping and saving on entertainment is more Dad’s style, pair Unlimited Welcome with the Walmart+ Membership perk that also includes Paramount+.4 myPlan for the traveling grad: Consider 100 GB Mobile Hotspot or 3 TravelPass Days so they stay connected wherever they may roam. If they prefer streaming, gaming or a variety of other options, +play is your best bet.5 Choose from over 30 services such as Netflix, Paramount+, Super Duolingo, Calm and Xbox Game Pass Ultimate. Also, take advantage of the first time Netflix, Paramount+ and SHOWTIME have ever been offered as a bundle with exclusive savings and access only on +play.\n\nOur favorite accessories for gifting\n\nThere are Great gifts for Dads or Grads available for less than $100. Take advantage of our latest deals including: JBL Quantum 400 Gaming Headset; Google Nest Hub (2nd Gen); Fitbit Inspire 3; UAG Civilian phone case for Samsung Galaxy S23 Ultra and more.\n\nVisit verizon.com, your local Verizon retail store, or use the My Verizon app. Grab these deals while they last!\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\n1 $180 promo credit per phone applied over 36 mos when you add 4 new smartphone lines with your own 4G/5G smartphone on Unlimited Welcome plan. Promo credit ends if eligibility req’s are no longer met. Limited time offer. Unlimited Welcome: $30/line for 4 lines, less $5/line discount. Max 12 lines. Auto Pay & paper-free billing req’d. Unlimited 5G / 4G LTE: For Unlimited Welcome plan, in times of congestion, your data may be temporarily slower than other traffic. Mobile Hotspot not included on Unlimited Welcome plan. Domestic data roaming at 2G speeds.\n\n2 3-yr Price Guarantee: Applies to the then-current base monthly rate charged by Verizon for your talk, text, and data; excludes taxes, fees, surcharges, additional plan discounts or promotions, and third-party services. Price guarantee is void if any of the lines are canceled or moved to an ineligible plan. Plan perks, taxes, fees, and surcharges are subject to change.\n\n3Most reliable 5G network based on more first place rankings in RootMetrics’ 5G data reliability assessments of 125 metro markets conducted in 2H 2021. Tested with best commercially available smartphones on three national mobile networks across all available network types, excluding C-band. Your experiences may vary. RootMetrics rankings are not an endorsement of Verizon.\n\n4 3rd party entertainment offers require a line subscribed to Unlimited Welcome or Unlimited Plus. Must be 18 yrs or older. Cancel anytime. One offer per eligible Verizon line. Add’lt terms apply. Disney Bundle includes Disney+ (No Ads), Hulu (w/Ads), and ESPN+ (w/Ads). EXISTING DISNEY+, HULU OR ESPN+ subscribers: Offer will not automatically replace existing subscription(s). Managing subscriptions may be required to avoid multiple subscriptions and corresponding charges. Terms apply. +play Monthly Credit Must be Account Owner/Manager to purchase. Credit must be used within 30 days.\n\n5 +play access included for Verizon postpaid mobile, 5G Home, and LTE Home subscribers.  Exclusive savings available on select partner subscriptions. All products and services sold on +play require a separate subscription or purchase.\n\nMedia contact: Ashley Colette\r\nashleytcolette@gmail.com\r\n908-655-8471", "link": "https://finance.yahoo.com/news/join-network-america-relies-starting-130000046.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.026, "neu": 0.859, "pos": 0.115}}, {"date": "2023-06-01T13:00:00+00:00", "title": "Verizon upgrades network for Orlando customers", "content": "Verizon Sourcing LLC\n\nCompany responds to massive traffic and population growth throughout the market with additional cell sites, capacity growth in its fiber network and additional spectrum\n\nORLANDO, Fla., June 01, 2023 (GLOBE NEWSWIRE) -- With people flocking to Orlando, drawn to the unbeatable weather, endless options for family fun and miles of beautiful coastline, Verizon has seen a massive increase in data usage on its network in the community. To address that increase in data usage and prepare for the continued influx expected throughout the summer months, Verizon has recently made major upgrades to the network serving customers in Orlando, FL. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Orlando include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\nEngineers have deployed 5G Ultra Wideband service using Millimeter Wave (mmWave), its premium, high-band spectrum which allows for extremely fast speeds and massive capacity as well as C-band spectrum designed for fast speeds, high capacity and wide coverage. 5G Ultra Wideband service is now available around Gotha, CasselBerry, along University Blvd and 417 in the Summer Woods area, University Blvd, Icon park, the Orlando Outlet Market, the South Orange area, Sea World, and Disney Blizzard Beach. Orlando’s 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum.  Verizon engineers are using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Orlando will be able to take advantage of more than twice that amount of spectrum as it becomes available for 5G Ultra Wideband.  That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services. Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Orlando. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links.  Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network.  Verizon has increased the capacity on the fiber connections in many cell sites in the Orlando area so they can carry 10 times the amount of data.\n\n“We know residents and visitors to Orlando count on us for reliable, secure, communication, and we are working hard to keep up with the significant increase in demand we are seeing in Orlando to ensure we deliver for them,” said Eric Lia, Vice President of Engineering and Operations for Verizon. “The investments we’ve made in the recent past have made a big difference in the level of service customers in Orlando are receiving, and we are not slowing down with our upgrades in this market.”\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place, smartphones with countless opportunities to use data in a highly mobile environment, home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, and complex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nOrlando, FL customers have an outstanding experience on Verizon’s network\n\nDespite the increases in demand on the network, the recent upgrades have led to customers having a solid experience on the Verizon network in Orlando, FL, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Orlando, Verizon is unbeaten in overall network performance, accessibility and call and text performance. Today’s results show great speeds for Verizon customers in Orlando with Verizon’s median download speed increasing 13% since last year* in the market.\n\nServices from the network customers rely on\n\nFor customers in Orlando, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with Auto Pay and select 5G mobile plans – all without hidden fees, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals For the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Victor Valley area will also be able to experience the benefits of these network enhancements.  To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nOrlando area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is incredibly fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Orlando RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Plans start at $25/mo. when combined with a postpaid mobile unlimited plan that includes 5G Ultra Wideband. Auto Pay and paper-free billing req’d.Subject to credit approval.\n\nMEDIA CONTACT:\r\nKaren Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://finance.yahoo.com/news/verizon-upgrades-network-orlando-customers-130000976.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.011, "neu": 0.91, "pos": 0.078}}, {"date": "2023-06-01T13:00:00+00:00", "title": "Join the network America relies on starting at $25/line with savings on gifts for Dads and Grads - only on Verizon", "content": "NEW YORK, June  01, 2023  (GLOBE NEWSWIRE) --\n\nWhat: Whether it’s a new, flexible phone plan, device discounts, cool accessories or blazing-fast internet savings, Verizon’s got the goods for dads and grads this season.\n\nFor a limited time, when you bring your phones to Verizon get the new Unlimited Welcome phone plan for $25/line/month when you add four lines with Auto Pay (plus taxes and fees).1With the Unlimited Plus plan, get a three-year price guarantee,(price guarantee excludes taxes and fees),2 Verizon Home Internet starting at $25/mo with Auto Pay, and take advantage of up to 50% off connected device plans.And of course, don’t miss out on the latest audio and gaming accessories for less than $100 including JBL Quantum 400 Gaming Headset; Google Nest Hub and more.\n\nWhy: Unleash the gifts that keep on giving with the peace of mind knowing you’re on America’s most reliable 5G network.3\r\nHow: Visit verizon.com, your local Verizon retail store, or use the My Verizon app. Snag these epic savings before they’re gone!\n\nWith myPlan you get exactly what you want. Only pay for what you need.\n\nCustomize your mobile phone plan with myPlan and make it a personalized gift to remember. Choose your Unlimited network option and your favorite content and streaming services at a price that can’t be beat. Every single perk offers savings ranging between $3 to $35 in value.\n\nmyPlan made for Dad: If Dad loves a content library chock full of incredible movies, shows and sports, match Unlimited Plus with the Disney Bundle perk that features Disney+, ESPN+ and Hulu.4 If online shopping and saving on entertainment is more Dad’s style, pair Unlimited Welcome with the Walmart+ Membership perk that also includes Paramount+.4myPlan for the traveling grad: Consider 100 GB Mobile Hotspot or 3 TravelPass Days so they stay connected wherever they may roam. If they prefer streaming, gaming or a variety of other options, +play is your best bet.5 Choose from over 30 services such as Netflix, Paramount+, Super Duolingo, Calm and Xbox Game Pass Ultimate. Also, take advantage of the first time Netflix, Paramount+ and SHOWTIME have ever been offered as a bundle with exclusive savings and access only on +play.\n\nOur favorite accessories for gifting\n\nThere are Great gifts for Dads or Grads available for less than $100. Take advantage of our latest deals including: JBL Quantum 400 Gaming Headset; Google Nest Hub (2nd Gen); Fitbit Inspire 3; UAG Civilian phone case for Samsung Galaxy S23 Ultra and more.\n\nVisit verizon.com, your local Verizon retail store, or use the My Verizon app. Grab these deals while they last!\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\n1 $180 promo credit per phone applied over 36 mos when you add 4 new smartphone lines with your own 4G/5G smartphone on Unlimited Welcome plan. Promo credit ends if eligibility req’s are no longer met. Limited time offer. Unlimited Welcome: $30/line for 4 lines, less $5/line discount. Max 12 lines. Auto Pay & paper-free billing req’d. Unlimited 5G / 4G LTE: For Unlimited Welcome plan, in times of congestion, your data may be temporarily slower than other traffic. Mobile Hotspot not included on Unlimited Welcome plan. Domestic data roaming at 2G speeds.\n\n2 3-yr Price Guarantee: Applies to the then-current base monthly rate charged by Verizon for your talk, text, and data; excludes taxes, fees, surcharges, additional plan discounts or promotions, and third-party services. Price guarantee is void if any of the lines are canceled or moved to an ineligible plan. Plan perks, taxes, fees, and surcharges are subject to change.\n\n3Most reliable 5G network based on more first place rankings in RootMetrics’ 5G data reliability assessments of 125 metro markets conducted in 2H 2021. Tested with best commercially available smartphones on three national mobile networks across all available network types, excluding C-band. Your experiences may vary. RootMetrics rankings are not an endorsement of Verizon.\n\n4 3rd party entertainment offers require a line subscribed to Unlimited Welcome or Unlimited Plus. Must be 18 yrs or older. Cancel anytime. One offer per eligible Verizon line. Add’lt terms apply. Disney Bundle includes Disney+ (No Ads), Hulu (w/Ads), and ESPN+ (w/Ads). EXISTING DISNEY+, HULU OR ESPN+ subscribers: Offer will not automatically replace existing subscription(s). Managing subscriptions may be required to avoid multiple subscriptions and corresponding charges. Terms apply. +play Monthly Credit Must be Account Owner/Manager to purchase. Credit must be used within 30 days.\n\n5 +play access included for Verizon postpaid mobile, 5G Home, and LTE Home subscribers.  Exclusive savings available on select partner subscriptions. All products and services sold on +play require a separate subscription or purchase.\n\nMedia contact: Ashley Colette\r\nashleytcolette@gmail.com\r\n908-655-8471", "link": "https://www.globenewswire.com/news-release/2023/06/01/2680388/0/en/Join-the-network-America-relies-on-starting-at-25-line-with-savings-on-gifts-for-Dads-and-Grads-only-on-Verizon.html", "symbols": ["VZ.US"], "tags": ["LIFESTYLE", "NYSE:VZ", "PRODUCT / SERVICES ANNOUNCEMENT", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.998, "neg": 0.026, "neu": 0.858, "pos": 0.116}}, {"date": "2023-06-01T13:00:00+00:00", "title": "Verizon upgrades network for Orlando customers", "content": "ORLANDO, Fla., June  01, 2023  (GLOBE NEWSWIRE) -- With people flocking to Orlando, drawn to the unbeatable weather, endless options for family fun and miles of beautiful coastline, Verizon has seen a massive increase in data usage on its network in the community. To address that increase in data usage and prepare for the continued influx expected throughout the summer months, Verizon has recently made major upgrades to the network serving customers in Orlando, FL. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Orlando include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\nEngineers have deployed 5G Ultra Wideband service using Millimeter Wave (mmWave), its premium, high-band spectrum which allows for extremely fast speeds and massive capacity as well as C-band spectrum designed for fast speeds, high capacity and wide coverage. 5G Ultra Wideband service is now available around Gotha, CasselBerry, along University Blvd and 417 in the Summer Woods area, University Blvd, Icon park, the Orlando Outlet Market, the South Orange area, Sea World, and Disney Blizzard Beach.Orlando’s 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum.  Verizon engineers are using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Orlando will be able to take advantage of more than twice that amount of spectrum as it becomes available for 5G Ultra Wideband.  That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services.Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Orlando. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links.  Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network.  Verizon has increased the capacity on the fiber connections in many cell sites in the Orlando area so they can carry 10 times the amount of data.\n\n“We know residents and visitors to Orlando count on us for reliable, secure, communication, and we are working hard to keep up with the significant increase in demand we are seeing in Orlando to ensure we deliver for them,” said Eric Lia, Vice President of Engineering and Operations for Verizon. “The investments we’ve made in the recent past have made a big difference in the level of service customers in Orlando are receiving, and we are not slowing down with our upgrades in this market.”\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place,smartphones with countless opportunities to use data in a highly mobile environment,home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, andcomplex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nOrlando, FL customers have an outstanding experience on Verizon’s network\n\nDespite the increases in demand on the network, the recent upgrades have led to customers having a solid experience on the Verizon network in Orlando, FL, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Orlando, Verizon is unbeaten in overall network performance, accessibility and call and text performance. Today’s results show great speeds for Verizon customers in Orlando with Verizon’s median download speed increasing 13% since last year* in the market.\n\nServices from the network customers rely on\n\nFor customers in Orlando, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with Auto Pay and select 5G mobile plans – all without hidden fees, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals For the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Victor Valley area will also be able to experience the benefits of these network enhancements.  To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nOrlando area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is incredibly fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Orlando RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Plans start at $25/mo. when combined with a postpaid mobile unlimited plan that includes 5G Ultra Wideband. Auto Pay and paper-free billing req’d.Subject to credit approval.\n\nMEDIA CONTACT:\r\nKaren Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://www.globenewswire.com/news-release/2023/06/01/2680381/0/en/Verizon-upgrades-network-for-Orlando-customers.html", "symbols": ["VZ.US"], "tags": ["NYSE:VZ", "PRODUCT / SERVICES ANNOUNCEMENT", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.996, "neg": 0.012, "neu": 0.911, "pos": 0.077}}, {"date": "2023-06-01T12:45:00+00:00", "title": "This 7%-Yielding Dividend Stock Is Safe and Growing More Secure", "content": "Verizon (NYSE: VZ) currently offers a big-time dividend. The yield is up to an eye-popping 7%, following a roughly 30% slide in the stock price over the past year. That puts its payout several times higher than the S&P 500, which currently yields slightly more than 1.", "link": "https://finance.yahoo.com/m/4118822b-4c3f-378c-9d0b-38ebe8c40666/this-7%25-yielding-dividend.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-06-01T12:31:00+00:00", "title": "6/1/23: Verizon declares quarterly dividend", "content": "Verizon Sourcing LLC\n\nNEW YORK, June 01, 2023 (GLOBE NEWSWIRE) -- The Board of Directors at Verizon Communications Inc. (NYSE, Nasdaq: VZ) today declared a quarterly dividend of 65.25 cents per outstanding share, consistent with the previous three quarters. The quarterly dividend is payable on August 1, 2023, to Verizon shareholders of record at the close of business on July 10, 2023.\n\n“Our consistent financial execution has once again put the Board in a position to declare the dividend,” said Chairman and CEO Hans Vestberg. \"With our disciplined approach and long-term strategy, we continue to focus on maximizing value for our shareholders.”\n\nVerizon has 4.2 billion shares of common stock outstanding. The company made $10.8 billion in cash dividend payments in 2022.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: \r\nEric Wilkens\r\neric.wilkens@verizon.com\r\n201-572-9317\r\n@ericwilkens", "link": "https://finance.yahoo.com/news/6-1-23-verizon-declares-123100008.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.947, "neg": 0.006, "neu": 0.915, "pos": 0.079}}, {"date": "2023-06-01T12:31:00+00:00", "title": "6/1/23: Verizon declares quarterly dividend", "content": "NEW YORK, June  01, 2023  (GLOBE NEWSWIRE) -- The Board of Directors at Verizon Communications Inc. (NYSE, Nasdaq: VZ) today declared a quarterly dividend of 65.25 cents per outstanding share, consistent with the previous three quarters. The quarterly dividend is payable on August 1, 2023, to Verizon shareholders of record at the close of business on July 10, 2023.\n\n“Our consistent financial execution has once again put the Board in a position to declare the dividend,” said Chairman and CEO Hans Vestberg. \"With our disciplined approach and long-term strategy, we continue to focus on maximizing value for our shareholders.”\n\nVerizon has 4.2 billion shares of common stock outstanding. The company made $10.8 billion in cash dividend payments in 2022.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: \r\nEric Wilkens\r\neric.wilkens@verizon.com\r\n201-572-9317\r\n@ericwilkens", "link": "https://www.globenewswire.com/news-release/2023/06/01/2680350/0/en/6-1-23-Verizon-declares-quarterly-dividend.html", "symbols": ["VZ.US"], "tags": ["DIVIDEND REPORTS AND ESTIMATES", "NYSE:VZ", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.947, "neg": 0.006, "neu": 0.914, "pos": 0.08}}, {"date": "2023-06-01T09:50:00+00:00", "title": "3 Ultra-High-Yield Dividend Stocks You Can Buy in June Without Any Hesitation", "content": "Stocks with especially high dividend yields often have underlying issues that you need to check out before buying. Ares Capital (NASDAQ: ARCC) is a business development company (BDC) that provides financing to middle-market businesses. The company is required to pay at least 90% of its taxable income to shareholders in the form of dividends to be exempt from paying federal taxes.", "link": "https://finance.yahoo.com/m/56ff21f7-e843-3b19-8752-b384cceca4d0/3-ultra-high-yield-dividend.html", "symbols": ["ARCC.US", "BAC.F", "BAC.XETRA", "EPD.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0.023, "neu": 0.954, "pos": 0.023}}, {"date": "2023-05-31T21:23:54+00:00", "title": "Dow Jones Today: Intel Soars While Index Dives", "content": "The Dow Jones Industrial Average fell about 0.4%, or 134 points, ahead of a key vote in the House of Representatives to extend the U.S. debt limit.", "link": "https://finance.yahoo.com/m/9dda6ccf-f652-3c20-a341-fb62ea8e38d9/dow-jones-today%3A-intel-soars.html", "symbols": ["BAC.F", "BAC.XETRA", "CHV.F", "CHV.XETRA", "CVX.MX", "CVX.US", "DJI.INDX", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": -0.202, "neg": 0.089, "neu": 0.851, "pos": 0.06}}, {"date": "2023-05-31T19:45:00+00:00", "title": "Verizon Forward for Good Accelerator Advances Health Equity-Based Start-Ups", "content": "BASKING RIDGE, NJ / ACCESSWIRE / May 31, 2023 / Verizon today announced that seven organizations have completed the third cohort of the Verizon Forward for Good Accelerator, focused on Health Equity to scale solutions that address the barriers to health access and quality care. In partnership with the innovation agency, CoLab, the accelerator program aims to support start-ups that are developing solutions leveraging advanced technology such as 5G, MEC, Big Data, AI, and XR to drive meaningful social impact. The participants of the Health Equity cohort will have the opportunity to present their tech-enabled solutions at the Verizon Innovation Lab in Boston on May 31, 2023.\n\n\"At Verizon, we understand the power our technology can have in creating an equitable future for all,\" said Carrie Hughes, Director of Corporate Social Responsibility Officer at Verizon. \"Thanks to the partnership of these innovators, we're leveraging our resources to help break the barriers to quality care that many communities across the country continue to face.\"\n\nThe start-ups selected to join the Health Equity cohort of the Verizon Forward for Good Accelerator received access to a wealth of resources provided by Verizon, including expert mentorship, technology enablement and coaching, networking, and $50,000 in non-dilutive funding to scale their solutions. The winners include:\n\nEquity Health: Developed a platform to enable home-based primary care practices of the future. Health In Her HUE: Connects Black women and women of color to culturally sensitive healthcare providers, evidence-based health content, and community support. Lessonbee: Developed a groundwater solution to address the social determinants of health by integrating health education, community context, and health care in one comprehensive digital learning platform. MedHaul: Helps health organizations understand and solve transportation barriers for historically marginalized patients, including patients who are low-income, elderly, disabled and/or reside in rural communities. Navigate Maternity: Developed a remote monitoring maternal care management platform to capture, analyze, and communicate data in real-time for enhanced clinical decision-making. Revealix: Developed a mobile application that helps clinical teams streamline and scale their amputation prevention practices through real-time monitoring of skin temperature changes, custom risk scores, and patient education. Veriteos: Pioneering first-mile behavioral health navigation by aligning local community resources, community clinic availability, and novel opportunities for culturally competent care.\n\nThis initiative is part of Citizen Verizon, the company's responsible business plan for economic, environmental and social advancement. To learn more about the Verizon Forward for Good Accelerator and the company's commitment to human prosperity visit VerizonForwardForGood.com. Verizon, Wednesday, May 31, 2023, Press release picture\n\nView additional multimedia and more ESG storytelling from Verizon on 3blmedia.com.\n\nContact Info:\r\nSpokesperson: Verizon\r\nWebsite: https://www.3blmedia.com/profiles/verizon\r\nEmail: info@3blmedia.com\n\nSOURCE: Verizon\n\nView source version on accesswire.com: \r\nhttps://www.accesswire.com/758458/Verizon-Forward-for-Good-Accelerator-Advances-Health-Equity-Based-Start-Ups", "link": "https://finance.yahoo.com/news/verizon-forward-good-accelerator-advances-194500663.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.004, "neu": 0.803, "pos": 0.193}}, {"date": "2023-05-31T18:18:00+00:00", "title": "Time to Buy Telecom? Charting Verizon, AT&amp;T and T-Mobile", "content": "Verizon , AT&T and T-Mobile continue to struggle. All three stocks are lower on the year, AT&T by about 14%, Verizon roughly 9% and T-Mobile 1.5%. Verizon and AT&T are down 30% and 25%, respectively.", "link": "https://finance.yahoo.com/m/86613841-bb53-36c1-ab36-4a6a904e8914/time-to-buy-telecom%3F-charting.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": -0.273, "neg": 0.119, "neu": 0.818, "pos": 0.063}}, {"date": "2023-05-31T13:30:00+00:00", "title": "Verizon Forward for Good Accelerator advances health equity-based start-ups", "content": "BASKING RIDGE, N.J., May  31, 2023  (GLOBE NEWSWIRE) -- Verizon today announced that seven organizations have completed the third cohort of the Verizon Forward for Good Accelerator, focused on Health Equity to scale solutions that address the barriers to health access and quality care. In partnership with the innovation agency, CoLab, the accelerator program aims to support start-ups that are developing solutions leveraging advanced technology such as 5G, MEC, Big Data, AI, and XR to drive meaningful social impact. The participants of the Health Equity cohort will have the opportunity to present their tech-enabled solutions at the Verizon Innovation Lab in Boston on May 31, 2023.\n\n“At Verizon, we understand the power our technology can have in creating an equitable future for all,” said Carrie Hughes, Director of Corporate Social Responsibility Officer at Verizon. “Thanks to the partnership of these innovators, we’re leveraging our resources to help break the barriers to quality care that many communities across the country continue to face.”\n\nThe start-ups selected to join the Health Equity cohort of the Verizon Forward for Good Accelerator received access to a wealth of resources provided by Verizon, including expert mentorship, technology enablement and coaching, networking, and $50,000 in non-dilutive funding to scale their solutions. The winners include:\n\nEquity Health: Developed a platform to enable home-based primary care practices of the future.Health In Her HUE: Connects Black women and women of color to culturally sensitive healthcare providers, evidence-based health content, and community support.Lessonbee: Developed a groundwater solution to address the social determinants of health by integrating health education, community context, and health care in one comprehensive digital learning platform.MedHaul: Helps health organizations understand and solve transportation barriers for historically marginalized patients, including patients who are low-income, elderly, disabled and/or reside in rural communities.Navigate Maternity: Developed a remote monitoring maternal care management platform to capture, analyze, and communicate data in real-time for enhanced clinical decision-making.Revealix: Developed a mobile application that helps clinical teams streamline and scale their amputation prevention practices through real-time monitoring of skin temperature changes, custom risk scores, and patient education.Veriteos: Pioneering first-mile behavioral health navigation by aligning local community resources, community clinic availability, and novel opportunities for culturally competent care.\n\nThis initiative is part of Citizen Verizon, the company’s responsible business plan for economic, environmental and social advancement. To learn more about the Verizon Forward for Good Accelerator and the company’s commitment to human prosperity visit VerizonForwardForGood.com.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nCitizen Verizon is the company’s responsible business plan for economic, environmental and social advancement. Citizen Verizon empowers Verizon to deliver on its mission to move the world forward through action by expanding digital access and resources, protecting the climate, and ensuring people have the skills needed for jobs of the future. Through Citizen Verizon, and the key pillars of Digital Inclusion, Climate Protection and Human Prosperity, the company's responsible business goals include providing 10 million youths with digital skills training by 2030, supporting 1 million small businesses with resources to help them thrive in the digital economy by 2030, achieving net zero emissions in its operations by 2035, and preparing 500,000 individuals for jobs of the future by 2030. Learn more at CitizenVerizon.com.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: \r\nBernadette Brijlall\r\nbernadette.brijlall@verizon.com\n\nHerbert Nyarko\r\nherbert.aidoo-nyarko@verizon.com", "link": "https://www.globenewswire.com/news-release/2023/05/31/2679531/0/en/Verizon-Forward-for-Good-Accelerator-advances-health-equity-based-start-ups.html", "symbols": ["VZ.US"], "tags": ["NYSE:VZ", "PHILANTHROPY", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.998, "neg": 0.005, "neu": 0.842, "pos": 0.153}}, {"date": "2023-05-31T13:00:00+00:00", "title": "Verizon upgrades network for Columbus customers", "content": "Verizon Sourcing LLC\n\nRecent upgrades lead to testing results that show customers have an outstanding experience on the Verizon network\n\nCOLUMBUS, Ohio, May 31, 2023 (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Columbus, OH. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Columbus include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\nEngineers have deployed 5G Ultra Wideband service using Millimeter Wave (mmWave), its premium, high-band spectrum which allows for extremely fast speeds and massive capacity as well as C-band spectrum designed for fast speeds, high capacity and wide coverage. With the recent deployments and upgrades, 96% of people in Columbus now have access to 5G service from Verizon. Verizon Engineers have deployed 5G Ultra Wideband service using its C-band spectrum designed for high capacity and wide coverage. Most notably, Verizon’s 5G Ultra Wideband service is now available in the Arena District, Franklinton, South Columbus, West Columbus, Hilliard, Ohio State Campus area, Whitehall, Blacklick, Clintonville, Delaware, Westerville, Polaris, Powell, Grove City, and Sunbury. Columbus’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum.  Verizon engineers are using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Columbus will be able to take advantage of more than twice that amount of spectrum as it becomes available for 5G Ultra Wideband.  That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Columbus. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links.  Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network.  Verizon has increased the capacity on the fiber connections in many cell sites in the Columbus area so they can carry 10 times the amount of data.\n\n“We know customers count on us, and we work everyday to ensure we deliver for them. Our reliable, secure network connects families, friends, homes and businesses in Columbus, OH with best-in-class 5G Ultra Wideband technology,” said Dean Brauer, Vice President of Engineering and Operations for Verizon.\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place, smartphones with countless opportunities to use data in a highly mobile environment, home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, and complex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nColumbus, OH customers have an outstanding experience on Verizon’s network\n\nThe recent network upgrades have led to customers having an outstanding experience on the Verizon network in Columbus, OH, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Columbus, Verizon was unbeaten for overall network performance, and in fact was also unbeaten in the categories measured including reliability, speed, and data, call and text performance. Today’s results show great speeds for Verizon customers in Columbus with Verizon’s median download speed increasing 50% and median upload speeds increasing 69% since last year in the market.*\n\nServices from the network customers rely on\n\nFor customers in Columbus, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with Auto Pay and select 5G mobile plans – all without hidden fees, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals For the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Columbus area will also be able to experience the benefits of these network enhancements.  To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nColumbus area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is incredibly fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Columbus RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Plans start at $25/mo. when combined with a postpaid mobile unlimited plan that includes 5G Ultra Wideband. Auto Pay and paper-free billing req’d.Subject to credit approval.\n\nMEDIA CONTACT:\r\nKaren Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.co", "link": "https://finance.yahoo.com/news/verizon-upgrades-network-columbus-customers-130000215.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.009, "neu": 0.918, "pos": 0.074}}, {"date": "2023-05-31T13:00:00+00:00", "title": "Verizon continues to upgrade San Jose's network", "content": "Verizon Sourcing LLC\n\nRecent upgrades lead to testing results that show Verizon customers have an outstanding network experience in San Jose\n\nSAN JOSE, Calif., May 31, 2023 (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in the San Jose metro area. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in San Jose include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\nEngineers have deployed 5G Ultra Wideband service using Millimeter Wave (mmWave), its premium, high-band spectrum which allows for extremely fast speeds and massive capacity, as well as C-band spectrum designed for fast speeds, high capacity and wide coverage. Over 65% of sites serving San Jose now provide 5G Ultra Wideband service. Most recently, Verizon engineers have added 5G coverage near Almaden Expressway and the Camden Avenue area in Southern San Jose, along I-280 between I-880 and Hwy 85, along I-680 at Calaveras in Milpitas, along Trimble Road near Hwy 101, around Lafayette Street just east of Great America, and along Santa Teresa Boulevard and Monterey Road near Leavesley Road in Gilroy. San Jose’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum. Verizon engineers have been using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in San Jose will be able to take advantage of even more spectrum as it becomes available for 5G Ultra Wideband. That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services. Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in San Jose. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links. Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network. Verizon has increased the capacity on the fiber connections in many cell sites in the San Jose area so they can carry 10 times the amount of data.\n\n“Whether our customers are enjoying connecting with friends and family while on the move, connecting their smart homes through one of our home internet products or using our service in San Jose for small business or enterprise applications, we know customers count on us,” said Phillip French, Vice President of Engineering and Operations for Verizon. “Our team has been working hard in San Jose to deliver these results, and we are not slowing down.”\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place, smartphones with countless opportunities to use data in a highly mobile environment, home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, and complex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nSan Jose, CA customers have an outstanding experience on Verizon’s network\n\nThe recent network upgrades have led to customers having an outstanding experience on the Verizon network in San Jose, PA according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout San Jose, Verizon is unbeaten in multiple categories including overall network performance, accessibility as well as performance of texts and calls. Today’s results show great speeds for Verizon customers in San Jose with Verizon’s median upload speed increasing 23% since last year* in the market.\n\nServices from the network customers rely on\n\nFor customers in San Jose, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with Auto Pay and select 5G mobile plans – all without hidden fees, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals for the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the San Jose area will also be able to experience the benefits of these network enhancements. To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nSan Jose area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics®San Jose RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Plans start at $25/mo. when combined with a postpaid mobile unlimited plan that includes 5G Ultra Wideband. Auto Pay and paper-free billing req’d. Subject to credit approval.\n\nMEDIA CONTACT:\r\nKaren Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://finance.yahoo.com/news/verizon-continues-upgrade-san-joses-130000062.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.009, "neu": 0.915, "pos": 0.076}}, {"date": "2023-05-31T13:00:00+00:00", "title": "Verizon Lands $145.7M Digital Modernization Contract with United States Postal Service", "content": "Verizon Sourcing LLC\n\nVerizon tasked with upgrading and digitizing USPS customer support infrastructure\n\nWASHINGTON, May 31, 2023 (GLOBE NEWSWIRE) -- Verizon Business today announced a 10-year contract worth up to $145,700,000 with the United States Postal Service (USPS). The award builds on Verizon’s existing technology and positions Verizon as the USPS’ key strategic contact center and customer experience partner.\n\nUnder the terms of the agreement, Verizon will deliver a number of infrastructure upgrades, including a transition to cloud solutions supported by real-time reporting, monitoring and administration, as well as ongoing physical infrastructure enhancements for host servers, storage arrays, and other equipment. Verizon’s solutions will help eliminate the need for premise infrastructure, software licenses, or hardware, thereby reducing the burden on USPS’ IT personnel and lowering operational costs. Verizon’s technology solutions will deliver an agile, robust, scalable, and flexible infrastructure that will provide significant business value in the near term and prepare USPS strategically for the future.\n\nAdditionally, the migration to the new cloud platform will expedite USPS’ integration of artificial intelligence capabilities, which will improve customer satisfaction by providing more intelligent, high-quality responses to inquiries. Verizon will also help USPS move to a multichannel platform that supports email, SMS, chat and more.\n\nVerizon will provide support for 80 million annual interactions with 4,500 contact center agents across 10 business units. This contract builds on a successful, 25-year partnership between Verizon and USPS.\n\n“Working with our USPS partners, Verizon will bring our Network as a Service offering to life, making their customer service network smarter and to make the customer support systems run more efficiently,” said Maggie Hallbach, Senior Vice President of Verizon Public Sector and President of Verizon Frontline. “It’s no secret, today’s consumers expect immediate, personalized support. That’s a very high bar when you’re serving tens of millions of customers. Our digital solutions will relieve some of that administrative burden so USPS can focus on providing an invaluable service for our country.”\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: Geoffrey Basye\r\ngeoffrey.basye@verizon.com\r\n(202) 748-1882", "link": "https://finance.yahoo.com/news/verizon-lands-145-7m-digital-130000717.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.024, "neu": 0.815, "pos": 0.161}}, {"date": "2023-05-31T13:00:00+00:00", "title": "Verizon upgrades network for Ann Arbor customers", "content": "Verizon Sourcing LLC\n\nRecent upgrades lead to testing results that show customers have the best experience on the Verizon network\n\nANN ARBOR, Mich., May 31, 2023 (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Ann Arbor, MI. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Ann Arbor include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\nEngineers have deployed 5G Ultra Wideband service using Millimeter Wave (mmWave), its premium, high-band spectrum which allows for extremely fast speeds and massive capacity as well as C-band spectrum designed for fast speeds, high capacity and wide coverage. With the recent deployments and upgrades, 90% of people in Ann Arbor now have access to 5G service from Verizon. Verizon Engineers have deployed 5G Ultra Wideband service using its C-band spectrum designed for high capacity and wide coverage. Most notably, Verizon’s 5G Ultra Wideband service is now available along Wagner Rd, from Pratt Rd to Parkridge Dr., around the Stonebridge Golf Club, and along Platt Rd on each side of Michigan Ave to support the residences around the Pittsfield Preserve. Ann Arbor’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum.  Verizon engineers are using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Ann Arbor will be able to take advantage of more than twice that amount of spectrum as it becomes available for 5G Ultra Wideband.  That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services. Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Ann Arbor. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links.  Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network.  Verizon has increased the capacity on the fiber connections in many cell sites in the Ann Arbor area so they can carry 10 times the amount of data.\n\n“We know customers count on us, and we work everyday to ensure we deliver for them. Our reliable, secure network connects families, friends, homes and businesses in Ann Arbor, MI with best-in-class 5G Ultra Wideband technology,” said Dean Brauer, Vice President of Engineering and Operations for Verizon.\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place, smartphones with countless opportunities to use data in a highly mobile environment, home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, and complex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nAnn Arbor, MI customers have the best experience on Verizon’s network\n\nThe recent network upgrades have led to customers having the best experience on the Verizon network in Ann Arbor, MI, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Ann Arbor, Verizon wins for overall network performance, as well as in the categories of accessibility, speed and data performance. Today’s results show great speeds for Verizon customers in Ann Arbor with Verizon’s median download speed increasing 36% and median upload speeds increasing 12% since last year in the market.*\n\nServices from the network customers rely on\n\nFor customers in Ann Arbor, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with Auto Pay and select 5G mobile plans – all without hidden fees, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals For the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Ann Arbor area will also be able to experience the benefits of these network enhancements.  To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nAnn Arbor area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is incredibly fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Ann Arbor RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Plans start at $25/mo. when combined with a postpaid mobile unlimited plan that includes 5G Ultra Wideband. Auto Pay and paper-free billing req’d. Subject to credit approval.\n\nMEDIA CONTACT: Karen Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://finance.yahoo.com/news/verizon-upgrades-network-ann-arbor-130000023.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.008, "neu": 0.914, "pos": 0.078}}, {"date": "2023-05-31T13:00:00+00:00", "title": "Verizon continues to upgrade San Jose's network", "content": "SAN JOSE, Calif., May  31, 2023  (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in the San Jose metro area. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in San Jose include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\nEngineers have deployed 5G Ultra Wideband service using Millimeter Wave (mmWave), its premium, high-band spectrum which allows for extremely fast speeds and massive capacity, as well as C-band spectrum designed for fast speeds, high capacity and wide coverage. Over 65% of sites serving San Jose now provide 5G Ultra Wideband service. Most recently, Verizon engineers have added 5G coverage near Almaden Expressway and the Camden Avenue area in Southern San Jose, along I-280 between I-880 and Hwy 85, along I-680 at Calaveras in Milpitas, along Trimble Road near Hwy 101, around Lafayette Street just east of Great America, and along Santa Teresa Boulevard and Monterey Road near Leavesley Road in Gilroy.San Jose’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum. Verizon engineers have been using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in San Jose will be able to take advantage of even more spectrum as it becomes available for 5G Ultra Wideband. That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services.Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in San Jose. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links. Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network. Verizon has increased the capacity on the fiber connections in many cell sites in the San Jose area so they can carry 10 times the amount of data.\n\n“Whether our customers are enjoying connecting with friends and family while on the move, connecting their smart homes through one of our home internet products or using our service in San Jose for small business or enterprise applications, we know customers count on us,” said Phillip French, Vice President of Engineering and Operations for Verizon. “Our team has been working hard in San Jose to deliver these results, and we are not slowing down.”\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place,smartphones with countless opportunities to use data in a highly mobile environment,home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, andcomplex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nSan Jose, CA customers have an outstanding experience on Verizon’s network\n\nThe recent network upgrades have led to customers having an outstanding experience on the Verizon network in San Jose, PA according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout San Jose, Verizon is unbeaten in multiple categories including overall network performance, accessibility as well as performance of texts and calls. Today’s results show great speeds for Verizon customers in San Jose with Verizon’s median upload speed increasing 23% since last year* in the market.\n\nServices from the network customers rely on\n\nFor customers in San Jose, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with Auto Pay and select 5G mobile plans – all without hidden fees, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals for the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the San Jose area will also be able to experience the benefits of these network enhancements. To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nSan Jose area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics®San Jose RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Plans start at $25/mo. when combined with a postpaid mobile unlimited plan that includes 5G Ultra Wideband. Auto Pay and paper-free billing req’d. Subject to credit approval.\n\nMEDIA CONTACT:\r\nKaren Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://www.globenewswire.com/news-release/2023/05/31/2679497/0/en/Verizon-continues-to-upgrade-San-Jose-s-network.html", "symbols": ["VZ.US"], "tags": ["NYSE:VZ", "PRODUCT / SERVICES ANNOUNCEMENT", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.996, "neg": 0.01, "neu": 0.915, "pos": 0.076}}, {"date": "2023-05-31T13:00:00+00:00", "title": "Verizon upgrades network for Columbus customers", "content": "COLUMBUS, Ohio, May  31, 2023  (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Columbus, OH. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Columbus include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\nEngineers have deployed 5G Ultra Wideband service using Millimeter Wave (mmWave), its premium, high-band spectrum which allows for extremely fast speeds and massive capacity as well as C-band spectrum designed for fast speeds, high capacity and wide coverage. With the recent deployments and upgrades, 96% of people in Columbus now have access to 5G service from Verizon. Verizon Engineers have deployed 5G Ultra Wideband service using its C-band spectrum designed for high capacity and wide coverage. Most notably, Verizon’s 5G Ultra Wideband service is now available in the Arena District, Franklinton, South Columbus, West Columbus, Hilliard, Ohio State Campus area, Whitehall, Blacklick, Clintonville, Delaware, Westerville, Polaris, Powell, Grove City, and Sunbury.Columbus’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum.  Verizon engineers are using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Columbus will be able to take advantage of more than twice that amount of spectrum as it becomes available for 5G Ultra Wideband.  That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust servicesLastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Columbus. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links.  Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network.  Verizon has increased the capacity on the fiber connections in many cell sites in the Columbus area so they can carry 10 times the amount of data.\n\n“We know customers count on us, and we work everyday to ensure we deliver for them. Our reliable, secure network connects families, friends, homes and businesses in Columbus, OH with best-in-class 5G Ultra Wideband technology,” said Dean Brauer, Vice President of Engineering and Operations for Verizon.\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place,smartphones with countless opportunities to use data in a highly mobile environment,home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, andcomplex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nColumbus, OH customers have an outstanding experience on Verizon’s network\n\nThe recent network upgrades have led to customers having an outstanding experience on the Verizon network in Columbus, OH, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Columbus, Verizon was unbeaten for overall network performance, and in fact was also unbeaten in the categories measured including reliability, speed, and data, call and text performance. Today’s results show great speeds for Verizon customers in Columbus with Verizon’s median download speed increasing 50% and median upload speeds increasing 69% since last year in the market.*\n\nServices from the network customers rely on\n\nFor customers in Columbus, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with Auto Pay and select 5G mobile plans – all without hidden fees, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals For the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Columbus area will also be able to experience the benefits of these network enhancements.  To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nColumbus area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is incredibly fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Columbus RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Plans start at $25/mo. when combined with a postpaid mobile unlimited plan that includes 5G Ultra Wideband. Auto Pay and paper-free billing req’d.Subject to credit approval.\n\nMEDIA CONTACT:\r\nKaren Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.co", "link": "https://www.globenewswire.com/news-release/2023/05/31/2679496/0/en/Verizon-upgrades-network-for-Columbus-customers.html", "symbols": ["VZ.US"], "tags": ["NYSE:VZ", "PRODUCT / SERVICES ANNOUNCEMENT", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.996, "neg": 0.009, "neu": 0.918, "pos": 0.073}}, {"date": "2023-05-31T13:00:00+00:00", "title": "Verizon upgrades network for Ann Arbor customers", "content": "ANN ARBOR, Mich., May  31, 2023  (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Ann Arbor, MI. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Ann Arbor include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\nEngineers have deployed 5G Ultra Wideband service using Millimeter Wave (mmWave), its premium, high-band spectrum which allows for extremely fast speeds and massive capacity as well as C-band spectrum designed for fast speeds, high capacity and wide coverage. With the recent deployments and upgrades, 90% of people in Ann Arbor now have access to 5G service from Verizon. Verizon Engineers have deployed 5G Ultra Wideband service using its C-band spectrum designed for high capacity and wide coverage. Most notably, Verizon’s 5G Ultra Wideband service is now available along Wagner Rd, from Pratt Rd to Parkridge Dr., around the Stonebridge Golf Club, and along Platt Rd on each side of Michigan Ave to support the residences around the Pittsfield Preserve.Ann Arbor’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum.  Verizon engineers are using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Ann Arbor will be able to take advantage of more than twice that amount of spectrum as it becomes available for 5G Ultra Wideband.  That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services.Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Ann Arbor. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links.  Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network.  Verizon has increased the capacity on the fiber connections in many cell sites in the Ann Arbor area so they can carry 10 times the amount of data.\n\n“We know customers count on us, and we work everyday to ensure we deliver for them. Our reliable, secure network connects families, friends, homes and businesses in Ann Arbor, MI with best-in-class 5G Ultra Wideband technology,” said Dean Brauer, Vice President of Engineering and Operations for Verizon.\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place,smartphones with countless opportunities to use data in a highly mobile environment,home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, andcomplex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nAnn Arbor, MI customers have the best experience on Verizon’s network\n\nThe recent network upgrades have led to customers having the best experience on the Verizon network in Ann Arbor, MI, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Ann Arbor, Verizon wins for overall network performance, as well as in the categories of accessibility, speed and data performance. Today’s results show great speeds for Verizon customers in Ann Arbor with Verizon’s median download speed increasing 36% and median upload speeds increasing 12% since last year in the market.*\n\nServices from the network customers rely on\n\nFor customers in Ann Arbor, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with Auto Pay and select 5G mobile plans – all without hidden fees, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals For the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Ann Arbor area will also be able to experience the benefits of these network enhancements.  To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nAnn Arbor area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is incredibly fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Ann Arbor RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Plans start at $25/mo. when combined with a postpaid mobile unlimited plan that includes 5G Ultra Wideband. Auto Pay and paper-free billing req’d. Subject to credit approval.\n\nMEDIA CONTACT: Karen Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://www.globenewswire.com/news-release/2023/05/31/2679495/0/en/Verizon-upgrades-network-for-Ann-Arbor-customers.html", "symbols": ["VZ.US"], "tags": ["NYSE:VZ", "PRODUCT / SERVICES ANNOUNCEMENT", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.996, "neg": 0.009, "neu": 0.914, "pos": 0.077}}, {"date": "2023-05-31T13:00:00+00:00", "title": "Verizon Lands $145.7M Digital Modernization Contract with United States Postal Service", "content": "WASHINGTON, May  31, 2023  (GLOBE NEWSWIRE) -- Verizon Business today announced a 10-year contract worth up to $145,700,000 with the United States Postal Service (USPS). The award builds on Verizon’s existing technology and positions Verizon as the USPS’ key strategic contact center and customer experience partner.\n\nUnder the terms of the agreement, Verizon will deliver a number of infrastructure upgrades, including a transition to cloud solutions supported by real-time reporting, monitoring and administration, as well as ongoing physical infrastructure enhancements for host servers, storage arrays, and other equipment. Verizon’s solutions will help eliminate the need for premise infrastructure, software licenses, or hardware, thereby reducing the burden on USPS’ IT personnel and lowering operational costs. Verizon’s technology solutions will deliver an agile, robust, scalable, and flexible infrastructure that will provide significant business value in the near term and prepare USPS strategically for the future.\n\nAdditionally, the migration to the new cloud platform will expedite USPS’ integration of artificial intelligence capabilities, which will improve customer satisfaction by providing more intelligent, high-quality responses to inquiries. Verizon will also help USPS move to a multichannel platform that supports email, SMS, chat and more.\n\nVerizon will provide support for 80 million annual interactions with 4,500 contact center agents across 10 business units. This contract builds on a successful, 25-year partnership between Verizon and USPS.\n\n“Working with our USPS partners, Verizon will bring our Network as a Service offering to life, making their customer service network smarter and to make the customer support systems run more efficiently,” said Maggie Hallbach, Senior Vice President of Verizon Public Sector and President of Verizon Frontline. “It’s no secret, today’s consumers expect immediate, personalized support. That’s a very high bar when you’re serving tens of millions of customers. Our digital solutions will relieve some of that administrative burden so USPS can focus on providing an invaluable service for our country.”\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: Geoffrey Basye\r\ngeoffrey.basye@verizon.com\r\n(202) 748-1882", "link": "https://www.globenewswire.com/news-release/2023/05/31/2679456/0/en/Verizon-Lands-145-7M-Digital-Modernization-Contract-with-United-States-Postal-Service.html", "symbols": ["VZ.US"], "tags": ["MANAGEMENT STATEMENTS", "NYSE:VZ", "PARTNERSHIPS", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.995, "neg": 0.025, "neu": 0.815, "pos": 0.16}}, {"date": "2023-05-31T12:45:00+00:00", "title": "Verizon (VZ) Deploys 5G Ultra Wideband Across Wisconsin", "content": "Verizon Communications Inc. VZ recently deployed 5G Ultra Wideband network across Wisconsin as part of its concerted effort to expand its customer base with improved broadband connectivity. The superfast network with greater capacity and reliability is likely to offer the residents an unrivaled Internet experience.\r\n\r\nPowered by the C-band spectrum, the 5G network service is expected to cater to the exponential growth of video demand in multiple Wisconsin markets. Verizon aims to deploy additional bandwidth for greater coverage once all of its licensed spectrum is made available at the end of this year. These airwaves offer significant bandwidth with better propagation characteristics for optimum coverage in rural and urban areas.\r\n\r\nVerizon is witnessing significant 5G adoption and fixed wireless broadband momentum. The telecom giant plans to accelerate the availability of its 5G Ultra Wideband network across the country. The company’s growth strategy includes 5G mobility, nationwide broadband and mobile edge compute and business solutions. Verizon is building the entire network infrastructure and ecosystem to provide the most amazing 5G experience to customers. It continues to deploy Home Internet service in select cities, where users can experience a maximum download speed of up to 1 Gbps.\r\n\r\nWith one of the most efficient wireless networks in the United States, Verizon deploys the latest technologies to deliver faster peak data speeds and capacity for customers, driven by customer-focused planning, disciplined engineering and constant strategic investment. The company remains focused on making necessary capital expenditures due to the expansion of 5G mmWave in new and existing markets, the densification of the 4G LTE wireless network to cater to huge traffic demands across multiple verticals and the continued deployment of the fiber infrastructure.\r\n\r\nVerizon’s 5G mobility service offers an unparalleled experience that impacts industries as diverse as public safety, health care, retail and sports. The company’s 5G network hinges on three fundamental drivers to deliver the full potential of next-generation wireless technology. These are massive spectrum holdings, particularly in the millimeter-wave bands for faster data transfer, end-to-end deep fiber resources and the ability to deploy a large number of small cells.\r\n\r\nThe stock has lost 32.1% over the past year compared with the industry’s decline of 21.4%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nVerizon carries a Zacks Rank #3 (Hold).\r\n\r\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nKey Picks\n\nInterDigital, Inc. IDCC, sporting a Zacks Rank #1, delivered an earnings surprise of 170.89%, on average, in the trailing four quarters. In the last reported quarter, it pulled off an earnings surprise of 579.03%. It has long-term earnings growth expectation of 13.9%.\r\n\r\nIt is a pioneer in advanced mobile technologies that enables wireless communications and capabilities. The company engages in designing and developing a wide range of advanced technology solutions, which are used in digital cellular and wireless 3G, 4G and IEEE 802-related products and networks.\r\n\r\nAkamai Technologies, Inc. AKAM, carrying a Zacks Rank #2 (Buy), delivered an earnings surprise of 4.9%, on average, in the trailing four quarters. It has long-term earnings growth expectation of 10%.\r\n\r\nAkamai is a global provider of content delivery network and cloud infrastructure services. The company’s solutions accelerate and improve the delivery of content over the Internet, enabling faster response to requests for web pages, streaming of video & audio, business applications, etc. Akamai’s offerings are intended to reduce the impact of traffic congestion, bandwidth constraints and capacity limitations on customers.\r\n\r\nViasat Inc. VSAT, sporting a Zacks Rank #1, enjoys a leading position in the satellite and wireless communications market. Headquartered in Carlsbad, CA, it designs, develops and markets advanced digital satellite telecommunications and other wireless networking and signal processing equipment. The company serves its high-bandwidth, high-performance communications solutions to public as well as military, enterprises and government enterprises.\r\n\r\nViasat is ramping up investments in the development of its revolutionary ViaSat-3 broadband communications platform, which will have nearly 10 times the bandwidth capacity of ViaSat-2. These satellites will be capable of covering one-third of the world, including all Americas.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nVerizon Communications Inc. (VZ) : Free Stock Analysis Report\n\nAkamai Technologies, Inc. (AKAM) : Free Stock Analysis Report\n\nInterDigital, Inc. (IDCC) : Free Stock Analysis Report\n\nViasat Inc. (VSAT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/verizon-vz-deploys-5g-ultra-124500559.html", "symbols": ["AK3.F", "AK3.XETRA", "AKAM.US", "BAC.F", "BAC.XETRA", "VERZ34.SA", "VS1.F", "VSAT.US", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.005, "neu": 0.865, "pos": 0.13}}, {"date": "2023-05-31T11:37:00+00:00", "title": "If You Invested $1,000 in Verizon in 2014, This Is How Much You Would Have Today", "content": "Verizon (NYSE: VZ) is often considered a stable investment for conservative income investors. If you had invested $1,000 in Verizon on Feb. 21, 2014 -- the fateful day it took full control of Verizon Wireless by buying out Vodafone's (NASDAQ: VOD) 45% stake in the joint venture for a staggering $130 billion -- your investment would be worth roughly $740 today. Let's see why Verizon underperformed the market by such a wide margin -- and whether it will ever recover.", "link": "https://finance.yahoo.com/m/8e51f589-b134-37c2-ae31-2aab1ebcf44c/if-you-invested-%241%2C000-in.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TM5.F", "TMUS.US", "VERZ34.SA", "VOD.US", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0, "neu": 0.948, "pos": 0.052}}, {"date": "2023-05-31T09:21:00+00:00", "title": "3 No-Brainer Stocks to Buy With $400 Right Now", "content": "A reasonably small amount of money can go a long way when it's invested in industry-changing businesses.", "link": "https://finance.yahoo.com/m/2a75cc3b-d3a7-347d-a2f4-cc8827d2d0ab/3-no-brainer-stocks-to-buy.html", "symbols": ["3E2.F", "ABNB.US", "BAC.F", "BAC.XETRA", "ETSY.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}]