[{"date": "2023-04-27T16:12:49+00:00", "title": "10 Best Dividend ETFs in 2023", "content": "In this article, we will take a look at the 10 best dividend ETFs in 2023. To see more such companies, go directly to 5 Best Dividend ETFs in 2023.\n\nDividend stocks remain in the limelight as investors dig in for a long period of uncertainty amid the Federal Reserve’s fight against inflation. While upbeat CPI data on April 12 sent the markets in the green, some believe the latest numbers won’t affect the Federal Reserve’s policy of interest rate hikes. The Wall Street Journal in a latest report quoted Steve Blitz, chief U.S. economist at TS Lombard, who believes that the March CPI numbers would not “move the needle for the Fed.” Blitz believes “the inflation problem doesn’t get solved by itself—it needs higher unemployment to get there.” Even if the Federal Reserve pauses interest rate hikes, it would take some time to get the economy back to normal and analysts believe piling into quality dividend stocks remains a viable option for long-term investors who want to avoid risks and volatility.\n\nAccording to a report by Global X, during 1960 to 2017, high dividend stocks outperformed the S&P 500 by nearly 3.0% on an annualized basis. What makes dividend stocks attractive during recessions is their outperformance in high interest rate environments. The same Global X report says that dividend stocks outperformed the S&P 500 during 7 out of the 10 rising interest rate periods since 1960.\n\nAnother report by Anchor Capital Advisors sheds some light on the power of dividend reinvesting and compounding. The report said that if you had invested $100 in the S&P 500 Index in 2001, and reinvested all the dividends, your initial investment would have growth to $350 by July 2020. The report also said that Anchor’s analysis has shown that companies that pay dividends tend to have significantly low volatility as compared to those that don’t pay dividends. The report also mentions that contrary to the popular belief that dividend-paying companies usually operate in low-growth businesses, in reality, dividend payers are found across a variety of sectors.\n\nStory continues\n\nA report by WisdomTree Research titled “The Dividends of a Dividend Approach” quotes an interesting study shared by Jeremy Siegel in his book The Future for Investors. The study, which WisdomTree shows with updates through 2022, demonstrates that from 1957 to 2022, highest quintile (basket of stocks with highest dividend yields in the study) outperformed the broad S&P 500 Index by over 1.8% per year. This translated into an outperformance of a whopping 223% over time, according to the WisdomTree report. The second quintile outperformed the S&P 500 by 1.6% per year.\n\nAnother study which takes into account the total equity returns of US stocks from 1802 to 2002 shows that dividends (plus real growth in dividends) accounted for fully 5.8% of the 7.9% total annualized returns in the period.\n\nInvesting in ETFs is becoming highly popular since ETFs provide a low-risk, low-cost way to get exposure to a wide variety of equities. There are various dividend ETFs that allow investors to generate steady income with low volatility. Young investors are flocking to these ETFs because of the downside protection they offer. According to a WSJ report, JPMorgan Equity Premium Income ETF lost just 3.5% in 2022, compared to a whopping 18% decline for the S&P 500 index. The ETF, which is also in our list of the best dividend ETFs in 2023, saw an inflow of $12.9 billion in 2022. Best Dividend ETFs in 2023\n\nPhoto by Dan Dennis on Unsplash\n\nOur Methodology\n\nFor this article we selected some of the most popular and safest dividend ETFs that provide exposure to high dividend stocks that have low volatility and strong dividend history. We also picked up some non-US dividend ETFs that allow investors to diversify their portfolios by having exposure to non-US companies. With each ETF we have mentioned its top holdings and hedge fund sentiment around them.\n\nBest Dividend ETFs in 2023\n\n10. Invesco S&P 500 High Dividend Low Volatility ETF (NYSE:SPHD)\n\nInvesco S&P 500 High Dividend Low Volatility ETF (NYSE:SPHD) is based on the S&P 500 Low Volatility High Dividend Index (Index). Invesco S&P 500 High Dividend Low Volatility ETF (NYSE:SPHD) gives exposure to dividend stocks that have relatively high yields and low volatility, just what investors in general are looking for these days when there’s hardly any certainty left in the financial markets. Some of the top holdings of Invesco S&P 500 High Dividend Low Volatility ETF (NYSE:SPHD) include Altria Group, Inc. (NYSE:MO), Verizon Communications Inc. (NYSE:VZ), Kinder Morgan, Inc. (NYSE:KMI) and Dow Inc. (NYSE:DOW).\n\nThe biggest holding of Invesco S&P 500 High Dividend Low Volatility ETF (NYSE:SPHD) is AT&T Inc. (NYSE:T). AT&T Inc. (NYSE:T) has a dividend yield of over 5%. As of the end of the fourth quarter of 2022, 55 hedge funds tracked by Insider Monkey had stakes in AT&T Inc. (NYSE:T). The biggest stakeholder of AT&T Inc. (NYSE:T) among these hedge funds was Cliff Asness’s AQR Capital Management which owns a $334 million stake in the company.\n\n9. JPMorgan Equity Premium Income ETF (NYSE:JEPI)\n\nJPMorgan Equity Premium Income ETF (NYSE:JEPI) generates monthly income by investing in large-cap, low-volatility dividend stocks. JPMorgan Equity Premium Income ETF (NYSE:JEPI) has an attractive 12-month rolling dividend yield of 11%. JPMorgan Equity Premium Income ETF (NYSE:JEPI)’s portfolio consists of 133 stocks. Some notable holdings of JPMorgan Equity Premium Income ETF (NYSE:JEPI) include AbbVie Inc. (NYSE:ABBV), PepsiCo, Inc. (NYSE:PEP), The Coca-Cola Company (NYSE:KO), Visa Inc. (NYSE:V) and Microsoft Corporation (NASDAQ:MSFT). JPMorgan Equity Premium Income ETF (NYSE:JEPI)’s second biggest holding, AbbVie Inc. (NYSE:ABBV), has increased its dividend consistently for several decades now and is also highly popular among the elite hedge funds tracked by Insider Monkey.\n\nAs of the end of the fourth quarter, 73 hedge funds had stakes in AbbVie Inc. (NYSE:ABBV). The biggest hedge fund stakeholder of AbbVie Inc. (NYSE:ABBV) was Cliff Asness’ AQR Capital Management which owns a $229 million stake in the company.\n\n8. Fidelity US Quality Income ETF (LON:FUSD)\n\nFidelity US Quality Income ETF (LON:FUSD) tracks the Fidelity US Quality Income Index. Major tech companies account heavily for Fidelity US Quality Income ETF (LON:FUSD)’s portfolio. Some of the biggest holdings of Fidelity US Quality Income ETF (LON:FUSD) include Apple Inc. (NASDAQ:AAPL), Microsoft Corporation (NASDAQ:MSFT) and NVIDIA Corporation (NASDAQ:NVDA). Some other notable stocks in the portfolio famous for their dividends include The Procter & Gamble Company (NYSE:PG), Chevron Corporation (NYSE:CVX) and The Home Depot, Inc. (NYSE:HD).\n\nApple Inc. (NASDAQ:AAPL) is one of the best investments both for dividend and share price appreciation. It is one of the most favorite stocks of hedge funds too. Insider Monkey’s proprietary database of 943 hedge funds shows that 135 hedge funds had stakes in Apple Inc. (NASDAQ:AAPL). The biggest stakeholder of Apple Inc. (NASDAQ:AAPL) during this period was Warren Buffett’s Berkshire Hathaway which owns an $116 billion stake in the company.\n\n7. ProShares S&P 500 Dividend Aristocrats ETF (BATS:NOBL)\n\nProShares S&P 500 Dividend Aristocrats ETF (BATS:NOBL) gives investors exposure to the select group of dividend stocks which have increased their dividends consistently for the last 25 years. These stocks are commonly known as dividend aristocrats. ProShares S&P 500 Dividend Aristocrats ETF (BATS:NOBL) claims to be the only ETF which exclusively focuses on The S&P 500 Dividend Aristocrats. ProShares S&P 500 Dividend Aristocrats ETF (BATS:NOBL) consists of 67 holdings. The top three stocks in ProShares S&P 500 Dividend Aristocrats ETF (BATS:NOBL)’s portfolio are Albemarle Corporation (NYSE:ALB), Caterpillar Inc. (NYSE:CAT) and Chubb Limited (NYSE:CB).\n\nChemicals manufacturing company Albemarle Corporation (NYSE:ALB) has upped its dividends consistently for the last 27 years.\n\nAs of the end of the fourth quarter of 2022, 46 hedge funds had stakes in Albemarle Corporation (NYSE:ALB). The biggest hedge fund stakeholder of Albemarle Corporation (NYSE:ALB) was Ken Griffin’s Citadel Investment Group which owns an $115 million stake in the company.\n\n6. SPDR Portfolio S&P 500 High Dividend ETF (NYSE:SPYD)\n\nSPDR Portfolio S&P 500 High Dividend ETF (NYSE:SPYD) seeks to generate results that correspond to S&P® 500 High Dividend Index. SPDR Portfolio S&P 500 High Dividend ETF (NYSE:SPYD)’s portfolio consists of 79 stocks, most of which offer high dividend yields.\n\nSome of the biggest holdings of SPDR Portfolio S&P 500 High Dividend ETF (NYSE:SPYD) include Paramount Global (NASDAQ:PARA), AbbVie Inc. (NYSE:ABBV) and Omnicom Group Inc. (NYSE:OMC). The biggest holding of SPDR Portfolio S&P 500 High Dividend ETF (NYSE:SPYD) is Packaging Corp Of America (NYSE:PKG), which has a dividend yield of over 3.4% as of April 12. UBS in February shared a screen of top 40 dividend stocks picked up by its machine learning model. UBS said that these stocks offer “greater downside protection, have stronger pricing power, trade at a 15-20% valuation discount vs the market and the payout ratio (45%) is 5 ppts below average implying upside to dividend growth.\" PKG made it to this list of stocks.\n\nThis screen of stocks, according to UBS, has outperformed by 5.5% over the past six months.\n\nClick to continue reading and see 5 Best Dividend ETFs in 2023.\n\nSuggested articles:\n\n15 Best Retirement Communities For Active Adults 12 Best Consumer Cyclical Dividend Stocks To Buy Now 25 Countries with the Best Hospitals in the World\n\nDisclosure: None. 10 Best Dividend ETFs in 2023is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/10-best-dividend-etfs-2023-161249154.html", "symbols": ["3IW.F", "4AB.F", "4AB.XETRA", "AAPL.MX", "AAPL.US", "AAPL34.SA", "ABBV.MX", "ABBV.US", "ALB.US", "AMC.F", "APC.F", "APC.XETRA", "CAT.US", "CB.US", "CVX.US", "DOW.US", "GSPC.INDX"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.03, "neu": 0.891, "pos": 0.079}}, {"date": "2023-04-27T14:00:23+00:00", "title": "Should You Be Excited About Verizon Communications Inc.'s (NYSE:VZ) 23% Return On Equity?", "content": "While some investors are already well versed in financial metrics (hat tip), this article is for those who would like to learn about Return On Equity (ROE) and why it is important. To keep the lesson grounded in practicality, we'll use ROE to better understand Verizon Communications Inc. (NYSE:VZ).\n\nReturn on equity or ROE is an important factor to be considered by a shareholder because it tells them how effectively their capital is being reinvested. In simpler terms, it measures the profitability of a company in relation to shareholder's equity.\n\nSee our latest analysis for Verizon Communications\n\nHow To Calculate Return On Equity?\n\nThe formula for ROE is:\n\nReturn on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity\n\nSo, based on the above formula, the ROE for Verizon Communications is:\n\n23% = US$22b ÷ US$94b (Based on the trailing twelve months to March 2023).\n\nThe 'return' is the yearly profit. So, this means that for every $1 of its shareholder's investments, the company generates a profit of $0.23.\n\nDoes Verizon Communications Have A Good ROE?\n\nArguably the easiest way to assess company's ROE is to compare it with the average in its industry. The limitation of this approach is that some companies are quite different from others, even within the same industry classification. As you can see in the graphic below, Verizon Communications has a higher ROE than the average (7.9%) in the Telecom industry. roe\n\nThat's what we like to see. With that said, a high ROE doesn't always indicate high profitability. A higher proportion of debt in a company's capital structure may also result in a high ROE, where the high debt levels could be a huge risk .\n\nWhy You Should Consider Debt When Looking At ROE\n\nMost companies need money -- from somewhere -- to grow their profits. The cash for investment can come from prior year profits (retained earnings), issuing new shares, or borrowing. In the first two cases, the ROE will capture this use of capital to grow. In the latter case, the debt required for growth will boost returns, but will not impact the shareholders' equity. Thus the use of debt can improve ROE, albeit along with extra risk in the case of stormy weather, metaphorically speaking.\n\nStory continues\n\nVerizon Communications' Debt And Its 23% ROE\n\nVerizon Communications clearly uses a high amount of debt to boost returns, as it has a debt to equity ratio of 1.62. There's no doubt the ROE is impressive, but it's worth keeping in mind that the metric could have been lower if the company were to reduce its debt. Investors should think carefully about how a company might perform if it was unable to borrow so easily, because credit markets do change over time.\n\nSummary\n\nReturn on equity is a useful indicator of the ability of a business to generate profits and return them to shareholders. In our books, the highest quality companies have high return on equity, despite low debt. All else being equal, a higher ROE is better.\n\nBut when a business is high quality, the market often bids it up to a price that reflects this. It is important to consider other factors, such as future profit growth -- and how much investment is required going forward. So you might want to check this FREE visualization of analyst forecasts for the company.\n\nOf course, you might find a fantastic investment by looking elsewhere. So take a peek at this  free list of interesting companies.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nJoin A Paid User Research Session\r\nYou’ll receive a US$30 Amazon Gift card for 1 hour of your time while helping us build better investing tools for the individual investors like yourself. Sign up here", "link": "https://finance.yahoo.com/news/excited-verizon-communications-inc-nyse-140023021.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.054, "neu": 0.798, "pos": 0.148}}, {"date": "2023-04-27T13:00:00+00:00", "title": "Verizon Business to showcase 5G business solutions at Channel Partners Conference &amp; Expo 2023", "content": "Verizon Sourcing LLC\n\nVerizon, the network America relies on, will demonstrate 5G innovations that are transforming business operations at The Venetian, Las Vegas, NV, May 1-4\n\nBASKING RIDGE, N.J., April 27, 2023 (GLOBE NEWSWIRE) -- Verizon Business will showcase its 5G business solutions at the Channel Partners Conference & Expo (Booth #1219) at the Venetian Resort in Las Vegas by demonstrating how 5G, edge computing, collaboration tools and a host of advanced connectivity solutions can facilitate the digital transformation of small businesses and large enterprises alike.\n\n“We’re thrilled to be at the Channel Partners Expo to showcase how Verizon is helping our customers transform their business with new and advanced technologies, including a full deployment of 5G core with our proprietary cloud platform, advancement of our fiber network, artificial intelligence utilization, and so much more,” said Michael Caralis, Vice President, Verizon Business Markets. “The combination of these new and advanced technologies not only drives enhanced productivity and generates new revenue streams, but also allows our customers to respond more quickly to changing business dynamics and truly change the world.”\n\nVerizon’s 5G solutions connect discrete systems to streamline operations and provide businesses with the insights to make smarter decisions.\n\nExperience how Verizon is making businesses faster and smarter.\n\nAt Verizon booth #1219, Channel Partners Conference & Expo attendees will be able to meet with Verizon solution experts and see demos illustrating the transformative benefits of Verizon’s solutions, including:\n\n5G and Fixed Wireless Access (FWA) BlueJeans by Verizon Public Sector solutions\n\nTo find out more about Verizon’s Partner Network and solutions, come check out booth #1219 or visit https://www.verizon.com/business/resources/partner-network/\n\nMedia contact: \r\nSarah Heinz\r\nsarah.heinz@verizon.com", "link": "https://finance.yahoo.com/news/verizon-business-showcase-5g-business-130000987.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.987, "neg": 0, "neu": 0.857, "pos": 0.143}}, {"date": "2023-04-27T13:00:00+00:00", "title": "Verizon upgrades network for Rockford customers", "content": "Verizon Sourcing LLC\n\nRecent upgrades lead to testing results that show Verizon’s network performance is unbeaten in Rockford\n\nROCKFORD, Ill., April 27, 2023 (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Rockford, IL. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Rockford include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\n74% of cell sites in Rockford are serving customers in communities throughout Boone and Winnebago with 5G Ultra Wideband service. To extend that coverage, Verizon engineers have recently added a new macro cell site, adding capacity near North Alpine Road and Riverside Blvd. Rockford’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum.  Verizon engineers are using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Rockford will be able to take advantage of even more spectrum as it becomes available for 5G Ultra Wideband.  More than doubling bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services. Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Rockford. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links.  Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network.  Verizon has increased the capacity on the fiber connections in many cell sites in the Rockford area so they can carry 10 times the amount of data.\n\nStory continues\n\n“Verizon is committed to delivering the most reliable network experience and meeting our customer’s connectivity needs, no matter where they are. Our reliable, secure network connects families, friends, homes and businesses in Rockford, IL with our secure, reliable, best-in-class 5G Ultra Wideband technology,” said Dean Brauer, Vice President of Engineering and Operations for Verizon.\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place, smartphones with infinite opportunities to use data in a highly mobile environment, home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, and complex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nRockford, IL customers have an outstanding experience on Verizon’s network\n\nThe recent network upgrades have led to Verizon’s network being unbeaten in Rockford, IL, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Rockford, Verizon is unbeaten for overall network performance, as well as in every single category tested including accessibility, speed, reliability and data, text and call performance.  Today’s results show great speeds for Verizon customers in Rockford with Verizon’s peak download speeds of up to 308 Mbps and median download speeds increasing more than 133% since last year* in the market.\n\nServices from the network customers rely on\n\nFor customers in Rockford, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants super fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with AutoPay and a select 5G mobile plan – all without extra fees, equipment charges, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals For the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Rockford area will also be able to experience the benefits of these network enhancements.  To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nRockford area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Rockford RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Save $25/mo. when combined with an existing 5G Do More, 5G Play More, 5G Get More or One Unlimited for iPhone plan. With Auto Pay and paper-free billing req’d. Add’l $10/mo. w/o Auto Pay. Subject to credit approval.\n\nMEDIA CONTACT: Karen Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://finance.yahoo.com/news/verizon-upgrades-network-rockford-customers-130000386.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.013, "neu": 0.899, "pos": 0.088}}, {"date": "2023-04-27T13:00:00+00:00", "title": "Verizon continues to upgrade Lansing's network", "content": "Verizon Sourcing LLC\n\nRecent upgrades lead to testing results that show Verizon customers have an excellent network experience in Lansing\n\nLANSING, Mich., April 27, 2023 (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Lansing, MI. These technology upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases and to pave the way for personalized customer experiences. Network upgrades in Lansing include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\n39% of people in the Lansing area are covered with 5G Ultra Wideband service, experiencing the speed and security of 5G Ultra Wideband service. In the past several months, Verizon engineers expanded coverage and capacity with new cell sites covering the East Lansing/Okemos area. Additionally, small cells using Verizon’s premium mmWave spectrum have been deployed throughout the East Lansing and Holt communities. Engineers also addressed growing demand at MSU Spartan Stadium by adding additional 5G Ultra Wideband service there. In the near future, engineers will be working on deploying additional network solutions in Willow Creek, the Mason area, the Dewitt area and throughout West Lansing. Lansing’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum.  Verizon engineers are using 100 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Lansing will be able to take advantage of even more spectrum as it becomes available for 5G Ultra Wideband.  That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services. Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Lansing. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links.  Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network.  Verizon has increased the capacity on the fiber connections in many cell sites in the Lansing area so they can carry 10 times the amount of data.\n\nStory continues\n\n“Verizon is committed to delivering the most reliable network experience and meeting our customer’s connectivity needs, no matter where they are. Our reliable, secure network connects families, friends, homes and businesses in Lansing with our secure, reliable, best-in-class 5G Ultra Wideband technology,” said Dean Brauer, Vice President of Engineering and Operations for Verizon.\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place, smartphones with infinite opportunities to use data in a highly mobile environment, home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, and complex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nLansing, MI customers have an excellent experience on Verizon’s network\n\nThe recent network upgrades have led to Verizon’s network being unbeaten in Lansing, MI according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Lansing, Verizon is unbeaten for overall network performance, as well as in categories including speed, accessibility, and reliability.  Today’s results show great speeds for Verizon customers in Lansing with Verizon’s peak download speeds of up to 438 Mbps and median download speeds increasing 115% since last year* in the market.\n\nServices from the network customers rely on\n\nFor customers in Lansing, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants super fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with AutoPay and a select 5G mobile plan – all without extra fees, equipment charges, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals For the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Lansing area will also be able to experience the benefits of these network enhancements.  To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nLansing area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Lansing RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Save $25/mo. when combined with an existing 5G Do More, 5G Play More, 5G Get More or One Unlimited for iPhone plan. With Auto Pay and paper-free billing req’d. Add’l $10/mo. w/o Auto Pay. Subject to credit approval.\n\nMEDIA CONTACT: Karen Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://finance.yahoo.com/news/verizon-continues-upgrade-lansings-network-130000986.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.013, "neu": 0.898, "pos": 0.089}}, {"date": "2023-04-27T13:00:00+00:00", "title": "Verizon Business to showcase 5G business solutions at Channel Partners Conference &amp; Expo 2023", "content": "BASKING RIDGE, N.J., April  27, 2023  (GLOBE NEWSWIRE) -- Verizon Business will showcase its 5G business solutions at the Channel Partners Conference & Expo (Booth #1219) at the Venetian Resort in Las Vegas by demonstrating how 5G, edge computing, collaboration tools and a host of advanced connectivity solutions can facilitate the digital transformation of small businesses and large enterprises alike.\n\n“We’re thrilled to be at the Channel Partners Expo to showcase how Verizon is helping our customers transform their business with new and advanced technologies, including a full deployment of 5G core with our proprietary cloud platform, advancement of our fiber network, artificial intelligence utilization, and so much more,” said Michael Caralis, Vice President, Verizon Business Markets. “The combination of these new and advanced technologies not only drives enhanced productivity and generates new revenue streams, but also allows our customers to respond more quickly to changing business dynamics and truly change the world.”\n\nVerizon’s 5G solutions connect discrete systems to streamline operations and provide businesses with the insights to make smarter decisions.\n\nExperience how Verizon is making businesses faster and smarter.\n\nAt Verizon booth #1219, Channel Partners Conference & Expo attendees will be able to meet with Verizon solution experts and see demos illustrating the transformative benefits of Verizon’s solutions, including:\n\n5G and Fixed Wireless Access (FWA)BlueJeans by VerizonPublic Sector solutions\n\nTo find out more about Verizon’s Partner Network and solutions, come check out booth #1219 or visit https://www.verizon.com/business/resources/partner-network/\n\nMedia contact: \r\nSarah Heinz\r\nsarah.heinz@verizon.com", "link": "https://www.globenewswire.com/news-release/2023/04/27/2656418/0/en/Verizon-Business-to-showcase-5G-business-solutions-at-Channel-Partners-Conference-Expo-2023.html", "symbols": ["VZ.US"], "tags": ["CALENDAR OF EVENTS", "NYSE:VZ", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.987, "neg": 0, "neu": 0.841, "pos": 0.159}}, {"date": "2023-04-27T13:00:00+00:00", "title": "Verizon continues to upgrade Lansing's network", "content": "LANSING, Mich., April  27, 2023  (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Lansing, MI. These technology upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases and to pave the way for personalized customer experiences. Network upgrades in Lansing include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\n39% of people in the Lansing area are covered with 5G Ultra Wideband service, experiencing the speed and security of 5G Ultra Wideband service. In the past several months, Verizon engineers expanded coverage and capacity with new cell sites covering the East Lansing/Okemos area. Additionally, small cells using Verizon’s premium mmWave spectrum have been deployed throughout the East Lansing and Holt communities. Engineers also addressed growing demand at MSU Spartan Stadium by adding additional 5G Ultra Wideband service there. In the near future, engineers will be working on deploying additional network solutions in Willow Creek, the Mason area, the Dewitt area and throughout West Lansing.Lansing’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum.  Verizon engineers are using 100 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Lansing will be able to take advantage of even more spectrum as it becomes available for 5G Ultra Wideband.  That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services.Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Lansing. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links.  Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network.  Verizon has increased the capacity on the fiber connections in many cell sites in the Lansing area so they can carry 10 times the amount of data.\n\n“Verizon is committed to delivering the most reliable network experience and meeting our customer’s connectivity needs, no matter where they are. Our reliable, secure network connects families, friends, homes and businesses in Lansing with our secure, reliable, best-in-class 5G Ultra Wideband technology,” said Dean Brauer, Vice President of Engineering and Operations for Verizon.\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place,smartphones with infinite opportunities to use data in a highly mobile environment,home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, andcomplex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nLansing, MI customers have an excellent experience on Verizon’s network\n\nThe recent network upgrades have led to Verizon’s network being unbeaten in Lansing, MI according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Lansing, Verizon is unbeaten for overall network performance, as well as in categories including speed, accessibility, and reliability.  Today’s results show great speeds for Verizon customers in Lansing with Verizon’s peak download speeds of up to 438 Mbps and median download speeds increasing 115% since last year* in the market.\n\nServices from the network customers rely on\n\nFor customers in Lansing, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants super fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with AutoPay and a select 5G mobile plan – all without extra fees, equipment charges, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals For the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Lansing area will also be able to experience the benefits of these network enhancements.  To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nLansing area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Lansing RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Save $25/mo. when combined with an existing 5G Do More, 5G Play More, 5G Get More or One Unlimited for iPhone plan. With Auto Pay and paper-free billing req’d. Add’l $10/mo. w/o Auto Pay. Subject to credit approval.\n\nMEDIA CONTACT: Karen Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://www.globenewswire.com/news-release/2023/04/27/2656436/0/en/Verizon-continues-to-upgrade-Lansing-s-network.html", "symbols": ["VZ.US"], "tags": ["NYSE:VZ", "PRODUCT / SERVICES ANNOUNCEMENT", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.997, "neg": 0.014, "neu": 0.897, "pos": 0.089}}, {"date": "2023-04-27T13:00:00+00:00", "title": "Verizon upgrades network for Rockford customers", "content": "ROCKFORD, Ill., April  27, 2023  (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Rockford, IL. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Rockford include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\n74% of cell sites in Rockford are serving customers in communities throughout Boone and Winnebago with 5G Ultra Wideband service. To extend that coverage, Verizon engineers have recently added a new macro cell site, adding capacity near North Alpine Road and Riverside Blvd.Rockford’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum.  Verizon engineers are using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Rockford will be able to take advantage of even more spectrum as it becomes available for 5G Ultra Wideband.  More than doubling bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services.Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Rockford. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links.  Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network.  Verizon has increased the capacity on the fiber connections in many cell sites in the Rockford area so they can carry 10 times the amount of data.\n\n“Verizon is committed to delivering the most reliable network experience and meeting our customer’s connectivity needs, no matter where they are. Our reliable, secure network connects families, friends, homes and businesses in Rockford, IL with our secure, reliable, best-in-class 5G Ultra Wideband technology,” said Dean Brauer, Vice President of Engineering and Operations for Verizon.\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place,smartphones with infinite opportunities to use data in a highly mobile environment,home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, andcomplex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nRockford, IL customers have an outstanding experience on Verizon’s network\n\nThe recent network upgrades have led to Verizon’s network being unbeaten in Rockford, IL, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Rockford, Verizon is unbeaten for overall network performance, as well as in every single category tested including accessibility, speed, reliability and data, text and call performance.  Today’s results show great speeds for Verizon customers in Rockford with Verizon’s peak download speeds of up to 308 Mbps and median download speeds increasing more than 133% since last year* in the market.\n\nServices from the network customers rely on\n\nFor customers in Rockford, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants super fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with AutoPay and a select 5G mobile plan – all without extra fees, equipment charges, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals For the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Rockford area will also be able to experience the benefits of these network enhancements.  To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nRockford area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Rockford RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Save $25/mo. when combined with an existing 5G Do More, 5G Play More, 5G Get More or One Unlimited for iPhone plan. With Auto Pay and paper-free billing req’d. Add’l $10/mo. w/o Auto Pay. Subject to credit approval.\n\nMEDIA CONTACT: Karen Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://www.globenewswire.com/news-release/2023/04/27/2656434/0/en/Verizon-upgrades-network-for-Rockford-customers.html", "symbols": ["VZ.US"], "tags": ["NYSE:VZ", "PRODUCT / SERVICES ANNOUNCEMENT", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.997, "neg": 0.013, "neu": 0.896, "pos": 0.09}}, {"date": "2023-04-27T09:40:00+00:00", "title": "Is Verizon Communications Stock a Buy Now?", "content": "Verizon Communications (NYSE: VZ) posted a mixed first-quarter earnings report on April 25. The telecom giant's operating revenue declined 2% year over year to $32.9 billion and missed analysts' estimates by $740 million. Verizon's stock held steady after that report, but its shares remain more than 30% below their all-time high from late 2020.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6a9a98a2-82bf-345f-84bb-6d192261af58/is-verizon-communications.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0.028, "neu": 0.923, "pos": 0.049}}, {"date": "2023-04-27T09:06:00+00:00", "title": "The Fed Expects a Recession: 2 Dow Stocks to Buy Hand Over Fist and 1 to Avoid Like the Plague", "content": "Two time-tested Dow stocks are perfectly positioned if the U.S. dips into a recession, while another Dow component has an abysmal track record during economic downturns.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f2755a87-9932-3caf-befc-3d70401202f3/the-fed-expects-a-recession%3A.html", "symbols": ["BA.MX", "BA.US", "BAC.F", "BAC.XETRA", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0.088, "neu": 0.781, "pos": 0.131}}, {"date": "2023-04-26T19:48:13+00:00", "title": "Verizon Reports Mixed Earnings", "content": "Verizon (NYSE: VZ) reported earnings this week, and results were mixed to say the least. Customers keep leaving, but the broadband business is booming. Travis Hoium discusses the good and bad in the video below.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1dd94557-5b89-389e-8aa1-8ec7f1d777a6/verizon-reports-mixed-earnings.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": -0.226, "neg": 0.109, "neu": 0.803, "pos": 0.088}}, {"date": "2023-04-26T15:55:00+00:00", "title": "Verizon Awards 25 Hispanic Small Businesses $10,000 Grants to Drive Digital Acceleration", "content": "NORTHAMPTON, MA / ACCESSWIRE / April 26, 2023 / Verizon\n\nNew Study of Hispanic Small Business Owners Shows a Push to Digital in Wake of Labor Shortages\n\nVerizon Small Business Study finds a significant gap between Hispanic small business owners' desire for private loans and grants, and the owners that have been able to apply\n\nNEW YORK, April 26, 2023 /3BL Media/ - In celebration of National Small Business Week and Verizon Small Business Days, the company today announced the recipients of twenty five $10,000 grants totaling $250,000 to Hispanic small business owners across the country. The Hispanic small business grant recipients include entrepreneurs from cities such as Boston, Chicago, Houston, Philadelphia, and San Diego.\n\nThrough Verizon Small Business Digital Ready, a free online resource focused on helping small businesses achieve success in today's digital economy, and in partnership with Next Street and Local Initiatives Support Corporation (LISC), these grants will allow businesses to invest in upgrading their technology, advancing their marketing, or supporting operational costs such as employee wages, rent, and more.\n\n\"Working full time as an oncology nurse, I was not sure I'd be able to fully bring my dream to life of also opening and operating my own restaurant. But having access to the grant from Verizon opened a new world of possibilities,\" said Mia Thorn, co-founder of Cruz Kitchen & Taps, one of the grantee recipients. \"Utilizing the platform and Digital Ready tools that Verizon offers allowed me to improve on both my marketing and financial management skills as well as accomplish my business goals during the heart of the pandemic.\"\n\n\"Hispanic small business owners are continuously reinventing themselves through technology and the data from our study proves this,\" said Aparna Khurjekar, Chief Revenue Officer, Business Markets & SaaS at Verizon Business. \"Between the direct partnership with our customer-facing teams of digital experts in their community, the grants for these deserving businesses, and the access to information and mentorship we provide online through our Digital Ready program, we are thrilled to support their continued growth.\"\n\nStory continues\n\nHighlighting the priorities, opportunities, successes and challenges that Hispanic small businesses face, Verizon Business also released the findings of its latest study, Verizon Business' Hispanic Small Business Report, conducted by Morning Consult. Polling five hundred Hispanic small business owners across the country, the research highlights the adoption of technology, desire for advice and assistance, and economic outlook of Hispanic small business owners.\n\nAdditionally, the study looked at differences among gender, industry, as well as those businesses who conduct business primarily in English versus those conducting via a combination of English and Spanish.\n\nTechnology Adoption\n\nNearly three out of four (74%) Hispanic small businesses have leveraged digital tools and technologies to make money over the past three years More than one-third (41%) of respondents have implemented new technology to solve for worker shortage Over the past year, nearly half (47%) have transitioned to a digital first operation Nearly two-thirds (65%) are concerned about ensuring the security of online and digital transactions Hispanic small businesses who conducted business through a combination of Spanish and English are leveraging digital tools to change the customer experience and make money to a greater extent (77%) versus those who conduct business primarily in English (69%)\n\nAdvice and Assistance\n\nIn the past year, only 32% have applied for a private loan or grant, but 78% reported wanting assistance in the form of finding private loan options and how to apply Nearly three out of four (71%) say they need external support for implementation of new systems or technology to ensure security More than three out of four (78%) would find it helpful to speak with IT experts to advice on remote work infrastructure and using newer technologies, such as 5G Two out of three (67%) would find it necessary to have external support in helping their business provide new technology to employees to retain and attract new talent\n\nCommunity and Culture\n\nAlmost two-thirds of Hispanic small business owners (64%) say they have family members working for their business in a paid capacity, and about half (53%) say they have family members volunteering their unpaid time to help with the business Half (48%) say that their business has created new job opportunities More than 62% are trying to develop strategies to drive customers back to face-to-face interactions\n\nBusiness Outlook\n\nNearly half (48%) have begun preparing for a possible recession Nearly two in three (64%) Hispanic small business owners worry about needing to tap into their personal savings to finance their business However two out of three (65%) say their business is better now than it was this time last year and 74% believe their business will be better a year from now than it is today\n\nVerizon Small Business Days Kicks off April 27-May 3\n\nVerizon Small Business days start tomorrow, April 27 through May 3. During this time, small businesses are invited to talk with a Verizon Business' small business specialist and tap into great offers and solutions to drive business forward.\n\nAll small businesses can receive a free tech check to see if their current solutions meet the needs of their business. Additionally, businesses can get a free 5G phone when signing up for a new line with a Business Unlimited Plus or Business Unlimited Pro plan. No trade-in required.\n\nProviding Small Businesses with Digital Ready Resources\n\nVerizon Small Business Digital Ready, a free online resource, was created with and for small businesses, with a specific focus on helping diverse and under-resourced business owners. Small business owners can benefit from access to personalized learning through over 40 courses, mentorship, peer networking, 1:1 expert coaching, and incentives such as grant funding.\n\nBeyond the $250,000 in grant funding provided to Hispanic-owned small businesses announced today, Verizon is offering another round of grant funding available to small business owners from all backgrounds through Verizon Small Business Digital Ready. Now through May 12, 2023, small businesses can unlock an application for the new round of grant funding by registering for Verizon Small Business Digital Ready, and completing at least two of the following, in any combination: courses, live coaching, or community events. A selection of small businesses that complete the application will be chosen to receive a $10,000 grant.\n\nVerizon also recently launched new Spanish language course offerings, coaching from experts, community events, and personalized mentorship available on Small Business Digital Ready.\n\nThis initiative is part of Verizon's goal to help support 1M small businesses by 2030 with the resources to thrive in the digital economy, as part of its responsible business plan: Citizen Verizon.\n\nBeyond Verizon Small Business Digital Ready, Verizon offers other free tools for small businesses to take advantage of including the recently announced BlueJeans Basic, the free version of BlueJeans by Verizon. This allows small businesses to meet for as long as they want, one-on-one or in groups of up to 25 people.\n\nFor more information on Verizon Business and the offerings available for small business, visit www.verizon.com/business.\n\nMedia contact(s)\r\nSarah Heinz\r\nsarah.heinz@verizon.com\r\nBernadette Brijlall\r\nbernadette.brijlall@verizon.com Verizon, Wednesday, April 26, 2023, Press release picture\n\nView additional multimedia and more ESG storytelling from Verizon on 3blmedia.com.\n\nContact Info:\r\nSpokesperson: Verizon\r\nWebsite: https://www.3blmedia.com/profiles/verizon\r\nEmail: info@3blmedia.com\n\nSOURCE: Verizon\n\nView source version on accesswire.com: \r\nhttps://www.accesswire.com/751407/Verizon-Awards-25-Hispanic-Small-Businesses-10000-Grants-to-Drive-Digital-Acceleration", "link": "https://finance.yahoo.com/news/verizon-awards-25-hispanic-small-155500149.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.012, "neu": 0.834, "pos": 0.154}}, {"date": "2023-04-26T15:45:07+00:00", "title": "12 Cheap Internet Stocks to Buy Now", "content": "In this piece, we will take a look at 12 cheap internet stocks to buy now. For more internet stocks, head on over to 5 Cheap Internet Stocks to Buy Now.\n\nThe world that we live in today is vastly different from the one just a couple of decades ago. Want a ride? Use your smartphone. Want to order food? Again, you're smartphone is right there. Bored and want to watch Netflix? Guess what gadget will help you once again. However, the smartphone would not have half the functionality that it has today were it not for the Internet. The project, initially started by the U.S. military, is now a global reality and its impacts are so profound that even the United Nations has adopted a non binding resolution that believes internet access is a human right. This definition builds on the human right to free speech and access to resolution, but the resolution was opposed by some countries such as Russia, Saudi Arabia, India, and China.\n\nAt the same time, the Internet has also given us multi billion dollar companies that rely on it as a primary component of their business model. The biggest example of this is the rise of Amazon.com, Inc. (NASDAQ:AMZN), which is one of the world's biggest electronic commerce retailers and whose latest market capitalization sits at a stunning $996 billion. Another mega company that owes its existence to everybody's favorite communications and entertainment medium, is Meta Platforms, Inc. (NASDAQ:META). Finally, any mention of Internet companies is incomplete without Google, whose parent company Alphabet Inc. (NASDAQ:GOOG) is the largest on our brief set of examples through an absolutely massive market capitalization of $1.2 trillion.\n\nBut how big, or what really is the 'internet industry'? This is a tough question that is bound to leave you scratching your head, because after all, if it weren't for the Internet, Uber Technologies, Inc. (NYSE:UBER) wouldn't exist either. So does this primary reliance on the Internet make Uber an internet company? Or is it simply a transportation services provider, and telecommunications firms such as Verizon Communications Inc. (NYSE:VZ) which actually do provide everyday users with Internet coverage are the true internet companies? We think it's both of them, and it's an important distinction to make as you'll find you below.\n\nStory continues\n\nThe distinction is important because it lets us place a value on the true worth of firms in this elusive internet industry since it has several sub segments with massive valuations of their own. For instance, consider the video on demand industry that's dominated by Netflix, Inc. (NASDAQ:NFLX). According to a research report from Fortune Business Insights, this industry was worth $69.5 billion in 2021 and is expected to grow through a compounded annual growth rate (CAGR) of 17.6% until 2029 to sit at an estimated $257 billion by the end of the forecast period. Another estimate, this time for the transportation as a service (TaaS) industry which consists primarily of firms like Uber, suggests that this sector presents an unbelievable market opportunity of $8 trillion courtesy of its different constituent divisions such as micro mobility. Yet, while the TaaS sector presents an $8 trillion opportunity, the global electronic commerce industry has already crossed the lucrative trillion dollar valuation, with one research report outlining that this industry was worth $2.6 trillion in 2021, will have grown to $3 trillion in 2022, and from then until 2026 will demonstrate a CAGR of 12% for a final value of $4.79 trillion.\n\nFinally, even though it has shaken up human existence, the Internet still has more in store for us. This is courtesy of both 5G telecommunications (for 5G stocks, take a look at 13 Best 5G Stocks to Buy) and satellite coverage (for more on space, head on over to 11 Best Space Stocks to Invest In) - both of which have started to pick up the pace only recently and are projected to have a massive valuation. For instance, the global satellite internet market is estimated to grow at a stunning 20.4% CAGR between 2021 and 2030 and have a final value of $18.5 billion according to Allied Market Research, and according to estimates from the investment bank Morgan Stanley, the sector will represent at least 50% of the total growth in the global space economy by 2040. For reference, the bank believes that the space sector can cross $1 trillion by that time.\n\nAs for 5G, here's what Verizon Communications Inc. (NYSE:VZ)'s chief executive officer Mr. Hans Vestberg had to say during the firm's latest analyst call:\n\nOur engineers have the best track record for designing and building networks that produce the best experience. Our network will continue to evolve with a relentless commitment to quality and reliability, adding capacity where needed and filling service gaps where they exist even as capital intensity declines in the coming years. In the shift to 5G, we have been rapidly building out our C-band spectrum with the most aggressive deployment plan in our company’s history. We are tracking to 200 million POPs this quarter and are well ahead of schedule to reach our 250 million POP targeted by year-end 2024. C-band propagation is very similar to that of AWS and PCS spectrum, which covers more than 300 million POPs today. This gives us a clear path to scale C-band quickly and efficiently, including in the 330 markets where we expect to gain complete access to the C-band spectrum later this year.\n\nWith these details in mind, it's time to take a look at some cheap internet stocks, with the top picks being VEON Ltd. (NASDAQ:VEON), Magyar Telekom Távközlési Nyilvánosan Müködö Részvénytársaság (OTCMKTS:MYTAY), and KT Corporation (NYSE:KT). 12 Cheap Internet Stocks to Buy Now\n\nPixabay/Public Domain\n\nOur Methodology\n\nTo pick out cheap internet stocks, we cast a wide net for our piece. This included sifting out software companies, telecommunications companies, information technology firms, and others, and then analyzing their business model to gauge their relevance to the Internet. Then, the final picks were ranked according to their price to earnings ratio, and the firms with the lowest ratio are listed here.\n\n12 Cheap Internet Stocks to Buy Now\n\n12. Telekom Austria AG (OTCMKTS:TKAGY)\n\nLatest P/E Ratio: 8.41\n\nTelekom Austria AG (OTCMKTS:TKAGY) is an Austrian company that is based in Vienna, Austria. It is a diversified internet company with operations in Serbia, Croatia, Slovenia, and other countries. Telekom Austria AG (OTCMKTS:TKAGY)'s products and services include fixed line internet, internet protocol television coverage, mobile commerce, connected smart home devices, and a mobile payment platform.\n\nAlong with Magyar Telekom Távközlési Nyilvánosan Müködö Részvénytársaság (OTCMKTS:MYTAY), VEON Ltd. (NASDAQ:VEON), and KT Corporation (NYSE:KT), Telekom Austria AG (OTCMKTS:TKAGY) is a cheap internet stock.\n\n11. Yalla Group Limited (NYSE:YALA)\n\nLatest P/E Ratio: 8.23\n\nYalla Group Limited (NYSE:YALA) is a social networking company that is based in Dubai, the United Arab Emirates. Its social network platform enables users to play video games, buy and sell virtual items, and chat with each other. As of December 2022, Yalla Group Limited (NYSE:YALA) had 32 million average users and 12.4 million paying users on its platform.\n\nBy the end of 2022's December quarter, four of the 943 hedge funds surveyed by Insider Monkey had bought Yalla Group Limited (NYSE:YALA)'s shares. The firm's largest investor is Jim Simons' Renaissance Technologies which owns 611,000 shares that are worth $2 million.\n\n10. APT Satellite Holdings Limited (OTCMKTS:ASEJF)\n\nLatest P/E Ratio: 8.03\n\nAPT Satellite Holdings Limited (OTCMKTS:ASEJF) is a Hong Kong based company headquartered in Tai Po, Hong Kong. The firm provides internet protocol management services to other companies via its constellation of satellites. APT Satellite Holdings Limited (OTCMKTS:ASEJF)'s full year results saw the firm grow its revenue by 1.8% annually but struggle with inflation as its profit margin dropped to 25% and net income go down by 12% annually.\n\n9. Verizon Communications Inc. (NYSE:VZ)\n\nLatest P/E Ratio: 7.51\n\nVerizon Communications Inc. (NYSE:VZ) is an American firm that provides fixed and wireless broadband and mobile internet to consumers. Additionally, it also provides networking, IoT, and data broadband services to businesses. The firm is based in New York, New York.\n\nInsider Monkey's 943 hedge fund study for last year's fourth quarter found that 56 had held a stake in Verizon Communications Inc. (NYSE:VZ). The firm's largest investor is Ric Dillon's Diamond Hill Capital which owns 6.7 million shares that are worth $266 million.\n\n8. Altice USA, Inc. (NYSE:ATUS)\n\nLatest P/E Ratio: 7.44\n\nAltice USA, Inc. (NYSE:ATUS) is an American company headquartered in Long Island City, New York. It enables customers to build virtual private networks based on internet protocol, companies to run advertising campaigns based on IP addresses and run network security services, and also provides VoIP telephony and broadband internet services.\n\nAs of Q4 2022, 27 of the 943 hedge funds part of Insider Monkey's database had bought Altice USA, Inc. (NYSE:ATUS)'s shares. The firm's largest hedge fund investor is Jonathan Kolatch's Redwood Capital Management which owns 15 million shares that are worth $70 million.\n\n7. Adeia Inc. (NASDAQ:ADEA)\n\nLatest P/E Ratio: 6.49\n\nAdeia Inc. (NASDAQ:ADEA) is an American firm headquartered in San Jose, California. It enables television companies to distribute their programming over the Internet, aids multichannel video data distribution service (MVDDS) providers to run their business, and firms that rely on internet advertising to generate streaming revenue to make money.\n\nAs of Q4 2022, 17 of the 943 hedge funds polled by Insider Monkey had bought Adeia Inc. (NASDAQ:ADEA)'s shares.\n\n6. Turkcell Iletisim Hizmetleri A.S. (NYSE:TKC)\n\nLatest P/E Ratio: 6.26\n\nTurkcell Iletisim Hizmetleri A.S. (NYSE:TKC) is a Turkish company that is headquartered in Istanbul, Turkey. The firm has a global presence with operations in Germany, the Netherlands, and other countries. It has a digital music service, a mobile browser, fixed and mobile internet products, and a digital business service portfolio made of cybersecurity and Internet of Things (IoT) services.\n\nBy the end of last year's fourth quarter, five of the 943 hedge funds part of Insider Monkey's database had bought Turkcell Iletisim Hizmetleri A.S. (NYSE:TKC)'s shares. Out of these, the company's largest investor is Richard Oldfield's Oldfield Partners which owns 1.7 million shares that are worth $8.4 million.\n\nVEON Ltd. (NASDAQ:VEON), Turkcell Iletisim Hizmetleri A.S. (NYSE:TKC), Magyar Telekom Távközlési Nyilvánosan Müködö Részvénytársaság (OTCMKTS:MYTAY), and KT Corporation (NYSE:KT). are some cheap internet stocks.\n\nClick to continue reading and see 5 Cheap Internet Stocks to Buy Now.\n\nSuggested Articles:\n\n15 Best Retirement Communities For Active Adults 11 Best Space Stocks to Invest In 11 Best Cryptocurrency Stocks to Buy\n\nDisclosure: None. 12 Cheap Internet Stocks to Buy Now is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/12-cheap-internet-stocks-buy-154507189.html", "symbols": ["1045.HK", "15PA.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "ADEA.US", "AMZN.US", "ASEJF.US", "ATUS.US", "AY8.STU", "BAC.F", "BAC.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.02, "neu": 0.875, "pos": 0.105}}, {"date": "2023-04-26T15:24:00+00:00", "title": "New York Hall of Science, Verizon and Snap launch citywide augmented reality experience", "content": "Verizon Sourcing LLC\n\nFirst-of-its-kind “Science City Explorers” Snapchat Lens reveals science and technology behind NYC’s infrastructure, ranging from fire hydrants to stop signs\n\nNEW YORK, April 26, 2023 (GLOBE NEWSWIRE) -- The New York Hall of Science has teamed up with Verizon and Snap to launch “Science City Explorers,” a citywide augmented reality experience that allows people to learn the science in common public objects across New York City, turning the Big Apple into an interactive learning lab.\n\n“Science City Explorers” launched today and is immediately available in the Snapchat app in select New York metro areas.\n\n“NYSCI is committed to creating new ways of delivering equitable learning opportunities around STEM. The ‘Science City Explorers’ experience does exactly that – breaking down walls and unlocking science exploration across the city,” said Margaret Honey, President and CEO of the New York Hall of Science. “Not only will it encourage children to get outside and explore their neighborhoods, but it will open their eyes to the city’s unseen world of science and engineering. Both Verizon and Snap are amazing partners and we are honored to work with their talented teams to turn the entire city into a learning laboratory.”\n\nDeveloped by Social Tech Agency Gospooky, the 5G “Science City Explorers” Lens is available exclusively for Verizon customers with a 5G smartphone on a 5G Unlimited plan on Verizon’s 5G Ultra Wideband network in the New York metro area. A 4G version of the Lens is also available for anyone on Snapchat, independent of carrier and coverage area.\n\n“The massive bandwidth, low latency and fast speeds of Verizon’s 5G Ultra Wideband network takes learning to a whole new level allowing users to collect and learn in super high fidelity on the go,” said Srini Kalapala, Senior Vice President of Technology and Product Development at Verizon. “By combining the power of Verizon’s 5G Ultra Wideband network with Snap’s AR technology and NYSCI’s learning assets, you unlock unique, immersive experiences so children can interact and learn about science in new and engaging ways while they explore the city.”\n\nStory continues\n\n“It’s inspiring to see the creativity around learning that NYSCI and Verizon are bringing to the Snapchat community with this new Lens,” said Sofia Andrianakou, Director of Carrier Partnerships at Snap. “At Snap, we believe in the potential that Augmented Reality has to enhance the real world around us, and this is a perfect example of how to do that via a unique Lens campaign. We can’t wait to see how NYC Snapchatters use the Lens to learn about their city.”\n\nAbout Science Cities Explorers\n\nThis new educational Snapchat Lens uses machine learning to recognize common objects from New York City’s infrastructure. By unlocking the Lens and pointing the Snapchat camera at selected water, electricity and transportation infrastructure across the city, Science City Explorers reveal the behind-the-scenes technology powering NYC. For instance, Snapchatters can scan a stop sign; the Science City Explorers Lens will recognize the object using machine learning and reveal a hidden science component that powers it – in this case, the reflective sheeting that increases visibility and luminosity at night.\n\nExplorers who use the Lens to learn about six or more city objects will receive a free ticket to NYSCI, New York City’s only hands-on science and technology museum, to continue the learning experience in-person.\n\nScience City Explorers is built on and powered by Verizon’s 5G network, which gives Snapchatters the speed and capacity to explore more robust and complex AR experiences. To bring Science City Explorers to life, the Lens includes machine learning models that recognize a variety of everyday objects found throughout the city. Paired with the low latency and bandwidth of Verizon 5G, all objects can be collected in real-time with minimal lag.\n\nNYSCI partners with companies in support for the creation of equitable and engaging STEM learning experiences. Verizon has been partnering with NYSCI for more than 35 years, supporting innovative exhibitions, research and programming, including the development of Design Lab, the largest design engineering space in any museum in the country, and NYSCI’s innovative digital Noticing Tools. NYSCI was also previously awarded a 5G Challenge Award to create showcase projects for how 5G can enhance K-12 education.\n\nAbout NYSCI\n\nThe mission of the New York Hall of Science (NYSCI) is to nurture generations of passionate learners, critical thinkers and active citizens through an approach called Design, Make, Play. Design, Make, Play emphasizes open-ended exploration, imaginative learning and personal relevance, resulting in deep engagement and delight in science, technology, engineering and mathematics. NYSCI was founded at the 1964-65 World’s Fair and has evolved into a local, global and impactful center for interactive science:\n\n500,000 annual visitors. 1 million learners worldwide use NYSCI’s digital products. 3,000 local teachers participate in professional development each year. 1,000 high-school and college students benefit from mentoring opportunities in STEM fields every year. 95 percent of the more than 4,000 young people participating in NYSCI’s Science Career Ladder program over the last three decades have gone on to college. 70 percent of the Science Career Ladder alumni work in STEM fields.\n\nFor more information, visit nysci.org. Follow NYSCI on Twitter and Instagram: @nysci, and on Facebook at: facebook.com/nysci.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: \r\nCaroline Brooks\r\ncaroline.brooks@verizon.com", "link": "https://finance.yahoo.com/news/york-hall-science-verizon-snap-152400601.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.018, "neu": 0.86, "pos": 0.121}}, {"date": "2023-04-26T15:24:00+00:00", "title": "New York Hall of Science, Verizon and Snap launch citywide augmented reality experience", "content": "NEW YORK, April  26, 2023  (GLOBE NEWSWIRE) -- The New York Hall of Science has teamed up with Verizon and Snap to launch “Science City Explorers,” a citywide augmented reality experience that allows people to learn the science in common public objects across New York City, turning the Big Apple into an interactive learning lab.\n\n“Science City Explorers” launched today and is immediately available in the Snapchat app in select New York metro areas.\n\n“NYSCI is committed to creating new ways of delivering equitable learning opportunities around STEM. The ‘Science City Explorers’ experience does exactly that – breaking down walls and unlocking science exploration across the city,” said Margaret Honey, President and CEO of the New York Hall of Science. “Not only will it encourage children to get outside and explore their neighborhoods, but it will open their eyes to the city’s unseen world of science and engineering. Both Verizon and Snap are amazing partners and we are honored to work with their talented teams to turn the entire city into a learning laboratory.”\n\nDeveloped by Social Tech Agency Gospooky, the 5G “Science City Explorers” Lens is available exclusively for Verizon customers with a 5G smartphone on a 5G Unlimited plan on Verizon’s 5G Ultra Wideband network in the New York metro area. A 4G version of the Lens is also available for anyone on Snapchat, independent of carrier and coverage area.\n\n“The massive bandwidth, low latency and fast speeds of Verizon’s 5G Ultra Wideband network takes learning to a whole new level allowing users to collect and learn in super high fidelity on the go,” said Srini Kalapala, Senior Vice President of Technology and Product Development at Verizon. “By combining the power of Verizon’s 5G Ultra Wideband network with Snap’s AR technology and NYSCI’s learning assets, you unlock unique, immersive experiences so children can interact and learn about science in new and engaging ways while they explore the city.”\n\n“It’s inspiring to see the creativity around learning that NYSCI and Verizon are bringing to the Snapchat community with this new Lens,” said Sofia Andrianakou, Director of Carrier Partnerships at Snap. “At Snap, we believe in the potential that Augmented Reality has to enhance the real world around us, and this is a perfect example of how to do that via a unique Lens campaign. We can’t wait to see how NYC Snapchatters use the Lens to learn about their city.”\n\nAbout Science Cities Explorers\n\nThis new educational Snapchat Lens uses machine learning to recognize common objects from New York City’s infrastructure. By unlocking the Lens and pointing the Snapchat camera at selected water, electricity and transportation infrastructure across the city, Science City Explorers reveal the behind-the-scenes technology powering NYC. For instance, Snapchatters can scan a stop sign; the Science City Explorers Lens will recognize the object using machine learning and reveal a hidden science component that powers it – in this case, the reflective sheeting that increases visibility and luminosity at night.\n\nExplorers who use the Lens to learn about six or more city objects will receive a free ticket to NYSCI, New York City’s only hands-on science and technology museum, to continue the learning experience in-person.\n\nScience City Explorers is built on and powered by Verizon’s 5G network, which gives Snapchatters the speed and capacity to explore more robust and complex AR experiences. To bring Science City Explorers to life, the Lens includes machine learning models that recognize a variety of everyday objects found throughout the city. Paired with the low latency and bandwidth of Verizon 5G, all objects can be collected in real-time with minimal lag.\n\nNYSCI partners with companies in support for the creation of equitable and engaging STEM learning experiences. Verizon has been partnering with NYSCI for more than 35 years, supporting innovative exhibitions, research and programming, including the development of Design Lab, the largest design engineering space in any museum in the country, and NYSCI’s innovative digital Noticing Tools. NYSCI was also previously awarded a 5G Challenge Award to create showcase projects for how 5G can enhance K-12 education.\n\nAbout NYSCI\n\nThe mission of the New York Hall of Science (NYSCI) is to nurture generations of passionate learners, critical thinkers and active citizens through an approach called Design, Make, Play. Design, Make, Play emphasizes open-ended exploration, imaginative learning and personal relevance, resulting in deep engagement and delight in science, technology, engineering and mathematics. NYSCI was founded at the 1964-65 World’s Fair and has evolved into a local, global and impactful center for interactive science:\n\n500,000 annual visitors.1 million learners worldwide use NYSCI’s digital products.3,000 local teachers participate in professional development each year.1,000 high-school and college students benefit from mentoring opportunities in STEM fields every year.95 percent of the more than 4,000 young people participating in NYSCI’s Science Career Ladder program over the last three decades have gone on to college.70 percent of the Science Career Ladder alumni work in STEM fields.\n\nFor more information, visit nysci.org. Follow NYSCI on Twitter and Instagram: @nysci, and on Facebook at: facebook.com/nysci.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: \r\nCaroline Brooks\r\ncaroline.brooks@verizon.com", "link": "https://www.globenewswire.com/news-release/2023/04/26/2655399/0/en/New-York-Hall-of-Science-Verizon-and-Snap-launch-citywide-augmented-reality-experience.html", "symbols": ["VZ.US"], "tags": ["NYSE:VZ", "PARTNERSHIPS", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.999, "neg": 0.016, "neu": 0.859, "pos": 0.125}}, {"date": "2023-04-26T15:11:00+00:00", "title": "Verizon Has a 7% Dividend Yield. The Payout Could Get Better.", "content": "CEO Hans Vestburg said the phone company has mostly finished $10 billion in spending on C-bank spectrum and that it expects to be generating more cash.\n\nContinue reading", "link": "https://finance.yahoo.com/m/5c6cd504-9d23-3175-bc64-7aa8e1ede6e8/verizon-has-a-7%25-dividend.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-04-26T13:00:00+00:00", "title": "Verizon continues to upgrade Seattle's best network", "content": "Verizon Sourcing LLC\n\nRecent upgrades lead to testing results that show Verizon customers have the best network experience in Seattle\n\nSEATTLE, April 26, 2023 (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Seattle, WA. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Seattle include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\n77% of people in the Seattle area are covered with 5G Ultra Wideband service. That coverage has been expanded recently with the addition of new macro cell sites and small cell sites. Customers in the Artondale neighborhood of Gig Harbor, WA., in Midland, WA., between South Tacoma and University Place, WA., and in Snohomish, WA. are now able to experience the speed and security of 5G Ultra Wideband service. In the coming months, additional enhancements will be made to increase capacity near Pipe Lake near the Covington Home Depot and near Tahoma High School in Maple Valley, to help manage the exponential increase in data usage Verizon is seeing from customers in those areas. In addition to adding more 5G service using C-band spectrum, Verizon is also deploying 5G service using Millimeter Wave (mmWave), its premium, high-band spectrum which allows for extremely fast speeds and massive capacity. Verizon has recently added mmWave most notably in Capitol Hill, Ballard, Green Lake, Queen Anne, Highline, Central Tacoma, Proctor, Hilltop, Kirkland, Bellevue, Mercer Island and Renton. Engineers have also improved in-building coverage in several stadiums, arenas and key buildings throughout Seattle including Lumen Field, Seattle Convention Center and SeaTac Airport. These in-building solutions use a combination of Verizon’s 4G LTE service for capacity, C-band spectrum for great coverage and Millimeter Wave (mmWave) spectrum, its premium, high-band spectrum which allows for extremely fast speeds and massive 5G capacity. Seattle’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum. Verizon engineers have been limited to using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Seattle will be able to take advantage of even more spectrum as it becomes available for 5G Ultra Wideband. That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services. Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Seattle. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links. Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network. Verizon has increased the capacity on the fiber connections in many cell sites in the Seattle area so they can carry 10 times the amount of data.\n\nStory continues\n\n“Whether our customers are enjoying connecting with friends and family while on the move, connecting their smart homes through one of our home internet products or using our service in Seattle for small business or enterprise applications, we know customers count on us,” said Phillip French, Vice President of Engineering and Operations for Verizon. “Our team has been working hard in Seattle to deliver these results, and we are not slowing down.”\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place, smartphones with infinite opportunities to use data in a highly mobile environment, home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, and complex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers, the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nSeattle, WA customers have the best experience on Verizon’s network\n\nThe recent network upgrades have led to customers having the best experience on the Verizon network in Seattle, WA, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Seattle, Verizon not only wins for overall network performance, but is unbeaten in the categories of accessibility, reliability and performance in texts and calls. Today’s results show great speeds for Verizon customers in Seattle with Verizon’s median download speed increasing 84% and median upload speeds increasing 18% since last year* in the market and peak download speeds of up to 396 Mbps.\n\nServices from the network customers rely on\n\nFor customers in Seattle, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants super fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with AutoPay and a select 5G mobile plan – all without extra fees, equipment charges, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals for the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Seattle area will also be able to experience the benefits of these network enhancements. To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nSeattle area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service. To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Seattle RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Save $25/mo. when combined with an existing 5G Do More, 5G Play More, 5G Get More or One Unlimited for iPhone plan. With Auto Pay and paper-free billing req’d. Add’l $10/mo. w/o Auto Pay. Subject to credit approval.\n\nMEDIA CONTACT:\r\nKaren Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://finance.yahoo.com/news/verizon-continues-upgrade-seattles-best-130000301.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.013, "neu": 0.902, "pos": 0.085}}, {"date": "2023-04-26T13:00:00+00:00", "title": "Verizon continues to upgrade Durham's best network", "content": "Verizon Sourcing LLC\n\nRecent upgrades lead to testing results that show Verizon customers have the best network experience in Durham\n\nDURHAM, N.C., April 26, 2023 (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Durham, NC. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Durham include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\nVerizon engineers have been aggressively deploying 5G Ultra Wideband throughout Durham. That coverage has been expanded recently with the addition of new macro cell sites and small cell sites. Customers around downtown Chapel Hill, the Duke University campus, UNC Kenan football stadium, and near the intersection of Junction and Cheek Rd near Chatham Steel Corporation and the Bull City Little League fields are now able to experience the speed and security of 5G Ultra Wideband service. Additionally a new macro site was built for coverage and capacity along the I-885 freeway connector linking I-40 and Toll NC 885. Also a site was built to improve coverage along Cole Mill Road and Umstead Road in the Eno River State Park vicinity. In the coming months, additional enhancements will be made to increase capacity near Northern High School as well as near North Carolina Central University and Dean Smith Arena to help manage the exponential increase in data usage Verizon is seeing from customers in those areas. Projects are underway to upgrade coverage and capacity in the Ninth St. area near Duke’s east campus as well. Durham’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum.  Verizon engineers have been limited to using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Durham will be able to take advantage of up to 160 MHz of spectrum as it becomes available for 5G Ultra Wideband, almost tripling the bandwidth available to customers.  That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services. Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Durham. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links.  Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network.  Verizon has increased the capacity on the fiber connections in many cell sites in the Durham area so they can carry 10 times the amount of data.\n\nStory continues\n\n“Whether our customers are enjoying connecting with friends and family while on the move, connecting their smart homes through one of our home internet products or using our service in Durham for small business or enterprise applications, we know customers count on us,” said Eric Lia, Vice President of Engineering and Operations for Verizon. “Our team has been working hard in Durham to deliver these results, and we are not slowing down.”\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place, smartphones with infinite opportunities to use data in a highly mobile environment, home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, and complex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nDurham, NC customers have the best experience on Verizon’s network\n\nThe recent network upgrades have led to customers having the best experience on the Verizon network in Durham, NC, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Durham, Verizon not only wins for overall network performance, but is unbeaten in the categories of accessibility, reliability and performance in texts and calls. Today’s results show great speeds for Verizon customers in Durham with Verizon’s median download speed increasing 71% and median upload speeds increasing 24% since last year* in the market and peak download speeds of up to 330 Mbps.\n\nServices from the network customers rely on\n\nFor customers in Durham, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants super fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with AutoPay and a select 5G mobile plan – all without extra fees, equipment charges, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals For the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Durham area will also be able to experience the benefits of these network enhancements.  To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nDurham area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Durham RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Save $25/mo. when combined with an existing 5G Do More, 5G Play More, 5G Get More or One Unlimited for iPhone plan. With Auto Pay and paper-free billing req’d. Add’l $10/mo. w/o Auto Pay. Subject to credit approval.\n\nMEDIA CONTACT: Karen Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://finance.yahoo.com/news/verizon-continues-upgrade-durhams-best-130000993.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.014, "neu": 0.898, "pos": 0.088}}, {"date": "2023-04-26T13:00:00+00:00", "title": "Verizon upgrades network for Miami customers", "content": "Verizon Sourcing LLC\n\nRecent upgrades lead to testing results that show customers have the best experience on Verizon’s network, just in time for the Miami Grand Prix and the summer travel season\n\nMIAMI, April 26, 2023 (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Miami, FL. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Miami include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\n94% of customers in Miami have access to 5G Ultra Wideband service. To extend that coverage, Verizon engineers have recently added new macro cell sites, adding capacity in the southwest and northern portions of Doral, northeast of the Miami Airport and in the south Aventura area. In addition to adding more 5G service using C-band spectrum, Verizon is also deploying 5G service using Millimeter Wave (mmWave), its premium, high-band spectrum which allows for extremely fast speeds and massive capacity. Verizon has recently added new small cells using mmWave in the Hialeah and Hialeah Gardens area, Northwest Miami in the Allapattah area, in downtown Miami and throughout South Beach. Miami’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum. Verizon engineers are using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Miami will be able to take advantage of even more spectrum as it becomes available for 5G Ultra Wideband. That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services. Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Miami. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links. Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network. Verizon has increased the capacity on the fiber connections in many cell sites in the Miami area so they can carry 10 times the amount of data.\n\nStory continues\n\n“Verizon is committed to delivering the most reliable network experience and meeting our customer’s connectivity needs, no matter where they are. Our reliable, secure network connects families, friends, homes and businesses in Miami, FL with our secure, reliable, best-in-class 5G Ultra Wideband technology,” said Eric Lia, Vice President of Engineering and Operations for Verizon.\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place, smartphones with infinite opportunities to use data in a highly mobile environment, home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, and complex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nMiami, FL customers have the best experience on Verizon’s network\n\nThe recent network upgrades have led to customers having the best experience on the Verizon network in Miami, FL, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Miami, Verizon not only wins for overall network performance, but is unbeaten in the categories of accessibility, reliability and performance in data, texts and calls. Today’s results show great speeds for Verizon customers in Miami with peak download speeds of up to 265 Mbps.\n\nServices from the network customers rely on\n\nFor customers in Miami, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants super fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with AutoPay and a select 5G mobile plan – all without extra fees, equipment charges, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals for the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Miami area will also be able to experience the benefits of these network enhancements. To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nMiami area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics®Miami RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Save $25/mo. when combined with an existing 5G Do More, 5G Play More, 5G Get More or One Unlimited for iPhone plan. With Auto Pay and paper-free billing req’d. Add’l $10/mo. w/o Auto Pay. Subject to credit approval.\n\nMEDIA CONTACT:\r\nKaren Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://finance.yahoo.com/news/verizon-upgrades-network-miami-customers-130000573.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.013, "neu": 0.896, "pos": 0.09}}, {"date": "2023-04-26T13:00:00+00:00", "title": "Verizon continues to upgrade Durham's best network", "content": "DURHAM, N.C., April  26, 2023  (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Durham, NC. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Durham include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\nVerizon engineers have been aggressively deploying 5G Ultra Wideband throughout Durham. That coverage has been expanded recently with the addition of new macro cell sites and small cell sites. Customers around downtown Chapel Hill, the Duke University campus, UNC Kenan football stadium, and near the intersection of Junction and Cheek Rd near Chatham Steel Corporation and the Bull City Little League fields are now able to experience the speed and security of 5G Ultra Wideband service. Additionally a new macro site was built for coverage and capacity along the I-885 freeway connector linking I-40 and Toll NC 885. Also a site was built to improve coverage along Cole Mill Road and Umstead Road in the Eno River State Park vicinity. In the coming months, additional enhancements will be made to increase capacity near Northern High School as well as near North Carolina Central University and Dean Smith Arena to help manage the exponential increase in data usage Verizon is seeing from customers in those areas. Projects are underway to upgrade coverage and capacity in the Ninth St. area near Duke’s east campus as well.Durham’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum.  Verizon engineers have been limited to using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Durham will be able to take advantage of up to 160 MHz of spectrum as it becomes available for 5G Ultra Wideband, almost tripling the bandwidth available to customers.  That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services.Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Durham. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links.  Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network.  Verizon has increased the capacity on the fiber connections in many cell sites in the Durham area so they can carry 10 times the amount of data.\n\n“Whether our customers are enjoying connecting with friends and family while on the move, connecting their smart homes through one of our home internet products or using our service in Durham for small business or enterprise applications, we know customers count on us,” said Eric Lia, Vice President of Engineering and Operations for Verizon. “Our team has been working hard in Durham to deliver these results, and we are not slowing down.”\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place,smartphones with infinite opportunities to use data in a highly mobile environment,home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, andcomplex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nDurham, NC customers have the best experience on Verizon’s network\n\nThe recent network upgrades have led to customers having the best experience on the Verizon network in Durham, NC, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Durham, Verizon not only wins for overall network performance, but is unbeaten in the categories of accessibility, reliability and performance in texts and calls. Today’s results show great speeds for Verizon customers in Durham with Verizon’s median download speed increasing 71% and median upload speeds increasing 24% since last year* in the market and peak download speeds of up to 330 Mbps.\n\nServices from the network customers rely on\n\nFor customers in Durham, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants super fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with AutoPay and a select 5G mobile plan – all without extra fees, equipment charges, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals For the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Durham area will also be able to experience the benefits of these network enhancements.  To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nDurham area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Durham RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Save $25/mo. when combined with an existing 5G Do More, 5G Play More, 5G Get More or One Unlimited for iPhone plan. With Auto Pay and paper-free billing req’d. Add’l $10/mo. w/o Auto Pay. Subject to credit approval.\n\nMEDIA CONTACT: Karen Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://www.globenewswire.com/news-release/2023/04/26/2655131/0/en/Verizon-continues-to-upgrade-Durham-s-best-network.html", "symbols": ["VZ.US"], "tags": ["NYSE:VZ", "PRODUCT / SERVICES ANNOUNCEMENT", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.998, "neg": 0.015, "neu": 0.899, "pos": 0.087}}, {"date": "2023-04-26T13:00:00+00:00", "title": "Verizon continues to upgrade Seattle's best network", "content": "SEATTLE, April  26, 2023  (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Seattle, WA. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Seattle include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\n77% of people in the Seattle area are covered with 5G Ultra Wideband service. That coverage has been expanded recently with the addition of new macro cell sites and small cell sites. Customers in the Artondale neighborhood of Gig Harbor, WA., in Midland, WA., between South Tacoma and University Place, WA., and in Snohomish, WA. are now able to experience the speed and security of 5G Ultra Wideband service. In the coming months, additional enhancements will be made to increase capacity near Pipe Lake near the Covington Home Depot and near Tahoma High School in Maple Valley, to help manage the exponential increase in data usage Verizon is seeing from customers in those areas.In addition to adding more 5G service using C-band spectrum, Verizon is also deploying 5G service using Millimeter Wave (mmWave), its premium, high-band spectrum which allows for extremely fast speeds and massive capacity. Verizon has recently added mmWave most notably in Capitol Hill, Ballard, Green Lake, Queen Anne, Highline, Central Tacoma, Proctor, Hilltop, Kirkland, Bellevue, Mercer Island and Renton.Engineers have also improved in-building coverage in several stadiums, arenas and key buildings throughout Seattle including Lumen Field, Seattle Convention Center and SeaTac Airport. These in-building solutions use a combination of Verizon’s 4G LTE service for capacity, C-band spectrum for great coverage and Millimeter Wave (mmWave) spectrum, its premium, high-band spectrum which allows for extremely fast speeds and massive 5G capacity.Seattle’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum. Verizon engineers have been limited to using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Seattle will be able to take advantage of even more spectrum as it becomes available for 5G Ultra Wideband. That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services.Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Seattle. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links. Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network. Verizon has increased the capacity on the fiber connections in many cell sites in the Seattle area so they can carry 10 times the amount of data.\n\n“Whether our customers are enjoying connecting with friends and family while on the move, connecting their smart homes through one of our home internet products or using our service in Seattle for small business or enterprise applications, we know customers count on us,” said Phillip French, Vice President of Engineering and Operations for Verizon. “Our team has been working hard in Seattle to deliver these results, and we are not slowing down.”\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place,smartphones with infinite opportunities to use data in a highly mobile environment,home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, andcomplex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers, the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nSeattle, WA customers have the best experience on Verizon’s network\n\nThe recent network upgrades have led to customers having the best experience on the Verizon network in Seattle, WA, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Seattle, Verizon not only wins for overall network performance, but is unbeaten in the categories of accessibility, reliability and performance in texts and calls. Today’s results show great speeds for Verizon customers in Seattle with Verizon’s median download speed increasing 84% and median upload speeds increasing 18% since last year* in the market and peak download speeds of up to 396 Mbps.\n\nServices from the network customers rely on\n\nFor customers in Seattle, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants super fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with AutoPay and a select 5G mobile plan – all without extra fees, equipment charges, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals for the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Seattle area will also be able to experience the benefits of these network enhancements. To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nSeattle area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service. To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics® Seattle RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Save $25/mo. when combined with an existing 5G Do More, 5G Play More, 5G Get More or One Unlimited for iPhone plan. With Auto Pay and paper-free billing req’d. Add’l $10/mo. w/o Auto Pay. Subject to credit approval.\n\nMEDIA CONTACT:\r\nKaren Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://www.globenewswire.com/news-release/2023/04/26/2655139/0/en/Verizon-continues-to-upgrade-Seattle-s-best-network.html", "symbols": ["VZ.US"], "tags": ["NYSE:VZ", "PRODUCT / SERVICES ANNOUNCEMENT", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.998, "neg": 0.013, "neu": 0.902, "pos": 0.085}}, {"date": "2023-04-26T13:00:00+00:00", "title": "Verizon upgrades network for Miami customers", "content": "MIAMI, April  26, 2023  (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Miami, FL. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Miami include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\n94% of customers in Miami have access to 5G Ultra Wideband service. To extend that coverage, Verizon engineers have recently added new macro cell sites, adding capacity in the southwest and northern portions of Doral, northeast of the Miami Airport and in the south Aventura area.In addition to adding more 5G service using C-band spectrum, Verizon is also deploying 5G service using Millimeter Wave (mmWave), its premium, high-band spectrum which allows for extremely fast speeds and massive capacity. Verizon has recently added new small cells using mmWave in the Hialeah and Hialeah Gardens area, Northwest Miami in the Allapattah area, in downtown Miami and throughout South Beach.Miami’s exceptional 5G coverage uses a combination of mmWave spectrum and Verizon’s recently acquired C-band spectrum. Verizon engineers are using 60 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Miami will be able to take advantage of even more spectrum as it becomes available for 5G Ultra Wideband. That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services.Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Miami. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links. Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network. Verizon has increased the capacity on the fiber connections in many cell sites in the Miami area so they can carry 10 times the amount of data.\n\n“Verizon is committed to delivering the most reliable network experience and meeting our customer’s connectivity needs, no matter where they are. Our reliable, secure network connects families, friends, homes and businesses in Miami, FL with our secure, reliable, best-in-class 5G Ultra Wideband technology,” said Eric Lia, Vice President of Engineering and Operations for Verizon.\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers:\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place,smartphones with infinite opportunities to use data in a highly mobile environment,home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, andcomplex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nMiami, FL customers have the best experience on Verizon’s network\n\nThe recent network upgrades have led to customers having the best experience on the Verizon network in Miami, FL, according to the nation’s most rigorous scientific testing company RootMetrics®. In the most recent test measuring performance of major wireless carriers throughout Miami, Verizon not only wins for overall network performance, but is unbeaten in the categories of accessibility, reliability and performance in data, texts and calls. Today’s results show great speeds for Verizon customers in Miami with peak download speeds of up to 265 Mbps.\n\nServices from the network customers rely on\n\nFor customers in Miami, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants super fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with AutoPay and a select 5G mobile plan – all without extra fees, equipment charges, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals for the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Miami area will also be able to experience the benefits of these network enhancements. To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nMiami area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service.  To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n*Rankings based on the RootMetrics®Miami RootScore® Report: 1H 2023. Tested with best commercially available smartphones on three mobile networks across all available network types. Your experiences may vary. The RootMetrics award is not an endorsement of Verizon.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Save $25/mo. when combined with an existing 5G Do More, 5G Play More, 5G Get More or One Unlimited for iPhone plan. With Auto Pay and paper-free billing req’d. Add’l $10/mo. w/o Auto Pay. Subject to credit approval.\n\nMEDIA CONTACT:\r\nKaren Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://www.globenewswire.com/news-release/2023/04/26/2655140/0/en/Verizon-upgrades-network-for-Miami-customers.html", "symbols": ["VZ.US"], "tags": ["NYSE:VZ", "PRODUCT / SERVICES ANNOUNCEMENT", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.997, "neg": 0.014, "neu": 0.896, "pos": 0.09}}, {"date": "2023-04-26T13:00:00+00:00", "title": "Verizon Awards 25 Hispanic Small Businesses $10,000 Grants to Drive Digital Acceleration", "content": "Verizon Small Business Days Kick Off April 27, Featuring Tech Check Up and Promotions\n\nNew Study of Hispanic Small Business Owners Shows a Push to Digital in Wake of Labor Shortages\n\nVerizon Small Business Study finds a significant gap between Hispanic small business owners’ desire for private loans and grants, and the owners that have been able to apply\n\nNEW YORK, April  26, 2023  (GLOBE NEWSWIRE) -- In celebration of National Small Business Week and Verizon Small Business Days, the company today announced the recipients of twenty five $10,000 grants totaling $250,000 to Hispanic small business owners across the country. The Hispanic small business grant recipients include entrepreneurs from cities such as Boston, Chicago, Houston, Philadelphia, and San Diego.\n\nThrough Verizon Small Business Digital Ready, a free online resource focused on helping small businesses achieve success in today’s digital economy, and in partnership with Next Street and Local Initiatives Support Corporation (LISC), these grants will allow businesses to invest in upgrading their technology, advancing their marketing, or supporting operational costs such as employee wages, rent, and more.\n\n“Working full time as an oncology nurse, I was not sure I’d be able to fully bring my dream to life of also opening and operating my own restaurant. But having access to the grant from Verizon opened a new world of possibilities,” said Mia Thorn, co-founder of Cruz Kitchen & Taps, one of the grantee recipients. “Utilizing the platform and Digital Ready tools that Verizon offers allowed me to improve on both my marketing and financial management skills as well as accomplish my business goals during the heart of the pandemic.”\n\n“Hispanic small business owners are continuously reinventing themselves through technology and the data from our study proves this,” said Aparna Khurjekar, Chief Revenue Officer, Business Markets & SaaS at Verizon Business. “Between the direct partnership with our customer-facing teams of digital experts in their community, the grants for these deserving businesses, and the access to information and mentorship we provide online through our Digital Ready program, we are thrilled to support their continued growth.”\n\nHighlighting the priorities, opportunities, successes and challenges that Hispanic small businesses face, Verizon Business also released the findings of its latest study, Verizon Business’ Hispanic Small Business Report, conducted by Morning Consult. Polling five hundred Hispanic small business owners across the country, the research highlights the adoption of technology, desire for advice and assistance, and economic outlook of Hispanic small business owners.\n\nAdditionally, the study looked at differences among gender, industry, as well as those businesses who conduct business primarily in English versus those conducting via a combination of English and Spanish.\n\nTechnology Adoption\n\nNearly three out of four (74%) Hispanic small businesses have leveraged digital tools and technologies to make money over the past three yearsMore than one-third (41%) of respondents have implemented new technology to solve for worker shortageOver the past year, nearly half (47%) have transitioned to a digital first operationNearly two-thirds (65%) are concerned about ensuring the security of online and digital transactionsHispanic small businesses who conducted business through a combination of Spanish and English are leveraging digital tools to change the customer experience and make money to a greater extent (77%) versus those who conduct business primarily in English (69%)\n\nAdvice and Assistance\n\nIn the past year, only 32% have applied for a private loan or grant, but 78% reported wanting assistance in the form of finding private loan options and how to applyNearly three out of four (71%) say they need external support for implementation of new systems or technology to ensure securityMore than three out of four (78%) would find it helpful to speak with IT experts to advice on remote work infrastructure and using newer technologies, such as 5GTwo out of three (67%) would find it necessary to have external support in helping their business provide new technology to employees to retain and attract new talent\n\nCommunity and Culture\n\nAlmost two-thirds of Hispanic small business owners (64%) say they have family members working for their business in a paid capacity, and about half (53%) say they have family members volunteering their unpaid time to help with the businessHalf (48%) say that their business has created new job opportunitiesMore than 62% are trying to develop strategies to drive customers back to face-to-face interactions\n\nBusiness Outlook\n\nNearly half (48%) have begun preparing for a possible recessionNearly two in three (64%) Hispanic small business owners worry about needing to tap into their personal savings to finance their businessHowever two out of three (65%) say their business is better now than it was this time last year and 74% believe their business will be better a year from now than it is today\n\nVerizon Small Business Days Kicks off April 27-May 3\n\nVerizon Small Business days start tomorrow, April 27 through May 3. During this time, small businesses are invited to talk with a Verizon Business’ small business specialist and tap into great offers and solutions to drive business forward.\n\nAll small businesses can receive a free tech check to see if their current solutions meet the needs of their business. Additionally, businesses can get a free 5G phone when signing up for a new line with a Business Unlimited Plus or Business Unlimited Pro plan. No trade-in required.\n\nProviding Small Businesses with Digital Ready Resources\n\nVerizon Small Business Digital Ready, a free online resource, was created with and for small businesses, with a specific focus on helping diverse and under-resourced business owners. Small business owners can benefit from access to personalized learning through over 40 courses, mentorship, peer networking, 1:1 expert coaching, and incentives such as grant funding.\n\nBeyond the $250,000 in grant funding provided to Hispanic-owned small businesses announced today, Verizon is offering another round of grant funding available to small business owners from all backgrounds through Verizon Small Business Digital Ready. Now through May 12, 2023, small businesses can unlock an application for the new round of grant funding by registering for Verizon Small Business Digital Ready, and completing at least two of the following, in any combination: courses, live coaching, or community events. A selection of small businesses that complete the application will be chosen to receive a $10,000 grant.\n\nVerizon also recently launched new Spanish language course offerings, coaching from experts, community events, and personalized mentorship available on Small Business Digital Ready.\n\nThis initiative is part of Verizon’s goal to help support 1M small businesses by 2030 with the resources to thrive in the digital economy, as part of its responsible business plan: Citizen Verizon.\n\nBeyond Verizon Small Business Digital Ready, Verizon offers other free tools for small businesses to take advantage of including the recently announced BlueJeans Basic, the free version of BlueJeans by Verizon. This allows small businesses to meet for as long as they want, one-on-one or in groups of up to 25 people.\n\nFor more information on Verizon Business and the offerings available for small business, visit www.verizon.com/business.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nMedia contact: Sarah Heinz sarah.heinz@verizon.com\n\nBernadette Brijlall\r\nbernadette.brijlall@verizon.com", "link": "https://www.globenewswire.com/news-release/2023/04/26/2655184/0/en/Verizon-Awards-25-Hispanic-Small-Businesses-10-000-Grants-to-Drive-Digital-Acceleration.html", "symbols": ["VZ.US"], "tags": ["CONTESTS/AWARDS", "NYSE:VZ", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.999, "neg": 0.009, "neu": 0.841, "pos": 0.149}}, {"date": "2023-04-26T13:00:00+00:00", "title": "Cable Companies and Mobile Carriers Battle Over Fixed Wireless Internet", "content": "Comcast and Charter Communications have lost customers to their less-expensive rival plans. But they insist customers will return to broadband.\n\nContinue reading", "link": "https://finance.yahoo.com/m/0f577db8-1387-3dd7-a07e-4dce5498baa4/cable-companies-and-mobile.html", "symbols": ["BAC.F", "BAC.XETRA", "CHTR.US", "CMCS34.SA", "CMCSA.MX", "CMCSA.US", "CQD.F", "CTP2.F", "TM5.F", "TMUS.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": -0.318, "neg": 0.099, "neu": 0.901, "pos": 0}}, {"date": "2023-04-26T11:25:00+00:00", "title": "Is Verizon's Big-Time Dividend in Trouble?", "content": "Verizon (NYSE: VZ) currently offers a monster dividend. The telecom giant's payout yields an eye-popping 7%. That's one of the highest yields in the S&P 500 where the average is 1.7%. A high dividend yield is often a warning sign that the market doesn't believe it's sustainable.\n\nContinue reading", "link": "https://finance.yahoo.com/m/2f26f0a3-83f3-344e-87e3-076257a8a41d/is-verizon%27s-big-time.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": -0.34, "neg": 0.051, "neu": 0.949, "pos": 0}}, {"date": "2023-04-26T11:00:00+00:00", "title": "Is AT&amp;T's Dividend in Trouble?", "content": "AT&T (NYSE: T) has a great dividend, but its business isn't performing as well as investors hoped. Does that put the dividend into question? That's what Travis Hoium tackles in this video. *Stock prices used were end-of-day prices of April 22, 2023.\n\nContinue reading", "link": "https://finance.yahoo.com/m/5dd9f98f-7f37-3f06-bbd6-18bcd662ac33/is-at%26t%27s-dividend-in-trouble%3F.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.667, "neg": 0.031, "neu": 0.843, "pos": 0.125}}, {"date": "2023-04-26T06:37:46+00:00", "title": "14 Best Income Stocks To Invest In", "content": "In this article, we discuss 14 best income stocks to invest in. You can skip our detailed analysis of income stocks and the performance of dividend stocks over the years, and go directly to read 5 Best Income Stocks To Invest In.\n\nIncome stocks are picking up steam this year because they offer a relatively stable and consistent source of income through dividends. One of the main reasons for considering dividend stocks is that these companies tend to perform well during market downturns. For instance, the companies in the S&P 500 paid out a record $565 billion in dividends last year despite stock market turbulence.\n\nDividends accounted for nearly 40% of the annualized total return of the broad market from January 1926 through March 2023, including both capital appreciation and dividends reinvested. Dividend-paying securities can be attractive to investors during recessionary periods and are seen as more stable and financially secure than companies that do not pay dividends. In our previous article titled 11 Best 5% Dividend Stocks To Buy According To Analysts, we reported that since 1926, dividends accounted for over 50% of the market’s total returns during decades with elevated interest rates and slowing growth. Some of the best dividend stocks for regular income include McDonald’s Corporation (NYSE:MCD), Roper Technologies, Inc. (NYSE:ROP), and Aflac Incorporated (NYSE:AFL).\n\nRegular income is often a primary concern for retirees, as they no longer have the same level of steady income from employment that they had during their working years. But not only retirees, any investor who is seeking regular income from their investments may consider dividend stocks as part of their investment strategy. Moreover, concerns about high-interest rates and growing inflation have pushed investors into dividend-paying stocks this year. According to a report by Wall Street Journal, dividend-focused exchange-traded funds experienced inflows worth approximately $2.8 billion this year through April. The report also mentioned that there are now 180 US dividend ETFs with total assets of over $384 billion.\n\nStory continues\n\nDividends have also contributed to an individual's personal income over the years. Dividends as a source of personal income stood at 8.5% in the fourth quarter of 2022, compared with 3.2% in the first quarter of 1980, as reported by S&P Dow Jones Indices and the Bureau of Economic Analysis. Readers can also check out 14 Best Passive Income Stocks To Buy Now to know more about income stocks. 14 Best Income Stocks To Invest In\n\nPhoto by lucas Favre on Unsplash\n\nOur Methodology:\n\nWe scoured Insider Monkey's database of 943 hedge funds as of the fourth quarter of 2022 and picked stocks that pay regular dividends to shareholders. From that list, we shortlisted companies with strong balance sheets and stable cash flow, which show the sustainability of their future dividends and make them reliable investments for generating stable income for shareholders. We ranked these companies in ascending order of the number of funds that have stakes in them as of Q4.\n\nBest Income Stocks To Invest In\n\n14. Realty Income Corporation (NYSE:O)\n\nNumber of Hedge Fund Holders: 24\n\nRealty Income Corporation (NYSE:O) is an American real estate investment trust company. It is one of the best dividend stocks on our list as the company pays monthly dividends to shareholders. Moreover, the company has raised its payouts consistently for 29 years. It currently offers a monthly dividend of $0.255 per share and has a dividend yield of 4.93%, as of April 25.\n\nIn addition to some of the best dividend stocks such as McDonald’s Corporation (NYSE:MCD), Roper Technologies, Inc. (NYSE:ROP), and Aflac Incorporated (NYSE:AFL), Realty Income Corporation (NYSE:O) is also favored by investors due to its monthly payouts.\n\nIn the fourth quarter of 2022, Realty Income Corporation (NYSE:O) reported revenue of $888.7 million, which showed a 30% growth from the same period last year. In 2022, the company's dividend payments represented 75.7% of its diluted AFFO per share.\n\nIn April, Scotiabank upgraded Realty Income Corporation (NYSE:O) to Outperform and also raised its price target on the stock to $69. The firm highlighted the company's lower cost of capital and strong balance sheet.\n\nAs per Insider Monkey’s database for Q4 2022, 24 hedge funds owned stakes in Realty Income Corporation (NYSE:O), compared with 28 in the previous quarter. These stakes are valued at roughly $327 million collectively.\n\n13. The Clorox Company (NYSE:CLX)\n\nNumber of Hedge Fund Holders: 34\n\nThe Clorox Company (NYSE:CLX) is an American manufacturing company, headquartered in California. The company specializes in consumer and professional products, including bleach and other cleaning supplies. Its cash position remained strong in its fiscal Q2 2023, as it reported an operating cash flow of $387 million, up from $222 million during the same period last year. At the end of December 2022, the company had over $168 million available in cash and cash equivalents.\n\nThe Clorox Company (NYSE:CLX) currently pays a quarterly dividend of $1.18 per share for a dividend yield of 2.86%, as of April 25. The company is one of the best dividend stocks for income on our list as it has raised its dividends for 20 years in a row.\n\nAt the end of Q4 2022, 34 hedge funds tracked by Insider Monkey owned stakes in The Clorox Company (NYSE:CLX), up from 27 in the previous quarter. These stakes have a consolidated value of over $764.3 million. Among these hedge funds, Viking Global was the company’s leading stakeholder in Q4.\n\n12. Amgen Inc. (NASDAQ:AMGN)\n\nNumber of Hedge Fund Holders: 35\n\nAmgen Inc. (NASDAQ:AMGN) is a California-based multinational biopharmaceutical company that develops and manufactures medicines for patients with serious illnesses. In the fourth quarter of 2022, the company posted revenue of $6.8 billion, which beat analysts' estimates by $30 million. Its free cash flow for FY22 came in at $8.8 billion, up from $8.4 billion in 2021, which shows that its cash position is strong to generate regular income for shareholders.\n\nAmgen Inc. (NASDAQ:AMGN), one of the best dividend stocks for income, has raised its payouts every year since 2011. Its current quarterly dividend stood at $2.13 per share for a dividend yield of 3.48%, as of April 25.\n\nIn March, Wells Fargo upgraded Amgen Inc. (NASDAQ:AMGN) to Overweight with a $265 price target, appreciating the company's marketing strength in its recent acquisitions.\n\nAmgen Inc. (NASDAQ:AMGN) was a popular stock among hedge funds in Q4 2022, as 60 funds in Insider Monkey’s database owned stakes in the company, up from 53 in the previous quarter. The collective value of these stakes is over $2.2 billion. With over 1.5 million shares, Two Sigma Advisors was the company's leading stakeholder in Q4.\n\n11. Skyworks Solutions, Inc. (NASDAQ:SWKS)\n\nNumber of Hedge Fund Holders: 43\n\nAn American semiconductor manufacturing company, Skyworks Solutions, Inc. (NASDAQ:SWKS) is next on our list of the best dividend stocks for income. Stifel initiated its coverage on the stock in April with a Buy rating and a $150 price target. The firm believes that the company will continue to diversify into broad-based markets.\n\nSkyworks Solutions, Inc. (NASDAQ:SWKS) reported a solid cash position in its fiscal Q1 2023 earnings. The company's operating cash flow for the quarter came in at $773.4 million, compared with $581.7 million during the same period last year. Moreover, it also returned $265.6 million to shareholders in dividends and share repurchases during the quarter.\n\nSkyworks Solutions, Inc. (NASDAQ:SWKS) currently pays a quarterly dividend of $0.62 per share. The company maintains an eight-year streak of consistent dividend growth. The stock has a dividend yield of 2.44%, as of April 25.\n\nAccording to Insider Monkey's database for Q4 2022, 43 hedge funds reported having stakes in Skyworks Solutions, Inc. (NASDAQ:SWKS), up from 39 in the previous quarter. These stakes have a total value of over $871 million.\n\nHeartland Advisors mentioned Skyworks Solutions, Inc. (NASDAQ:SWKS) in its Q3 2022 investor letter. Here is what the firm has to say:\n\n“Before the risk-on rebound early in the quarter, we were searching for opportunities to shift from our defensive stance, looking for beaten-down, high-quality “early cycle” leaders. Existing holding, Skyworks Solutions, Inc. (NASDAQ:SWKS), represents one such opportunity that was added to one weakness.\n\nSkyworks is one of two leading providers of radio frequency system components to smartphone makers and electronics manufacturers. With every step-up in product complexity, over the past two decades, the competitive landscape has shrunk while gross margins have increased significantly. 5G represents another such step-up, which is likely to increase how much Skyworks can make per smartphone. (Click here to view the full text)\n\n10. International Business Machines Corporation (NYSE:IBM)\n\nNumber of Hedge Fund Holders: 43\n\nInternational Business Machines Corporation (NYSE:IBM) is a multinational tech company, based in New York. The company specializes in the production of system hardware and software. On April 15, the company declared a 0.6% hike in its quarterly dividend to $1.66 per share. This marked the company's 28th consecutive year of dividend growth, which makes it one of the best dividend stocks on our list. The stock's dividend yield on April 25 came in at 5.24%.\n\nIn the first quarter of 2023, International Business Machines Corporation (NYSE:IBM) reported an operating cash flow of $3.8 billion and its free cash flow came in at $1.3 billion. The company returned $1.5 billion to shareholders in dividends during the quarter.\n\nBMO Capital maintained a Market Perform rating on International Business Machines Corporation (NYSE:IBM) in April with a $145 price target. The firm mentioned that the company's Q1 earnings were 'reasonable'.\n\nAt the end of Q4 2022, 43 hedge funds tracked by Insider Monkey reported owning stakes in International Business Machines Corporation (NYSE:IBM), compared with 40 in the previous quarter. These stakes have a collective value of $1.23 billion.\n\nDiamond Hill Capital mentioned International Business Machines Corporation (NYSE:IBM) in its Q4 2022 investor letter. Here is what the firm has to say:\n\n“New positions initiated in Q4 included shorts International Business Machines Corporation (NYSE:IBM), Acushnet Holdings (GOLF) and elf Beauty (ELF). Since diversified information technology company IBM’s 2019 acquisition of Red Hat, the company has aggressively pursued a hybrid cloud strategy. Though IBM and its new management team have made solid progress on this pivot, we believe the company still meaningfully lags the cloud hyperscalers and other cloud-native companies. Management has also laid out aggressive long-term targets for revenue growth and free cash flow, both of which we believe the company will struggle to achieve as it faces intense competition in its hybrid cloud business and structural headwinds in the company’s legacy businesses.”\n\n9. Waste Management, Inc. (NYSE:WM)\n\nNumber of Hedge Fund Holders: 43\n\nWaste Management, Inc. (NYSE:WM) is a Texas-based environmental services company. The company offers a quarterly dividend of $0.70 per share, having raised it by 7.7% in February this year. It is one of the best dividend stocks on our list as it has been growing its dividends consistently for the past 20 years. The stock's dividend yield came in at 1.69%, as of April 25.\n\nTruist initiated its coverage on Waste Management, Inc. (NYSE:WM) in April with a Buy rating and a $190 price target, calling the company its favorite name in the group due to its aggressive sustainability investments.\n\nAt the end of Q4 2022, 44 hedge funds owned investments in Waste Management, Inc. (NYSE:WM), up from 41 in the previous quarter. These investments are worth over $6.3 billion collectively.\n\nDiamond Hill Capital mentioned Waste Management, Inc. (NYSE:WM) in its Q1 2022 investor letter. Here is what the firm has to say:\n\n“We also initiated a position in Waste Management (NYSE:WM), one of the largest providers of waste collection services in the US. We believe it is a high-quality business with ownership of key landfill assets that provide pricing power over the long term. Its stock was trading at a discount to our estimate of intrinsic value due to short-term market concerns over an increase in growth investments—we expect these investments to be value-creating over the long term.”\n\n8. Verizon Communications Inc. (NYSE:VZ)\n\nNumber of Hedge Fund Holders: 56\n\nVerizon Communications Inc. (NYSE:VZ) provides communications and entertainment products and services to its consumers. In Q1 2023, the company reported revenue of roughly $33 billion and its net income for the quarter came in at $5 billion. The company generated $8.3 billion in operating cash flow, up from $6.8 billion during the same period last year.\n\nVerizon Communications Inc. (NYSE:VZ) has been rewarding shareholders with increased dividends for the past 16 years, which makes it one of the best dividend stocks on our list. The company pays a quarterly dividend of $0.6525 per share and has a dividend yield of 7%, as of April 25.\n\nAccording to Insider Monkey's Q4 2022 database, 56 hedge funds owned investments in Verizon Communications Inc. (NYSE:VZ) with a value of over $1.5 billion collectively.\n\nMawer Investment Management mentioned Verizon Communications Inc. (NYSE:VZ) in its Q3 2022 investor letter. Here is what the firm has to say:\n\n“There are a few other segments of our portfolios that displayed weakness in the quarter. Cable and telecommunication companies have been an area that has lagged the broader market as their worlds are increasingly colliding. Companies such as Verizon (NYSE:VZ) has been impacted as wireless operator is spending heavily to attract internet subscribers with fixed wired access and the cable companies are trying to build wireless businesses.”\n\n7. ConocoPhillips (NYSE:COP)\n\nNumber of Hedge Fund Holders: 67\n\nConocoPhillips (NYSE:COP) is an American multinational energy company that specializes in hydrocarbon exploration and production. The company recently announced its 10-year plan which is widely appreciated by Street analysts. In view of this, Raymond James raised its price target on the stock to $142 in April with a Buy rating on the shares.\n\nOne of the best dividend stocks for income, ConocoPhillips (NYSE:COP) has been making uninterrupted dividends to shareholders since 1993. It pays a quarterly dividend of $0.51 per share for a dividend yield of 5.23%, as of April 25.\n\nAt the end of December 2022, 67 hedge funds tracked by Insider Monkey held stakes in ConocoPhillips (NYSE:COP), up from 64 in the previous quarter. These stakes have a consolidated value of roughly $3 billion.\n\nOakmark Funds mentioned ConocoPhillips (NYSE:COP) in its Q1 2023 investor letter. Here is what the firm has to say:\n\n“ConocoPhillips (NYSE:COP) is one of the largest and lowest cost U.S. exploration and production companies in the country, led by CEO Ryan Lance—in our view one of the best value creators in the industry. ConocoPhillips’s share prices fell in the first quarter as oil prices receded, which is not atypical. We were buying the company at prices where it could generate its entire market cap in free cash flow over the next decade while growing the production such that at the end of that time, the base of production would be one-third higher. This sort of reinvestment opportunity is unique to ConocoPhillips and clearly not reflected in the current share price.”\n\n6. Bristol-Myers Squibb Company (NYSE:BMY)\n\nNumber of Hedge Fund Holders: 69\n\nBristol-Myers Squibb Company (NYSE:BMY) is a pharmaceutical industry company that offers innovative medical solutions to its consumers. The company has been raising its dividends consistently for the past 17 years and can be added to dividend portfolios alongside some of the best dividend stocks, such as McDonald’s Corporation (NYSE:MCD), Roper Technologies, Inc. (NYSE:ROP), and Aflac Incorporated (NYSE:AFL). It currently pays a quarterly dividend of $0.57 per share and has a dividend yield of 3.25%, as of April 25.\n\nAt the end of December 2022, 69 hedge funds in Insider Monkey’s database were long Bristol-Myers Squibb Company (NYSE:BMY), compared with 68 funds in the previous quarter. The stakes owned by these hedge funds have a collective value of over $1.75 billion.\n\nBaron Funds mentioned Bristol-Myers Squibb Company (NYSE:BMY) in its Q2 2022 investor letter. Here is what the firm has to say:\n\n“We established a position in Bristol-Myers Squibb Company, a global biopharmaceutical company focused on discovering, developing, and selling medicines for patients in the therapeutic areas of oncology, immunology, cardiovascular, and neurology. The stock trades at a low valuation relative to its current earnings because the company faces loss of exclusivity on several key drugs over the next eight years, including Revlimid, Eliquis, and Opdivo.\n\nAt the same time, Bristol-Myers has multiple new products in the early stages of launch (e.g., Opdualag, Camzyos, Breyanzi, and Reblozyl), a robust new product pipeline (e.g., Deucravacitinib, Milvexian, and CELMoD agents), and a strong balance sheet combined with strong free cash flow generation that the company can use for acquisitions. Management believes these growth drivers can more than offset the loss of exclusivity and drive revenue growth through the end of the decade. Given the company’s low valuation, if the company can execute, we think there is substantial upside in the stock.”\n\nClick to continue reading and see 5 Best Income Stocks To Invest In.\n\nSuggested articles:\n\n10 Best Stocks To Invest In 2023 For Beginners 15 Best Dividend Stocks To Buy and Hold 10 Best Car Stocks To Buy Now\n\nDisclosure. None. 14 Best Income Stocks To Invest In is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/14-best-income-stocks-invest-063746421.html", "symbols": ["AFL.F", "AFL.US", "AMG.F", "AMG.XETRA", "AMGN.MX", "AMGN.US", "AMGN34.SA", "AWM.F", "BAC.F", "BAC.XETRA", "BMY.MX", "BMY.US", "BMYB34.SA", "BRM.F", "BRM.XETRA", "CLX.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.022, "neu": 0.86, "pos": 0.118}}, {"date": "2023-04-26T03:42:52+00:00", "title": "Q1 2023 Verizon Communications Inc Earnings Call", "content": "Participants\n\nAnthony Skiadas\n\nBrady Connor; SVP of IR; Verizon Communications Inc.\n\nHans E. Vestberg; Chairman & CEO; Verizon Communications Inc.\n\nMatthew D. Ellis; Executive VP & CFO; Verizon Communications Inc.\n\nBrett Joseph Feldman; Equity Analyst; Goldman Sachs Group, Inc., Research Division\n\nCraig Eder Moffett; Co-Founder, Founding Partner & Senior Research Analyst; MoffettNathanson LLC\n\nDavid William Barden; MD; BofA Securities, Research Division\n\nFrank Garrett Louthan; MD of Equity Research; Raymond James & Associates, Inc., Research Division\n\nJohn Christopher Hodulik; MD, Sector Head of the United States Communications Group and Telco & Pay TV Analyst; UBS Investment Bank, Research Division\n\nKannan Venkateshwar; Director & Senior Research Analyst; Barclays Bank PLC, Research Division\n\nMichael Ian Rollins; MD & U.S. Telecoms Analyst; Citigroup Inc., Research Division\n\nPeter Lawler Supino; MD & Senior Analyst; Wolfe Research, LLC\n\nPhilip A. Cusick; MD and Senior Analyst; JPMorgan Chase & Co, Research Division\n\nSimon William Flannery; MD; Morgan Stanley, Research Division\n\nTimothy Kelly Horan; MD & Senior Analyst; Oppenheimer & Co. Inc., Research Division\n\nPresentation\n\nOperator\n\nGood morning, and welcome to the Verizon First Quarter 2023 Earnings Conference Call. (Operator Instructions). Today's conference is being recorded. If you have any objections, you may disconnect at this time. \r\nIt is now my pleasure to turn the call over to your host, Mr. Brady Connor, Senior Vice President, Investor Relations.\n\nBrady Connor\n\nThanks, Brad. Good morning, everyone, and welcome to our first quarter earnings conference call. I'm Brady Connor, and I'm joined by our Chairman and Chief Executive Officer, Hans Vestberg; as well as our current Chief Financial Officer, Matt Ellis, and Chief Financial Officer designate, Tony Skiadas. Before we begin, I would like to draw your attention to our safe harbor statement, which can be found on Slide 2 of the presentation. \r\nInformation in this presentation contains statements about expected future events and financial results that are forward-looking and subject to risks and uncertainties. Discussion of factors that may affect future results is contained in Verizon's filings with the SEC, which are available on our website. This presentation contains certain non-GAAP financial measures. Reconciliations of these non-GAAP measures to the most directly comparable GAAP measures are included in the financial materials posted on our website. \r\nEarlier this morning, we posted to our Investor Relations website a detailed review of our first quarter results. Please note that during the first quarter, in order to better serve our customers, we reorganized the customer groups within our business segment. We now report the following customer groups: enterprise and public sector, business markets and Software as a Service and wholesale. Prior period operating revenue results within the business segment have been recast to reflect these changes. You will find additional details in the earnings materials on our Investor Relations website. \r\nWith that, I'll now turn the call over to Hans.\n\nStory continues\n\nHans E. Vestberg\n\nThank you, Brady. Good morning, everyone, and welcome to our first quarter earnings call 2023. We delivered a solid first quarter marked by strong performance as we continue to execute on our plan to grow the business across mobility, broadband and private networks. We're making steady progress and expect to keep up the momentum going forward. We remain focused on delivering for our customers and driving service revenue, EBITDA and free cash flow. We grew total postpaid phone gross adds by 5% year-over-year this quarter and achieved 3% wireless service revenue growth $11.9 billion of adjusted EBITDA as well as a strong cash flow from operations of $8.3 billion, an increase of $1.5 billion versus the prior year. \r\nWe're working every day to move the business forward by using the power of America's most reliable network to deliver the best experience for our customers. During the quarter, we reached more than 200 million POPs covered C-band in just over a year since we lead up the first site. With access to that spectrum and advancing the build-out as quickly as we did, we have enabled new source of revenue growth and elevated our customers' overall wireless experience. \r\nIn the first quarter, J.D. Power recognized us as the most awarded for network quality for the 30th time in a row. We're seeing improvements in already leading network performance validated by year-to-date root metrics testing and our customers are taking notice. Where we offer C-band, we see significant benefits in fixed wireless access consumer phone gross adds and retention as well as premium take rates. We also see 4G customers benefiting as we offload traffic in some markets to our 5G Ultra Wideband network. The performance improvements will continue as 5G penetration expands market by market. \r\nWe're excited about the remaining deployment of C-band spectrum and the potential dividend lack for both our business and consumer performance. Moving on to mobility. On the business side, even in the current economic conditions by peers across different industries have combined confidence that mobility remains a priority in their spending. During the first quarter, Verizon business continued to run of strong performance, delivering 136,000 postpaid phone net adds. This was accomplished in spite of some pressures around restructurings within the technology sector. \r\nOn the consumer side, payment trends are at healthy pre-COVID levels and consumers are shopping, evidenced by our increase in consumer postpaid phone gross adds, which were up 11% year-over-year, with the new to Verizon ads leading the way. Our gross ad performance is proof that are surgical and segmented approach to the market is working. We're in a much better position than a year ago, entering the second quarter with a sustained momentum around gross adds as well as postpaid churn where we saw improved performance each month across the first quarter. \r\nWe remain committed to our strategy, not to compete on who can discount the most, but rather who can offer the most value to customers the best overall experience and the best customer satisfaction. +play is a great example of this. We listen to our consumers and introduce exciting partners like Peloton and Netflix providing exclusive deals on an easy-to-use subscription managed platform, and there is more to come. Our segmented approach to the market recognize that one plan doesn't fit all, and we have continued the work to address are underperforming segments. I've talked about our efforts to be more targeted and surgical with our retention. And we saw that play out during the quarter. \r\nBy reducing upgrade volumes and lowering inefficient spending, we were able to deliver working capital benefits while finishing the quarter in a good place with churn and executing on migrations to premium unlimited. Those are real cash savings and a key driving to the large year-over-year improvements in free cash flow. You have seen us taking pricing action most recently on some of our legacy unlimited plans. We continue to look across our base and evaluate opportunities to more closely align pricing to our value proposition. On prepaid, we are working diligently to realize the full potential of this segment. While net adds were down by more than 207,000 versus the prior year, this total was affected by 2 transitory factors. \r\nFirst, more than 100% of our net year-over-year decline came from higher disconnects within our SafeLink brand, which provides services to customers on government subsidized programs. We're still in process of migrating customers onto our network as well. Prepaid is an important part of our value segment strategy and our investment here will continue as we're confident that will pay off in the long term. \r\nTurning to broadband, which is a major growth area for us across consumer and business. We achieved the highest net adds in over 10 years, adding 437,000 total net adds within the quarter, including 67,000 net adds from Fios. We are very pleased with the Fios performance with net adds up 12% year-over-year. For fixed wireless access, we're seeing growth quarter-after-quarter of the quarter with 1.9 million subscribers at the end of the first quarter, fixed wireless continues to scale and contribute increasingly to our revenue performance. \r\nOur business customers are increasingly turning to fixed wireless access as their primary source of broadband connectivity. Won over by the reliability and the overall value of the product. In addition, to take any share from our competitors, we're also seeing new use cases across all of our customer groups leveraging the flexibility of the product to expand beyond what traditional wired broadband can do. \r\nFinally, in private networks, our Verizon business team continues to execute at a high level. We announced new deals with KPMG and Deloitte and have a strong funnel of business ahead of us. We have also established a leadership position as a top network provider in the public sector. This quarter, we announced a 15-year critical infrastructure contract with FAA worth over $2 billion to design, build and operate and maintain the FAA's next-generation communication platform. This is in addition to many ongoing products we're working on for large federal agencies. \r\nIn creating the networks that move the world forward, we remain committed to running our business responsibly for our customers, shareholders, employees and society. Last month, we published our 2022 ESG report, which highlights how business ethics, governance, environmental stewardship and human rights are at the center of everything we do. \r\nI encourage you to take some time to review the report and learn about how we are managing risk and unlocking opportunities surrounding the issues of utmost importance for our stakeholders. Our commitments here come right from our leaders and their teams. A few weeks ago, I announced new leadership for our 2 business units, the network organization and our Chief Financial Officer. These leaders come with nearly 100 years of experiences within Verizon and bring a proven track record of successful execution. \r\nLet me take a moment to walk through these changes. Sampath takes over as a CEO of Verizon Consumer. His objectives are clear: to enhance our consumer operation model and experience, deepen our segmentation approach, scale, fixed wireless access and broadband and drive financial discipline. Kyle Malady was appointed CEO of Verizon business. CIOs are increasingly searching for technology reach solutions, and nobody knows our technology like Kyle. \r\nHis focus is clear: drive sustainable growth in mobility and deliver on the revenue growth opportunities within fixed wireless, 5G private wireless and mobile edge compute solutions. Joe Russo takes over as a President of Global Networks and Technology to continue our efforts to extend, enhance and solidify the nation's leading wireless network and vast global IP and fiber network. Finally, Matt Ellis leaves us at the end of the month, on the 10 years at Verizon and 6 years as our CFO. I want to thank him for his many contributions to our business. \r\nTony Skiadas assumed the title of Chief Financial Officer on May 1. I appreciate Tony's work to improve operations and drive performance as we search for a long-term CFO replacement. So let's now move on, in talking about efficiencies. The teams are on the way to deliver better, simpler and more efficient end-to-end processes for our customers and employees. Spearheaded by the Verizon Global Services Group, we're looking into numerous areas across the business that will help drive bottom line growth, including IT platform transformations, building advanced AI models for the better diagnostic and predictive insights, optimizing our real estate footprint and managing our supply chain efficiently. \r\nWe have also reduced headcount over the last quarters. All in all, our cost efficiency program is on track to achieve our target of $2 billion to $3 billion of annual savings by 2025, which will help to fund our growth as well as drive margin improvements over time. With almost all our $10 billion C-band capital expenditure program behind us, we expect our cash generation profile to expand over the next few years, driven by revenue growth cost management and efficiencies with capital expenditures. This helps support our objective to achieve consistent dividend growth with our 16 consecutive years of increases currently the longest streak in the industry. \r\nAs we look to build on the free cash flow growth generated in the first quarter, we expect to see significant improvement in our dividend payout ratio this year putting the board in a strong position to increase the dividend once again and bring us closer to our debt targets over the following years. Going into the second quarter, I'm energized by the execution of the Verizon team and our new leadership across key positions. We remain focused on delivering for our customers and driving service revenue, EBITDA and free cash flow expansion. \r\nAnd with that, I will now turn it over to Matt for the last time.\n\nMatthew D. Ellis\n\nThank you, Hans, and good morning. Our results for the first quarter reflect the steps we have taken to improve our performance. C-band and the investments in our network are having a positive benefit on customer and overall network experiences. And as Hans mentioned, we are seeing a direct benefit around fixed wireless and phone gross adds, among other metrics, where we operate C-band, but more work remains to be done. Taking a look at operating results of the first quarter, let's start with consumer postpaid phones, which had 263,000 net losses for the quarter compared to 292,000 net losses for the prior year period. Consumer postpaid phone gross adds was strong across the quarter, up over 11% year-over-year, continuing the momentum from the second half of last year. \r\nOur efforts around the segmentation of our base and our more targeted go-to-market approach and offerings to those different customer groups have been key drivers behind our improved gross adds performance. Consumer postpaid phone churn for the quarter was 0.84% and up 7 basis points compared to the same period last year. We are now seeing a return of involuntary churn rates to pre-pandemic levels. As for voluntary churn, performance was mixed across the quarter starting off elevated as we saw normal holiday season activity extend into the early parts of the first quarter. \r\nBut as the quarter progressed, we saw improvements in terms of year-over-year churn performance exit in the quarter with voluntary churn rates in line with last year. While we have more work to do to improve consumer net adds, we are encouraged by the double-digit percentage improvement in gross adds combined with the improved churn level at the end of the first quarter. We entered the second quarter with significantly better momentum than a year ago. \r\nMoving on to the business segment. Verizon business again delivered strong results. We saw solid demand across our 3 customer groups and had 136,000 phone net adds for the first quarter compared to 256,000 for the same period last year. The year-over-year change was primarily due to a couple of large deals that contributed to our net adds results a year ago. Additionally, we saw an increase in churn due to business customers being more cautious around spending and the restructurings Hans noted in his remarks. \r\nMoving along to broadband on a consolidated basis, we delivered 437,000 net additions in the first quarter, the most in a decade. As expected, we saw another quarter of sequential growth in fixed wireless with 393,000 net ads, up from 379,000 in the prior quarter. Customer satisfaction remains high as evidenced by NPS scores as well as encouraging churn trends around the more tenured cohorts of customers. On the Fios side, Internet net adds for the first quarter was 67,000 and up from 60,000 in the first quarter of last year. \r\nCustomers continue to be attracted to our high-quality broadband products, which is reflected in the year-over-year increase in Fios gross adds even in an environment with lower move volumes versus the prior year. \r\nFios retention rates continue to be strong with our best churn performance in more than 5 years. While the first quarter results were prepaid were below our expectations, we remain confident in the value market opportunities and the benefits of having a portfolio of assets and plans to satisfy the needs of all of our customers. \r\nYou heard from Hans some of the actions we are taking to create long-term value. As expected, in the short term, these actions are having a negative impact on our prepaid net adds. Together with the elevated disconnects and our SafeLink brand that Hans referenced, we expect pressure on prepaid net ads to increase in the second quarter before they abate later in the year. \r\nMoving on to the financials. Consolidated revenue for the quarter was $32.9 billion, down 1.9% year-over-year primarily due to equipment revenue being lower by 9% as well as continued declines in business wireline services. Wireless service revenue was $18.9 billion, up 3.0% year-over-year. \r\nAs we discussed on our fourth quarter earnings call, results for the first quarter included a benefit of approximately 185 basis points associated with the large allocation of administrative and telco recovery fees from other revenue into wireless service revenue. This benefit was partially offset by the impact associated with the shutdown of our 3G network completed at the end of the fourth quarter. The shutdown resulted in the removal of approximately 1.1 million retail connections and the corresponding loss of revenue for the first quarter and beyond. \r\nWe continue to see pressure on service revenue from the cost of promotions and the amortization impact in the first quarter. Additionally, we see pressure from prepaid revenue as a result of lower subscribers versus prior year. To help offset these pressures, we've recently implemented additional pricing actions across our business and consumer segments. We expect to see the benefits of these actions ramp across the second quarter as the business segment began billing customers closer to the end of the first quarter, while consumers started earlier this month. \r\nAs a result of these combined pricing actions, we anticipate approximately $75 million of incremental quarterly revenue moving forward. Additionally, the consumer team is working to improve efficiencies around device promotions and credits that we expect to yield revenue benefits across the remainder of the year. We believe that the actions the teams are taking will grow the top line, driving both EBITDA and cash flow. To complement this, the team expects to make additional progress across 2023 on the development and implementation of cost efficiency initiatives, resulting in a meaningful savings run rate at the end of the year. \r\nDuring the first quarter, operating expenses, excluding depreciation and amortization, were down 2.4% year-over-year, primarily due to lower cost of equipment from reduced upgrade volume which helped to offset an increase in bad debt of approximately $200 million. Similar to involuntary churn rates, bad debt expense reflects the return of collections to pre-pandemic levels. While up year-over-year, bad debt expense is relatively consistent with the prior quarter. \r\nCash flow from operating activities for the first quarter totaled $8.3 billion compared to $6.8 billion in the prior year. This increase was primarily due to working capital improvements driven by lower inventory levels, coupled with fewer upgrades and a modest improvement in customer payment patterns despite the current macroeconomic conditions. CapEx for the quarter came in at $6.0 billion, which includes most of the remaining $1.75 billion of C-band-related spending in our guidance. \r\nWith the conclusion of the program, we would expect a step down in the pacing of overall CapEx throughout the remainder of the year and continue to expect 2023 capital spending to be within our guidance of $18.25 billion to $19.25 billion. The net result of cash flow from operations and capital spending is free cash flow for the quarter of $2.3 billion up $1.3 billion versus last year. Total unsecured debt for the quarter was $132.0 billion, an increase of $1.4 billion compared to the end of 2022 and $5.3 billion lower year-over-year. This resulted in net unsecured debt to adjusted EBITDA ratio of 2.7x as of the end of the first quarter. A 0.1x improvement compared to the first quarter of 2022 and flat from the prior quarter. \r\nWe continue to have very low near-term unsecured debt maturities with the only maturity remaining in 2023 and being approximately $600 million due in the second quarter. I wanted to take a moment to acknowledge that this will be my last earnings call as Verizon's CFO. It has been a fulfilling 10 years at Verizon and a privilege to serve as CFO, and I'm thankful to everyone that has made it such a rewarding experience. \r\nFrom our talented finance team to my fellow executive team members to all of you that have had the pleasure of getting to know I want to say thank you. Verizon is in good hands with Tony as its CFO. I've worked closely with him since my first day at the company, and I know he will always strive to drive the business forward in a way that puts Verizon and its shareholders first. I truly look forward to seeing what he and the entire Verizon team will achieve as I cheer them on from the sidelines as an enthusiastic customer and shareholder. \r\nWith that, I will now turn the call back to Hans for concluding comments before we open up to your questions.\n\nHans E. Vestberg\n\nThanks, Matt. In summary, our disciplined approach has led to significant progress on our key strategic plans and we need to keep the momentum and focus going. We're pleased with how 2023 has started. We continue to deliver the best customer experience on the most reliable network supported by the best people in the industry. In mobility, our segmented and surgical approach to the market is working, and we are taking pricing actions where possible. \r\nIn broadband, the combination of fixed wireless access and fiber is winning as we continue to capture market share. We'll continue to grow our cash generation profile and maximum shareholder returns aided by our cost efficiency program and lowered capital expenditures. I remain confident in our strategy and our strong focus on execution. We are always identifying new ways to evolve our business and execute on opportunities. In everything we do, we focus on driving profitable growth. We measure our success in maximizing value across stakeholders for our ability to grow service revenue, EBITDA and cash flow. \r\nBrady, over for the questions.\n\nQuestion and Answer Session\n\nBrady Connor\n\nThanks, Hans. Brad, we're ready to take questions this morning.\n\nOperator\n\n(Operator Instructions) The first question for today comes from John Hodulik of UBS.\n\nJohn Christopher Hodulik\n\nGreat. And Matt, thanks for all the help over the years and best of luck to you in the future. If I could just start with a couple of wireless questions. First on the gross side or the consumer side, obviously, some strength there. Any other detail you can give us in terms of what's driving the double-digit improvement. I think AT&T saw a decline. \r\nThere's just any change in the sort of promotional posture or anything you're doing there? And then on the other side of the ledger, churn, obviously up a little bit year-over-year, but it sounds like you're making some trends. Did you guys make any pricing changes on the consumer side in the first quarter? And just -- any comments around the sustainability of those improvements as we look forward throughout the year?\n\nHans E. Vestberg\n\nThank you. Let me start, and then I'll hand it over to Matt. I think what we saw in the first quarter was very much the momentum. We start building I would say, end of the third and into the fourth when it comes to both how we converted our customers to be part of our journey with the more segmented approach. And that we have seen through the quarter when it comes to our gross adds that many of the initiatives we have had all the way from the welcome plan and many of the others, they have been working well for us. So that's partly what we have been doing. \r\nAnd then, of course, I think we're much more focused. And of course, now with the new team in place as well, where we have full alignment with Sampath when it comes to the execution here and seeing that we're getting the right customers in. I think that has been helpful as well. Then as you have seen, we're coming in and out of the quarter with promotions. We really are taking the opportunity when we see that we have an opportunity to bring in customers. So that's how are you seeing the momentum continue. And as Matt said also in his opening here, we have seen that momentum continuing for us. \r\nAnd for the churn, I will hand it over to Matt. But as I said, I mean, we had a little bit higher in the beginning of the quarter and it continued to improve. And we are working with both that as well as we continue to create the momentum we have right now on the consumer wireless. Matt?\n\nMatthew D. Ellis\n\nThanks, Hans. So on the churn side, certainly, we saw improvement as the quarter went on. We had a lot of carryover from holiday level churn in January by the time we got to March, we saw a much better momentum there. So that's the jump-off point as we go into second quarter. The pricing changes that you mentioned in your question really didn't go into effect until we kind of came to the moving from Q1 to Q2 so that will be incremental to the results of the business here as we get into the rest of the year. \r\nSo -- but as Hans said, really a case of rebuilding from the momentum last year that was a year ago was not where we wanted it to be. At the midpoint of the year, we talked about taking actions, and you see the results of those actions showing up in the results. And so the team is focused on continuing to build from there.\n\nOperator\n\nThe next question comes from Brett Feldman of Goldman Sachs.\n\nBrett Joseph Feldman\n\nI'd also like to reiterate my thanks to Matt for all his help over the years. My question is about fixed wireless. So when I look at the formal remarks document you put out, it looks like you still have just over 40 million households where that can get your fixed wireless service. The reason I bring it up is that would appear to be a fraction of the availability of your ultra-wideband network, which now covers over 2/3 of the population. \r\nSo I was wondering, how do we think about the game plan for expanding the distribution of the fixed wireless service now that you have significantly expanded the ultra-broadband -- ultra-wideband network? And how do we think about the cadence of quarterly fixed wireless access here? Is there still going to be a tailwind? Or are we getting to a point where it's leveling now?\n\nHans E. Vestberg\n\nThank you, Brett. First of all, we're really pleased with the performance on the fixed wireless access. The team is doing a great work. And remember, it's not only the consumer side, it's the business side as well on the business side. Many new use cases are coming up on using fixed wireless access. So the team are scaling, and we're on scale right now. So like the rhythm I see on our sales motions right now. And if you see in the first quarter, almost 400,000. \r\nWhen it comes to the network, you know that later -- the latter part of this year in December, actually -- or we will get our next chunk of C-band. Right now, we're covering some 70 markets out of over 400. So it's 330 markets left, we will get the C-band. And we clearly pointed out in the opening here that where we opened a C-band. We're not only seeing fixed-wire access opportunity. We also see step-ups and a greater upgrade cycle for our customers because they see the improvements on the C-band. So we're very encouraged by the C-band coming out. But as I said, we're waiting for the clearance by the year-end to get even more. But as we roll out right now, we open up markets. \r\nAnd remember, we talked about that we are in the network team, we're now decentralizing so we can attack locally because we are sort of opening markets locally. The same goes what Sampath is working on right now is also taking his operations more locally, so we can both the marketing and execution locally. And you might have seen it that we do more local things because as we open up more on fixed wireless access. We do that locally. And so far, our success rate is high. We're just going to go do this in the right way to take the learnings with us doing better all the time. \r\nWe also have started with differentiation on different type of peers when it comes to our fixed wireless offerings. There's a lot more to be done there. \r\nBut as I said, I'm very pleased with the rhythm and the market share we're taking and remember, the C-band, so far is deployed mainly in urban and suburban areas, the majority of the spectrum coming is actually in more of the suburban and rural. And we also get, of course, more urban spectrum as we're only deploying 60, maybe 80-somewhat megahertz, 100 where we are, in average, 160. So I have to say this is one of the biggest 5G use cases we have right now, and we really seeing good traction. So that's how we're going forward.\n\nBrady Connor\n\nYes. Thanks, Brett.\n\nOperator\n\nThe next question comes from Simon Flannery of Morgan Stanley.\n\nSimon William Flannery\n\nAgain, my best wishes to Matt for the future. Just following up on Brett's fixed wireless question. You talked about scaling. It looks like you're almost hitting 2 million fixed wireless subscribers now. How is it working on the network capacity side of things? And what's your confidence in going to continue to handle increasing usage from the customers as this continues to scale? \r\nAnd then if we could just go back to the announcement, I think it was March 3 of the new appointments. You talked a little bit about Kyle and Sampath. But what if we were inside Verizon, what are the big changes that have taken place over the past 7 weeks or so that are really changing the trajectory, particularly of consumer.\n\nHans E. Vestberg\n\nThank you, Simon. On the capacity, we -- the guys is great. First of all, were used on an initial trends of spectrum that we're using, as I said, we were fixed wireless access on the ultra-wideband. We have so much more capacity coming. On top of that, all the new features you have with advanced 5G carrier aggregation, we have new devices coming out that can handle different spectrum. \r\nSo there are so many more things I feel really confident that we will manage this capacity without any problems to the levels we have talked about and way beyond that. Then, of course, as I talked with many of you guys, if it comes a moment that we have a community that have a lot of fixed wireless access we will have over time, other opportunities of sales splitting, et cetera. We are not even close to that today. \r\nSo I feel really good about how the guys are managing the network and the opportunities we're building on our C-band here. As I said, on the 4G fixed wireless access, they were more opportunistic and selling when we see that we have capacity, but not sort of where we see that we have that full. We're not selling any more. But this expansion is right now on 5G Ultra Wideband. \r\nWhen it comes to the new team, the big changes I've seen, first of all, the first big change is that these guys are operational day one. I mean both Kyle and Sampath is straight into it. If you look at Sampath, he's very much focused both on the customer dimension and seeing that we were improving the momentum we have right now on gross adds and churn and see that we actually improving through the year. But he also works with our offerings and our operations, see that we're even stronger locally. Kyle, on the other hand, continuing the work of Sampath, great momentum on Business Wireless as we continue this quarter private networks is really taking off. \r\nAnd then on top of that, working with a wireline decline to see that we're taking out cost at the same time, managing our contract and I don't think there's no one better than Kyle. He knows the network that more than anybody else. So I think that's the main focus and they've been really fast. And then, of course, the transitions between Tony and Matt is going extremely simple because these guys have worked together for 10 years. Tony is already into all the operations, working very closely with the new leaders all the way from Joe, that's running networking Kyle and Sampath. So I feel good. I feel really good and confident about it, and it's very clear that the priorities there. So maybe, Tony, you can say something about your priorities.\n\nAnthony Skiadas\n\nSure. Thanks, Hans and Simon. I'm excited to have the opportunity to succeed Matt as the CFO. In terms of my priorities, I have 3 of them. First, supporting our new leaders, Sampath, Kyle and Joe in executing their strategies. And that includes narrowing our focus with a very strong emphasis on operational performance; second, ensuring that we deliver the 2023 financial guidance that we laid out in January and third, ensuring that we continue to execute on our capital allocation strategy, the 4 capital allocation priorities that we shared with you last year, those remain unchanged. So those are my 3 priorities right out of the gate. And as Hans mentioned, the transition has gone exceptionally well.\n\nSimon William Flannery\n\nGreat.\n\nBrady Connor\n\nThanks, Simon.\n\nOperator\n\nThe next question is from Phil Cusick of JPMorgan.\n\nPhilip A. Cusick\n\nTwo, if I can. First, can you expand on the bad debt and churn discussion and how that relates to the upgrades, which seem to be fading through the quarter? And then second, if you can talk about prepaid. Are the losses mostly happening in SafeLink and what is happening in this and the different brands and any conversion of prepaid to postpaid this quarter? And how would you report that if it was happening?\n\nHans E. Vestberg\n\nOkay. That was a lot of questions in one. I will start on the high level here on the -- as we said earlier, the payment patterns are basically same as pre-COVID. We have a high-quality customer base. We see this as a very healthy at the moment, all the way. I will ask Matt to expand on that because looking backwards. And then when it comes to the question on prepaid, or value segment, yes, as we said in an opening here, I mean, the negative number is, I would say, 100% coming from SafeLink, which is a government-subsidized brand. \r\nBut there are other puts and takes there as well. I think that the visible brand is doing well. We're just ramping up total wireless, which is an important piece of it, not having all the things coming through there. So -- and then, of course, we have the network migration still happening. So it's combination of a lot of things on the different brands. Our confidence is that we will improve that at the latter part of the year when some of these things are moving out. So that's a general comment, maybe on the churn piece, Matt, if you say something.\n\nMatthew D. Ellis\n\nYes. Thanks, Phil. So looking at the churn and the bad debt and to your question was more around the bad debt side. So certainly up a little bit year-over-year, but more importantly, flat sequentially. And what you're really seeing is first quarter last year, we still had some impacts in there of some of the COVID-related activities. That's now fully out. \r\nAnd I'd say we're back to perpetual type run rate. In terms of the -- with the lower upgrades in there, also the plus 11% phone gross adds, as Hans mentioned in his prepared remarks, a lot of those gross adds were new to Verizon. And those new to Verizon customers typically come in at a different bad debt accrual rate than upgrades, which is existing customers that we know well and so that's the trade-off there. \r\nThe other thing I look at on the bad debt side. One, you see from our most recent ABS filings at our FICO scores across our base continues to be very strong. We've talked for many years now about the quality of the Verizon postpaid base and you see that there. And then secondly, the payment patterns we actually had from customers this quarter actually just slightly better sequentially in terms of the aging. So we're seeing good behavior, good payment activity from our customer base, which is why you see the flat bad debt on a sequential basis now that we're fully through the COVID period.\n\nPhilip A. Cusick\n\nIf I can just follow up, was there any conversion from prepaid to postpaid? Or I may have missed it.\n\nMatthew D. Ellis\n\nA little bit, but nothing material, but that's obviously certainly something the team is very focused on going forward, having that opportunity in there, got that's still ahead of them to be a much more meaningful contributor going forward.\n\nBrady Connor\n\nYes. Thanks, Phil.\n\nOperator\n\nThe next question comes from David Barden of Bank of America.\n\nDavid William Barden\n\nThanks for all the help, Matt. I guess in the prepared remarks, Matt, I think you mentioned that there were going to be some cost efficiency benefits in 2023. I was wondering if you could kind of -- in that $2 billion to $3 billion target, talk about the cadence of how you see that unfolding in maybe the second half of this year and into the coming years?\r\nAnd then the second question would be one of the things that's contributed to, I think, the momentum that you guys have been talking about a lot on the call has been a combination of the new kind of more affordable welcome and limited plan and a lot of the marketing you've been doing. Could you talk about what the new kind of management team wants to do to take that maybe to another level, if at all, this year and kind of what the end goal is flat subscribers to goal? Or is market share of the goal? That would be helpful.\n\nHans E. Vestberg\n\nI will start, and then I will toss the question and toss to Tony, and I will start with your second question. So the team -- I think we just need to divide the wireless question that you have. On the business side, I think it's clear, we're really strong. We are taking market share. The team is working through SMB, government and large enterprises with our offerings where the network is the key contributor. \r\nKyle will continue that work and the drumbeat we have there. On the consumer side, I think that Sampath and I are 100% the line that we are in a momentum where we are now going to continue to improve our net additions on consumer, but most importantly is to grow in the service revenue but of course, we want customers as well. But mostly important is growing the service revenue and expanding the cash flow and EBITDA. That's really the main focus for Sampath that were 100% the line on. But that also means that we need to take customers. And I think that we will continue to evolve our proposition and coming with new products. \r\nSo I feel encouraged what I've seen so far and the thinking that Sampath and the team have, but we need to stay tuned for some of the new things coming, Tony?\n\nAnthony Skiadas\n\nThanks, Hans. David. So on the cost side, as we mentioned in the prepared remarks, we're making progress with Verizon Global Services and all the cost transformation efforts. As we mentioned previously, we're on track with our cost efficiency program to take $2 billion to $3 billion of cost out by 2025. Within that, we'll see some of those benefits manifest themselves in the second half of this year in '23 with significant savings in 2024 and really focused on areas like sourcing, transformation, IT conversions and transformations as well as supply chain and other AI models.\n\nBrady Connor\n\nYes. Thanks, Dave.\n\nOperator\n\nThe next question comes from Michael Rollins of Citi.\n\nMichael Ian Rollins\n\nMatt, I also want to express my thanks and best wishes as you leave Verizon. If I could focus on 2 topics. First, on the ARPU side, if you can unpack a little bit more in terms of what you're seeing on the unlimited and premium unlimited take rates and where those can go over time in terms of continuing to monetize the network and the bundles that you offer? And then on the lower upgrade rate, are you seeing a fundamental change in customer holding periods for devices and what does that mean for the size of the switcher pool in the industry going forward?\n\nHans E. Vestberg\n\nI can start. I mean, we -- I can on a high level, say we continue to see the trend from our customer on postpaid going to unlimited and then go to unlimited premium. That continues, the team is doing great work to see that we're doing that transition. And -- but we still have opportunities. We still have customer meter plans. We still have a portion or one limited, it can go to unlimited premium. \r\nSo we still see that as an important growth trajectory for our ARPU going forward. And then on the upgrades, I mean, we have talked about before, I mean the market indication is that it's going to be a little bit smaller switcher pool. That doesn't mean that we feel that we shouldn't be taking more fair share. We should definitely do that and continue to see that our customers that we have, we're expanding with them, and then we're actually bringing new customers. So I think -- that's what we see right now. But again, we have good momentum with all the offerings we have. I expect my consumer team come out with new offerings as well. So -- and continue that drumbeat, Matt?\n\nMatthew D. Ellis\n\nYes. No, exactly, Hans. And Mike, so as you think about it, the strategy is 1 always to get the customer in, then have the opportunity to move customers up the stack and you see we've done that number of different ways over the years, and you should expect us to continue to find ways to do that. \r\nAnd then also, we get the opportunity to add other things to the account, so fixed wireless access allows us to increase ARPU and adding other devices to the accounts, too. So there's still significant opportunities there for us to grow share of wallet with the customer as we go forward. And I would expect that the consumer team will continue to make sure that they are having the right pricing constructs and offerings in front of customers, and those will constantly evolve over time so that we can continue to grow up.\n\nMichael Ian Rollins\n\nAnd if I could just throw one other out there. Just from a government program perspective, can you share how Verizon participates in ACP? And any new thoughts on potentially participating in the BEAT program?\n\nMatthew D. Ellis\n\nYes. So I'll take the first shot. Look, ACP is an important program. As you've seen, the actions we've taken over the past few years, whether it's the acquisition of Tracfone, the introduction of plans like Welcome. We want to participate in all customer segments. That includes ACP, whether that be on the wireless side or the fixed side. So we do participate in those programs. And then as the B programs come out, we will look for where it makes the most sense for us to participate in those programs. We've been doing -- we've been building fiber out to our homes for a long time. We continue to do so. \r\nOver 500,000 new OFS last year, we said we'd do something in that same region again this year and into the foreseeable future at that type of run rate. So as that those new programs help us the opportunities to continue to do that will certainly be very interested in looking at using them where it makes sense.\n\nBrady Connor\n\nYes. Great. Thanks, Mike.\n\nOperator\n\nThe next question comes from Craig Moffett of MoffettNathanson.\n\nCraig Eder Moffett\n\nI want to sort of step back to a more strategic question about the wireless business, if I could. I mean for years, your business model and your -- and sort of the way you came to market was based on a very low churn strategy, therefore, arguably, you didn't need the same number of gross adds to sustain growth. And it was based on a very clear value proposition of Best Network. \r\nIt seems like all of those pieces are quite different now. And despite what you said about the prospects for churn, churn is quite a bit higher for retention. How do you kind of win the battle for the hearts and minds, particularly in the consumer segment by sort of returning to the base of convincing customers that yours is really the best network and sort of how do you win with the value proposition?\n\nHans E. Vestberg\n\nI will start here. First of all, what we see right now is we have a clear value proposition when we roll out the C-band. We have great uptake, step-ups from our customers when they see the C-band. And you know better than anybody else how much of that spectrum we have right now, which is a very little bit. And with all that, we get this momentum, that's why I feel so good about it. \r\nAnd then as Matt said, our churn a little bit elevated, but it's also improving in the quarter. So we're working on that. And having a gross -- the gross adds momentum at the same time. That tells you something about where we're going right now heading. And then we have Sampath in the role that really no operational execution. So I think we have all that and we have the best network clearly, and it's just going to get better. I mean with every measurement we do right now, we are clearly come out as #1. \r\nAnd the only thing I know for sure. We're going to extend that leadership with the C-band continue to roll out. So our proposition is very clear, continue to have the best network, have a good proposition for our customer because you need to continue to do new offerings to the consumer group because their behaviors are changing as well. That's why we came with it, +play. We're listening to customers to make it easier and all of that. And you haven't seen the loss from us. So I think that we're building on all the strength we have and those strengths are even getting stronger.\n\nBrady Connor\n\nThanks, Craig.\n\nOperator\n\nThe next question comes from Tim Horan of Oppenheimer.\n\nTimothy Kelly Horan\n\nCan you be a little clearer on the network upgrades -- it looks like you're more than doubling the amount of spectrum by year-end. What does that mean for coverage, do you think, in capacity? And when will we get to 300 million homes passed and more like 70 million or 80 million that have the ability to get fixed wireless?\n\nHans E. Vestberg\n\nSo on the network, you're absolutely right. We have just -- on the C band we have just started to roll it out in the majority of the 60, 70 markets we're rolling out right now, we're using 60 megahertz. And you know we have an average 160 megahertz and in many places, even up to 200 megahertz. So it's an enormous difference when it comes from 60 to 160 megahertz, how much more capacity there is and on top of that, of course, we are adding new type of software features like carrier aggregation, the ship size is getting better in devices, both the handset and the fixed wireless access devices. \r\nSo that's going to enhance the capacity for us. And as I said, we were very focused to see that we materialize our business cases for the C-band, all the way from consumer and business wireless to fixed wire access and mobile edge compute and private networks. So we focus on the revenue generation of it, and we'll continue to do so. But clearly, it's going to be a step-up when we get the next tranche. And we're going to open more homes for households penetrated with fixed wireless access, and we're going to have much more markets covered by the C-band. So we're just going to continue that journey as fast as we can.\n\nTimothy Kelly Horan\n\nBut does the increase section help the coverage? Or do you still have to build out in those areas?\n\nHans E. Vestberg\n\nI would say, as we said from the beginning, which many people doubted we can use our existing 4G grid for the C-band. There is -- we don't need any new. However, we always build some new sites. We find new areas where there have been capacity constrained. \r\nWe'll continue to do that as well. But mainly our C-band is using the 4G grid in order to see that the coverage is coming out there. And this year, we're going to build a little bit more sites than we've normally done and the -- and our 4G spectrum AWS and et cetera, is covering 300 million POPs a day. And that's where we be large C-band right now.\n\nBrady Connor\n\nYes. Great, Tim.\n\nOperator\n\nThe next question comes from Kannan Venkateshwar of Barclays.\n\nKannan Venkateshwar\n\nThank you. Hans, strategically, you face a few choices, which I think are contradictory in some way, and there is an attempt to grow gross adds, obviously, but SG&A is growing faster than revenues, and so that puts pressure on margins. And it also comes with cash flow trade-offs. And we are trying to increase price to offset this margin impact, but that comes with churn trade-offs. \r\nSo ultimately, when you think about your growth model or the growth algorithms what's the north star? Is it unit growth? And are you willing to sacrifice margins and cash flow to get to that turnaround point? Or is it margins? Even if it comes at the expense of unit growth because it does feel like there is a choice that has to be made at some point. And I'm just wondering what the metric is that you're most focused on?\n\nHans E. Vestberg\n\nI think it's crystal clear. Our metrics that we're measured on is the service revenue and the EBITDA and cash flow expansion. You still need to have customers for that, and you need to grow that. But ultimately, that's what we measure ourselves on to see that we can grow that. And that's what you have seen from us right now. And you see the cash flow in the quarter. We are very focused on that. We think that's very important for all the stakeholders. And so then, of course, units are important, but it's even more important to see that we have the right growth metrics when it comes to the company's finance. But maybe Tony wants to add something here.\n\nAnthony Skiadas\n\nTo just add on to what Hans mentioned. I mean we have to be disciplined and segmented in how we approach the market. Our focus is on volumes that drive profitable revenue growth. So the team is laser focused on that.\n\nBrady Connor\n\nGood. Thanks, Kannan.\n\nOperator\n\nThe next question is from Peter Supino of Wolfe Research.\n\nPeter Lawler Supino\n\nQuestion back to fixed wireless. Obviously, the expansion to suburban and rural markets is a big opportunity back in the urban areas where your C-band depth is going to more than double in 2023. Is there any reason that expansion shouldn't support accelerated marketing and approval of inbounds about FWA so that you would drive up your net adds in those markets as well?\n\nHans E. Vestberg\n\nThat's clear. I mean, and that's why our organization, both on the consumer side and the business side and our network side, it's more regional right now because we're following the sort of the deployment of the network and doing marketing and outreach to our customers on fixed wireless access that really want to have it when we open up. So clearly, you're right, there is also opportunity in the urban places where we get more capacity or more coverage and as it goes for the suburban and the rural.\n\nBrady Connor\n\nGreat. Thanks, Peter. Brad, we have time for one more question.\n\nOperator\n\nYour last question will come from Frank Louthan of Raymond James.\n\nFrank Garrett Louthan\n\nCan you -- with the business changes, can you walk us through on the SaaS line? What is sort of SaaS revenue in total and where can you see growth there? And then back to the phone adds with the new level of gross adds you're getting, are there any characteristics about this type of customer you're tracking now that might be different than, say, 2 years ago and what their long-term churn characteristics might be?\n\nHans E. Vestberg\n\nSo you need to repeat the first question. You're talking about SaaS revenues.\n\nFrank Garrett Louthan\n\nWell, with the breakout -- new breakout on the business line item. Just curious how much of that line that includes SaaS. Is SaaS revenue and what is that growing?\n\nHans E. Vestberg\n\nYes. We don't disclose the SaaS revenue specifically, so.\n\nMatthew D. Ellis\n\nYes. But overall, I mean, it's not the largest part of that customer group, you should be a fair assumption from.\n\nBrady Connor\n\nOkay. And then what was the second part of the question, Frank?\n\nFrank Garrett Louthan\n\nSo with the gross adds that you're getting, are there any characteristics about these customers you're tracking today that are maybe different from what they were, say, 2 years ago. And I'm curious about what you think about the long-term churn characteristics of customers you're tracking today, particularly given the heavier promotional activity that you've done versus what you did historically?\n\nHans E. Vestberg\n\nIn general, I think the churn characteristics, all the new customers coming in is even better than before for many reasons, as you said yourself. And then the type of customers, I think Matt talked a little bit on the type of gross adds we're getting is new customers to Verizon, where they come in. And of course, we have opportunities to upgrade and step up them and also having opportunities for our converged offerings. So really good quality of the customers coming in, as Matt said as well. So we feel really good about the growth momentum we have and the customers we are getting.\n\nBrady Connor\n\nYes. Thanks, Frank. Brad, that's all the time we have today.\n\nOperator\n\nLadies and gentlemen, this does conclude the conference call for today. Thank you for your participation and for using Verizon Conference Services. You may now disconnect.", "link": "https://finance.yahoo.com/news/q1-2023-verizon-communications-inc-034252056.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.029, "neu": 0.813, "pos": 0.158}}, {"date": "2023-04-25T18:25:12+00:00", "title": "3 Undervalued High-Yield Stocks to Buy", "content": "Stocks with attractive, sustainable dividend yields are highly desirable to income investors. Moreover, if their stock prices are significantly undervalued, they become even more compelling investments. The combination of reliable, lucrative current income with long-term wealth compounding is a passive income investor’s dream.\n\nHigh-yield and attractive long-term total returns are definitely not mutually exclusive. Thanks in part to rising interest rates, we are at a rare moment in modern market history where income investors can buy high-yielding stocks that also have very defensive business models and reliable dividend growth potential. When you combine the high yields with dividend growth and the potential for valuation multiples to increase over time back toward more historical norms, these stocks could deliver outstanding risk-adjusted total returns for shareholders.\n\nThis article discusses three undervalued dividend stocks that offer strong yields and are undervalued. Therefore, they present opportunities for high total returns over time.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nWalgreens Boots Alliance (WBA) Walgreens (WBA) store exterior and sign in Pompano Beach, Florida\n\nSource: saaton / Shutterstock.com\n\nWalgreens Boots Alliance (NASDAQ:WBA) is the largest retail pharmacy in the US and Europe. It operates in over nine countries with 13,000+ stores. It also employs over 315,000 people across the U.S., Europe and Latin America.\n\nWalgreens’ competitive advantage stems from its large-scale and extensive network in a significant, growing industry. The company maintains a reasonable payout ratio, providing income stability for investors. Despite a decline in earnings in 2020, Walgreens has historically demonstrated resilience. For example, it suffered only a 6.9% drop in earnings in 2009 .\n\nWalgreens has experienced an average annual earnings per share (EPS) growth rate of 7.6% over the past decade, driven by top-line growth, steady net profit margins, and a reduced number of outstanding shares. However, in 2020, EPS declined by 21% due to the Covid-19 pandemic.\n\nStory continues\n\nDespite short-term challenges, long-term growth prospects are promising. This is due to factors like an aging population, focus on becoming a health destination, and the company’s role in Covid-19 vaccinations and testing. While the tailwind from Covid-19 vaccinations is subsiding, Walgreens will likely continue to grow in the future.\n\nBetween its 4% anticipated EPS compound annual growth rate (CAGR), 5.4% expected annualized tailwind from multiple expansion over the next half decade, and 5.5% current dividend yield, WBA is positioned to deliver double-digit annualized total returns over the next half decade. As a result, it appears to be a compelling buy while also offering investors attractive, sustainable and growing current income.\n\nKinder Morgan (KMI) Kinder Morgan logo on a sign outside the company headquarters in Houston.\n\nSource: JHVEPhoto / Shutterstock.com\n\nKinder Morgan (NYSE:KMI) is one of the largest energy companies in the U.S. It focuses on midstream storage and transportation of oil, gas and other energy commodities. The company operates around 83,000 miles of pipelines and 144 terminals. These pipelines transport natural gas, refined petroleum products, crude oil and carbon dioxide. Kinder Morgan generates about 90% of its cash flow from fee-based services, and the vast majority of its counterparties are investment grade. As a result, it operates in many ways like a toll road and generally avoids commodity price risk.\n\nKinder Morgan operates in the cyclical energy sector but maintains fairly stable cash flows due to its business model. Although the company previously had a low interest coverage ratio and high debt, leading to a dividend cut in 2016, the new dividend payout level is secure. The company used avings from the dividend reduction to pay down debt and improve the balance sheet, resulting in credit rating upgrades from Standard & Poor’s and Moody’s. As one of the largest energy companies in the U.S., Kinder Morgan benefits from significant network and economies of scale advantages. It is the largest natural gas transporter, moving about 40% of the gas used in the U.S., as well as the largest independent transporter of petroleum products, carbon dioxide and terminals operator.\n\nKinder Morgan’s future growth catalysts include new pipeline and terminal projects, driven by the increasing demand for natural gas as it replaces coal. However, political headwinds may slow down growth for the company. In 2023, Kinder Morgan plans to invest in growth projects and joint ventures, funding them through internally generated cash flow without accessing capital markets. The company’s distributable cash flow per share is expected to be around $2.13 in 2023. It will likely increase steadily over the next half decade due to growth projects and share repurchases.\n\nWhile KMI’s anticipated 2.6% distributable cash flow per share CAGR over the next half decade is relatively unimpressive, the 6.2% dividend yield and expectations of a flat valuation multiple push the total return profile to the high-single-digits. As a result, KMI looks like a worthwhile investment for dependable and lucrative income and solid total returns.\n\nVerizon (VZ) Verizon (VZ) logo above the entrance to a Verizon store.\n\nSource: photobyphm / Shutterstock.com\n\nVerizon (NYSE:VZ) is a leading wireless carrier in the U.S. It generates 75% of its revenue from wireless services and 25% from broadband and cable services. Verizon’s network reaches approximately 300 million people, covering 98% of the U.S. population.\n\nVerizon offers a high and stable dividend yield, benefiting from increased cash flow due to a lower tax rate and reduced net debt levels. The company is known as the best wireless carrier in the U.S. It boasts strong customer retention and potential for upselling higher-priced plans. Additionally, Verizon is rolling out 5G service, giving it a competitive edge and making its stock resilient during market downturns.\n\nVerizon’s EPS has grown at 2.6% annually over the past decade. With a slightly reduced forward expected growth rate of 2.5%, the company’s 2023 guidance suggests a potential EPS of $5.32 per share by 2028.\n\nLike Kinder Morgan, Verizon likely won’t be a big growth stock in the coming years. It has an estimated CAGR of just 2.5% over the next half decade. That said, its 6.7% current dividend yield — which appears to be quite safe and very sustainable for the foreseeable future — along with the 5.7% expected annualized tailwind from valuation multiple expansion mean that the company is well-positioned to deliver double-digit annualized total returns over the next five years. As a result, it looks like it could be a great investment for generating substantial returns alongside a lucrative income stream.\n\nOn the date of publication, Bob Ciura did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live The Best $1 Investment You Can Make Today Wall Street Titan: Here’s My #1 Stock for 2023 It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 3 Undervalued High-Yield Stocks to Buy appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-undervalued-high-yield-stocks-182512949.html", "symbols": ["2KD.F", "KMI.US", "VZ.US", "W8A.F", "WBA.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.029, "neu": 0.792, "pos": 0.179}}, {"date": "2023-04-25T18:06:00+00:00", "title": "Yahoo Makes a Move It Hopes Will Improve Its Sports Betting Aspirations", "content": "Yahoo has made an acquisition it hopes will bolster its sports gambling portfolio. Yahoo is acquiring 100% of peer-to-peer sports betting app Wagr, adding to its sports betting and gaming space that has built the second largest fantasy sports user base behind ESPN. Adding peer-to-peer betting was the \"logical extension\" for Yahoo, CEO Jim Lanzone told Front Office Sports.\n\nContinue reading", "link": "https://finance.yahoo.com/m/add0bdcf-724b-3305-93e5-36c4ab97b087/yahoo-makes-a-move-it-hopes.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0, "neu": 0.955, "pos": 0.045}}, {"date": "2023-04-25T15:12:01+00:00", "title": "Verizon Misses Q1 Revenue Expectations, FY23 EPS Outlook Lags", "content": "Verizon Communications Inc (NYSE: VZ) reported a first-quarter FY23 sales decline of 1.9% year-on-year to $32.9 billion, missing the consensus of $33.6 billion. Adjusted EPS of $1.20 was in line with the consensus. Total wireless service revenue was $18.9 billion, up 3% Y/Y, reflecting the company's ownership of TracFone, premium Unlimited strategy, and pricing actions. Postpaid phone net losses were 127,000, and retail postpaid net additions were 633,000. The quarter marked 437,000 total broadband net additions reflecting strong demand for fixed wireless and Fios products. Total Verizon Business revenues were $7.5 billion, down by 2.8% Y/Y. Total Verizon Consumer revenue declined by 1.7% Y/Y to $24.9 billion. Consumer wireless retail postpaid churn was 1.05%, and wireless retail postpaid phone churn was 0.84%. Verizon Consumer clocked wireless retail postpaid phone net losses of 263,000. Verizon Consumer had fixed wireless net additions of 256,000. The consumer segment EBITDA margin was flattish at 41.5%, while the business segment EBITDA margin declined by 50 bps to 22%. Adjusted EBITDA of $11.9 billion was down 1.1% Y/Y. \"Last month, we announced that our 5G Ultra Wideband now reaches more than 200 million people as we continue to undergo the most aggressive network deployment in our company's history,\" said Verizon Chairman and CEO Hans Vestberg. FY23 Outlook: Verizon reiterates wireless service revenue growth of 2.5% - 4.5%. Verizon reiterates adjusted EPS of $4.55 - $4.85, below the consensus of $4.70. Price action: VZ shares traded lower by1.40% at $36.58 in premarket on the last check Tuesday.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Verizon Misses Q1 Revenue Expectations, FY23 EPS Outlook Lags originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/verizon-misses-q1-revenue-expectations-151201793.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.808, "neg": 0.054, "neu": 0.868, "pos": 0.077}}, {"date": "2023-04-25T15:05:00+00:00", "title": "McDonald’s, PepsiCo, GM Flex Their Pricing Power", "content": "Shoppers pay up for food and diapers, more than offsetting volume declines, but big-ticket purchases wane.\n\nContinue reading", "link": "https://finance.yahoo.com/m/ad904c5c-c3d9-38cd-95e8-a9c68ed2200e/mcdonald%E2%80%99s%2C-pepsico%2C-gm-flex.html", "symbols": ["8GM.F", "BAC.F", "BAC.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "KMB.US", "KMY.F", "MCD.MX", "MCD.US", "MCDC34.SA", "MDO.F", "MDO.XETRA", "NESM.F", "NESM.XETRA", "NESN.SW", "NESNN.MX", "NSRGF.US", "NSRGY.US", "PEP.MX"], "tags": [], "sentiment": {"polarity": -0.052, "neg": 0.066, "neu": 0.934, "pos": 0}}, {"date": "2023-04-25T15:00:00+00:00", "title": "5G Not Enough? Telecom Companies Look to 5.5G", "content": "Mobile companies say an upgrade is coming in a couple of years that will boost connection speeds amid flagging consumer interest\n\nContinue reading", "link": "https://finance.yahoo.com/m/a6752499-e1b4-3081-a3d7-2d76263fbc97/5g-not-enough%3F-telecom.html", "symbols": ["BAC.F", "BAC.XETRA", "TM5.F", "TMUS.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.691, "neg": 0, "neu": 0.778, "pos": 0.222}}, {"date": "2023-04-25T13:37:00+00:00", "title": "Verizon Earnings Beat Estimates. Why the Stock Is Slipping.", "content": "The company loses a net 263,000 postpaid retail customers for its phone service in the first quarter.\n\nContinue reading", "link": "https://finance.yahoo.com/m/3a73f380-8a83-3686-b426-0a2f3c6b371c/verizon-earnings-beat.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": -0.318, "neg": 0.119, "neu": 0.881, "pos": 0}}, {"date": "2023-04-25T13:30:01+00:00", "title": "Verizon (VZ) Q1 Earnings: Taking a Look at Key Metrics Versus Estimates", "content": "Verizon Communications (VZ) reported $32.91 billion in revenue for the quarter ended March 2023, representing a year-over-year decline of 1.9%. EPS of $1.20 for the same period compares to $1.35 a year ago.\n\nThe reported revenue compares to the Zacks Consensus Estimate of $33.71 billion, representing a surprise of -2.36%. The company delivered an EPS surprise of +0.84%, with the consensus EPS estimate being $1.19.\n\nWhile investors closely watch year-over-year changes in headline numbers -- revenue and earnings -- and how they compare to Wall Street expectations to determine their next course of action, some key metrics always provide a better insight into a company's underlying performance.\n\nSince these metrics play a crucial role in driving the top- and bottom-line numbers, comparing them with the year-ago numbers and what analysts estimated about them helps investors better project a stock's price performance.\n\nHere is how Verizon performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\n\nConsumer - Wireless - Net subscribers additions - Retail postpaid phones: -263 thousand compared to the -260.81 thousand average estimate based on five analysts. Consumer - Wireless total retail connections: 114523 thousand compared to the 114798.9 thousand average estimate based on four analysts. Consumer - Fios video connections: 3160 thousand compared to the 3185.43 thousand average estimate based on four analysts. Consumer - Fios Internet connections: 6803 thousand versus 6816.85 thousand estimated by four analysts on average. Consumer - Wireless retail postpaid Connection: 92192 thousand versus the four-analyst average estimate of 91857.81 thousand. Consumer - Wireless retail prepaid connections: 22331 thousand compared to the 22941.07 thousand average estimate based on four analysts. Business - Churn rate - Wireless - Retail postpaid: 1.5% versus 1.36% estimated by four analysts on average. Consumer - Wireless Retail postpaid ARPA: $130.06 versus the four-analyst average estimate of $128.65. Operating revenues- Consumer: $24.86 billion versus $25.25 billion estimated by six analysts on average. Compared to the year-ago quarter, this number represents a -1.7% change. Operating revenues- Consumer - Other: $1.52 billion versus the six-analyst average estimate of $1.64 billion. Operating revenues- Consumer - Wireless equipment: $4.88 billion versus the six-analyst average estimate of $5.12 billion. The reported number represents a year-over-year change of -9.2%. Operating revenues- Consumer - Service: $18.46 billion compared to the $18.51 billion average estimate based on six analysts. The reported number represents a change of +1.8% year over year.\n\nStory continues\n\nView all Key Company Metrics for Verizon here>>>\r\n\r\nShares of Verizon have returned -2.5% over the past month versus the Zacks S&P 500 composite's +4.3% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nVerizon Communications Inc. (VZ) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/verizon-vz-q1-earnings-taking-133001034.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.976, "neg": 0, "neu": 0.938, "pos": 0.062}}, {"date": "2023-04-25T13:11:01+00:00", "title": "Verizon (VZ) Beats on Q1 Earnings Despite Lower Revenues", "content": "Verizon Communications Inc. VZ reported mixed first-quarter 2023 results with the bottom line beating the Zacks Consensus Estimate but the top line missing the same. The telecom giant is witnessing significant 5G adoption and fixed wireless broadband momentum. Strong demand for Fios and fixed wireless products also led to the best total broadband quarterly performance in over a decade with total broadband net additions of 437,000.\r\n\r\nHowever, the Consumer wireless business struggled with 263,000 retail postpaid phone net losses in the quarter. This dragged the shares down in pre-market trading as investors probably expected healthy subscriber growth.\n\nNet Income\n\nOn a GAAP basis, net income in the quarter was $5,018 million or $1.17 per share compared with $4,711 million or $1.09 per share in the prior-year quarter. The year-over-year increase despite top-line contraction was primarily attributable to high expenses in the year-ago quarter.\n\nExcluding non-recurring items, quarterly adjusted earnings per share were $1.20 compared with $1.35 in the prior-year quarter. The bottom line beat the Zacks Consensus Estimate by a penny.\n\nVerizon Communications Inc. Price, Consensus and EPS Surprise Verizon Communications Inc. Price, Consensus and EPS Surprise\n\nVerizon Communications Inc. price-consensus-eps-surprise-chart | Verizon Communications Inc. Quote\n\nRevenues\n\nQuarterly total operating revenues decreased to $32,912 million from $33,554 million in the prior year owing to lower wireless equipment revenues driven by a challenging macroeconomic environment. The lower year-over-year revenue was also attributable to the shutdown of the company's 3G network, resulting in the removal of approximately 1.1 million retail connections. The top line missed the consensus estimate of $33,709 million.\n\nQuarterly Segment Results\n\nConsumer: Total revenues from this segment declined 1.7% year over year to $24,857 million, as higher service revenues were more than offset by lower equipment revenues in the quarter.\r\n\r\nService revenues were up 1.8% to $18,456 million, while wireless equipment revenues slumped 9.2% to $4,878 million. Other revenues totaled $1,523 million, down 15% year over year.\r\n\r\nThe segment recorded 263,000 wireless retail postpaid phone net losses and 351,000 wireless retail prepaid net losses in the quarter. Wireless retail postpaid churn was 1.05%, while retail postpaid phone churn was 0.84%. The company recorded 63,000 Fios Internet net additions as high demand for reliable fiber optic broadband was spurred by increasing work-from-home trend. Fixed wireless broadband net additions were 256,000 for the quarter. However, Verizon registered 74,000 Fios Video net losses in the quarter, reflecting the ongoing shift from traditional linear video to over-the-top offerings.\r\n\r\nThe segment’s operating income declined 3% to $7,099 million with a margin of 28.6%, down from 28.9% in the year-ago quarter. EBITDA decreased 1.6% to $10,313 million with a margin of 41.5% compared with 41.4% in the prior-year quarter due to higher marketing expenses.\r\n\r\nBusiness: The segment revenues were down 2.8% to $7,494 million due to lower wireline and wireless equipment revenues, partially offset by growth in wireless service revenue. The segment had 312,000 wireless retail postpaid net additions in the quarter, including 136,000 postpaid phone net additions. Wireless retail postpaid churn was 1.50%, while retail postpaid phone churn was 1.16%. Fixed wireless broadband net additions were 137,000 for the quarter. Operating income declined to $551 million from $673 million in the year-ago quarter with respective margins of 7.4% and 8.7%. EBITDA was down 5.1% to $1,645 million owing to higher subsidies for a margin of 22% compared with 22.5% in the year-earlier quarter.\n\nStory continues\n\nOther Quarterly Details\n\nTotal operating expenses decreased 1.7% year over year to $25,328 million, while operating income was down 2.7% to $7,584 million. Consolidated adjusted EBITDA declined to $11,902 million from $12,032 million for respective margins of 36.2% and 35.9%.\n\nCash Flow & Liquidity\n\nVerizon generated $8,289 million of net cash from operating activities in the quarter compared with $6,821 million in the year-ago period. The improvement was primarily due to working capital improvements driven by lower inventory levels, fewer phone upgrades and a modest improvement in customer payment patterns. Free cash flow was $2,331 million compared with $1,000 million in the prior-year period.\r\n\r\nAs of Mar 31, 2023, the company had $2,234 million in cash and cash equivalents with $140,772 million of long-term debt. Capital expenditure totaled $5,958 million, up from $5,821 million in prior-year period, driven by expenses related to C-Band deployment. The continued build out of OneFiber and C-Band spectrum expansion will expand the reach and capacity of its 5G Ultra Wideband network across the country.\n\nGuidance Reiterated\n\nVerizon has reiterated its guidance for 2023 and expects wireless service revenue growth in the range of 2.5%-4.5%. Adjusted EBITDA is likely to be $47-$48.5 billion. The company expects adjusted earnings in the range of $4.55 to $4.85 per share. Capital expenditure is estimated between $18.25 billion and $19.25 billion.\n\nZacks Rank & Stock to Consider\n\nVerizon currently has a Zacks Rank #3 (Hold).\r\n\r\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nHere are some better-ranked stocks from the broader industry.\r\n\r\nArista Networks, Inc. ANET, carrying a Zacks Rank #2 (Buy), is likely to benefit from the strong momentum and diversification across its top verticals and product lines. The company has a software-driven, data-centric approach to help customers build their cloud architecture and enhance their cloud experience. Arista has a long-term earnings growth expectation of 14.2% and delivered an earnings surprise of 14.2%, on average, in the trailing four quarters.\r\n\r\nIt holds a leadership position in 100-gigabit Ethernet switching share in port for the high-speed datacenter segment. Arista is increasingly gaining market traction in 200- and 400-gig high-performance switching products and remains well-positioned for healthy growth in data-driven cloud networking business with proactive platforms and predictive operations.\r\n\r\nJuniper Networks, Inc. JNPR carries a Zacks Rank #2. It has a long-term earnings growth expectation of 7% and delivered an earnings surprise of 1.6%, on average, in the trailing four quarters.\r\n\r\nJuniper is leveraging the 400-gig cycle to capture hyperscale switching opportunities inside the data center. The company is set to capitalize on the increasing demand for data center virtualization, cloud computing and mobile traffic packet/optical convergence.\r\n\r\nSplunk Inc. SPLK, sporting a Zacks Rank #1, is another key pick. San Francisco, CA-based Splunk provides software solutions that enable enterprises to gain real-time operational intelligence by harnessing the value of their data. The company’s offerings enable users to investigate, monitor, analyze and act on machine data and big data, irrespective of format or source, and helps in operational decision making. \r\n\r\nSplunk’s software offerings enable users to have deep insight of their data on a real-time basis, thereby making the operational decision-making process faster. It delivered a trailing four-quarter earnings surprise of 131.1%, on average. Splunk has a long-term earnings growth expectation of 24.1%.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nVerizon Communications Inc. (VZ) : Free Stock Analysis Report\n\nJuniper Networks, Inc. (JNPR) : Free Stock Analysis Report\n\nSplunk Inc. (SPLK) : Free Stock Analysis Report\n\nArista Networks, Inc. (ANET) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/verizon-vz-beats-q1-earnings-131101569.html", "symbols": ["117.F", "ANET.US", "BAC.F", "BAC.XETRA", "JNP.F", "JNPR.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.037, "neu": 0.828, "pos": 0.135}}, {"date": "2023-04-25T13:08:00+00:00", "title": "Of 3 Holdings Reporting, One Is Swell, Another Is OK and a Third Disappoints", "content": "We're glad we've been trimming the stock that is under pressure this morning after posting its results and we may trim even more going forward.\n\nContinue reading", "link": "https://finance.yahoo.com/m/2422ad92-845d-3383-b2ea-25fa90abddbd/of-3-holdings-reporting%2C-one.html", "symbols": ["BAC.F", "BAC.XETRA", "PEP.MX", "PEP.US", "PEP.XETRA", "PEPB34.SA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0.073, "neu": 0.828, "pos": 0.099}}, {"date": "2023-04-25T12:56:41+00:00", "title": "Verizon Revenue Misses As Consumer Wireless Business Struggles", "content": "Verizon reported earnings that edged by views while revenue fell short of estimates as its wireless consumer business continued to struggle.\n\nContinue reading", "link": "https://finance.yahoo.com/m/339a6377-34d5-3cd3-8017-fd5262f12191/verizon-revenue-misses-as.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": -0.318, "neg": 0.095, "neu": 0.905, "pos": 0}}, {"date": "2023-04-25T12:05:12+00:00", "title": "Verizon Communications (VZ) Tops Q1 Earnings Estimates", "content": "Verizon Communications (VZ) came out with quarterly earnings of $1.20 per share, beating the Zacks Consensus Estimate of $1.19 per share. This compares to earnings of $1.35 per share a year ago. These figures are adjusted for non-recurring items.\n\nThis quarterly report represents an earnings surprise of 0.84%. A quarter ago, it was expected that this largest U.S. cellphone carrier would post earnings of $1.20 per share when it actually produced earnings of $1.19, delivering a surprise of -0.83%.\n\nOver the last four quarters, the company has surpassed consensus EPS estimates two times.\n\nVerizon , which belongs to the Zacks Wireless National industry, posted revenues of $32.91 billion for the quarter ended March 2023, missing the Zacks Consensus Estimate by 2.36%. This compares to year-ago revenues of $33.55 billion. The company has topped consensus revenue estimates three times over the last four quarters.\n\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\n\nVerizon shares have lost about 5.8% since the beginning of the year versus the S&P 500's gain of 7.8%.\n\nWhat's Next for Verizon?\n\nWhile Verizon has underperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\n\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\n\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\n\nStory continues\n\nAhead of this earnings release, the estimate revisions trend for Verizon: mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $1.20 on $34.08 billion in revenues for the coming quarter and $4.70 on $137.22 billion in revenues for the current fiscal year.\n\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Wireless National is currently in the bottom 35% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nAnother stock from the same industry, Atlantic Tele-Network (ATNI), has yet to report results for the quarter ended March 2023. The results are expected to be released on April 26.\n\nThis provider of telecommunications services is expected to post quarterly loss of $0.12 per share in its upcoming report, which represents a year-over-year change of +7.7%. The consensus EPS estimate for the quarter has remained unchanged over the last 30 days.\n\nAtlantic Tele-Network's revenues are expected to be $191.93 million, up 11.6% from the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nVerizon Communications Inc. (VZ) : Free Stock Analysis Report\n\nATN International, Inc. (ATNI) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/verizon-communications-vz-tops-q1-120512090.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.015, "neu": 0.894, "pos": 0.092}}, {"date": "2023-04-25T11:31:41+00:00", "title": "Verizon Q1 Revenue Misses As Consumer Wireless Business Struggles", "content": "Verizon reported Q1 adjusted earnings that edged by views while revenue fell short of estimates as its wireless consumer business continued to struggle.\n\nContinue reading", "link": "https://finance.yahoo.com/m/339a6377-34d5-3cd3-8017-fd5262f12191/verizon-q1-revenue-misses-as.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": -0.318, "neg": 0.087, "neu": 0.913, "pos": 0}}, {"date": "2023-04-25T11:19:00+00:00", "title": "Verizon Revenue Misses Estimates and Subscribers Decline. The Stock Slips.", "content": "There is a fight for consumers among the big three telecom firms after they saw record growth during social distancing.\n\nContinue reading", "link": "https://finance.yahoo.com/m/3a73f380-8a83-3686-b426-0a2f3c6b371c/verizon-revenue-misses.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0.107, "neu": 0.785, "pos": 0.107}}, {"date": "2023-04-25T10:54:03+00:00", "title": "Verizon's tepid results underscore wireless slowdown, tough competition", "content": "(Reuters) -Verizon Communications Inc missed first-quarter revenue and free cash flow estimates on Tuesday, hit by wireless subscriber losses as inflation-hit Americans delayed device upgrades and a pandemic-led growth boom fizzled out.\n\nShares of the New York-based telecom company were down 0.8% in premarket trading.\n\nVerizon has seen broadband demand surge following its scale-up of the technology behind 5G connectivity, but its fast-growing rivals AT&T Inc and T-Mobile have stayed a step ahead with their focus on promotional activity and 5G network development.\n\nHigh inflation has also prompted customers to put off their device upgrades and seek cheaper plans, offsetting the growth that Verizon recorded with its enterprise customers.\n\nThe carrier lost 127,000 net monthly bill-paying wireless phone subscribers in the quarter, after dropping 263,000 users in its consumer business. Factset had estimated a loss of 121,000 subscribers.\n\nFree cash flow, a metric closely watched by investors to help determine dividend payouts, more than doubled to $2.3 billion in the quarter, but came in below the $2.7 billion estimated by 17 analysts polled by Visible Alpha.\n\nLast week, AT&T also missed market estimates for first-quarter revenue and free cash flow, underpinning the pinch that telecom firms have felt this year from a slowdown in consumer spending.\n\nVerizon's total revenue fell 1.9% to $32.9 billion in the quarter ended March 31, below analysts' estimates of $33.57 billion, according to Refinitiv data.\n\nExcluding items, Verizon earned $1.20 per share, on-par with Wall Street expectations.\n\n(Reporting by Eva Mathews in Bengaluru; Editing by Devika Syamnath)", "link": "https://finance.yahoo.com/news/verizon-misses-first-quarter-estimates-105403795.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.907, "neg": 0.055, "neu": 0.856, "pos": 0.089}}, {"date": "2023-04-25T10:50:00+00:00", "title": "Verizon begins 2023 with rapid network expansion and the most broadband additions in over a decade", "content": "Company's total wireless postpaid phone gross additions increased 5.3 percent year over year\n\nCash flow from operations increased $1.5 billion year over year, \r\nand free cash flow1 increased $1.3 billion year over year\n\n1Q 2023 highlights\n\nConsolidated:\n\n$1.17 in EPS, compared with $1.09 in first-quarter 2022; adjusted EPS1, excluding a special item, of $1.20, compared with $1.35 in first-quarter 2022.Total operating revenue of $32.9 billion, a decrease of 1.9 percent from first-quarter 2022.Net income of $5.0 billion, an increase of 6.5 percent from first-quarter 2022, and adjusted EBITDA1 of $11.9 billion, down 1.1 percent year over year.\n\nTotal Broadband:\n\nTotal broadband net additions of 437,000 was the largest result in more than a decade, reflecting a strong demand for fixed wireless and Fios products. This result included 393,000 fixed wireless net additions, an increase from 379,000 fixed wireless net additions in fourth-quarter 2022.67,000 Fios Internet net additions, an increase from 60,000 Fios Internet net additions in first-quarter 2022.\n\nTotal Wireless:\n\nTotal wireless service revenue3 of $18.9 billion, a 3.0 percent increase year over year.Postpaid phone net losses of 127,000, and retail postpaid net additions of 633,000. Total wireless postpaid phone gross additions increased 5.3 percent year over year, primarily driven by an 11.5 percent year over year growth in Consumer phone gross additions.Total retail postpaid churn of 1.15 percent, and retail postpaid phone churn of 0.90 percent.\n\nNEW YORK, April  25, 2023  (GLOBE NEWSWIRE) -- Verizon Communications Inc. (NYSE, Nasdaq: VZ) reported first-quarter results today highlighted by increased cash flow and the largest number of total broadband net additions in more than a decade.\n\n\"Our operational and financial results reflect the steps that we have taken to improve our performance. Compared to this time last year, we have added more postpaid phone gross additions to our network and have increased our cash flow from operations and free cash flow1,\" said Verizon Chairman and CEO Hans Vestberg. “Last month, we announced that our 5G Ultra Wideband now reaches more than 200 million people as we continue to undergo the most aggressive network deployment in our company's history. With our mobile and broadband capabilities, and our focus on network strength, we are giving more customers in more places a superior network experience.\"\n\nFor first-quarter 2023, Verizon reported EPS of $1.17, compared with $1.09 in first-quarter 2022. On an adjusted basis1, excluding a special item, EPS was $1.20 in first-quarter 2023, compared with adjusted EPS1 of $1.35 in first-quarter 2022.\n\nFirst-quarter 2023 earnings included a pre-tax loss of approximately $208 million from a special item representing the impacts of amortization of intangible assets related to TracFone and other acquisitions.\n\nConsolidated results\n\nTotal consolidated operating revenue in first-quarter 2023 of $32.9 billion, a decrease of 1.9 percent from first-quarter 2022. This decrease was primarily due to lower equipment revenue and continued declines in Business wireline services.Total wireless service revenue3 in first-quarter 2023 increased 3.0 percent year over year. As discussed during the company's fourth-quarter 2022 earnings call, results for first-quarter 2023 included a benefit of approximately 185 basis points associated with a larger allocation of administrative and telco recovery fees from other revenue into wireless service revenue. This benefit was partially offset by the impact associated with the shutdown of the company's 3G network, completed at the end of fourth-quarter 2022. The shutdown resulted in the removal of approximately 1.1 million retail connections and the corresponding loss of revenue for first-quarter 2023.Net income of $5.0 billion, an increase of 6.5 percent compared to first-quarter 2022, and adjusted EBITDA1 of $11.9 billion, a decrease of 1.1 percent year over year.Cash flow from operations totaled $8.3 billion in first-quarter 2023, an increase from $6.8 billion in first-quarter 2022. This increase was primarily due to working capital improvements driven by lower inventory levels, fewer phone upgrades and a modest improvement in customer payment patterns, despite current macroeconomic uncertainties.First-quarter 2023 capital expenditures were $6.0 billion, and included most of the remaining $1.75 billion under the company's C-Band related spending program.The company ended first-quarter 2023 with free cash flow1 of $2.3 billion, an increase from $1.0 billion in first-quarter 2022.Verizon's unsecured debt as of the end of first-quarter 2023 increased by $1.4 billion sequentially to $132.0 billion. The company's net unsecured debt1 balance increased sequentially by $1.8 billion to $129.8 billion. At the end of first-quarter 2023, Verizon's ratio of unsecured debt to net income (LTM) was approximately 6.0 times, and its net unsecured debt to adjusted EBITDA ratio1 was approximately 2.7 times.\n\nVerizon Consumer results\n\nTotal Verizon Consumer revenue was $24.9 billion, a decrease of 1.7 percent year over year. This decrease was due to declines in wireless equipment revenue partially offset by gains in service and other revenue.Wireless service revenue increased 2.5 percent year over year. This increase was driven by a larger allocation of administrative and telco recovery fees from other revenue into wireless service revenue, to partly recover network operating costs, and pricing actions implemented in the second half of 2022. These gains were partially offset by the amortization of wireless equipment sales promotions as well as volume driven declines in prepaid revenue.Consumer wireless retail postpaid churn was 1.05 percent in first-quarter 2023, and wireless retail postpaid phone churn was 0.84 percent.In first-quarter 2023, Consumer reported 263,000 wireless retail postpaid phone net losses. Consumer postpaid phone gross additions increased 11.5 percent year over year, continuing the momentum from the second half of 2022.Consumer reported 351,000 wireless retail prepaid net losses in first-quarter 2023. The company is taking steps to generate long term value, including strengthening its brands, evolving its go-to-market strategy and migrating off-network subscribers onto the Verizon network. In the short term, these actions are having a negative impact on prepaid net additions. The reported result was also due to elevated disconnects in the SafeLink brand.Consumer reported 256,000 fixed wireless net additions and 63,000 Fios Internet net additions in first-quarter 2023. Consumer Fios revenue was $2.9 billion in first-quarter 2023, a decrease of 0.8 percent year over year.In first-quarter 2023, Consumer operating income was $7.1 billion, a decrease of 3.0 percent year over year, and segment operating income margin was 28.6 percent, a decrease from 28.9 percent in first-quarter 2022. Segment EBITDA1 in first-quarter 2023 was $10.3 billion, a decrease of 1.6 percent year over year. This decline was due to higher bad debt, as involuntary churn rates and collections return to pre-pandemic levels, and elevated marketing expenses, among other factors. Segment EBITDA margin1 was 41.5 percent, an increase from 41.4 percent in first-quarter 2022.\n\nVerizon Business results\n\nTotal Verizon Business revenue was $7.5 billion in first-quarter 2023, a decrease of 2.8 percent year over year. This decrease was due to lower wireline and wireless equipment revenue that offset the growth in wireless service revenue.Business wireless service revenue was $3.3 billion, an increase of 5.3 percent year over year. This growth was driven predominantly by the continued momentum in adding more customers onto the platform, and pricing actions implemented in the second half of 2022 and early 2023.Business reported 312,000 wireless retail postpaid net additions in first-quarter 2023, including 136,000 postpaid phone net additions.Business wireless retail postpaid churn was 1.50 percent in first-quarter 2023, and wireless retail postpaid phone churn was 1.16 percent.Business reported 137,000 fixed wireless net additions in first-quarter 2023.In first-quarter 2023, Verizon Business operating income was $551 million, a decrease of 18.1 percent year over year, and segment operating income margin was 7.4 percent, a decrease from 8.7 percent in first-quarter 2022. Segment EBITDA1 was $1.6 billion in first-quarter 2023, a decrease of 5.1 percent year over year, which reflected continued declines in high margin wireline revenues. Segment EBITDA margin1 was 22.0 percent in first-quarter 2023, a decrease from 22.5 percent in first-quarter 2022.\n\nOutlook and guidance\n\nFor 2023, Verizon continues to expect the following:\n\nTotal wireless service revenue growth2 3 of 2.5 percent to 4.5 percent.Adjusted EBITDA1 of $47.0 billion to $48.5 billion.Adjusted EPS1 of $4.55 to $4.85.Adjusted effective income tax rate1 in the range of 22.5 percent to 24.0 percent.Capital spending in the range of $18.25 billion to $19.25 billion.\n\n1Non-GAAP financial measure. See the accompanying schedules and www.verizon.com/about/investors for reconciliations of non-GAAP financial measures cited in this document to most directly comparable financial measures under generally accepted accounting principles (GAAP).\n\n2Includes a benefit of approximately 190 basis points from the reallocation from Other revenue to Wireless service revenue. This results from a larger allocation of administrative and telco recovery charges which partly recover network operating costs.\n\n3Total wireless service revenue represents the sum of Consumer and Business segments.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nForward-looking statements\r\nIn this communication we have made forward-looking statements. These statements are based on our estimates and assumptions and are subject to risks and uncertainties. Forward-looking statements include the information concerning our possible or assumed future results of operations. Forward-looking statements also include those preceded or followed by the words “anticipates,” “believes,” “estimates,” “expects,” “forecasts,” “hopes,” “plans” or similar expressions. For those statements, we claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. The following important factors, along with those discussed in our filings with the Securities and Exchange Commission (the “SEC”), could affect future results and could cause those results to differ materially from those expressed in the forward-looking statements: the effects of competition in the markets in which we operate, including any inability to successfully respond to competitive factors such as prices, promotional incentives and evolving consumer preferences; failure to take advantage of, or respond to competitors' use of, developments in technology and address changes in consumer demand; performance issues or delays in the deployment of our 5G network resulting in significant costs or a reduction in the anticipated benefits of the enhancement to our networks; the inability to implement our business strategy; adverse conditions in the U.S. and international economies, including inflation in the markets in which we operate; cyber attacks impacting our networks or systems and any resulting financial or reputational impact; damage to our infrastructure or disruption of our operations from natural disasters, extreme weather conditions, acts of war, terrorist attacks or other hostile acts and any resulting financial or reputational impact; the impact of public health crises on our operations, our employees and the ways in which our customers use our networks and other products and services; disruption of our key suppliers’ or vendors' provisioning of products or services, including as a result of geopolitical factors, public health crises or the potential impacts of global climate change; material adverse changes in labor matters and any resulting financial or operational impact; changes in the regulatory environment in which we operate, including any increase in restrictions on our ability to operate our networks or businesses; our high level of indebtedness; significant litigation and any resulting material expenses incurred in defending against lawsuits or paying awards or settlements; an adverse change in the ratings afforded our debt securities by nationally accredited ratings organizations or adverse conditions in the credit markets affecting the cost, including interest rates, and/or availability of further financing; significant increases in benefit plan costs or lower investment returns on plan assets; changes in tax laws or treaties, or in their interpretation; and changes in accounting assumptions that regulatory agencies, including the SEC, may require or that result from changes in the accounting rules or their application, which could result in an impact on earnings.\n\nMedia contacts:Kim Ancin908-559-3227kimberly.ancin@verizon.com Eric Wilkens201-572-9317eric.wilkens@verizon.com", "link": "https://www.globenewswire.com/news-release/2023/04/25/2653681/0/en/Verizon-begins-2023-with-rapid-network-expansion-and-the-most-broadband-additions-in-over-a-decade.html", "symbols": ["VZ.US"], "tags": ["EARNINGS RELEASES AND OPERATING RESULTS", "NYSE:VZ", "VERIZON EARNINGS", "VERIZON FIRST QUARTER EARNINGS", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.983, "neg": 0.064, "neu": 0.853, "pos": 0.083}}, {"date": "2023-04-25T10:50:00+00:00", "title": "Verizon begins 2023 with rapid network expansion and the most broadband additions in over a decade", "content": "Verizon Sourcing LLC\n\nCompany's total wireless postpaid phone gross additions increased 5.3 percent year over year\n\nCash flow from operations increased $1.5 billion year over year, \r\nand free cash flow1 increased $1.3 billion year over year\n\n1Q 2023 highlights\n\nConsolidated:\n\n$1.17 in EPS, compared with $1.09 in first-quarter 2022; adjusted EPS1, excluding a special item, of $1.20, compared with $1.35 in first-quarter 2022. Total operating revenue of $32.9 billion, a decrease of 1.9 percent from first-quarter 2022. Net income of $5.0 billion, an increase of 6.5 percent from first-quarter 2022, and adjusted EBITDA1 of $11.9 billion, down 1.1 percent year over year.\n\nTotal Broadband:\n\nTotal broadband net additions of 437,000 was the largest result in more than a decade, reflecting a strong demand for fixed wireless and Fios products. This result included 393,000 fixed wireless net additions, an increase from 379,000 fixed wireless net additions in fourth-quarter 2022. 67,000 Fios Internet net additions, an increase from 60,000 Fios Internet net additions in first-quarter 2022.\n\nTotal Wireless:\n\nTotal wireless service revenue3 of $18.9 billion, a 3.0 percent increase year over year. Postpaid phone net losses of 127,000, and retail postpaid net additions of 633,000. Total wireless postpaid phone gross additions increased 5.3 percent year over year, primarily driven by an 11.5 percent year over year growth in Consumer phone gross additions. Total retail postpaid churn of 1.15 percent, and retail postpaid phone churn of 0.90 percent.\n\nNEW YORK, April 25, 2023 (GLOBE NEWSWIRE) -- Verizon Communications Inc. (NYSE, Nasdaq: VZ) reported first-quarter results today highlighted by increased cash flow and the largest number of total broadband net additions in more than a decade.\n\n\"Our operational and financial results reflect the steps that we have taken to improve our performance. Compared to this time last year, we have added more postpaid phone gross additions to our network and have increased our cash flow from operations and free cash flow1,\" said Verizon Chairman and CEO Hans Vestberg. “Last month, we announced that our 5G Ultra Wideband now reaches more than 200 million people as we continue to undergo the most aggressive network deployment in our company's history. With our mobile and broadband capabilities, and our focus on network strength, we are giving more customers in more places a superior network experience.\"\n\nStory continues\n\nFor first-quarter 2023, Verizon reported EPS of $1.17, compared with $1.09 in first-quarter 2022. On an adjusted basis1, excluding a special item, EPS was $1.20 in first-quarter 2023, compared with adjusted EPS1 of $1.35 in first-quarter 2022.\n\nFirst-quarter 2023 earnings included a pre-tax loss of approximately $208 million from a special item representing the impacts of amortization of intangible assets related to TracFone and other acquisitions.\n\nConsolidated results\n\nTotal consolidated operating revenue in first-quarter 2023 of $32.9 billion, a decrease of 1.9 percent from first-quarter 2022. This decrease was primarily due to lower equipment revenue and continued declines in Business wireline services. Total wireless service revenue3 in first-quarter 2023 increased 3.0 percent year over year. As discussed during the company's fourth-quarter 2022 earnings call, results for first-quarter 2023 included a benefit of approximately 185 basis points associated with a larger allocation of administrative and telco recovery fees from other revenue into wireless service revenue. This benefit was partially offset by the impact associated with the shutdown of the company's 3G network, completed at the end of fourth-quarter 2022. The shutdown resulted in the removal of approximately 1.1 million retail connections and the corresponding loss of revenue for first-quarter 2023. Net income of $5.0 billion, an increase of 6.5 percent compared to first-quarter 2022, and adjusted EBITDA1 of $11.9 billion, a decrease of 1.1 percent year over year. Cash flow from operations totaled $8.3 billion in first-quarter 2023, an increase from $6.8 billion in first-quarter 2022. This increase was primarily due to working capital improvements driven by lower inventory levels, fewer phone upgrades and a modest improvement in customer payment patterns, despite current macroeconomic uncertainties. First-quarter 2023 capital expenditures were $6.0 billion, and included most of the remaining $1.75 billion under the company's C-Band related spending program. The company ended first-quarter 2023 with free cash flow1 of $2.3 billion, an increase from $1.0 billion in first-quarter 2022. Verizon's unsecured debt as of the end of first-quarter 2023 increased by $1.4 billion sequentially to $132.0 billion. The company's net unsecured debt1 balance increased sequentially by $1.8 billion to $129.8 billion. At the end of first-quarter 2023, Verizon's ratio of unsecured debt to net income (LTM) was approximately 6.0 times, and its net unsecured debt to adjusted EBITDA ratio1 was approximately 2.7 times.\n\nVerizon Consumer results\n\nTotal Verizon Consumer revenue was $24.9 billion, a decrease of 1.7 percent year over year. This decrease was due to declines in wireless equipment revenue partially offset by gains in service and other revenue. Wireless service revenue increased 2.5 percent year over year. This increase was driven by a larger allocation of administrative and telco recovery fees from other revenue into wireless service revenue, to partly recover network operating costs, and pricing actions implemented in the second half of 2022. These gains were partially offset by the amortization of wireless equipment sales promotions as well as volume driven declines in prepaid revenue. Consumer wireless retail postpaid churn was 1.05 percent in first-quarter 2023, and wireless retail postpaid phone churn was 0.84 percent. In first-quarter 2023, Consumer reported 263,000 wireless retail postpaid phone net losses. Consumer postpaid phone gross additions increased 11.5 percent year over year, continuing the momentum from the second half of 2022. Consumer reported 351,000 wireless retail prepaid net losses in first-quarter 2023. The company is taking steps to generate long term value, including strengthening its brands, evolving its go-to-market strategy and migrating off-network subscribers onto the Verizon network. In the short term, these actions are having a negative impact on prepaid net additions. The reported result was also due to elevated disconnects in the SafeLink brand. Consumer reported 256,000 fixed wireless net additions and 63,000 Fios Internet net additions in first-quarter 2023. Consumer Fios revenue was $2.9 billion in first-quarter 2023, a decrease of 0.8 percent year over year. In first-quarter 2023, Consumer operating income was $7.1 billion, a decrease of 3.0 percent year over year, and segment operating income margin was 28.6 percent, a decrease from 28.9 percent in first-quarter 2022. Segment EBITDA1 in first-quarter 2023 was $10.3 billion, a decrease of 1.6 percent year over year. This decline was due to higher bad debt, as involuntary churn rates and collections return to pre-pandemic levels, and elevated marketing expenses, among other factors. Segment EBITDA margin1 was 41.5 percent, an increase from 41.4 percent in first-quarter 2022.\n\nVerizon Business results\n\nTotal Verizon Business revenue was $7.5 billion in first-quarter 2023, a decrease of 2.8 percent year over year. This decrease was due to lower wireline and wireless equipment revenue that offset the growth in wireless service revenue. Business wireless service revenue was $3.3 billion, an increase of 5.3 percent year over year. This growth was driven predominantly by the continued momentum in adding more customers onto the platform, and pricing actions implemented in the second half of 2022 and early 2023. Business reported 312,000 wireless retail postpaid net additions in first-quarter 2023, including 136,000 postpaid phone net additions. Business wireless retail postpaid churn was 1.50 percent in first-quarter 2023, and wireless retail postpaid phone churn was 1.16 percent. Business reported 137,000 fixed wireless net additions in first-quarter 2023. In first-quarter 2023, Verizon Business operating income was $551 million, a decrease of 18.1 percent year over year, and segment operating income margin was 7.4 percent, a decrease from 8.7 percent in first-quarter 2022. Segment EBITDA1 was $1.6 billion in first-quarter 2023, a decrease of 5.1 percent year over year, which reflected continued declines in high margin wireline revenues. Segment EBITDA margin1 was 22.0 percent in first-quarter 2023, a decrease from 22.5 percent in first-quarter 2022.\n\nOutlook and guidance\n\nFor 2023, Verizon continues to expect the following:\n\nTotal wireless service revenue growth2 3 of 2.5 percent to 4.5 percent. Adjusted EBITDA1 of $47.0 billion to $48.5 billion. Adjusted EPS1 of $4.55 to $4.85. Adjusted effective income tax rate1 in the range of 22.5 percent to 24.0 percent. Capital spending in the range of $18.25 billion to $19.25 billion.\n\n1Non-GAAP financial measure. See the accompanying schedules and www.verizon.com/about/investors for reconciliations of non-GAAP financial measures cited in this document to most directly comparable financial measures under generally accepted accounting principles (GAAP).\n\n2Includes a benefit of approximately 190 basis points from the reallocation from Other revenue to Wireless service revenue. This results from a larger allocation of administrative and telco recovery charges which partly recover network operating costs.\n\n3Total wireless service revenue represents the sum of Consumer and Business segments.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nForward-looking statements\r\nIn this communication we have made forward-looking statements. These statements are based on our estimates and assumptions and are subject to risks and uncertainties. Forward-looking statements include the information concerning our possible or assumed future results of operations. Forward-looking statements also include those preceded or followed by the words “anticipates,” “believes,” “estimates,” “expects,” “forecasts,” “hopes,” “plans” or similar expressions. For those statements, we claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. The following important factors, along with those discussed in our filings with the Securities and Exchange Commission (the “SEC”), could affect future results and could cause those results to differ materially from those expressed in the forward-looking statements: the effects of competition in the markets in which we operate, including any inability to successfully respond to competitive factors such as prices, promotional incentives and evolving consumer preferences; failure to take advantage of, or respond to competitors' use of, developments in technology and address changes in consumer demand; performance issues or delays in the deployment of our 5G network resulting in significant costs or a reduction in the anticipated benefits of the enhancement to our networks; the inability to implement our business strategy; adverse conditions in the U.S. and international economies, including inflation in the markets in which we operate; cyber attacks impacting our networks or systems and any resulting financial or reputational impact; damage to our infrastructure or disruption of our operations from natural disasters, extreme weather conditions, acts of war, terrorist attacks or other hostile acts and any resulting financial or reputational impact; the impact of public health crises on our operations, our employees and the ways in which our customers use our networks and other products and services; disruption of our key suppliers’ or vendors' provisioning of products or services, including as a result of geopolitical factors, public health crises or the potential impacts of global climate change; material adverse changes in labor matters and any resulting financial or operational impact; changes in the regulatory environment in which we operate, including any increase in restrictions on our ability to operate our networks or businesses; our high level of indebtedness; significant litigation and any resulting material expenses incurred in defending against lawsuits or paying awards or settlements; an adverse change in the ratings afforded our debt securities by nationally accredited ratings organizations or adverse conditions in the credit markets affecting the cost, including interest rates, and/or availability of further financing; significant increases in benefit plan costs or lower investment returns on plan assets; changes in tax laws or treaties, or in their interpretation; and changes in accounting assumptions that regulatory agencies, including the SEC, may require or that result from changes in the accounting rules or their application, which could result in an impact on earnings.\n\nMedia contacts: Kim Ancin 908-559-3227 kimberly.ancin@verizon.com Eric Wilkens 201-572-9317 eric.wilkens@verizon.com", "link": "https://finance.yahoo.com/news/verizon-begins-2023-rapid-network-105000461.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.983, "neg": 0.063, "neu": 0.855, "pos": 0.083}}, {"date": "2023-04-25T08:09:47+00:00", "title": "PepsiCo, McDonald's and Spotify rise premarket; First Republic slumps", "content": "Investing.com -- Stocks in focus in premarket trade on Tuesday, April 25th. Please refresh for updates.\n\nFirst Republic Bank  (NYSE:FRC) stock slumped 21% after the regional lender saw $100 billion in customer withdrawals last month, fuelling concerns that it will need to offload its mortgage portfolio at a heavy loss to cover the outflows.\n\nPepsiCo (NASDAQ:PEP) stock rose 1.7% after the soft drinks colossus lifted its annual profit guidance after price rises helped it overcome a jump in input expenses to post better-than-expected first-quarter earnings.\n\nVerizon Communications  (NYSE:VZ) stock fell 0.8% after the telecoms giant missed first-quarter revenue estimates and reported wireless subscriber losses as a pandemic-led boom in demand fizzled out.\n\nUnited Parcel Service (NYSE:UPS) stock fell 4.4% after the delivery company said it expects full-year revenue to be at the lower end of its earlier forecast on account of a weakening economy.\n\nMcDonald’s (NYSE:MCD) stock rose 0.8% after the burger giant posted a strong rise in global comparable sales in the first quarter, with earnings helped by higher menu prices and more customer visits.\n\nBiogen (NASDAQ:BIIB) stock fell 0.8% after the drugmaker said it would discontinue or pause some studies to reduce costs, even as it beat quarterly profit expectations.\n\nRaytheon (NYSE:RTX) stock rose 1.5% after the aerospace company reported a healthy rise in quarterly profit, benefiting from strong demand for jet engine spare parts and services.\n\nSpotify (NYSE:SPOT) stock climbed 4.8% after the music streaming company reported first-quarter monthly active users crossed the half-billion mark for the first time.\n\nJetBlue (NASDAQ:JBLU) stock rose 2.2% after the low-cost carrier reported a quarterly loss, but still forecast a rebound to profit on strong travel demand.\n\nUBS (NYSE:UBS) stock fell 1.9% after the Swiss lender reported a 52% drop in net profit in the first quarter after allotting $665M in provisions to cover costs related to litigation surrounding U.S. residential mortgage-backed securities.\n\nStory continues\n\nFox (NASDAQ:FOX) stock fell 0.3% after the news that Tucker Carlson has parted ways with Fox News, putting an end to a more than decade-long career as one of the channel's most prominent and controversial voices.\n\nRelated Articles\n\nPepsiCo, McDonald's and Spotify rise premarket; First Republic slumps\n\nWall St falls on mixed earnings, First Republic sinks to all-time low\n\nUPS tempers 2023 revenue view as freight volumes remain strained", "link": "https://finance.yahoo.com/news/pepsico-mcdonalds-spotify-rise-premarket-080947344.html", "symbols": ["5UR.F", "639.F", "639.XETRA", "BAC.F", "BAC.XETRA", "BIIB.MX", "BIIB.US", "FOX.US", "FRC.US", "IDP.F", "IDP.XETRA", "JAW.F", "JBLU.US", "MCD.US", "PEP.MX", "PEP.US", "PEP.XETRA"], "tags": [], "sentiment": {"polarity": 0.832, "neg": 0.075, "neu": 0.838, "pos": 0.087}}, {"date": "2023-04-25T05:56:31+00:00", "title": "Tech earnings loom, UBS reports, U.S. cable news shake-up - what's moving markets", "content": "Investing.com -- U.S. stock futures point lower with key tech earnings waiting in the wings. Investors get a peek at how March's banking sector turmoil impacted two lenders near the center of the crisis, while two U.S. cable news channels announce shock departures by some of their brightest stars.\n\n1. U.S. futures in the red as tech earnings loom\n\nU.S. stocks are seen opening lower on Tuesday, as investors await the release of quarterly results from big global tech names.\n\nBy 05:22 ET (09:22 GMT), the Dow Futures contract was down 1548 points or 0.45%, S&P 500 Futures traded about 23 points or 0.55% lower, and Nasdaq 100 Futures slipped by 67 points or 0.52%.\n\nOn the docket for earnings this week are three out of the four largest U.S. companies by market value: Microsoft Corporation (NASDAQ:MSFT), Google-parent Alphabet (NASDAQ:GOOGL), and Amazon.com Inc (NASDAQ:AMZN). Microsoft and Alphabet are both slated to report later today, followed by Amazon on Thursday. Facebook-owner Meta Platforms Inc (NASDAQ:META) is also due out on Wednesday.\n\nShares in these firms have risen so far this year, and these results will likely serve as a test to see whether these moves are justified while concerns grow over a slowdown in broader economic activity.\n\nElsewhere, other major brands set to report include PepsiCo Inc (NASDAQ:PEP), McDonald’s Corporation (NYSE:MCD), and Verizon Communications Inc (NYSE:VZ), along with General Motors Company (NYSE:GM) and General Electric Company (NYSE:GE).\n\n2. Depositors flee First Republic\n\nShares in First Republic Bank (NYSE:FRC) shed more than a fifth of their value in postmarket trading on Monday after the San Francisco-based bank said that it saw $100 billion in customer withdrawals last month.\n\nThe regional lender became a focal point during the banking sector crisis in March sparked by the collapse of Silicon Valley Bank. Customers raced to withdraw funds, fuelling concerns that First Republic would need to offload its mortgage portfolio at a heavy loss to cover the outflows.\n\nStory continues\n\nHigh-profile U.S. financiers and government officials eventually engineered a rescue deal that saw a group of 11 banks place $30B in deposits in First Republic. This helped lessen the slide in quarterly deposits, with the figure falling by $72B.\n\nIn a joint statement, executive chairman Jim Herbert and chief executive Mike Roffler noted that the company's deposit base has since stabilized. They also backed the \"strength of our credit quality and capital position.\"\n\nHowever, First Republic, which has seen shares plummet by 87% this year through to Monday's close, warned that it will slash headcount by about 20% to 25% in the second quarter. It also pledged to pursue \"strategic options\" to reinforce its capital position, and withdrew its financial guidance.\n\n3. \"Challenging\" times ahead for UBS\n\nUBS Group AG (SIX:UBSG) reported a $28B climb in net new money at its key wealth management division as the banking sector turmoil hit its merger partner (and old rival) Credit Suisse (SIX:CSGN).\n\nSwitzerland's largest bank noted that $7B of these inflows came in the final ten days of March following the announcement of its government-brokered acquisition of Credit Suisse.\n\nUBS chief executive Sergio Ermotti, who returned to the helm of the lender in March to oversee the tie-up, faces a mammoth task folding ailing Credit Suisse into its operations. On Monday, Credit Suisse reported CHF 61B- roughly $68B- in outflows over the first quarter, and warned that this asset flight has yet to abate.\n\nErmotti himself flagged that economic conditions remain \"challenging,\" telling Reuters after the release of its latest earnings that \"things are going to be hard.\"\n\nTo complicate matters even more, net profit attributable to UBS shareholders fell by 52% in the first quarter after the bank took out $665M in provisions to cover costs related to litigation surrounding U.S. residential mortgage-backed securities that were at the center of the global financial crisis some fifteen years ago.\n\nShares in UBS dropped by more than 4% in early European trading on Tuesday.\n\n4. Big changes in U.S. cable news\n\nTwo long-time stars of U.S. cable news are leaving their perches in a fresh shake-up in the country's television media landscape.\n\nHost Tucker Carlson has parted ways with Fox News, the network announced on Monday, putting an end to a more than decade-long career as one of the channel's most prominent voices.\n\nCarlson's departure comes after Fox News paid $787.5M last week to settle a legal dispute with Dominion Voting Systems, which had accused it of airing false claims that it rigged its voting machines in favor of Joe Biden during the 2020 U.S. presidential election.\n\nAccording to the Wall Street Journal, citing sources familiar with the matter, Fox News executives had taken issue with comments from Carlson that were revealed during the course of the Dominion lawsuit which they viewed as derogatory.\n\nShares in Fox Corp. (NASDAQ:FOX), the owner of Fox News, dropped on Monday.\n\nMeanwhile, Fox News rival CNN said that 17-year veteran anchor Don Lemon is departing the channel.\n\nCNN did not provide further details, but the decision follows controversy sparked by recent comments made by Lemon about Republican presidential hopeful Nikki Haley. Lemon said Haley was not \"in her prime,\" a remark that was later criticized for being sexist.\n\n5. Oil steadies as key Chinese holiday approaches\n\nOil prices mostly stabilized, with traders eyeing a possible rebound in demand in China as the second-biggest economy nears a crucial holiday period.\n\nBookings in China for trips abroad during the upcoming May Day holiday showed signs of recovery from strict COVID-19 pandemic rules. Although the figures are still below pre-pandemic levels due to elevated fares for long-haul flights, investors are trying to gauge how the trend will help support fuel demand in the world's largest oil importer.\n\nContributing to sentiment as well is the prospect of further interest rate rise in the West, which could weigh on economic growth. Planned supply cuts by the OPEC+ producer group may also boost prices, analysts have suggested.\n\nBy 05:18 ET (09:18 GMT), U.S. crude futures traded slightly lower by 0.15% at $78.84 a barrel, while the Brent contract edged down 0.1% to $82.46 per barrel.\n\nRelated Articles\n\nTech earnings loom, UBS reports, U.S. cable news shake-up - what's moving markets\n\nUBS hit by old toxic debt costs ahead of 'hard' Credit Suisse task\n\nBiogen tops Q1 expectations; Mizuho says MS sales weaker-than-expected", "link": "https://finance.yahoo.com/news/tech-earnings-loom-ubs-reports-055631507.html", "symbols": ["AMZN.US", "CS.US", "CSGKF.US", "CSGN.SW", "CSN.MX", "CSX1.F", "FOX.US", "FOXA.US", "FRC.US", "GE.US", "GM.US", "GOOGL.US", "MCD.MX", "MCD.US", "MCDC34.SA", "MDO.F", "MDO.XETRA", "META.US"], "tags": [], "sentiment": {"polarity": 0.985, "neg": 0.053, "neu": 0.863, "pos": 0.084}}]