[{"date": "2024-01-24T23:17:00+00:00", "title": "Verizon announces giveaways for Las Vegas residents ahead of the Big Game", "content": "Verizon Sourcing LLC\n\nThe chance to win tickets begins January 22 and residents must live within 75 miles of a participating store in the Las Vegas area to qualify\n\nLAS VEGAS, Jan. 24, 2024 (GLOBE NEWSWIRE) -- Fans will be flying in from all over to watch the biggest game in football, but Verizon is showing some love to locals by giving qualified Nevada residents a chance to win the hottest ticket in town – plus access to events and experiences leading up to kickoff. Two lucky fans who call Nevada home will win two tickets each1 to the game.\n\nEnter to win tickets to the game: Visit the red Verizon van or participating store\r\nBeginning January 22, a branded Verizon van will be roaming the streets of Las Vegas. To enter the ticket sweepstakes for the big game, visit the red Verizon van or any of the 29 participating stores in the Las Vegas area. The chance to enter and win begins January 22 and residents must live within 75 miles of a participating store to qualify. No purchase is necessary to enter the sweepstakes for the big game. Two grand prize winners will be selected through a random drawing on February 6.\n\nHow to score access to events and experiences: Make a qualifying purchase at the red Verizon van or participating store \r\nLas Vegas residents and football fanatics can also get in on the hype all week by scoring access to exclusive events leading up to the big game. Fans who make a qualifying purchase2 from January 22 to February 5 can choose which experience3 they would like to attend. More details on events happening will be announced in the coming days.\n\nQualifying Purchases:\n\nNew customers can qualify by purchasing a new phone and signing up for myPlan. Existing customers can qualify when they upgrade an existing line to myPlan, add a new line to an existing myPlan account or sign up for Verizon Home Internet4 service.  Businesses in Las Vegas, we’ve got you too. Businesses can choose event tickets or gift cards with the purchase of a new 5G phone and new Business Unlimited 5G mobile plan. Businesses can also qualify by upgrading an existing line to Business Unlimited 5G, adding a new line to an existing Business Unlimited 5G account, or by signing up for Verizon Business Internet5 service.\n\nStory continues\n\nFind the red van and make a qualifying purchase at one of the stops listed below or head to one of nine participating Verizon stores in the Las Vegas area. Click on Verizon.com/live for terms and conditions and to find eligible stores.\n\nVerizon Van Locations:\n\nLV Premium Outlets 875 Grand Central Parkway, Las Vegas, NV 89106\r\nDates 1/22-1/24 Time 12pm-7pm\n\nTown Square 6695 S Las Vegas Blvd Suite A-180, Las Vegas, NV 89119\r\nDates 1/26-1/29 Time 12pm-7pm\n\nFashion Show 3200 Las Vegas Blvd S Ste. 600, Las Vegas, NV 89109\r\nDates 1/31-2/01 Time 12pm-7pm local time\n\nDistrict Green Valley Ranch 2240 Village Walk Dr, Henderson, NV 89052\r\nDates 2/03 - 2/05 Time 12pm-7pm\n\nLocals Save with Verizon:\r\nVerizon is thanking Nevada residents with two ways to save. For a limited time, plans start at $50 per month for a single line6. This deal is available at Las Vegas area stores when new customers switch to Verizon’s Unlimited Welcome plan, bring their own phone and sign up for autopay.\n\nSave even more with Verizon’s ‘Refer a Friend’ program7 where existing customers receive monthly $15 bill credits totaling $180 with a referral. Their friend will get a matching $180 bill credit when they activate a new account8.\n\nThe Network Las Vegas Relies On:\r\nOver the last three years, Verizon has nearly tripled Las Vegas’ network capacity and is now utilizing the full 160 MHz of spectrum, which allows us to provide greater bandwidth and enable higher data speeds for customers throughout Las Vegas.\n\nVerizon has doubled down on its 5G network in Las Vegas thanks to our Test Force, an on-the-ground team of wireless engineers and technicians who are working hard to build, upgrade and relentlessly test the network that Las Vegas relies on.\n\nVerizon has added unmatched large capacity connections (mmWave) at the most congested areas in Las Vegas, including the Las Vegas Strip, Fremont Street and Allegiant Stadium, as well as additional upgrades in high demand areas such as the Las Vegas Convention Center and Harry Reid International Airport. These are permanent upgrades that will remain a fixture of the Las Vegas network for years to come.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $134.0 billion in 2023. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/about/news/superbowl. News releases are also available through an RSS feed.\n\nMedia contact(s): \r\nLiz Gelardi\r\nliz.gelardi@verizon.com\n\n1 No purchase necessary to enter sweepstakes, Must be Nevada resident 18-years or older to enter. Sweepstakes starts January 22, 2024 and ends February 5, 2024. See www.verizon.com/live for Official Rules and details. \r\n2Available during the offer period on a first-come, first-served basis. Limit one offer per person.\r\n3 Event selections must be made at least 24-hours prior to the start of the selected event. Gift card redemptions must be submitted prior to 11:59:59pm MST on February 29, 2024.\r\n4Verizon Home Internet includes 5G Home and LTE Home services\r\n5 Verizon Business Internet includes 5G Business Internet and LTE Business Internet services\r\n6$180 BYOD promo credit per phone applied over 36 mos. for new customers with 1 new line with your own 4G/5G smartphone on Unlimited Welcome plan req'd. $360 local promo credit applied over 36 mos. for new customers with 1 new line. Add'l terms apply. In select markets only. Auto Pay & paper-free billing req’d. For Unlimited Welcome plan, in times of congestion, Unlimited 5G and 4G LTE may be temporarily slower than other traffic. Domestic data roaming at 2G speeds.\r\n7Available online only. Must be 18 years or older to participate. Port-in of one line on Unlimited Welcome, postpaid Unlimited Plus or Unlimited Ultimate plan req’d. $180 referral credit applied to referee/referrer account over 12 months; credit ends if eligibility requirements are no longer met. Referrer(s) must be on an eligible Verizon mobile plan and remain in good standing for 12 months to receive referral reward. Referee(s) must not have been a Verizon customer w/in the last 90 days. Max. 10 referral rewards per account. Add’l terms and exclusions apply.\r\n8 $15/mo. credit will be applied over 12 months.", "link": "https://finance.yahoo.com/news/verizon-announces-giveaways-las-vegas-231700559.html", "symbols": ["0Q1S.LSE", "BAC.BE", "BAC.DU", "BAC.F", "BAC.HM", "BAC.MU", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.NEO", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.017, "neu": 0.856, "pos": 0.127}}, {"date": "2024-01-24T20:30:00+00:00", "title": "Why Verizon Communications and AT&amp;T’s Stocks Suddenly Look So Different", "content": "Not even a month into 2024, America’s two big legacy telecom companies— AT&T and Verizon Communications —are having very different years. After the two traded similarly for years, Verizon has suddenly gained an edge on its rival in the first few weeks of the year. Its stock has gained 11% this year through Tuesday’s close, soundly beating the S&P 500’s 2% gain and AT&T shares’ 0.4% decline.\n\nContinue reading", "link": "https://finance.yahoo.com/m/df3b4037-4bf7-34fe-9aae-9f86e308ddc2/why-verizon-communications.html", "symbols": ["BAC.F", "BAC.XETRA", "GSPC.INDX", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.681, "neg": 0.04, "neu": 0.847, "pos": 0.114}}, {"date": "2024-01-24T18:58:00+00:00", "title": "Verizon announces new savings with streaming bundle featuring Netflix and STARZ", "content": "Verizon Sourcing LLC\n\nWith the latest offer, Verizon customers get 20% off of streaming services they love. Plus, myPlan monthly perk saves you even more.\n\nNEW YORK, Jan. 24, 2024 (GLOBE NEWSWIRE) -- Starting today, Verizon customers have yet another exciting offer for greater value on the streaming services they love: get Netflix Premium and STARZ together1 for $25.99 per month. This is the first time the two streaming services have been offered together, and the savings are only for Verizon customers.\n\nCustomers can access the new Netflix-STARZ bundle offer on +play, Verizon’s hub to discover and save on app subscriptions. +play is available to all Verizon postpaid mobile, 5G Home and LTE Home subscribers.\n\nThat’s not all: Verizon customers with myPlan can take an additional $5 off of this new offer using the myPlan monthly +play perk, which is $15 in +play credits for just $10. These are savings you won’t find anywhere else.\n\nThe new Netflix-STARZ bundle\n\nGet ready to stream some of the latest buzz-worthy titles on Netflix, like “Lift” and “Rebel Moon (Part 1)”, and the third seasons of STARZ’s crime dramas “Power Book III: Raising Kanan,” “BMF” and “Hightown,” and the blockbuster action thriller film, “John Wick: Chapter 4.”\n\nGreater value – only with Verizon\n\nVerizon leads the industry in providing customers with access to content offers – like the new Netflix-STARZ bundle – with value they can’t get elsewhere. We’re using our strategic relationships with the biggest players in the content industry to continue to unlock more savings for customers, and our plans put customers in control so that they can choose what to add to their plan and save big on things they love.\n\nLearn more about offers from Verizon’s content partners on +play, by visiting verizon.com/plusplay.\n\nStream more savings using myPlan perks\n\nCustomers with myPlan can take advantage of even more savings for their favorite subscriptions on +play by using the monthly +play credit perk. For $10 per month, customers get $15 in +play credits to use on services from the over 30 partners in the platform.\n\nStory continues\n\nPlus, Verizon recently partnered with Netflix and Max to offer myPlan customers a first-of-its-kind streaming bundle, which is Netflix and Max (each with ads) for just $10 per month. That’s 40% savings each month – and only for Verizon customers.\n\n1) Netflix Premium & STARZ bundle subscription is $25.99+tax/mo. Offer only applies to new subscribers of STARZ and new or existing subscribers of Netflix Premium; existing Netflix subscribers can link their account to this offer. Not combinable w/ any other promos or pricing. Separate activation required for each service; billing begins from time of activation of first service. Subscription auto-renews monthly at then-current price until canceled. Add’l terms apply.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $134.0 billion in 2023. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control..\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact:\n\nCaroline Brooks\r\ncaroline.brooks@verizon.com", "link": "https://finance.yahoo.com/news/verizon-announces-savings-streaming-bundle-185800707.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.008, "neu": 0.886, "pos": 0.106}}, {"date": "2024-01-24T18:28:23+00:00", "title": "Verizon Communications Inc (VZ) Reports Mixed 2023 Results with Strong Wireless Growth Amidst ...", "content": "Wireless Service Revenue Growth: Full-year wireless service revenue increased by 3.2% to $76.7 billion. Fixed Wireless Growth: Fixed wireless net additions surged over 31% year over year. Free Cash Flow: Full-year free cash flow rose to $18.7 billion, up from $14.1 billion in 2022. EPS Decline: Full-year 2023 EPS was $2.75, down from $5.06 in 2022; adjusted EPS of $4.71, excluding special items. Operating Revenue Dip: Total operating revenue for full-year 2023 was $134.0 billion, a 2.1% decrease year over year. Q4 Postpaid Net Additions: Fourth-quarter wireless postpaid phone net additions jumped to 449,000, a significant increase from the previous year.\n\nWarning! GuruFocus has detected 7 Warning Sign with VZ.\n\nOn January 23, 2024, Verizon Communications Inc (NYSE:VZ) released its 8-K filing, detailing the company's financial performance for the fourth quarter and full-year 2023. As a leading provider of technology and communications services, Verizon has shown resilience in its wireless segment, which accounts for the majority of its service revenue and operating income. The company serves a vast customer base with approximately 92 million postpaid and 22 million prepaid phone customers, bolstered by its nationwide network and the acquisition of Tracfone. Verizon Communications Inc (VZ) Reports Mixed 2023 Results with Strong Wireless Growth Amidst Revenue Decline\n\nFinancial Performance and Challenges\n\nVerizon's financial results for 2023 reflect a mix of achievements and challenges. The company's wireless service revenue grew by 3.2% for the full year, reaching $76.7 billion, driven by pricing actions and the adoption of higher premium plans. Fixed wireless net additions also saw a significant increase, indicating strong demand for Verizon's product offerings. However, the company faced a decline in total operating revenue, which decreased by 2.1% to $134.0 billion for the full year, attributed to lower wireless equipment revenue and a decrease in total postpaid upgrades.\n\nThe company's earnings per share (EPS) for the full year stood at $2.75, a sharp decline from $5.06 in 2022. Adjusted EPS, excluding special items, was $4.71, compared to $5.18 in the previous year. This decline in EPS was influenced by a pre-tax loss from special items amounting to approximately $7.8 billion, including a significant goodwill impairment charge related to the Business reporting unit.\n\nStory continues\n\nDespite these challenges, Verizon's cash flow from operations increased slightly to $37.5 billion, and the company reported a robust free cash flow of $18.7 billion, up from $14.1 billion in 2022. These figures underscore the company's ability to generate cash and maintain financial flexibility.\n\nKey Financial Metrics\n\nVerizon's financial achievements in 2023, particularly in wireless customer growth and cash flow improvement, are critical for the company's long-term strategy in the competitive telecommunications industry. The increase in wireless service revenue and fixed wireless net additions demonstrates the company's strong position in the market and its ability to attract and retain customers. The improvement in free cash flow is also a positive indicator for investors, as it provides the company with the resources to invest in network improvements, pay down debt, and return value to shareholders.\n\nHowever, the decline in total operating revenue and EPS presents challenges that Verizon will need to address. The competitive landscape of the telecommunications industry requires continuous investment in technology and network infrastructure to meet customer demands and stay ahead of competitors. The decrease in operating revenue and the substantial goodwill impairment charge highlight the need for Verizon to reassess its business strategies, particularly within its Business reporting unit.\n\nOutlook and Guidance for 2024\n\nLooking ahead to 2024, Verizon expects total wireless service revenue growth of 2.0% to 3.5% and adjusted EBITDA growth of 1.0% to 3.0%. The company anticipates adjusted EPS to be in the range of $4.50 to $4.70 and plans for capital expenditures between $17.0 billion and $17.5 billion. The adjusted effective income tax rate is projected to be between 22.5% and 24.0%.\n\nVerizon's performance in 2023 and its outlook for 2024 will be of keen interest to value investors and potential members of GuruFocus.com, as they assess the company's financial health and future prospects. The company's ability to navigate the challenges ahead and capitalize on its strengths in the wireless market will be critical in determining its success in the coming year.\n\nExplore the complete 8-K earnings release (here) from Verizon Communications Inc for further details.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/verizon-communications-inc-vz-reports-182823453.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.026, "neu": 0.811, "pos": 0.164}}, {"date": "2024-01-24T17:33:02+00:00", "title": "Why cable stocks look better than telecoms: Analyst", "content": "AT&T (T) reported mixed fourth-quarter results after Verizon's (VZ) strong print, which MoffettNathanson's Co-Founder and Senior Analyst Craig Moffett tells Yahoo Finance Live was expected as \"what you see is what you get with these companies.\" He says AT&T's ongoing challenge is lack of growth.\n\nMoffett sees AT&T's 5G network buildout \"largely\" complete, but questions if it can drive revenues yet, calling it \"a running in place type of investment and an expensive one at that.\" He's also skeptical of convergence opportunities from fiber investments that he says will only cover about 25% of the country, leaving most untouched.\n\nInstead, he calls cable operators \"more interesting,\" positioned to win if convergence accelerates versus phone companies with limited fiber reach.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Angel Smith.\n\nVideo Transcript\n\nSEANA SMITH: All right, let's take a look at one of the trending tickers here this morning, and that is AT&T. Reporting results before the bell, missing on earnings, even as it added more customers than expected here. Now this comes as Verizon came out with its earnings on Tuesday, which came in strong.\n\nSo what's the play in the telecom space this year? We want to bring in Craig Moffett. He's MoffettNathanson's co-founder and senior analyst. All right, Craig let's talk about this. Let's start with AT&T, because we're looking at losses of shares just about 2%. There certainly were tidbits in this report that investors are taking issue with. But my question to you is, what do you think these results tell us just about the fundamentals of AT&T's business?\n\nCRAIG MOFFETT: Well, look, overall, it was a quarter that was more or less what you expected. The results in subscribers-- and you have to start, like any subscription business, with the subscriber counts. And the subscriber counts were pretty good.\n\nStory continues\n\nI think the challenge here is you look at this company, and it's really not growing. It hasn't grown faster than the rate of inflation in a decade. You've had a lot of tailwinds during that period for wireless overall. And you look forward, they're not guiding to any material earnings growth.\n\nI think that's why the market is reacting negatively this morning is the market had expected some material EPS growth. And you know, what you see is what you get with these companies. They're very slow growth companies. They pay a decent dividend. But the capital appreciation story hasn't worked in 30 years for the telcos.\n\nBRAD SMITH: You know, Craig, as the call had been taking place this morning, perhaps a lot of the focus may have not just been on the additions for subscribers, but also where the company is investing further here. Is there any of that investment, that CapEx that's going to be going out the door that you believe AT&T has to get right in order to hit its next inflection point for investors?\n\nCRAIG MOFFETT: Well, look, they have largely finished building out the 5G network, as have their peers. But the real question now is whether 5G will materialize as a real revenue driver. So far, it hasn't. It's been sort of a running in place type of investment, and an expensive one at that.\n\nOn the wireline side of the business, what I scratch my head over is the convergence strategy, right? They spoke a lot on their conference call about the power of convergence and the ability to offer a wired broadband solution and a wireless broadband solution. That's a lot of what's driving the capital investment that they're making in fiber.\n\nWell, that's fine, but their fiber network will eventually cover something like 25% of the United States. What do you do with the other 75% of the country? They talk about it as though they're advantaged, but I think a better way to characterize it is they are perhaps less disadvantaged than their peers.\n\nBut if convergence really happens, the cable operators are going to win the war, because cable operators can offer a converged solution everywhere, and the telephone companies that they compete with can't. And that's actually why I think, for me, particularly with expectations quite low for the cable operators. The cable operators are more interesting at this point than the phone companies are.", "link": "https://finance.yahoo.com/video/why-cable-stocks-look-better-173302293.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TBB.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.035, "neu": 0.836, "pos": 0.129}}, {"date": "2024-01-24T17:32:13+00:00", "title": "Is T-Mobile A Buy With Q4 Earnings Report Due?", "content": "T-Mobile holds an edge in 5G wireless spectrum but will its market share gains vs. rivals continue? A big stock buyback is underway.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4a06970b-05e2-307c-b5e6-89a2532bda8c/is-t-mobile-a-buy-with-q4.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TM5.F", "TMUS.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.71, "neg": 0, "neu": 0.789, "pos": 0.211}}, {"date": "2024-01-24T15:36:16+00:00", "title": "AT&amp;T Stock Falls After Telecom Giant's Soft Earnings Outlook", "content": "AT&T continued gaining subscribers for its core cellphone business in the last three months of 2023, lifting revenue and spurring the company to guide for another year of free cash flow growth. The company said its [recent $14 billion deal with Ericsson](https://www.wsj.com/business/telecom/at-t-signs-14-billion-supply-deal-with-ericsson-e0d870dd) would accelerate the depreciation of AT&T’s Nokia equipment, stinging earnings. Last quarter, the cell carrier added 526,000 postpaid phone connections, its main profit engine.\n\nContinue reading", "link": "https://finance.yahoo.com/m/14fa6327-2ab3-300b-a516-b1b4a9b1746a/at%26t-stock-falls-after.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TBB.US", "TM5.F", "TMUS.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.891, "neg": 0, "neu": 0.847, "pos": 0.153}}, {"date": "2024-01-24T15:18:00+00:00", "title": "AT&amp;T Stock Drops After Earnings Fail to Impress", "content": "AT&T reported fiscal fourth-quarter earnings below Wall Street expectations, but revenue came in above the consensus and the company added more customers than had been forecast. AT&T reported adjusted earnings of 54 cents a share, below analysts’ estimates of 56 cents a share and down from last year’s 61 cents a share. Revenue for the quarter of $32 billion was above Wall Street expectations of $31.46 billion and a slight increase from last year’s revenue of $31.34 billion.\n\nContinue reading", "link": "https://finance.yahoo.com/m/5cf2caa1-1f87-3dff-8266-750649c3618e/at%26t-stock-drops-after.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.885, "neg": 0, "neu": 0.864, "pos": 0.136}}, {"date": "2024-01-24T14:22:00+00:00", "title": "Company News for Jan 24, 2024", "content": "Shares of CBRE Group, Inc. CBRE fell 1.1% on the session’s real estate slump. Verizon Communications Inc.’s VZ shares jumped 6.7% after reporting fourth-quarter revenues of $35.13 billion, beating the Zacks Consensus Estimate of $34.81 billion. Shares of The Procter & Gamble Company PG gained 4.1% after reporting fourth-quarter adjusted earnings of $1.84 per share, beating the Zacks Consensus Estimate of $1.70. PepsiCo, Inc.’s PEP shares gained 1.5% on consumer staples becoming the biggest winning sector in the session.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nVerizon Communications Inc. (VZ) : Free Stock Analysis Report\n\nProcter & Gamble Company (The) (PG) : Free Stock Analysis Report\n\nPepsiCo, Inc. (PEP) : Free Stock Analysis Report\n\nCBRE Group, Inc. (CBRE) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/company-news-jan-24-2024-142200972.html", "symbols": ["0HQP.LSE", "BAC.F", "BAC.XETRA", "C1BR34.SA", "CBRE.US", "PG.BA", "PG.MX", "PG.US", "PRG.F", "PRG.XETRA", "RF6.BE", "RF6.DU", "RF6.F", "RF6.MU", "RF6.STU", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.982, "neg": 0.034, "neu": 0.746, "pos": 0.22}}, {"date": "2024-01-24T14:00:00+00:00", "title": "Verizon Business announces $75K donation to USO EMEA", "content": "Verizon Sourcing LLC\n\nDORTMUND, Germany, Jan. 24, 2024 (GLOBE NEWSWIRE) -- Verizon Business today announced it would donate $75,000 to the United Service Organizations (USO) Europe, Middle East, and Africa (EMEA).\n\nAs a result of this donation, Verizon Business will be designated a sponsor of the USO mission in Europe. As a mission sponsor, Verizon Business will help support the operation of USO locations across Europe, in part through a portion of the donated funds. These USO centers provide programs designed to support military members through the challenges of service and connect them to family and friends.\n\nAnother portion of the donation will be allocated to supporting the USO Gaming program, specifically the Rapid Response Gaming Kit initiative. These kits are built to bring the amenities of the USO Gaming program to remote locations where military members may be deployed. Each kit contains six gaming systems and at least 15 games.\n\nThis donation marks a continuation of Verizon’s long-standing commitment to the military community. Verizon’s lasting dedication to those who have served has led to its being named a top 10 Military Friendly Company for six consecutive years, including three as the #1 Military Friendly Company in the United States.\n\n“Verizon has a strong tradition of supporting the military community, and donations to organizations like the USO play a critical role in carrying this mission forward,” said Kyle Malady, CEO of Verizon Business. “As the executive sponsor of Verizon VALOR, our employee resource group for the more than 8,000 veterans and 500 military spouses part of our workforce across the globe, I see firsthand how important the work of the USO is to those in uniform, and it is personally important to me that Verizon Business contributes.”\n\n\"I would like to extend a heartfelt thank you to Verizon Business for their generous contribution to USO Europe, Middle East, and Africa,” said USO EMEA Regional Vice President Grant McCormick. “With these funds, we can significantly enhance our programs for the people who serve. Together with Verizon Business, we are committed to having a positive impact on the quality of life for our service members and their families.\"\n\nStory continues\n\nAbout USO EMEA:\r\nU.S. forces serving in Europe play a critical role in deterring traditional military threats to our country and providing vital support to others deployed in operations in Europe, the Middle East, Africa and beyond. USO locations in Germany, Italy, Spain and the United Kingdom support service members and their families by helping them stay connected to loved ones and their communities back home, despite being stationed so far away from everything familiar.\n\nUSO personnel also directly support troops exercising with our allies in more remote European locations, such as Poland, Romania, Hungary, Lithuania and Slovakia. Additionally, local programs and community-building activities like gaming events, holiday celebrations, creative arts and food-focused events provide a much-needed break from the demanding and challenging environment of life on deployment.\n\nAbout USO Gaming & Rapid Response Gaming Kits:\r\nGaming provides a generationally relevant online and in-person activity that helps service members relax and unwind. It also enables them to connect and interact with their fellow service members, families, and friends, as well as the civilian community, which helps to diminish the military-civilian divide.\n\nUSO Gaming strives towards a comprehensive gaming program which encapsulates opportunities for all types of gamers from competitive to casual, tabletop to digital. Gaming promotes mental wellness, social interaction, and entertainment while also providing service members and their families increased resiliency, stress relief, communication opportunities, and enhanced military camaraderie.\n\nThe comprehensive USO Gaming program provides gaming capabilities, used both online and in-person, for service members and their families, in addition to public partnerships, such as invitationals, streaming, content creation and entertainment events. The program includes local, regional and national events, including numerous tournaments, leagues, community events and competitions.\n\nThe USO Gaming program has continued to expand through the construction of USO Gaming Centers and dedicated gaming spaces within existing USO centers across the globe, as well as featuring prominent gaming experts and military family programming. Service members deployed to the front lines remained entertained and connected through USO Gaming’s Rapid Response Gaming Kits, which are portable, fully-contained gaming kits designed to support service members in the most austere locations around the world.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: Eric Durie\r\neric.durie@verizon.com\r\n516-382-8219\n\nSebrina Kepple\r\nsebrina.kepple@verizon.com\r\n+44 739-106-5817", "link": "https://finance.yahoo.com/news/verizon-business-announces-75k-donation-140000086.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.015, "neu": 0.807, "pos": 0.178}}, {"date": "2024-01-24T13:58:13+00:00", "title": "Verizon Communications Full Year 2023 Earnings: EPS Misses Expectations", "content": "Verizon Communications (NYSE:VZ) Full Year 2023 Results\n\nKey Financial Results\n\nRevenue: US$134.0b (down 2.1% from FY 2022). Net income: US$11.6b (down 45% from FY 2022). Profit margin: 8.7% (down from 16% in FY 2022). EPS: US$2.76 (down from US$5.06 in FY 2022). earnings-and-revenue-growth\n\nAll figures shown in the chart above are for the trailing 12 month (TTM) period\n\nVerizon Communications EPS Misses Expectations\n\nRevenue was in line with analyst estimates. Earnings per share (EPS) missed analyst estimates by 38%.\n\nLooking ahead, revenue is forecast to grow 1.3% p.a. on average during the next 3 years, compared to a 2.1% growth forecast for the Telecom industry in the US.\n\nPerformance of the American Telecom industry.\n\nThe company's shares are up 7.5% from a week ago.\n\nRisk Analysis\n\nBefore we wrap up, we've discovered 3 warning signs for Verizon Communications that you should be aware of.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.", "link": "https://finance.yahoo.com/news/verizon-communications-full-2023-earnings-135813981.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.452, "neg": 0.044, "neu": 0.908, "pos": 0.048}}, {"date": "2024-01-24T12:28:23+00:00", "title": "AT&amp;T Earnings Guidance For 2024 Misses As Q4 Wireless Subscriber Adds Top Views", "content": "AT&T early Wednesday reported fourth-quarter earnings that missed Wall Street estimates while revenue topped. T stock fell as the AT&T earnings outlook for 2024 fell short. Reported before the market open, AT&T earnings for the December quarter fell 11% to 54 cents on an adjusted basis.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1dcd385f-0f07-37ae-af97-9debdaa7db2d/at%26t-earnings-guidance-for.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": -0.296, "neg": 0.046, "neu": 0.954, "pos": 0}}, {"date": "2024-01-24T12:19:00+00:00", "title": "AT&amp;T Earnings Miss Expectations, New Phone Subscribers Beat. The Stock Falls.", "content": "AT&T reported fiscal fourth-quarter earnings below Wall Street expectations, but revenue came in above the consensus and the company added more customers than had been forecast. AT&T reported adjusted earnings of 54 cents a share, below analysts’ estimates of 56 cents a share and down from last year’s 61 cents a share. Revenue for the quarter of $32 billion was above Wall Street expectations of $31.46 billion and a slight increase from last year’s revenue of $31.34 billion.\n\nContinue reading", "link": "https://finance.yahoo.com/m/5cf2caa1-1f87-3dff-8266-750649c3618e/at%26t-earnings-miss.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.885, "neg": 0, "neu": 0.864, "pos": 0.136}}, {"date": "2024-01-24T10:51:00+00:00", "title": "Verizon Just Delivered Plenty of Bad News. Here's Why Investors Didn't Care.", "content": "How you think about Verizon Communications(NYSE: VZ) could depend on whether you see the proverbial glass of water as half-empty or half-full. For example, some will note that the telecom stock has lagged well behind the S&P 500 over the last 12 months. Others, however, will rightly point out that Verizon has trounced the market over the previous three- and six-month periods.\n\nThe difference in views could also surface with the company's fourth-quarter results, announced on Tuesday. Verizon just delivered plenty of bad news -- but here's why investors didn't care.\n\nBad news for Verizon in multiple areas\n\nYou won't have to look hard to find negatives with Verizon's Q4 results. Starting at the top of the income statement, the telecom giant's operating revenue slipped 0.3% lower year over year to $35.1 billion.\n\nThe main culprit for Verizon's top line was a decline in wireless equipment revenue. This resulted from postpaid upgrades falling by 17.9% from the prior-year period.\n\nThe issues for Verizon trickled down to its bottom line as well. The company posted a net loss in Q4 of $2.6 billion, or $0.64 per share, based on generally accepted accounting principles (GAAP). In the same quarter of 2022, Verizon delivered positive earnings of $6.7 billion, or $1.56 per share. Verizon Q4 2023 Income Statement Sankey Chart.\n\nA pretax loss from special items of around $7.8 billion weighed heavily on Verizon's Q4 results. This loss included a $5.8 billion goodwill impairment and a $992 million mark-to-market adjustment for the company's pension and other post-employment benefits liabilities.\n\nEven on an adjusted basis, though, Verizon's earnings still declined year over year. The company reported adjusted earnings per share of $1.08 in Q4, down from $1.19 in the prior year period.\n\nThe silver linings that investors applauded\n\nDespite all of this bad news, Verizon's share price jumped close to 6% on Tuesday following the Q4 update. Why? Investors applauded several silver linings in the company's generally gloomy earnings results.\n\nStory continues\n\nThe big story was that Verizon's wireless business delivered impressive growth. Total wireless postpaid phone net additions more than doubled year over year to 449,000. Consumer postpaid phone gross additions jumped 17% year over year, the company's best quarterly performance since 2020.\n\nVerizon's broadband business continued to pick up momentum as well. Total broadband net additions in Q4 came in at 413,000. This marked the fifth consecutive quarter Verizon has reported more than 400,000 broadband net additions.\n\nFor full-year 2023, Verizon generated free cash flow of $18.7 billion. This total is up from $14.1 billion in 2022.\n\nInvestors also found something to like in Verizon's guidance for 2024. The company projects total wireless service revenue will grow between 2% and 3.5%, reversing last year's decline.\n\nIs Verizon stock a smart pick to buy now?\n\nInvestors seeking strong growth probably aren't going to view Verizon as an attractive stock to buy. That's nothing new. However, I think that there's a much different story for income investors.\n\nVerizon's dividend yield currently stands at nearly 6.4%. The company has increased its dividend for 17 consecutive years. I expect that shareholder-friendly streak to continue.\n\nVerizon's dividend payout ratio is a healthy 52.8%. Rising free cash flow puts the telecom leader in an even stronger position to boost its dividend in the future.\n\nIncome investors should see Verizon as a glass of water that's more than half-full, in my opinion. If they have some cash to put to work, they might want to take a sip of this solid dividend stock.\n\nShould you invest $1,000 in Verizon Communications right now?\n\nBefore you buy stock in Verizon Communications, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Verizon Communications wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of January 22, 2024\n\nKeith Speights has no position in any of the stocks mentioned. The Motley Fool recommends Verizon Communications. The Motley Fool has a disclosure policy.\n\nVerizon Just Delivered Plenty of Bad News. Here's Why Investors Didn't Care. was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/verizon-just-delivered-plenty-bad-105100370.html", "symbols": ["VZ.US"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.067, "neu": 0.796, "pos": 0.137}}, {"date": "2024-01-24T08:42:00+00:00", "title": "Heard on the Street Recap: Brighter Picture", "content": "The earnings season is hitting its stride, offering investors an opportunity to assess whether the [high valuations](https://www.wsj.com/livecoverage/stock-market-today-dow-jones-earnings-01-23-2024/card/stocks-are-looking-more-expensive-HIS550qlPQoh3pLbewUm) that stocks are fetching make sense.\n\nContinue reading", "link": "https://finance.yahoo.com/m/042bbff3-c0a7-3116-ad37-19ead818afab/heard-on-the-street-recap%3A.html", "symbols": ["0NOF.LSE", "0Q1S.LSE", "BAC.F", "BAC.XETRA", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "MMM.BE", "MMM.F", "MMM.HA", "MMM.HM", "MMM.MU", "MMM.MX", "MMM.STU", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0, "neu": 0.896, "pos": 0.104}}, {"date": "2024-01-24T04:41:54+00:00", "title": "Q4 2023 Verizon Communications Inc Earnings Call", "content": "Participants\n\nAnthony T. Skiadas; Executive VP & CFO; Verizon Communications Inc.\n\nBrady Connor; SVP of IR; Verizon Communications Inc.\n\nHans E. Vestberg; Chairman & CEO; Verizon Communications Inc.\n\nBryan D. Kraft; Director & Lead Research Analyst; Deutsche Bank AG, Research Division\n\nCraig Eder Moffett; Co-Founder, Founding Partner & Senior Research Analyst; MoffettNathanson LLC\n\nDavid William Barden; MD & Global Research US Telecom Services & Communications Infrastructure Senior Analyst; BofA Securities, Research Division\n\nFrank Garrett Louthan; MD of Equity Research; Raymond James & Associates, Inc., Research Division\n\nJohn Christopher Hodulik; MD, Sector Head of the United States Communications Group and Telco & Pay TV Analyst; UBS Investment Bank, Research Division\n\nKannan Venkateshwar; Director & Senior Research Analyst; Barclays Bank PLC, Research Division\n\nMichael Ian Rollins; MD & U.S. Telecoms Analyst; Citigroup Inc., Research Division\n\nPeter Lawler Supino; MD & Senior Analyst; Wolfe Research, LLC\n\nPhilip A. Cusick; MD and Senior Analyst; JPMorgan Chase & Co, Research Division\n\nSimon William Flannery; MD; Morgan Stanley, Research Division\n\nWalter Paul Piecyk; Partner & TMT Analyst; LightShed Partners, LLC\n\nPresentation\n\nOperator\n\nGood morning, and welcome to the Verizon Fourth Quarter 2023 Earnings Conference Call. (Operator Instructions) Today's conference is being recorded. If you have any objections, you may disconnect at this time. \r\nIt is now my pleasure to turn the call over to your host, Mr. Brady Connor, Senior Vice President, Investor Relations.\n\nBrady Connor\n\nThanks, Brad. Good morning, everyone, and welcome to our fourth quarter earnings conference call. I'm Brady Connor, and I'm joined by our Chairman and Chief Executive Officer, Hans Vestberg; as well as our Chief Financial Officer, Tony Skiadas. \r\nBefore we begin, I'd like to draw your attention to our safe harbor statement, which can be found on Slide 2 of the presentation. Information in this presentation contains statements about expected future events and financial results that are forward-looking and subject to risks and uncertainties. Discussion of factors that may affect future results is contained in Verizon's filings with the SEC, which are available on our website. \r\nThis presentation contains certain non-GAAP financial measures. Reconciliations of these non-GAAP measures to the most directly comparable GAAP measures are included in the financial materials posted on our website. Earlier this morning, we posted to our Investor Relations website, a detailed review of our fourth quarter and full year results. You'll find additional details in the earnings materials on our Investor Relations website. \r\nWe'd like to note that Verizon's fourth quarter reporting earnings per share were negatively impacted by a number of special items, which are discussed in the written remarks available on our Investor Relations website. The largest -- the impacts was also disclosed in our 8-K filing last Wednesday. Excluding these special items, adjusted EPS for the fourth quarter was $1.08. \r\nWith that, I'll turn the call over to Hans.\n\nStory continues\n\nHans E. Vestberg\n\nThank you, Brady. Good morning, everyone, and welcome to our fourth quarter 2023 earnings call. I hope you all had a great start of 2024. I'm pleased to report that Verizon closed out the year with a strong fourth quarter, finishing off a year of solid operation and financial performance. For us, 2023 was a year of continuous improvement and important actions across the business. We made significant changes to how we operate and to our team, and those changes paid off. \r\nWe stabilized our core business and positioned the company for renewed growth and profitability. We built strong momentum quarter after quarter, culminating in a very good holiday season. And finally, we met the guidance that we provided to you in each of our key performance indicators. \r\nEntering 2024, Verizon stands ready to further unlock our performance potential at an accelerating rate. We now have all the assets, the best team in the business and a focus on continued operational excellence to deliver even better results going forward. \r\nLet me share some full year highlights with you. Wireless service revenue for 2023 was $76.7 billion, a 3.2% year-over-year increase. We delivered outstanding volumes during a healthy fourth quarter where our customers clearly embraced our offerings. Full year adjusted EBITDA was $47.8 billion, contributing to a very strong free cash flow of $18.7 billion, reflecting our disciplined and strategic approach to profitable growth. \r\nAs a result of our financial strength, we raised our dividend for the 17th year in a row with a healthy free cash flow dividend payout ratio of approximately 59%. We also reduced our year-over-year leverage while continuing to bring CapEx back towards business as usual levels. This aligns with the capital allocation priorities we have shared in recent years. \r\nThese results provide a solid foundation with Verizon's journey and future success. And I'm pleased that we put the leadership and team in place last year that will serve Verizon stakeholders well in both the short and long term. We, as a team, have focused on capturing the market opportunity, and I'm proud of our progress in 2023. \r\nJust two weeks ago, Leslie Berland joined Verizon as our Chief Marketing Officer. I'm excited to bring her on board and have a great confidence in her ability to continue shaping Verizon's premium brand perception and story. \r\nWe started 2023 determined to differentiate ourselves by investing even more in profitable growth while transforming Verizon to make the company more efficient and effective. Seeing the continued strength of the U.S. consumer, busy holiday store traffic and rising demand for mobility, broadband and private networks, we also took actions to fuel growth during the fourth quarter, and it showed in our results. \r\nA standout milestone in 2023 was our launch of myPlan, which was designed from extensive customer research to be the most flexible plan available to U.S. consumers from any wireless company. myPlan has been a great success that has seen stellar adoption. Introduced in May, we already have 13.1 million myPlan subscribers. \r\nAnd these customers are choosing premium packages and our unique perks driving ARPA. Other changes we made in 2023 include establishing a regional distribution model, tailing our approach to every market, revamping sales composition to support productivity and introducing new price plans and promotions in Consumer and Business. \r\nVerizon Business also partnered with HCLTech to be more efficient to deliver post-sale implementation and customer support from managed network services, enhancing our customer service while saving Verizon money. These actions paired with all of our assets sets us up very well for 2024. We are now working from an effective model, and this is just a start. Overall, the wireless industry is strong as we head into 2024, and we are confident in our strategy. We have great offerings with optionality to meet the needs of customers of any budget on the best network in the country. \r\nNow let me share a bit more how each of our service performed in the fourth quarter. Starting with Mobility. We had 449,000 postpaid phone net adds, driven by improving net adds in Consumer and a continued sustainable performance in Verizon Business. Our disciplined and segmented market approach is working with customers and creating great economics for our shareholders. \r\nIn Consumer, you can see the pattern of continuous improvement from the start of the year. In the fourth quarter, we delivered our best postpaid phone gross adds performance since 2019 and our best net adds in two years. We added 318,000 postpaid phone customers in the fourth quarter, and our gross adds were up almost 17% year-over-year. It is clear that we have momentum in Consumer as we move into 2024, and we'll continue to work to get our fair share of new business. \r\nOur customer-centric offers are resonating in the market, and we're just getting started. By leveraging Verizon's large subscriber base and key partnership, we can deliver exclusive discount offers like Netflix and Max for just $10 a month, underscoring our industry leadership in value-driven content offerings. With our vast network coverage and the largest base of loyal customers, we're uniquely positioned to provide targeted high-value deals that deepen relationships across connected devices, streaming and more. \r\nWithin the value business, which includes our prepaid offerings like TracFone, Visible and Total by Verizon, we still have work do, but are making progress. \r\nMoving to Verizon Business. The team continued to deliver on Mobility with total postpaid phone net adds of 131,000 for the fourth quarter 2023, marking our tenth consecutive quarter of postpaid phone net adds above 125,000. For the full year, business added 562,000 phone net adds, an outstanding result. Our Business customers are prioritizing mobility and value the optionality we offer with highly tailored plans on the best network in the country. \r\nNow let's turn to Broadband. For the year, we had more than 1.7 million Broadband net adds with more than 1.5 million net adds from fixed wireless access and 248,000 net adds from Fios, a nice increase over 2022. \r\nOn fixed wireless access, we're consistently adding more than 350,000 subscribers per quarter, which is part of our plan for steady, sustainable growth that exceeds what we expected at launch. Just three years of the launch, we serve more than 3 million fixed wireless access customers, well ahead of our stated goal of 4 million to 5 million subscribers by the end of 2025. With fixed wireless access, we're expanding into new markets and proving the value of Verizon's connectivity. \r\nCustomers are finding strong reliability and speed in fixed wireless access, and that shows in our results, including a very strong Net Promoter Score. For a product that still is in the beginning, the pace of adoption has the team super excited. We expect this will be a long-term source of recurring revenue for Verizon, and we're entering this year with a strong base for continued growth. \r\nTurning to the private networks and our 5G business solutions. We continue to see interest from large enterprises running complex logistics and operations like ports, automotive and heavy industries. In November, Norfolk International Terminal contracted us to build a second private 5G network for them. All the already one of our partners in smart car development has contracted us to build a private network for their automotive tech testing environment. And Nucor, one of the country's largest steel companies, has us building private networks for three of its sites with more to come over the next year. \r\nStrategically, we are building a new source of revenue expansion where we are the clear leader. Last year, we also expanded existing 5G private network partnerships with NFL to bring new spectator and retail experience to fans everywhere. When we build relationships with these large enterprises, and they see what our network can do for them, there is always potential for more business. And our network is just getting better and better every day. \r\nWith full access to our spectrum as of the end of third quarter last year, our mission is to optimize experience in every market and expand into suburban and rural markets, where we know our Consumer and Business customers are eager to take up our offerings. We have been expanding and improving our network in key markets through 2023 and into this year. I have said it before, and I will say it again, our network is the foundation of how we offer the best value and premium experience to our customers. And we are now seeing our investment in C-Band paying off in terms of customer experience and loyalty. \r\nWhere we have C-Band, we see higher gross adds, lower churn and more step-ups to premium services. We also see increased uptake of customers taking both mobility and broadband services. Meanwhile, millimeter wave, which we have now deployed in many urban areas and all 30 NFL stadiums, sets Verizon apart with an outstanding performance at high-density areas and public event spaces. And for the 32nd consecutive time, Verizon was the most awarded company in the country for wireless network quality with the first place rankings in each of J.D. Power's 6 regions. We are the network that America relies on, and we take that commitment very seriously. \r\nLooking ahead, our priority for 2024 are crystal clear. We remain laser-focused on growing wireless service revenue and expanding our adjusted EBITDA and free cash flow to allow for a meaningful debt reduction in the year ahead. This is what our whole team is working towards and what you, our shareholders and our Board want us to focus on. \r\nTony will have more details for you, but we anticipate strong wireless service revenue growth of 2% to 3.5% in 2024, which reflects our ability to sustain the top line of our business as we continue to pursue the right balance or profitability and customer growth. Our adjusted EBITDA profile will continue to improve as we become even more efficient with growth, cost saving measures and our disciplined promotional spending. Our capital allocation priorities remain consistent. And as we lower our capital intensity from the C-Band build-out and our new business structure, we expect to see continued strong free cash flow generation going forward. That will enable our Board to continue to raise our dividend and also enable us to bring down leverage. \r\nNow Tony will discuss the quarter as well as our operations and guidance in more detail.\n\nAnthony T. Skiadas\n\nThanks, Hans, and good morning. Executing on our plan, we finished the year strong and delivered on our financial guidance. We exited the year with good momentum and remain committed to our three priorities of growing wireless service revenue, adjusted EBITDA and free cash flow. \r\nIn 2023, we set out to improve our operational performance while sustaining financial discipline. Our fourth quarter and full year results confirm that our strategy is working and that we can deliver strong financials and improve key operating metrics. Consumer postpaid phone net adds totaled 318,000 for the quarter, a substantial improvement of 369,000 sequentially and 277,000 compared to the prior year. Our Consumer postpaid phone churn of 0.88% represents a stable result even after we implemented over $1 billion of annualized pricing actions in 2023. While we do not provide specific guidance on volumes, we wanted to share a couple of items as we look into 2024. \r\nIn the first quarter, we are taking additional targeted pricing actions that we expect will result in incremental pressure on Consumer postpaid phone churn in the period. However, we expect to deliver positive Consumer postpaid phone net adds in full year 2024 as we execute on our strategy of growing our subscriber base while being financially disciplined. \r\nPostpaid phone gross adds in the quarter were up nearly 17% year-over-year. This represents our best quarterly consumer gross add performance in four years. Our attractive myPlan offers combined with our segmented approach to the market, regional sales structure and disciplined promotional strategy continued to deliver strong results. Additionally, postpaid upgrades remained lower as compared to the prior year. The Consumer postpaid upgrade rate was 4.4% in the fourth quarter, down 120 basis points year-over-year as a result of approximately 19% fewer upgrades. \r\nAs Hans said, we continue to see better performance in markets where we have deployed C-Band. In our first 76 C-Band markets, fourth quarter Consumer postpaid phone gross add growth was 8 percentage points better than in non-C-Band markets. \r\nAdditionally, Consumer postpaid phone churn and C-Band markets was 4 basis points better than in non-C-Band markets. The strong momentum in the quarter, combined with the continued deployment of our C-Band network positions us well in 2024. The quality of the business we are writing in Consumer remains high as myPlan continues to drive premium plan adoption. The premium take rate in C-Band markets for the quarter was more than 10 percentage points higher than in non-C-Band markets. Consumer ARPA of $134.10 represents an increase of 4.7% year-over-year. This was driven by new customer additions, premium plan adoption and fixed wireless subscriber growth. We expect continued and healthy organic ARPA growth in 2024. \r\nOur prepaid results remained challenged in the fourth quarter. This is in part to seasonally weaker national retail sales volumes, which is the primary sales channel for our TracFone brands. We also continue to see pricing pressures from low-end postpaid offerings. Prepaid net losses for the quarter were 289,000. During the quarter, we saw continued strong growth within the Visible and Total by Verizon brands, which we will continue to scale. The team is also focused on our partnerships to improve the performance of the Straight Talk brand. We believe we're taking the right steps to better position our offerings in the market and expect to see some stabilization in 2024. \r\nVerizon Business delivered another strong quarter with 131,000 phone net adds which, as Hans mentioned, is our tenth consecutive quarter above 125,000. The Business Markets Group had its best phone net add performance in the last two years, demonstrating how our value proposition is resonating with small and medium businesses. Similar to Consumer, we are taking pricing actions in the first quarter in Business that could result in elevated phone churn in the period. However, we are confident that we will continue to deliver strong Business volumes in 2024. \r\nMoving on to broadband. We delivered 413,000 net additions in the quarter, continuing the pace of over 400,000 broadband net adds for the fifth consecutive quarter. We see strong demand for both our fiber and fixed wireless offerings, and we continue to see positive responses from customers regarding the quality and reliability of our services. In fixed wireless, we delivered 375,000 net adds for the quarter, growing the base to over 3 million subscribers. \r\nWe launched C-Band in early 2022 and our fixed wireless success in the last two years reflects the strong demand for high-quality broadband and the strength and reliability of our product. Notably, in the fourth quarter, over 80% of our consumer fixed wireless gross adds came from C-Band markets. The growth trajectory for fixed wireless continues to be robust, and we are ahead of schedule to achieve our 4 million to 5 million subscriber goal by year-end 2025. Fios Internet net adds were 55,000, down 4,000 year-over-year. We are pleased with the success of Fios with strong gross adds and retention, reflecting the quality and overall value of the product. We expect broadband subscriber momentum to extend into 2024 as we continue deployment of our C-Band spectrum, further expand our Fios footprint and bring new products and offers to the market. \r\nLet's now look at our financials. Consolidated revenue for the fourth quarter was $35.1 billion, down 0.3% year-over-year. This change can be attributed to the wireless equipment revenue, which was approximately 2% lower than the prior year as total postpaid upgrades declined by approximately 18%. Total wireless service revenue was $19.4 billion, up 3.2% year-over-year. Strong revenue benefited from targeted pricing actions, more customers selecting premium unlimited plans and growth in fixed wireless access. This was partially offset by pressure from prepaid, which reduced total wireless service revenue growth by approximately 70 basis points year-over-year as well as promo amortization. \r\nConsolidated adjusted EBIT in the quarter was $11.7 billion, a decrease of 0.6% compared to the prior year. Higher wireless service revenue and the benefits of lower upgrades were more than offset by higher marketing and bad debt expense and ongoing declines in business wireline revenue. Adjusted EBITDA margin of 33.2% was relatively flat year-over-year. In 2023, we implemented transformations within our Consumer customer care group as well as Business managed services. We are pleased with what we have achieved this year, and our cost-saving measures are meeting our expectations. We expect further progress on our cost efficiency program in 2024. Adjusted EPS was $1.08 in the quarter, resulting in full year adjusted EPS of $4.71. \r\nTurning to our cash flow summary. Cash flow from operating activities for the fourth quarter was $8.7 billion, bringing the total for 2023 to $37.5 billion. This marks the year-over-year improvement of over $300 million, primarily due to working capital improvements. CapEx for the quarter came in at $4.6 billion compared to $7.3 billion in the prior year. The full year CapEx totaled $18.8 billion, which represents a more than $4 billion reduction in capital spending from 2022 as we come down from our peak C-Band spending level. \r\nFree cash flow for the fourth quarter was $4.1 billion, bringing our year-to-date total to $18.7 billion, a $4.7 billion increase over the prior year, driven by operational improvements and the lower CapEx spending that we previously noted. We are pleased to have delivered on our guidance of more than $18 billion of free cash flow for the full year, which reflects our balanced and strategic approach to delivering profitable growth. \r\nNet unsecured debt at the end of the quarter was $126.4 billion, a $1.6 billion improvement year-over-year. Net unsecured debt increased sequentially primarily due to settling the $3.7 billion in incentive payments to satellite operators for our remaining C-Band spectrum. Our net unsecured debt consolidated adjusted EBITDA ratio was 2.6x as of the end of the fourth quarter, in line with the prior two quarters. \r\nWe expect deleveraging of the balance sheet to accelerate in 2024 as CapEx comes down to BAU levels, and we continue to generate strong cash flow. Additionally, we continue to benefit from our approach to managing long-term debt and have only $3.6 billion of unsecured debt maturing in 2024. Overall, I'm pleased with our momentum exiting the year and our performance in 2023, delivering an improved operational profile while also meeting our financial guidance. \r\nNow I want to take a few moments to look ahead and walk through our 2024 guidance. Our 2024 guidance demonstrates our expectations for accelerating wireless service revenue growth. As a reminder, the reported 2023 wireless service revenue growth of 3.2% included approximately 190 basis points of benefit from a reallocation of other revenues. Excluding this reallocation, the 2023 wireless service revenue growth was 1.3%. \r\nFor 2024, we expect total wireless service revenue to grow between 2% and 3.5%. This will be driven by anticipated positive postpaid phone additions to both Consumer and Business, continued fixed wireless access subscriber growth, further adoption of premium unlimited plans, growth in products and services and pricing action benefits. We expect consolidated adjusted EBITDA to grow by 1% to 3% versus the prior year. \r\nThis outlook reflects expected higher wireless service revenue and the impact of our cost transformation initiatives, partially offset by continued pressure in Business wireline revenues and increased wireless network operating expenses. Full year adjusted earnings per share is expected to be $4.50 to $4.70. As noted, we expect adjusted EBITDA to grow in 2024, offset by certain below-the-line impacts. \r\nSpecifically, higher interest expense is expected to impact adjusted EPS by $0.16 to $0.19, over 75% of which is driven by the continued reduction in capitalized interest related to the C-Band licenses being placed into service. In addition, EPS is expected to be impacted by approximately $0.07 to $0.09, of higher pension and OPEB expense, primarily due to the expiration of certain credits. This impact will flow through the other income and expense line on our income statement. We expect depreciation and amortization to be relatively flat in 2024 compared to 2023. \r\nOur adjusted effective income tax rate is expected to be in the range of 22.5% to 24% based on current legislation. As discussed in prior quarters, capital spending for the full year is expected to be between $17 billion and $17.5 billion, down from $18.8 billion in 2023. While we are not providing guidance on 2024 free cash flow, we wanted to provide some additional color to aid with your analysis. \r\nTailwinds to free cash flow will come from our adjusted EBITDA growth outlook as well as the expected $1.5 billion reduction in CapEx in 2024 based on the midpoint of our guided CapEx range. Offsets will be higher interest expense and higher cash taxes. As a reminder, the majority of the higher interest expense relates to reductions in capitalized interest. Such interest was recognized in cash flow from investing prior to placing the C-Band spectrum into service. \r\nThe higher cash taxes are primarily related to the continued phaseout of bonus depreciation in 2024 based on current legislation. Overall, we expect a strong free cash flow profile that will support our capital allocation priorities and position us for meaningful unsecured debt reduction in 2024, which we expect to come in the latter half of the year. \r\nWith that, I will now turn the call back over to Hans for his closing thoughts.\n\nHans E. Vestberg\n\nThank you, Tony. As you've heard today, we are confident and well positioned to deliver a solid 2024. Thanks to our best-in-class network, which is only getting better, we offer the mobile and broadband services that customers value and need the most. Our industry is critical to the next wave of innovation, and Verizon is ready to capitalize on the opportunity of the AI economy to bring this technology to live for all our stakeholders. \r\nAs I said in the beginning, we have the right team in place to execute the next chapter in Verizon's history. I'm proud of the work our team accomplished in 2023 and are excited what we will deliver in 2024. Our results in C-Band market speaks for themselves and support our investment decisions, and we're going to lean in further as we expand into suburban and rural markets while maintaining the financial discipline you come to expect from us. We will continue to stay very close to our customers to understand their needs and preferences so that we can offer the right promotions at the right times in the right markets. \r\nWe have the right people, the right assets and the right strategy. Our focus for 2024 is on execution. It's a winning combination, and we are very confident heading into this year. \r\nFinally, I want to remind you that we are hosting an investor event on February 5 and encourage everyone to tune in to the webcast. Given the financial update today, next month will be more of an operational and strategic update on the company. \r\nNow Brady, we are ready to take questions.\n\nBrady Connor\n\nThanks, Hans. Brad, we're ready for the first question.\n\nQuestion and Answer Session\n\nOperator\n\nWe will now begin the question-and-answer session. (Operator Instructions) The first question will come from John Hodulik of UBS.\n\nJohn Christopher Hodulik\n\nI'd love to drill down on a couple of things. First, the sub trends, 17% growth is some real momentum. I know, Hans, you talked about a number of sort of potential drivers. But if there's anything you could sort of be specific and sort of talk about what drove that in the quarter? And is that likely to continue, also the account growth, is that likely to continue? And then you talked about some churn on the price increase. Anything you could say about sort of the net add momentum as we look into '24? That's first. \r\nAnd maybe for Tony, nice service revenue growth. Any additional info you can give us to sort of unpack that in terms of the price increase impact versus last year and what you're seeing in terms of Tier, that would be great.\n\nHans E. Vestberg\n\nJohn, thank you for the question. So let me start about the subs then. On the Business side, tenth quarter in a row, more than 125,000, Kyle and the team is doing a great job where our network is performing so well. So our customers just continue to buy in with us, not only that. Our offerings in our go-to-market is as strong as ever. So we feel really good about what Kyle and the team is doing. \r\nOn the Consumer side, yes, we had a good fourth quarter. But you have seen also all through the year that we have sequentially improved all the time. Everything started where -- we started with a new offering myPlan, which resonates with the market, very much consumer insights in it. Then on top of that, Sampath has done a lot of changes in our structure all the way from the go-to-market, the incentives in our stores and our decentralization of it. \r\nSo it hangs together all the way. So I think the most important, we have the right offerings in the market, and that has really resonated on the Consumer side. So I'm really happy with the team. We will continue to execute on the plan we have, and we have started.\n\nAnthony T. Skiadas\n\nJohn, it's Tony. So just to add on to what Hans mentioned. We did really well in Tier 1 markets. As we mentioned in the prepared remarks, about 8 percentage points better and we were also net add positive in both Tier 2 and Tier 3 markets as well. We improved our competitive positioning against all providers. We continue to build out C-Band, as we said earlier in suburban and rural markets, and we see further opportunity there. And as Hans mentioned, we had strong momentum in the VBG side as well, on both mobility and FWA, so good results. \r\nAnd then on your question on service revenue. So we feel really good about the shape of service revenue in 2024. The guidance that we gave of 2% to 3.5% reflects accelerated growth, and we talked about the jump-off point of 1.3% in the prepared remarks. The midpoint of our guidance range implies over $2 billion of service revenue growth. If we think about the assumptions in the guide in terms of tailwinds, as you know, we've executed a number of pricing actions, both in the back half of 2023 that do carry into 2024 as well as in recent weeks, we've taken further pricing actions in both Consumer and Business that provide a tailwind. \r\nWe also have an improving volume profile in our Consumer business. As we said in the prepared remarks, we expect to have positive phone net adds in consumer in 2024 and stable business volumes as well. And then the third tailwind I'd point to is an increasing contribution from fixed wireless access. We have really good momentum and over 3 million subs in the base. \r\nIn terms of headwinds, prepaid, has been a drag on service revenue both in the fourth quarter and the full year was about $142 million in the fourth quarter, and we expect the prepaid headwinds to continue into 2024 as we stabilize that business. And then on promo amortization, that continues to be a headwind with the increase in 2024, similar to the increase we experienced in 2023. But when you put that all together, we like the trajectory of service revenue.\n\nOperator\n\nThe next question comes from Simon Flannery of Morgan Stanley.\n\nSimon William Flannery\n\nJust following up there on the fixed wireless. Could you just give us a little bit of color around how the churn is performing? What are you seeing in terms of those cohorts that have had this service for some time and any comments on sort of capacity and so forth. \r\nAnd also, are you seeing emerging seasonality in this product driven by strong back-to-school in Q3 and then maybe a little bit softer in Q4. And then anything you can -- color you can provide on your exposure to ACP and how that may affect you and your latest thoughts on the BEAD program.\n\nHans E. Vestberg\n\nOkay. Thank you. On the fixed wireless access, I think the product is maturing. We're now past 3 million subs, both on the Business side and Consumer together. Clearly, the rollout and the product is unique. It has -- it resonates so good in the market, simplicity of the product and installing it, which was the -- which was our idea. And even if we took out the discount that we had in the third quarter, we haven't seen any slowdown. The product is resonating so well. \r\nWe are constantly improving it. The NPS is really high on the product. And as I said so many times before, for us, is to keep the same volume right now because that -- we are demanding our capacity, or our capital in the best way. It's the most efficient way. So we will continue to be in these levels, and we think they are very important. \r\nAnd hoping that, of course, that our consumers using fixed wireless access that, they are using the network as anybody else. And as I said before, we have dimensioned the network to handle it, so that's not the challenge. And the most important for us is that we have fiberized all our network, and so we can transport all the data. The guys are doing a great job on fixed wireless access across the board.\n\nAnthony T. Skiadas\n\nYes. And then just one additional point there. So the longer-dated churn, Simon, is very strong, and we're very pleased with the progress thus far. \r\nOn your other question on ACP, just maybe a few points to make here. The guidance assumes that the ACP funding remains intact. In the event the funding goes away, we have plans to address it, and we'll see what happens there. The majority of the exposure on ACP is in our prepaid business. We have about 1.2 million prepaid subs that benefit from the ACP program, and that's less than 10% of our prepaid base. On the postpaid side, we have minimal exposure to ACP, both Fios and postpaid wireless. And the margin exposure from ACP is very, very small.\n\nHans E. Vestberg\n\nAnd on the BEAD program, we will participate when that comes out in the market where we see we can compete and where we see good return on investment. We have already won a couple in the early stages, but we expect that this will roll out over years to come. And -- but again, we will see that we participate when it makes sense for us, usually -- or not usually, always with financial discipline.\n\nSimon William Flannery\n\nGreat. And just one follow-up on the fiber build, is that again about 500,000 homes passed this year?\n\nAnthony T. Skiadas\n\nYes, Simon, it will be a little bit over 400,000 next year.\n\nOperator\n\nThe next question comes from Phil Cusick of JPMorgan.\n\nPhilip A. Cusick\n\nI think you said you expect postpaid phone positive for the year. What's the durability of Consumer growth? Could that also be positive for 2024? And remind us the impact that price increases tend to have on churn over the last couple of years. \r\nAnd then second, maybe you could just dig into where your gross adds are coming from, the improvements as you're doing better there. Churn has sort of been in line, but gross add is doing a lot better. If you could dig into that. Is there any significant shift in where customers are coming from, maybe from myPlan?\n\nHans E. Vestberg\n\nI can just start by saying but I'm going to hand it over to Tony. I think you're spot on. On myPlan, and I said it in my opening remarks, stellar performance so far on myPlan. But it's not only that the plan is good, it's both flexible, you have cost control and our customers get value of it. \r\nAnd I think that goes back to the -- what I talked about for years, disciplined approach, but also very segmented. And that's what's happening right now, and we can see that we allocate money to the right product to the right customer in the right market. So there's a lot of that. But Tony will give you a little bit of rundown on the numbers.\n\nAnthony T. Skiadas\n\nSure. So just, Phil, on the churn. I mean, obviously, we'll see a little bit of an uptick from the pricing changes we made in both Consumer and in Business. And those changes were announced in the last few weeks. And then as Hans mentioned, we really had good performance in Consumer. You saw the gross add number at 17% and 10% for the full year, and that's despite being in a much lower upgrade environment as well, so we feel really good. \r\nLike I said earlier, the Tier 1 markets were very strong, and we see further opportunity as we build out C-Band, the churn profile is much better. The ARPA is much better. So we're very comfortable with what we're seeing so far with C-Band and the performance.\n\nPhilip A. Cusick\n\nAnd in terms of the durability of postpaid and growth there?\n\nAnthony T. Skiadas\n\nYes. Look, we said we're going to be postpaid phone positive in Consumer in 2024, and we'll also continue to see strong momentum in Business as well. We did 562,000 net adds this year. And Kyle and the team did a great job, and we expect continued solid growth from the Business side as well.\n\nOperator\n\nThe next question comes from Michael Rollins of Citi.\n\nMichael Ian Rollins\n\nJust one more on wireless pricing. Can you provide some additional context on how you're seeing the competitive landscape evolve with respect to pricing? And how Verizon is trying to balance the volume versus price equation as you look out from the recent pricing actions that you've taken? \r\nAnd then second, can you provide an update on how much the cost-cutting program yielded in '23 and how much you can capture it in '24 relative to the previously articulated target?\n\nHans E. Vestberg\n\nThanks, Mike. I think when it comes to our pricing and our promotions, I think we look more about we are the leader in the market. We look at the different segments we have to see that we have the right offerings for our right customer with the right value. That's the focus we have had for, I would say, the last two years, very much focused on our customer base and the consumers and the customers we can attract the Verizon. \r\nAnd so far, that disciplined approach we have, you saw the fourth quarter, for example, we invested in a little bit more because we have really good momentum. So sometimes, we're going to invest more, but it's always going to be with a return on investment in mind to see that we're doing the right for all our stakeholders. So that's the focus we have on the pricing we have, both on broadband and on wireless. \r\nOn the cost program, '23 was a big year for us. You probably are following all our press releases, but we did a lot in customer care. We did a lot with managed services without sourcing the HCL, we implemented some really large IT systems and application that's going to be a fantastic platform. We continue to deploy our offshore centers and being even stronger and using that as a platform on the basis that we created Verizon Global Services, the 1st of January '23. So I'm really pleased with the platforms, and that means we're on track for the savings we talked about, going into '24. It's more about the same. Tony?\n\nAnthony T. Skiadas\n\nSure. So just to add a couple of things here. So on 2023, we delivered about $300 million to $400 million in savings. And as Hans mentioned, we expect the program to ramp in 2024, and the savings are contemplated in the guide. Portion will hit the bottom line while also giving us the flexibility to invest in the business. And I think you saw that in the fourth quarter and the results speak for themselves. \r\nWe're not going to give specific cost targets, but what -- in addition to what Hans mentioned, we have work going on in IT platform transformation, in real estate and fleet optimization and we're also opening up shared service center in Ireland. So we feel really good about the cost actions that are driving the EBITDA improvements that you see in the guidance for this year.\n\nMichael Ian Rollins\n\nAnd just one other. Where are you in the process of restructuring of the Business wireline operations? And how close are you to an inflection where that segment can stabilize financially or potentially, eventually grow at some point?\n\nHans E. Vestberg\n\nThank you, Mike. No, that's a big focus for us. We have the secular decline, and we've had that for quite a while. So there's nothing new and nothing new to that story. But our cost efficiency is, of course, happening very, very quickly. And the team is doing a great job. Not only that, we also see that we have the right pricing for our customers and also seeing where we don't have great contract we have decided to walk away from them. \r\nSo very much tackling, blocking and tackling to see that we'll continue to improve. And of course, our target is to get that to sort of being neutral to our P&L over time. And that is one of the important pieces for getting the 25% of the Verizon Business Group in EBITDA, but not only that, of course, we're offsetting that by growing our wireless business and our broadband business. \r\nSo typical management of a product portfolio, and I would say Kyle and the team is doing a great job with the full support from Tony and me.\n\nOperator\n\nThe next question comes from Frank Louthan of Raymond James.\n\nFrank Garrett Louthan\n\nSo you've made a lot of changes in the last year to kind of retail marketing to correct some of the past periods. You now got a new CMO. What can we expect her to be doing differently? Should we see this as another reset or change of direction? How should we think about that adjustment?\n\nHans E. Vestberg\n\nYou're right. Last year, we did a lot of changes. But looking at the result, I think many of the changes was absolutely right, all the way from our structural changes to go to market, the products. And also, we did quite a lot of management changes, getting the -- many of the executive new positions, including the recruiting a new CMO, Leslie Berland. We are excited to have her on. \r\nI think where we are with our brand and with our offerings, we're in a great place. But you cannot see still here, and that's why we recruited Leslie. Leslie will work with the full team to see how we continue to refine the leadership in the brand because we are the number one brand in the market, we're just going to refine that. But we're not going to sit still. So I think Leslie has been over two weeks. So I see a lot of great initiatives and ideas, and we will work together with her, to make this company even better.\n\nOperator\n\nThe next question comes from David Barden of Bank of America.\n\nDavid William Barden\n\nA couple, if I could. Just the first, you went out of your way to highlight how well fixed wireless access is doing in the C-Band markets. These are kind of the main markets, probably the densest markets. Obviously, we're going to see the C-Band deployment expand both in terms of spectrum density and in terms of geography. 350 has been kind of the baseline expectation for fixed wireless access adds in the current C-Band deployment. Would you be willing to put a stake in the ground? Where could that go? Could that double by the time we get the full C-Band deployment out there by the end of next year? That's the first question. \r\nAnd I guess the second question. Tony, you gave us the kind of moving parts, the EBITDA growth 2%. That's about $0.75 billion after tax. Interest expense at $0.175, that's about $3 billion -- $0.75 billion after tax, $1.5 billion CapEx savings. So the big moving part that none of us really know is the cash tax and how that might impact free cash flow, whether free cash flow could be up a little bit, down a little bit. Could you be more transparent around that moving part?\n\nHans E. Vestberg\n\nThank you, David. When it comes to fixed wireless access, yes, when we got the C-Band, the initial chunk of spectrum got was in urban places. Now since the end of the third quarter, we got the suburban and rural areas. But we continue at the end of the year to strengthen our urban area. So now we're sort of deploying much more in the suburban and rural. That creates a new opportunity for us, both from our strength in wireless in many of those markets together with our fixed wireless access. \r\nBut I said it many times before, for us, it's very important to have a certain volume and a certain cadence because we can optimize our resources, our capital, et cetera. So Tony and I feel really good about being around 400,000 net adds for broadband in total, including Fios. \r\nThat has sort of been a mantra, that can be, of course, coming up and down a little bit, but it's not like we are forcing a lot of capital and resources in the quarter and then doing less, that's not efficient in a company like ours. We are very financially disciplined, as you know. And that's best for our customers and for our stakeholders, like shareholders. So that's what you're going to expect from us.\n\nAnthony T. Skiadas\n\nAnd Dave, just on your -- question on cash taxes. So we said we're going to be pressured by the phaseout of bonus. We did see a tax benefit in 2023 from the spectrum clearing payments. And if you think about the headwind, we'd see it at about $2 billion right now, and we'll have to see how things play out with what the proposed legislation is.\n\nOperator\n\nThe next question comes from Craig Moffett of MoffettNathanson.\n\nCraig Eder Moffett\n\nI wonder if you could talk about your market growth expectations for postpaid coming into the year. I know you're the first one to report. So we haven't seen the results from anyone else yet. But what's your sense of what we can expect in terms of total postpaid and maybe total phone growth for 2024 market-wide?\n\nHans E. Vestberg\n\nThank you, Craig. If I think about this year, I mean, first of all, mobility in broadband is two of the most important infrastructure in the country. And I don't think it's any one company, person or organization can live without those services. We are the number one in basically everything we're doing. \r\nI think it's a healthy industry. It's an important product we have, then it can come up and down. So I cannot give you a percentage of what's going to happen. I think our offering is great. I think the product is so important, both mobility and broadband for all parts of our society. I wouldn't like to be in any other business, and it's sort of so important for our society that mobility and broadband is working.\n\nCraig Eder Moffett\n\nAnd can I just maybe drill down a little bit though? I mean the growth numbers we've seen have been as high as 6 million plus, is that a feasible growth rate? Population growth, including immigration is more like 3 million. Is your sense as you go into -- your own expectations for the year, that we'll see some deceleration? Or is your sense that there's still something going on that's keeping growth so far in excess of population growth?\n\nHans E. Vestberg\n\nI think that we're going to -- whatever number is going to be, we're going to get our fair share of it and that's what we are aiming for. But you're right, of course, immigration is lower. So the pool is smaller, but we've also seen a really good uptake between value segment to postpaid. So there's a lot of factors coming in. \r\nAnd then, of course, what we have done when we think about offerings, we have myPlan, we're adding the perks for example, in Netflix and Max. We are expanding also ARPA because we have such a great offering to our customers. So this is a new time. But again, the product is so important for the market and for each and every one of us. So I feel really good about coming into this year, what we have done and where we go, and let's see where we end up.\n\nOperator\n\nThe next question comes from Kannan Venkateshwar from Barclays.\n\nKannan Venkateshwar\n\nSo maybe a couple. I guess, firstly, on the fiber side, Hans, as you think about the base of fixed wireless subscribers. By next year, you'll have a pretty big critical mass overall of 5 million-plus potentially. And it's not too far away from where your Fios base is. And you have deep money coming in, potentially, there's more interest from private equity funds and so on and so forth. \r\nAnd I know you've talked about being a lot more disciplined on fiber, but does your breakeven threshold change just given the kind of critical mass you get to in fixed wireless and also the kind of capital alternatives that we are starting to see in the market? That's one. \r\nAnd secondly, on the wireless side, over the last two or three years, I mean, obviously, there's been a pretty big tailwind to service revenue from prices and explicit price increases. So your thoughts on how long that can continue. And when does mix take over and become a bigger component overall from a service revenue growth perspective? And how we should expect that transition to happen would be helpful.\n\nHans E. Vestberg\n\nThank you, Kannan. Yes, I have to go back a little bit when it comes to our broadband strategy. We have a multipurpose network. We build the network once and we have multiple options at the edge. That was sort of the infancy of the Verizon Intelligent Edge Network. From the data center to the edge, we have harmonized everything. We have fiber in between everything. We have multi routers. We have one transport network. That is super important, it's sort of the brain of the network. Then at the edge, we have optionality, what type of access we have. In the ILEC, of course, we're going to continue with our success in Fios and outside, we're doing fixed wireless access. \r\nBut it gives us optionality over time. I like honest economics. I think that, that makes us very competitive in pricing and offerings to our customers. There are, of course, a lot of offerings from people that want to ship in capital. But ultimately, it has paid off for us to be very, very prudent in financial discipline with our own money. But you can never outrule, but that's really my view on it. But I'm creating optionality with the network and Joe and his team are super agile if we need to be within that. \r\nOn the wireless, I would say, I mean, if you look at our Business side, they have great offerings in the market. They have taken the fair share over 10 quarters, and then have also made new offerings so they can expand. So I think they both have done quantity and value. And wireless, of course, on the Consumer side, they have historically have more ARPA increase with new offerings, new pricing, new products, rather than volumes. But you have seen us performing in the last part of the year. \r\nAnd I think Sampath and his team, they have said that they want to increase the part of getting new customers. But again, it will be financial discipline, and we should get the right customers. And if you look at our quality of our Consumer base, it's just amazing, and we will continue to be financially prudent on that. But clearly, we want to have more volumes and -- but not to any cost, we will do it with the right cost and the right product to our customers.\n\nOperator\n\nThe next question comes from Peter Supino of Wolfe Research.\n\nPeter Lawler Supino\n\nOn the subject of consumption and network utilization, I wondered if you could update us on the number of gigabytes per month that postpaid phone customers are consuming nowadays and extending that thought over the next few years, does that growth and the robust FWA business that you're building suggests that we should prepare for densification or other radio access network or spectrum costs for capacity over the next several years, certainly not a 2024 question.\n\nHans E. Vestberg\n\nYes. I'll go back to how we build the network because building the network is so very important because the biggest challenge with a lot of traffic is, of course, transporting it in an efficient way, having your own fiber and that we've already built. \r\nWhen it comes to the growth in the network, yes, everybody is using the network more. It's no different between fixed wireless access and Fios. And of course, wireless consumers are using the network more as well. But we have built a very stable network all the way from the data centers to the edge. And then, of course, we have assets that nobody else has. We have a lot of our traffic on millimeter wave, which is the cheapest way to deliver data in the market by far and we have our C-Band just coming out. So -- and we have our best engineers. So I feel really good with that people and customers are using our network more. That's what this was intended for, and we have designed it like that.\n\nOperator\n\nThe next question comes from Bryan Kraft of Deutsche Bank.\n\nBryan D. Kraft\n\nI had two, if I could. First, following up on John's earlier question, can you give us a sense for how much of the year-over-year improvement in gross adds in the fourth quarter was the result of healthy industry volumes versus the improved execution and product that you've got in the market now? And additionally on that, did you see stronger performance in December versus the rest of the quarter? I asked because I think your last public presentation was in early December, and your results seem to even more positive than your tone back then. So it seems like maybe you picked up momentum as the quarter progressed. \r\nAnd then I just had a separate question on the issue of lead cables. I was wondering if you would comment on the latest media report that the EPA has conducted its own testing, some of your lead sheet cables that have shown lead levels above EPA standard for safety. Any sense for whether these reports are accurate? And if so, how you're thinking about the potential impact at this point around this issue?\n\nHans E. Vestberg\n\nYes. Thank you, Bryan. Let me start with the market in the fourth quarter. We don't know. I mean the others haven't reported. We only know that we have performed really well. And -- but that has been -- it's not a one quarter phenomenon. If you think about from the second quarter, third quarter, even in the first quarter, we were sequentially improving all the time, and we have done that in a disciplined ways with a lot of actions and that we need to keep up. \r\nSo -- and then the comment on how the quarter shaped so you probably talk about consumer more than anything else. I think we're solid through the quarter, there was nothing sort of different during the month in the quarter. We were solid through the quarter, doing well performance. \r\nOn the lead. As I said before, we take that very seriously. I cannot comment what media is doing. We work with all the agencies and see that we are following this up and we have revealed all the information we have. So we don't have any more. We have also disclosed how much lead cable we have in the network, which is very little. But again, we take it seriously and we work with all the agencies.\n\nOperator\n\nYour last question will come from Walter Piecyk of LightShed.\n\nWalter Paul Piecyk\n\nHans, this is -- I apologize, probably the fourth time you're coming back to the gross add question. But I think earlier, you made mention of kind of the change in structure from nationalization to localization. I think that was something that Sampath had kind of stated as one of his specific things and probably something that maybe, could be more sustainable than just a change in a rate plan that obviously could be replicated or just addresses the market. So just a couple of questions on that. \r\nFirst, if you think about kind of the ramp in fourth quarter, I know this is kind of a soft question, but like the impact of localization, and that's change in the structure of the sales organization versus myPlan, which had a larger impact. And then, I guess, more importantly, the sustainability, meaning that, yes, you typically do see sequential growth seasonally around this time of the year. Obviously, more pronounced this year than past. \r\nBut are we going to see even more sequential growth or more abnormal growth in the first half of the year as some of the implementation of that localization continues? Or have we largely already seen that impact as we go into 2024?\n\nHans E. Vestberg\n\nWalt, I think that was -- it's a good question. So the whole -- remember, we started with the network as the C-Band is sort of rolling out in different ZIP codes all the time, we are engaging locally. The same we did with the Consumer group to be much more local, to be able to do local marketing, cater forward the local market, have local flavors of our marketing. We worked with a sports league like NFL and the teams in different markets to see that happen. \r\nSo of course, I'm going to attribute part of our growth during the year to the decentralization. But we just got started to see that we have that team in place and Sampath and the team are working with them with his market precedent -- make it. But it's also a sign of where the market is going. You need to be local, and you need to be on the ground in the different societies in order to perform and be knowledge. And Verizon is most visible in all the grounds and now we're taking next step with our structure. So very pleased with what I've seen so far, but more to be done.\n\nAnthony T. Skiadas\n\nYes, Walt. I'll just add on to what Hans said. The regional structure is a lot closer to the customer, and we've run the business this way for many, many years. And we can do things like different promos for different markets and local resources and decision-making and the localization offset some of the price up as well. So we feel really good about where we're heading, especially with the Tier 2 and Tier 3 rollouts with C-Band and the opportunity that provides.\n\nWalter Paul Piecyk\n\nTony, can you also remind us when the Board considers share repurchase as it relates to leverage? And I think the leverage that you mentioned earlier in the call excludes the unsecured debt because you were referencing a 2.6 number. So assuming we're basing it off the 2.6 number, I think your target -- your long-term target was 2.0. So clearly, you wouldn't let it go below 2.0 before you start buying stock back, but is there a consideration under 2.5 where the Board starts to consider share repurchase?\n\nHans E. Vestberg\n\nThank you, Walt. I think this is something that we are being very disciplined. Our capital allocation priority is clear. Number one, money to the business, basically our CapEx; number two, continue to put the Board in a place so they can continue to increase our dividend and then number three paying down debt. \r\nWhen we come down to 2.25 we have said we will start considering buybacks, but our ultimate long-term goal is to get around 2. So yes, that's the plan. But of course, it will play in where the market is, where the interest rates are, where the capital is and where our equity is. But clearly, that's the plan we have right now, and the Board is fully tuned to that plan.\n\nBrady Connor\n\nYes. Thanks, Walt. Brad, back to you.\n\nOperator\n\nLadies and gentlemen, this concludes the conference call for today. Thank you for your participation and for using Verizon Conference Services. You may now disconnect.", "link": "https://finance.yahoo.com/news/q4-2023-verizon-communications-inc-044154725.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.018, "neu": 0.822, "pos": 0.16}}, {"date": "2024-01-24T00:00:00+00:00", "title": "10,000 Customers Protest Verizon&#039;s Class-Action Lawsuit Settlement", "content": "Murphy Advocates has recently filed a new motion in an attempt to undermine the Verizon class-action lawsuit settlement.", "link": "https://investorplace.com/2024/01/10000-customers-protest-verizons-class-action-lawsuit-settlement/", "symbols": ["VZ.US"], "tags": [], "sentiment": {"polarity": -0.477, "neg": 0.215, "neu": 0.785, "pos": 0}}, {"date": "2024-01-23T22:57:28+00:00", "title": "Beyond the Magnificent 7 Stocks: 3 Underdogs to Watch in 2024", "content": "The positive future performance of the economy hinges on addressing concerns about businesses’ adaptation to post-pandemic dynamics. Efforts include renegotiating discounts with manufacturers as retailers seek to regain bargaining power. The effectiveness of these strategies and consumers’ response to potential price increases will play a pivotal role in fostering economic growth. The current economic performance of the United States is very positive and with continued doubt of a recession, you need to invest in these three underdog companies. These underdogs go beyond Magnificent 7 stocks, and take on a league of their own.\n\nMastercard Inc. (MA) Close up of a pile of mastercard credit load debit bank cards.\n\nSource: David Cardinez / Shutterstock.com\n\nMastercard Inc. (NYSE:MA) is a global payment solutions company, that provides electronic payment services to its clients. It currently trades for $439.75, a 12-month increase of 16.16%. With a 12-month median price forecast of $475.00 which is 8.1% more than its current price, analysts are bullish. Keeep in mind this is out of 40 analysts.\n\nThe global payment systems market is currently valued at $2.85 trillion and is forecasted to grow to $4.78 trillion by 2029, a CAGR of 10.88%. While macroeconomic and geopolitical uncertainty bothered investors, Mastercard’s strong and diverse business model spurred growth in Q3 2023 and continues to position it for growth in the future. In Q3 2023, Mastercard reported $6.5 billion in net revenue and $3.2 billion in net income, YoY growth of 14% and 28% respectively. It also achieved an operating margin of 58.8%, 4.8% higher than in Q3 2022. Additionally, Mastercard’s ROA of 40.78% is much higher than the sector median of 1.13% and also higher than its closest competitor Visa’s ROA of 19.09%, showcasing the effectiveness of Mastercard’s management team.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nMoreover, the company has been returning large amounts of capital to its shareholders. In addition to its dividend, which has been consistently growing since 2014 and currently yields 0.60%, Mastercard repurchased 4.8 million shares at a cost of $1.9 billion in Q3 2023. Then, in December 2023, Mastercard’s board approved another share buyback program worth $11 billion, effective right after the completion of its previous $9 billion program.\n\nStory continues\n\nVerizon Inc. (VZ) Verizon Wireless sign and trademark logo.\n\nSource: Ken Wolter / Shutterstock.com\n\nVerizon Inc. (NYSE:VZ) is a telecommunications company that provides users with cellular data and phone plans. It is a household name as the second largest telecommunications company. Up 1.9% YTD currently, it has a current price of $39.62.\n\nVerizon has seen an impressive increase in cash flow, with an Operating Cash Flow of $37.74 billion and a Levered Free Cash Flow of $17.85 billion. a total of 24 analysts have given it a price target of $41.32, higher than its current valuation. It has high debt, with a debt/equity of 179.71%. However, with increased revenue, profit, and cash flow, the debt is expected to get paid off.\n\nThe telecommunications sector is forecasted to reach $3.10 trillion by 2030 at a CAGR of 6.2%. This provides ample room for growth. Additionally, the continued roll-out of a widespread 5G network and packages with companies like Walmart, Netflix, Apple, etc. offers consumers a viable alternative to competitors. A high dividend rate also entices investors to hold the stock.\n\nThe cash flow is expected to increase, with the debt decreasing. Further expansions and partnerships open the possibility of future growth. Coupled with being perceived as undervalued and having a high dividend yield, it becomes clear why Verizon is a stock you should invest in over some Magnificent 7 stocks.\n\nCrowdstrike Holdings Inc. (CRWD) A sign with the Crowdstrike (CRWD) company logo\n\nSource: VDB Photos / Shutterstock.com\n\nCrowdstrike Holdings Inc. (NASDAQ:CRWD) is a leader in the cybersecurity space. It primarily sells subscriptions to its cybersecurity products, specializing in endpoint protection and cloud security. Trading at $298.66, Crowdstrike’s stock has exploded upwards by almost 181% in the past 12 months. The rally could still continue as Crowdstrike has 36 “Buy” ratings out of 46 analysts and no “Sell” ratings.\n\nIn the last quarter, Crowdstrike reported an ARR of $3.15 billion, a 35% increase YoY. While the company has been heavily growth-oriented, it still managed to be profitable for the last three quarters. Additionally, Crowdstrike has been improving its subscription gross margin as evidenced by its 78% GAAP subscription gross margin this quarter compared to 75% in the corresponding quarter of the prior year. These metrics combined with its D/E ratio of 0.386 show Crowdstrike’s strong top line, improving bottom line, and excellent liquidity. Magnificent 7 stocks are strong buys, but stocks like CRWD are also attractive.\n\nMoreover, Crowdstrike’s recent acquisition of Bionic, a cloud security platform, helps it be successful in protecting its clients from cloud exploitation. Now offering a complete cloud security solution, Crowdstrike can take full advantage of the quickly growing cloud security market. The acquisition also rounds out the company’s offerings since Bionic’s capabilities are integrated into Crowdstrike’s Falcon platform. Consolidating multiple cybersecurity solutions into one platform is appealing to many customers and could help Crowdstrike expand its client base.\n\nOn the date of publication, Michael Que did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nThe researchers contributing to this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article.\n\nMichael Que is a financial writer with extensive experience in the technology industry, with his work featured on Seeking Alpha, Benzinga and MSN Money. He is the owner of Que Capital, a research firm that combines fundamental analysis with ESG factors to pick the best sustainable long-term investments.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\n\nThe post Beyond the Magnificent 7 Stocks: 3 Underdogs to Watch in 2024 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/beyond-magnificent-7-stocks-3-225728526.html", "symbols": ["45C.F", "CRWD.US", "MA.US", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.017, "neu": 0.853, "pos": 0.13}}, {"date": "2024-01-23T21:28:53+00:00", "title": "US STOCKS-S&amp;P 500 notches third straight record high close", "content": "*\n\nVerizon up after upbeat FY forecast\n\n*\n\nGE's Q1 outlook disappoints, shares fall\n\n*\n\nNetflix rallies after hours following strong report\n\n*\n\nS&P 500 +0.29%, Nasdaq +0.43%, Dow -0.25%\n\n(Updates with stock moves following session end)\n\nBy Noel Randewich and Ankika Biswas\n\nJan 23 (Reuters) - The S&P 500 climbed to a record high close on Tuesday as investors digested a mixed bag of early quarterly results and awaited a slew of additional reports from Tesla and other companies later this week.\n\nIt was the third straight all-time high for the benchmark stock index, and many investors view upcoming quarterly reports from the heavily weighted \"Magnificent 7\" group of megacap companies as key to whether Wall Street's recent rally continues or loses steam.\n\n\"It's a crescendo of reports tomorrow and Thursday, and then next week will be even busier,\" said Art Hogan, chief market strategist at B. Riley Wealth. \"We've got a lot of things to contemplate over the course of this week and next that will likely will end up being a market positive.\"\n\nIn extended trade, Netflix rallied 3.2% after the video streaming service blew past Wall Street subscriber estimates in the fourth quarter, driven by a strong slate of shows.\n\nThe S&P 500 climbed 0.29% to end the session at 4,864.59 points.\n\nThe Nasdaq gained 0.43% to 15,425.94 points, while Dow Jones Industrial Average declined 0.25% to 37,905.45 points.\n\nVerizon Communications rallied 6.7% after forecasting a strong annual profit and posting its highest quarterly subscriber additions in nearly two years, while Procter & Gamble gained 4.2% after it topped second-quarter profit expectations.\n\n3M tumbled 11% after forecasting dour annual earnings, while Johnson & Johnson dipped 1.6% after reporting quarterly results just above expectations.\n\nD.R. Horton dropped over 9% after the homebuilder missed estimates for first-quarter profit.\n\nTesla climbed 0.2% ahead of its report late on Wednesday.\n\nStory continues\n\nAnalysts on average see S&P 500 fourth-quarter earnings up 4.6% year over year, compared to 7.5% growth in the third quarter, according to LSEG data.\n\nStock market valuations appear rich. The S&P 500 is trading at about 20 times forward 12-month earnings estimates, well above its long-term average of 16 times, according to LSEG.\n\n\"Earnings for all equity classes peaked and will move lower as the economy weakens and revenue growth stalls,\" Wells Fargo senior global market strategist Sameer Samana said in a note.\n\nWall Street's recent gains have been fueled by expectations of lower interest rates and optimism around artificial intelligence, which has helped lift the Philadelphia chip index over 5% so far in 2024, adding to a 65% surge last year.\n\nThe personal consumption expenditure (PCE) index - the Federal Reserve's preferred inflation gauge, as well as the S&P Global PMI readings and an advance fourth-quarter GDP print this week will be key in assessing the central bank's next interest rate decision when it meets on Jan. 31.\n\nThe Fed will wait until the second quarter before cutting rates, according to a Reuters poll, with June now seen more likely than May.\n\nAdvancing issues outnumbered falling ones within the S&P 500 by a 1.2-to-one ratio.\n\nThe S&P 500 posted 34 new highs and one new low; the Nasdaq recorded 102 new highs and 90 new lows.\n\nVolume on U.S. exchanges was relatively light, with 10.9 billion shares traded, compared to an average of 11.4 billion shares over the previous 20 sessions.\n\n(Reporting by Ankika Biswas, Johann M Cherian and Shubham Batra in Bangalore and by Noel Randewich in Oakland. Calif.; Editing by Pooja Desai, Maju Samuel and Aurora Ellis)", "link": "https://finance.yahoo.com/news/us-stocks-p-500-notches-212853872.html", "symbols": ["0KYY.LSE", "BAC.F", "BAC.XETRA", "GSPC.INDX", "MHL.BE", "MHL.DU", "MHL.F", "MHL.MU", "MHL.STU", "MHL.XETRA", "NFC.F", "NFC.XETRA", "NFLX.MX", "NFLX.US", "NFLX34.SA", "SPGI.US", "SPGI34.SA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.035, "neu": 0.854, "pos": 0.111}}, {"date": "2024-01-23T21:01:25+00:00", "title": "US STOCKS-S&amp;P 500 notches third straight record high close", "content": "*\n\nVerizon up after upbeat FY forecast\n\n*\n\nGE's Q1 outlook disappoints, shares fall\n\n*\n\nNetflix results on tap after the bell\n\n(Updates with close of trading session)\n\nBy Noel Randewich and Ankika Biswas\n\nJan 23 (Reuters) - The S&P 500 climbed to a record high close on Tuesday as investors digested a mixed bag of early quarterly results and awaited a slew of additional reports from Netflix, Tesla and other companies later this week.\n\nIt was the third straight all-time high for the benchmark stock index, and many investors view upcoming quarterly reports from the heavily weighted \"Magnificent 7\" group of megacap companies as key to whether Wall Street's recent rally continues or loses steam.\n\n\"It's a crescendo of reports tomorrow and Thursday, and then next week will be even busier,\" said Art Hogan, chief market strategist at B. Riley Wealth. \"We've got a lot of things to contemplate over the course of this week and next that will likely will end up being a market positive.\"\n\nAccording to preliminary data, the S&P 500 gained 14.11 points, or 0.28%, to end at 4,864.07 points, while the Nasdaq Composite gained 64.31 points, or 0.43%, to 15,425.30. The Dow Jones Industrial Average fell 95.77 points, or 0.25%, to 37,904.20.\n\nVerizon Communications rallied after forecasting a strong annual profit and posting its highest quarterly subscriber additions in nearly two years, while Procter & Gamble gained after it topped second-quarter profit expectations.\n\n3M tumbled after forecasting dour annual earnings, while Johnson & Johnson dipped after reporting quarterly results just above expectations.\n\nD.R. Horton dropped after the homebuilder missed estimates for first-quarter profit.\n\nNetflix rallied ahead of its report after the close of trading. Tesla traded lower for much of the session ahead of its report late on Wednesday.\n\nAnalysts on average see S&P 500 fourth-quarter earnings up 4.6% year over year, compared to 7.5% growth in the third quarter, according to LSEG data.\n\nStory continues\n\nStock market valuations appear rich. The S&P 500 is trading at about 20 times forward 12-month earnings estimates, well above its long-term average of 16 times, according to LSEG.\n\n\"Earnings for all equity classes peaked and will move lower as the economy weakens and revenue growth stalls,\" Wells Fargo senior global market strategist Sameer Samana warned in a note.\n\nWall Street's recent gains have been fueled by expectations of lower interest rates and optimism around artificial intelligence, which has helped lift the Philadelphia chip index over 5% so far in 2024, adding to a 65% surge last year.\n\nThe personal consumption expenditure (PCE) index - the Federal Reserve's preferred inflation gauge, as well as the S&P Global PMI readings and an advance fourth-quarter GDP print this week will be key in assessing the central bank's next interest rate decision when it meets on Jan. 31.\n\nThe Fed will wait until the second quarter before cutting rates, according to a Reuters poll, with June now seen more likely than May.\n\n(Reporting by Ankika Biswas, Johann M Cherian and Shubham Batra in Bangalore and by Noel Randewich in Oakland. Calif.; Editing by Pooja Desai, Maju Samuel and Aurora Ellis)", "link": "https://finance.yahoo.com/news/us-stocks-p-500-notches-210125575.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.038, "neu": 0.852, "pos": 0.111}}, {"date": "2024-01-23T21:00:00+00:00", "title": "Verizon recognized with Corporate Award of Excellence by Irving, Texas Mayor Rick Stopfer", "content": "Verizon Sourcing LLC\n\nIRVING, Texas, Jan. 23, 2024 (GLOBE NEWSWIRE) -- Today, Irving, Texas Mayor Rick Stopfer announced Verizon as the recipient of the Mayor’s Corporate Award of Excellence at the 2024 State of the City hosted by the Greater Irving-Las Colinas Chamber of Commerce. The Mayor’s Corporate Award of Excellence recognizes a company, organization or individual that exemplifies excellence in the work it does, the services it offers, the contributions it makes to the community and the commitment it provides to the city and its residents.\n\n\"Verizon exemplifies the spirit of collaboration and corporate responsibility, values that we hold in high regard in Irving,\" said Mayor Rick Stopfer. \"Verizon has long been a valued member of Irving's business community, contributing economically and philanthropically to the city. Their commitment to excellence, innovation and community engagement makes them a model winner of the 2024 Mayor's Award.\"\n\n“Verizon is honored to be recognized with Mayor Stopfer’s Corporate Award of Excellence,” said Verizon Market President Michelle R. Miller. “Irving has been our regional home for many years and we are proud of our long history with the city. It's where our employees work, play and serve the community and it is still a place where we see opportunity ahead of us.”\n\nFor more than 30 years, Verizon has had a corporate campus in Irving. Known as Hidden Ridge, the campus serves as a worksite for thousands of employees in varying functions including consumer, business and network. Hidden Ridge is one of seven engagement hubs for the company. The goal of these hubs is to create cultural centers where employees can come together, work together and connect with each other. The hub locations represent key business and talent markets for the company.\n\n“Verizon is a well-deserved recipient of the Mayor’s Corporate Award of Excellence,” said Beth A. Bowman, President and CEO of the Greater Irving-Las Colinas Chamber of Commerce and Irving Economic Development Partnership. “The team at Verizon have been valuable partners to the Chamber and Irving Economic Development Partnership, as we strive to take care of our member-investors and attract businesses to expand or relocate home to Irving-Las Colinas. Verizon has also been a great community partner and we thank them for their investment in Irving-Las Colinas.”\n\nStory continues\n\nSince 2017, Verizon has played an integral role in supporting education in Irving. Through Verizon Innovative Learning, over 24,000 students have been reached across 13 schools within the Irving Independent School District, equipping them with free technology, internet access and innovative STEM learning. 100% of eligible middle and high schools are part of the program. The district was also awarded nine Verizon Innovative Learning Labs, providing students and teachers access to emerging technologies such as augmented and virtual reality, 3D printing, and artificial intelligence. The multi-year initiative brings a project-based curriculum to help solve real-world problems in a custom-designed, experiential learning lab.\n\nVerizon’s holistic investment in the greater Irving-Las Colinas community – and across the nation – ladder back to Citizen Verizon, the company’s responsible business plan for economic, environmental and social advancement. Verizon is moving the world forward through action by expanding digital access and resources, protecting the climate, and ensuring people have the skills needed for jobs of the future.\n\nAdditional local investments made by Verizon include recent major upgrades to the network serving customers in the Dallas-Fort Worth Metroplex. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and pave the way for personalized customer experiences. Network upgrades to DFW include deploying new cell sites to extend coverage and capacity in local communities and 5G C-Band bandwidth upgrades, which has resulted in increased speeds across the DFW Metroplex.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $134.0 billion in 2023. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: \r\nJeannine Brew Braggs\r\njeannine.brew@verizon.com\r\n214-662-4430", "link": "https://finance.yahoo.com/news/verizon-recognized-corporate-award-excellence-210000785.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.005, "neu": 0.822, "pos": 0.173}}, {"date": "2024-01-23T20:59:55+00:00", "title": "Verizon beats on Q4 earnings, 3M down on full-year guidance", "content": "Verizon (VZ) beat expectations for its fourth-quarter earnings, with full-year wireless service revenue coming in at $76.7 billion along with a reported postpaid phone customer net addition of 449,000 customers.\n\n3M (MMM) posted its fourth-quarter earnings with positive adjusted earnings per share of $2.42 from sales of $8 billion, beating Wall Street expectations. However, shares of the stock sank over 10% on Tuesday after Wall Street analysts pointed out weak consumer demand and mixed industrial data. To assure shareholders, CEO Mike Roman said \"We will continue to invest in high-growth markets where 3M's unique capabilities can make a difference, including automotive electrification, climate technology, and industrial automation.\"\n\nYahoo Finance Anchors Josh Lipton and Julie Hyman break down the latest developments for these companies.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Nicholas Jacobino.", "link": "https://finance.yahoo.com/video/verizon-beats-q4-earnings-3m-205955635.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "MMM.BE", "MMM.F", "MMM.HA", "MMM.HM", "MMM.MU", "MMM.MX", "MMM.STU", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.459, "neg": 0.046, "neu": 0.889, "pos": 0.065}}, {"date": "2024-01-23T20:29:24+00:00", "title": "3 Dogs of the Dow With Dividend Yields Above 4%", "content": "The “Dogs of the Dow” strategy consists of investing in the 10 highest-yielding stocks in the Dow Jones Industrial Average. Purchasing the Dogs of the Dow creates higher dividend income, by focusing on high-yielding stocks.\n\nThe following three stocks are part of the 10 Dogs of the Dow for 2024. They are not the highest-yielding Dow stocks, but they are among the top 10 and also have strong dividend growth potential in the years ahead.\n\n3M (MMM)\n\nSource: Pavel Kapysh / Shutterstock.com Large\n\n3M (NYSE:MMM) is a diversified industrial manufacturer that sells more than 60,000 products. The company operates four separate divisions: Safety and Industrial, Healthcare, Transportation and Electronics, and Consumer. 3M is facing several lawsuits, including nearly 300,000 claims that its earplugs used by U.S. combat troops and produced by a subsidiary were defective. On Sept. 18, 2023, 3M agreed to pay $6.01 billion to settle lawsuits regarding the defective ear plugs. Additionally, the company is still waiting to hear if its $10.3 billion water utility settlement will be approved with more than 20 states.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nIn the most recent third quarter, revenue declined 3.6% to $8.3 billion, but this was $280 million above estimates. Adjusted earnings per share (EPS) of $2.68 was 33 cents more than projected. Adjusted organic growth fell 3.1% for the period. Health Care had organic growth of 2.4%, while Transportation and Electronics, Consumer, and Safety and Industrial were down 1.8%, 7.2%, and 5.8%, respectively.\n\n3M updated its outlook for 2023 as well, with the company now expecting adjusted EPS in a range of $8.95 to $9.15 for the year, up from $8.60 to $9.10 previously. 3M’s innovation is one of the company’s greatest competitive advantages. The company targets research and development (R&D) spending equivalent to 6% of sales (about $2 billion annually) to create new products to meet consumer demand. This spending has proven to be very beneficial to the company as 30% of sales during the last fiscal year were from products that did not exist five years ago\n\nStory continues\n\n3M is likely to generate enough cash flow to maintain its dividend. 3M has increased its dividend for over 60 years. MMM stock currently yields 5.5%.\n\nVerizon (VZ) 5G stocks, VZ stock\n\nSource: Ken Wolter / Shutterstock.com\n\nVerizon (NYSE:VZ) is a communication services stock and one of the largest wireless carriers in the country. Wireless contributes three-quarters of all revenues, and broadband and cable services account for about a quarter of sales. The company’s network covers about 300 million people and 98% of the U.S.\n\nOn Oct. 24, 2023, Verizon reported earnings results for the third quarter. For the quarter, revenue declined 2.7% to $33.3 billion, but this was in line with expectations. Adjusted EPS of $1.22 was 4 cents more than anticipated. Verizon had postpaid phone net losses of 51,000, but this was an improvement both on year-over-year and sequential basis.\n\nRevenue for the Consumer segment declined 2.3% to $25.3 billion, though wireless service revenue improved 2.9% due to higher average revenue per account. Broadband totaled 434,000 net new customers during the period, the fourth consecutive quarter of at least 400,000 net adds. Wireless retail postpaid phone churn rate remains low at 0.85%.\n\nVerizon reaffirmed guidance for 2023 as well with the company still expecting adjusted EPS of $4.55 to $4.85 for the year. Wireless service revenue is still projected to grow 2.5% to 4.5%. Free cash flow for 2023 is projected to be $18 billion, $1 billion higher than previously expected.\n\nThe strong free cash flow of the company fuels its high dividend payout. Verizon has increased its dividend for 19 consecutive years. VZ stock currently yields 6.6%.\n\nInternational Business Machines (IBM) Photo of IBM (IBM) building as seen through the canopy of a tree. IBM logo is in large letters on side of building.\n\nSource: shutterstock.com/LCV\n\nInternational Business Machines (NYSE:IBM) is a global information technology company that provides integrated enterprise solutions for software, hardware and services. IBM’s focus is running mission critical systems for large, multi-national customers and governments. IBM typically provides end-to-end solutions. The company now has four business segments: Software, Consulting, Infrastructure and Financing. IBM had annual revenue of about $60.5 billion in 2022.\n\nIBM reported solid results for Q3 2023 on Oct. 25, 2023. Companywide revenue rose 3.5% while diluted adjusted earnings per share climbed 22% on a year-over-year basis. Also, IBM’s revenue and earnings are being impacted by the strong U.S. dollar causing a 1.1% headwind. Software revenue increased 6.3% in comparable quarters due to 7% growth in Hybrid Platform and Solutions and a 5% increase in Transaction Processing. Revenue was up 8% for RedHat, 13% for Automation, 6% for Data and AI, and -3% for Security.\n\nThe firm launched watsonx for generative AI and machine learning. Consulting revenue increased 5% due to a 5% rise in Business Transformation, a 1% increase in Technology Consulting, and 7% growth in Application Operations. The book-to-bill ratio is a healthy 1.15x.\n\nFuture growth will be driven largely by acquisitions. So far in 2023, it has announced the purchase of StepZen and NS1. IBM has acquired 30 companies under the present CEO. Also, IBM is reinforcing its AI offerings as seen by the Apptio acquisition. IBM forecasts revenue growth in the mid-single-digits and free cash flow of about $10.5 billion in 2023.\n\nIBM has increased its dividend for 29 consecutive years, qualifying it as a Dividend Aristocrat. The 2023 dividend payout ratio of approximately 70% indicates a secure dividend. IBM stock yields 4.1%.\n\nOn the date of publication, Bob Ciura did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nBob Ciura has worked at Sure Dividend since 2016. He oversees all content for Sure Dividend and its partner sites. Prior to joining Sure Dividend, Bob was an independent equity analyst. His articles have been published on major financial websites such as The Motley Fool, Seeking Alpha, Business Insider and more. Bob received a bachelor’s degree in Finance from DePaul University and an MBA with a concentration in investments from the University of Notre Dame.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\n\nThe post 3 Dogs of the Dow With Dividend Yields Above 4% appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-dogs-dow-dividend-yields-202924416.html", "symbols": ["IBM.US", "MMM.BE", "MMM.F", "MMM.HA", "MMM.HM", "MMM.MU", "MMM.MX", "MMM.STU", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.026, "neu": 0.835, "pos": 0.139}}, {"date": "2024-01-23T20:15:00+00:00", "title": "3 Stocks to Consider After Beating Earnings Estimates", "content": "With the earnings season now in full force, valuable data to gauge the broader economy will be rolling in.\n\nBelow, I will share three stocks that posted earnings beats this morning, and that I think may be appealing additions to many investors’ portfolios.\n\nGeneral Electric\n\nIn 2023 General Electric GE stock recorded one of its best performances in modern history gaining 60% in the year. General Electric also enjoys a Zacks Rank #2 (Buy) rating reflecting upward trending earnings revisions. Following the high marks and impressive stock performance GE posted a strong quarter and full year of earnings.\n\nGeneral Electric reported Q4 earnings that exceeded expectations, with a 9% decrease in EPS to $1.13, surpassing the anticipated 28% drop. Revenue climbed 15% to $19.4 billion, beating expectations of a drop to $17.18 billion. Despite the positive results, GE stock opened lower after reaching a six-year high the previous day. However, by mid-day the stock rallied to unchanged, indicating strong buying pressure.\n\nThe company is undergoing a transformation into a pure-play aerospace company, planning to break out its power and renewables business as GE Vernova in April. GE's health care spinoff, GE HealthCare Technologies, debuted on the Nasdaq in January 2023.\n\nIn 2023, GE reported total orders of $79.2 billion, a 25% increase, and total revenues of $68.0 billion, a 17% rise. The profit margin increased by 1,640 basis points to 15.0%, and adjusted profit margin rose by 310 basis points to 8.8% organically. Full-year continuing EPS was $7.98, a significant improvement, and adjusted EPS reached $2.81.\n\nFor Q1 2024, GE expects high-single-digit revenue growth, adjusted EPS of $0.60 to $0.65, and free cash flow in line with net income growth.\n\nJohnson & Johnson\n\nJohnson and Johnson JNJ currently has a Zacks Rank #3 (Hold) rating, but was able to beat earnings estimates, nonetheless.\n\nJohnson & Johnson reported Q4 earnings and revenue that slightly exceeded expectations. The pharmaceutical and medical devices businesses experienced a surge in sales, contributing to a total of $21.40 billion in sales for the quarter, marking a 7.3% increase from the same period in 2022.\n\nStory continues\n\nNet income for the quarter was $4.13 billion, or $1.70 per share, compared to $3.23 billion, or $1.22 per share, in the year-ago period. Adjusted earnings per share were $2.29, slightly beating the expected $2.28. J&J provided a full-year guidance for 2024, anticipating sales between $87.8 billion and $88.6 billion, with adjusted earnings ranging from $10.55 to $10.75 per share.\n\nThe medical devices business generated sales of $7.67 billion, up 13.3%, while pharmaceutical sales reached $13.72 billion, with a notable contribution from drugs like Darzalex and Stelara.\n\nDespite challenges such as the loss of patent protection on Stelara, J&J remains optimistic about its pharmaceutical unit's growth, projecting a compounded annual growth rate of 5% to 7% between 2025 and 2030.\n\nJNJ stock is down (-1.2%) on the day, but is printing a large reversal candle, indicating strong buying interest. TradingView\n\nImage Source: TradingView\n\nVerizon Communications\n\nVerizon Communications VZ too has a Zacks Rank #3 (Hold) rating but is surging higher following earnings. VZ stock is up nearly 6% following the meeting.\n\nVerizon Communications reported Q4 earnings that met Wall Street estimates, with earnings per share of $1.08 on an adjusted basis, a 9% decrease from the previous year, and revenue of $35.1 billion, dipping 0.3%. Despite this, VZ stock rose to an 11-month high.\n\nThe key highlight was the addition of 449,000 postpaid phone customers, surpassing expectations and indicating momentum in the consumer market. Verizon CEO Hans Vestberg emphasized continuous improvement, particularly in postpaid phone net adds, marking the best performance in two years.\n\nDespite challenges, such as the loss of the \"best network\" marketing claim, Verizon aims for a balanced approach to growth and profitability in 2024. For the full year 2023, Verizon reported a total consolidated operating revenue of $134.0 billion, down 2.1% from the previous year, and full-year cash flow from operations increased to $37.5 billion. Consumer wireless service revenue saw a 3.2% YoY increase in Q4 2023, driven by pricing actions and higher adoption of premium price plans.\n\nThe company added 318,000 postpaid consumer phone customers in Q4, with the C-Band deployment contributing to improved performance. Verizon's focus on generating growth in service revenue, free cash flow, and EBITDA is part of its strategy amid industry challenges and changes.\n\nVerizon Communications is trading at a one year forward earnings multiple of 8.6x, which is below the industry average and below its 10-year median of 12x. It is also worth noting that the company pays a hefty 6.7% dividend yield to shareholders. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nGeneral Electric Company (GE) : Free Stock Analysis Report\n\nJohnson & Johnson (JNJ) : Free Stock Analysis Report\n\nVerizon Communications Inc. (VZ) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/3-stocks-consider-beating-earnings-201500324.html", "symbols": ["BAC.F", "BAC.XETRA", "GCP.F", "GCP.XETRA", "GE.MX", "GE.SW", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.024, "neu": 0.817, "pos": 0.159}}, {"date": "2024-01-23T17:57:07+00:00", "title": "How Verizon's Latest Earnings Could Boost Other Telecom Giants", "content": "In today’s market, a single earnings report can often set the tone for entire sectors. This is particularly true for Vanguard Communications Services Index Fund (NYSE:VOX), a sector known for its interconnectedness and shared market dynamics. With Verizon Communications (NYSE:VZ) being up 5% after reporting strong earnings this morning, it’s natural to wonder if this is good news for other telecom giants?\n\nAT&T\n\nAT&T (NYSE:T), with its dividend yield of 6.7%, has long been a favorite among dividend investors. Known for its widespread cellular and broadband services, the company has a strong presence in the communications market. AT&T’s dividend yield is particularly attractive, making it a compelling choice for income-focused portfolios. The company’s expansive infrastructure and ongoing investments in 5G technology underscore its commitment to maintaining a leading position in the telecom industry.\n\nDon't Miss:\n\nInvesting in real estate just got a whole lot simpler. This Dara Khosrowshahi-backed startup will allow you to become a landlord in just 10 minutes, and you only need $100. Commercial real estate has historically outperformed the stock market, but few investors have the capital or resources needed to invest in this asset class. A platform backed by industry giant Marcus & Millichap is changing that, allowing individuals to invest in commercial real estate with as little as $5,000.\n\nCrown Castle International\n\nCrown Castle International (NYSE:CCI), with its dividend yield of 5.8%, operates as a real estate investment trust (REIT), focusing on the ownership and management of communication infrastructure. CCI specializes in wireless towers and small cell networks, essential components in the ever-expanding wireless communication industry.\n\nWith a significant dividend yield, Crown Castle offers investors exposure to the strong demand for data and connectivity. The company’s extensive portfolio of towers, coupled with long-term leases with major wireless carriers, provides a stable revenue stream.\n\nStory continues\n\nAmerican Tower Corporation\n\nAmerican Tower Corporation (NYSE:AMT), with its dividend yield of 3.3%, is another major player in the communication infrastructure space. AMT operates a global network of wireless communication towers, with a significant presence in both developed and emerging markets. The company’s strategy of leasing space on its towers to multiple tenants, including wireless service providers and broadcasters, results in diversified revenue streams.\n\nLike CCI, American Tower also operates as a REIT, providing investors with a solid dividend yield. The ongoing global expansion of wireless services and the roll-out of 5G networks present growth opportunities for American Tower, potentially leading to increased dividends in the future.\n\nRead Next:\n\nCommercial real estate has historically outperformed the stock market, but few investors have the capital or resources needed to invest in this asset class. A platform backed by industry giant Marcus & Millichap is changing that, allowing individuals to invest in commercial real estate with as little as $5,000.  Collecting passive income from real estate just got a whole lot simpler. A new real estate fund backed by Dara Khosrowshahi gives you instant access to a diversified portfolio of rental properties, and you only need $100 to get started.\n\nImage Credit: Shutterstock\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nAPPLE (AAPL): Free Stock Analysis Report TESLA (TSLA): Free Stock Analysis Report\n\nThis article How Verizon's Latest Earnings Could Boost Other Telecom Giants originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/verizons-latest-earnings-could-boost-175707705.html", "symbols": ["0HEU.LSE", "0I4W.LSE", "8CW.F", "8CW.STU", "A0T.F", "A0T.STU", "AMT.US", "BAC.F", "BAC.XETRA", "C1CI34.SA", "CCI.US", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "T1OW34.SA", "VERZ34.SA"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.009, "neu": 0.86, "pos": 0.13}}, {"date": "2024-01-23T17:26:13+00:00", "title": "Why Verizon Stock Jumped 6% Today", "content": "Shares of telecommunications giant Verizon(NYSE: VZ) jumped 5.7% through 11:30 a.m. ET after meeting analyst forecasts for Q4 earnings and beating on sales Tuesday morning.\n\nHeading into its fourth and final quarterly report for 2023, Wall Street had forecast that Verizon would earn $1.08 per share (adjusted for one-time items) on sales of $34.6 billion. Verizon hit the earnings number on the nose and edged out sales projections, delivering $35.1 billion in sales for the quarter.\n\nVerizon sales and earnings\n\nBut not all the news was good. Sales for the final quarter of the year may have been better than expected, but they still declined slightly (down 0.3%) in comparison to Q4 2022. Adjusted earnings were also down year over year, and when calculated according to generally accepted accounting principles, Verizon actually lost money for the quarter -- $0.64 per share -- versus earning a GAAP profit of $1.56 per share in Q4 2022.\n\nThese results were both better and worse than Verizon's numbers for 2023 as a whole. For the full year, sales were down worse -- 2.1% to $134 billion -- but GAAP profits were positive $2.75 per share. (The bad news: This was barely half the $5.06-per-share GAAP profit that Verizon earned for all of 2022.)\n\nOn the other hand, Verizon scored a big increase in free cash flow (FCF) in 2023, with total cash profits for the year up 33% to $18.7 billion. If you ask me, that's the really good news today -- and the best reason for bidding up Verizon stock.\n\nWhere will Verizon be in 2024?\n\nNow what about 2024? How will Verizon aim to do even better this year than last?\n\nWell, first, the company needs to grow its business instead of shrinking it, and Verizon has a plan to do just that, aiming for somewhere between 2% and 3.5% sales growth in 2024. Management didn't give a GAAP number for this year's earnings target but did say that its adjusted profit should range from $4.50 to $4.70 per share.\n\nAnd here's the problem with that range: Its entirety falls below the $4.71 per share in \"adjusted\" earnings that Verizon says it earned in 2023! Thus, management appears to be planning to grow its sales but shrink its profits this year.\n\nStory continues\n\nNow, the good news is that Verizon does say its capital spending should be lighter this year than last (as little as $17 billion to $17.5 billion, which would be significantly less than the $18.8 billion Verizon spent on capex in 2023). If cash flow holds up, therefore (and with revenues growing again, it should), Verizon should be able to end up growing its free cash flow even if \"earnings\" take a hit this year.\n\nMy back-of-the-envelope math suggests FCF could even rise as high as $20.6 billion in 2024, which, when weighed against the company's $175.6 billion market capitalization, suggests Verizon stock is selling for a P/FCF ratio of only 8.5x current-year earnings. For a business growing at 2% and paying a 6.7% dividend yield, that seems a fair price to pay, to me.\n\nShould you invest $1,000 in Verizon Communications right now?\n\nBefore you buy stock in Verizon Communications, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Verizon Communications wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of January 22, 2024\n\nRich Smith has no position in any of the stocks mentioned. The Motley Fool recommends Verizon Communications. The Motley Fool has a disclosure policy.\n\nWhy Verizon Stock Jumped 6% Today was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/why-verizon-stock-jumped-6-172613549.html", "symbols": ["VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.058, "neu": 0.781, "pos": 0.161}}, {"date": "2024-01-23T17:22:00+00:00", "title": "Verizon Sends a Strong Signal. New Subscribers Were Why.", "content": "Telecom firm Verizon Communications reported fourth-quarter earnings in line with the consensus estimate.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1aa04f47-e30c-39dd-9f0b-1e39fa33a3b0/verizon-sends-a-strong.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-01-23T17:18:20+00:00", "title": "US STOCKS-S&amp;P 500, Nasdaq slip as mixed earnings weigh on risk appetite", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nVerizon up after upbeat FY forecast\n\n*\n\nGE's Q1 outlook disappoints, shares fall\n\n*\n\nP&G tops Q2 profit expectations, shares gain\n\n*\n\nFed to cut in Q2; economists less dovish than markets\n\n*\n\nIndexes down: Dow 0.51%, S&P 0.12%, Nasdaq 0.15%\n\n(Updated at 11:35 a.m. ET/1635 GMT)\n\nBy Ankika Biswas and Johann M Cherian\n\nJan 23 (Reuters) -\n\nThe benchmark S&P 500 and the Nasdaq edged lower on Tuesday as a mixed bag of earnings from industry bellwethers threatened to douse a recent rally, while the Dow dropped on the back of losses in 3M.\n\n3M tumbled 12.4% after forecasting dour annual earnings, while Johnson & Johnson fell 1.6% even after reporting quarterly results a nudge above expectations.\n\nD.R. Horton shed 9% as the homebuilder missed estimates for first-quarter profit.\n\nVerizon Communications rose 5.6% after forecasting a strong annual profit and posting its highest quarterly subscriber additions in nearly two years, while Procter & Gamble 4.4% as it topped second-quarter profit expectations.\n\n\"Earnings for all equity classes peaked and will move lower as the economy weakens and revenue growth stalls,\" Wells Fargo senior global market strategist Sameer Samana said in a note.\n\n\"In the near term, we expect pressure on earnings as well as prices with bouts of weakness and range trading.\"\n\nOf the S&P 500 companies that have reported results thus far, 86.6% surpassed earnings expectations, compared with 93.1% over a week ago, LSEG data showed.\n\nThe benchmark S&P 500 touched a fresh intraday record peak and closed at an all-time high for a second session on Monday, extending a bull-market run, fueled by strength in megacap tech and chip stocks.\n\nResults from the heavily weighted \"Magnificent 7\" group of megacap companies, along with other large tech-related companies, will be key in unlocking further gains in the S&P 500 and to assess if their rich valuations are justified.\n\nStory continues\n\nNetflix will report earnings after market close, while Tesla is due on Wednesday.\n\nThe blue-chip Dow also surpassed the 38,000-point mark for the first time on Monday, gaining for the third trading day.\n\nFurther, the personal consumption expenditure (PCE) index - the Fed's preferred inflation gauge, the S&P Global PMI readings and an advance fourth-quarter GDP print this week will be key in assessing the central bank's next policy decision when it meets on Jan. 31.\n\nWall Street had lost steam at the start of 2024, struck by a mixed bag of inflation data and Federal Reserve policymakers clamping down on market speculation of interest-rate cuts arriving as early as March this year.\n\nThe Fed will wait until the second quarter before cutting rates, according to a Reuters poll, with June now seen more likely than May.\n\nAt 11:35 a.m. ET, the Dow Jones Industrial Average was down 191.96 points, or 0.51%, at 37,809.85, the S&P 500 was down 5.85 points, or 0.12%, at 4,844.58, and the Nasdaq Composite was down 22.65 points, or 0.15%, at 15,337.64.\n\nAmong others, General Electric lost 0.9% after the engine maker's bleak quarterly profit forecast.\n\nRTX jumped 6.2% on a 10% surge in fourth-quarter revenue, while United Airlines gained 8.3% following an upbeat full-year outlook.\n\nDeclining issues outnumbered advancers for a 1.41-to-1 ratio on the NYSE and a 1.33-to-1 ratio on the Nasdaq.\n\nThe S&P index recorded 28 new 52-week highs and one new low, while the Nasdaq recorded 86 new highs and 67 new lows. (Reporting by Ankika Biswas, Johann M Cherian and Shubham Batra; Editing by Pooja Desai and Maju Samuel)", "link": "https://finance.yahoo.com/news/us-stocks-p-500-nasdaq-171820804.html", "symbols": ["BAC.F", "BAC.XETRA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "MHL.F", "SPGI.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.974, "neg": 0.065, "neu": 0.838, "pos": 0.097}}, {"date": "2024-01-23T16:37:28+00:00", "title": "Verizon Adds Most New Customers in 2 Years in Mobile Turnaround", "content": "(Bloomberg) -- Verizon Communications Inc. added more retail mobile customers in the fourth quarter than it has in any period since 2021, signaling a potential turning point for the phone giant that has been struggling to regain market share from competitors.\n\nMost Read from Bloomberg\n\nChina Weighs Stock Market Rescue Package Backed by $278 Billion India Tops Hong Kong as World’s Fourth-Largest Stock Market Netflix Pays $5 Billion for ‘Raw’ in Bet on Live Events An Isolated Israel Doubles Down on War in Gaza — At All Costs Hong Kong Stocks at 36% Discount Show True Depth of China Gloom\n\nVerizon’s consumer group added 318,000 mobile subscribers in the three months ended Dec. 31, the company reported Tuesday in a statement, beating Wall Street’s estimates of 95,900. The net gain, the first one after three down quarters, comes as the New York-based company works to win customers lost to rivals AT&T Inc. and T-Mobile US Inc.\n\nVerizon had fallen behind its wireless peers in subscriber growth for years, after costly purchases and strategic missteps allowed competitors to take its share in the already-saturated mobile market.\n\nLast March, the company placed nine-year company veteran Sowmyanarayan Sampath in charge of the consumer division, which represented 76% of Verizon’s revenue in the fourth quarter. Sampath has hiked prices and introduced flexible pricing plans in a bid to restore growth. He has a target of about 1 million new customers a year.\n\n“We made significant changes to how we operate and to our team, and those changes paid off,” Chief Executive Officer Hans Vestberg said during the company’s earnings call.\n\nRead more: Verizon Turns to Inside Fixer to Pull Mobile Giant Out of Slump\n\nChief Financial Officer Tony Skiadas attributed new consumer pricing tiers and bundles that include perks like Netflix and Max to the new customers and growth. Thirteen million people now subscribe to the new pricing plan, known as myPlan, Skiadas said in an interview.\n\nStory continues\n\n“We see really great progress with myPlan,” Skiadas said. “Our offers resonated with customers.”\n\nShares in New York jumped as much as 6.1% to $42.00, their highest price since last February. Verizon’s stock has rallied about 30% in the last three months, aided by strong third-quarter results that showed a better-than expected increase in broadband subscribers, returning roughly to levels of about a year ago.\n\nThe “robust” results suggest Verizon’s strategy is working, Bloomberg Intelligence analyst John Butler said in a note Tuesday. He cited as factors the new pricing, and activation of more of Verizon’s prime C-band airwaves that provide fast connections. “The momentum may continue as the latest measures provide a lift,” Butler said.\n\nRead More: Verizon Raises Prices on Old Customers in Push for New Data Plans\n\nTotal wireless service revenue was $19.4 billion in the quarter, up 3.2% from a year earlier in part due to price hikes and the adoption of new premium pricing plans, Verizon said.\n\nFourth-quarter adjusted earnings were $1.08 per share, in line with analysts’ average estimate. Revenue for the three months ended in December fell 0.3% from a year earlier, to $35.1 billion, compared with the average projection of $34.5 billion. Verizon attributed the drop to fewer customers upgrading phones.\n\nThe company also reported a continued drop in its business group after writing down the unit’s value by $5.8 billion last week, citing declining demand and competitive pressure. The unit’s revenue fell 3.6% to $7.6 billion in the quarter, even as it added wireless phone subscribers. Verizon cited lower sales from wireline services and equipment.\n\nVerizon reported broadband net additions of 413,000, including 375,000 fixed wireless accounts.\n\nFree cash flow rose to $18.7 billion in 2023, up from $14.1 billion the previous year.\n\n(Updates with CFO comments in sixth paragraph, shares in eighth paragraph)\n\nMost Read from Bloomberg Businessweek\n\nThe Downfall of Diddy Inc. How Sweden Quit Smoking Without Quitting Nicotine The Bitcoin Hype Is Back and About Just as Hollow as Before Should I Tell My Colleagues (or My Boss) About My Bipolar Diagnosis?\n\n©2024 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/verizon-adds-most-customers-2-163728013.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.987, "neg": 0.044, "neu": 0.861, "pos": 0.095}}, {"date": "2024-01-23T16:26:50+00:00", "title": "Verizon's Q4 Performance Shines: Substantial Wireless Gains Boost Stock", "content": "Verizon Communications Inc (NYSE:VZ) stock traded higher Tuesday after it reported fourth-quarter FY23 results.\n\nIt clocked a sales decline of 0.3% year-on-year to $35.13 billion, beating the consensus of $34.64 billion. Adjusted EPS of $1.08 beat the consensus of $1.07.\n\nTotal wireless service revenue was $19.4 billion, up 3.2% Y/Y, reflecting the company’s ownership of TracFone, premium Unlimited strategy, and pricing actions. Postpaid phone net additions were 449,000, and retail postpaid net additions were 1,460,000.\n\nThe quarter marked 413,000 total broadband net additions, representing the fifth consecutive quarter of over 400,000 broadband net additions.\n\nThe company ended the quarter with approximately 10.7 million broadband subscribers.\n\nTotal Verizon Business revenues were $7.6 billion, down by 3.6% Y/Y.\n\nTotal Verizon Consumer revenue rose by 0.7% Y/Y to $27.0 billion.\n\nConsumer wireless retail postpaid churn was 1.08%, and wireless retail postpaid phone churn was 0.88%.\n\nVerizon Consumer clocked wireless retail postpaid phone net additions of 318,000. Verizon Consumer had fixed wireless net additions of 231,000.\n\nThe consumer segment EBITDA margin improved by 60 bps 38.5%, attributed to service revenue growth and lower upgrade volumes, while the business segment EBITDA margin remained flat at 21.1%.\n\nCompany-level adjusted EBITDA of $11.7 billion was down 0.6% Y/Y. Verizon said it is ahead of schedule in achieving its goal of 4 million to 5 million subscribers by the end of 2025.\n\nFY24 Outlook: Verizon projected a 2.0% – 3.5% wireless service revenue growth. It expects an adjusted EPS of $4.50 – $4.70 versus consensus of $4.59.\n\nPrice action: VZ shares traded higher by3.46% at $40.95 premarket on the last check Tuesday.\n\nPhoto by JeepersMedia on Flickr\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nStory continues\n\nGet the latest stock analysis from Benzinga?\n\nVERIZON COMMUNICATIONS (VZ): Free Stock Analysis Report\n\nThis article Verizon's Q4 Performance Shines: Substantial Wireless Gains Boost Stock originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/verizons-q4-performance-shines-substantial-162650724.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.936, "neg": 0.023, "neu": 0.908, "pos": 0.069}}, {"date": "2024-01-23T16:01:24+00:00", "title": "Verizon sees wireless subscriber growth in Q4 earnings", "content": "Verizon (VZ) shares are popping off after fourth-quarter earnings topped estimates driven by better-than-expected wireless subscriber additions, snapping three consecutive quarters of declining subscriber counts.\n\nYahoo Finance's Seana Smith and Brad Smith deep dive into the telecoms giant's stock performance and what to expect for the company in the coming months.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Eyek Ntekim.\n\nVideo Transcript\n\nSEANA SMITH: All right. Verizon is the top trending ticker here at \"Yahoo Finance.\" Look at that gains of almost 5% here about half an hour into the trading day. Now, the stock getting a boost after it reported better than expected earnings for the second quarter. Also, added new wireless subscribers, which is a boom, potentially, here for Verizon because we know it generates a good chunk of its revenue from its mobile unit. And getting the vibe on the street because we're getting analysts quick take here following these results, Brad. And the earnings call that just took place with Hans Vestberg making a couple of key comments here, the CEO of Verizon.\n\nBut my two takeaways is that the Street is pretty pleased with these results. KeyBanc saying, that the results did come in somewhat mixed. But they were positive about the fact that those phone net adds did beat the Street's expectations. And then also, Evercore saying that this was a healthy quarter here for the company. A lot of that driven by those subscriber ads. And really, pointing to the fact that there is some optimism here for Verizon in 2024.\n\nBRAD SMITH: Yeah. Some swift reactions you got from analysts who were covering Verizon here this morning. One of them, vital knowledge, the big number in the Q4 report, as you were mentioning, still retail, postpaid, phone ads of 449,000 solidly above the Street's-- get this-- 229,000 forecasts. So healthy phone, net add number, and then the small guidance upside helping bolster the stock here today.\n\nSEANA SMITH: Yeah. And certainly, putting this all in perspective, why this is such a huge deal, when we talk about the net adds that we're getting here for subscribers, Verizon is coming off three straight quarters in a row, where they did disappoint here. So the fact that we are seeing a bit of a turnaround here for the mobile customers, it could signal a bit of a turning point here for the company, and also in terms of the guide, what that means for future growth here. It could be bullish there. So a good reason or a big reason why we're seeing shares up just about 5%.", "link": "https://finance.yahoo.com/video/verizon-sees-wireless-subscriber-growth-160124977.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.006, "neu": 0.871, "pos": 0.123}}, {"date": "2024-01-23T15:18:23+00:00", "title": "US STOCKS-S&amp;P 500, Nasdaq muted as mixed earnings weigh on risk appetite", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nVerizon up after upbeat FY forecast\n\n*\n\nGE's Q1 outlook disappoints, shares fall\n\n*\n\nP&G tops Q2 profit expectations, shares gain\n\n*\n\nIndexes: Dow falls 0.21%, S&P up 0.08%, Nasdaq up 0.14%\n\n(Updated at 9:48 a.m. ET/1448 GMT)\n\nBy Ankika Biswas and Johann M Cherian\n\nJan 23 (Reuters) -\n\nThe benchmark S&P 500 and the Nasdaq were flat on Tuesday as a mixed bag of earnings from industry bellwethers threatened to douse a recent rally, while the Dow treaded water on the back of losses in 3M.\n\n3M\n\ntumbled 9.5% after forecasting dour annual earnings as the company grapples with weak demand, while General Electric dropped 2.1% after the engine maker's bleak quarterly profit forecast.\n\nJohnson & Johnson\n\nfell 2.5% even after reporting quarterly results a nudge above expectations, while Verizon Communications forecast a strong annual profit and posted its highest quarterly subscriber additions in nearly two years, sending its shares up 4.8%.\n\nAll eyes are on the profit outlook for corporate America after major U.S. banks kicked off the ongoing earnings season, which has been mixed so far, with lower profits.\n\n\"A lot of these companies which had a pretty good quarter have issued cautious guidance ... so that weighs on people's minds on whether they should be in this market,\" said Robert Pavlik, senior portfolio manager at Dakota Wealth.\n\nOf the S&P 500 companies that have reported results thus far, 86.6% surpassed earnings expectations, compared with 93.1% over a week ago, LSEG data showed.\n\nThe benchmark S&P 500 touched a fresh intraday record peak and closed at an all-time high for a second session on Monday, extending a bull-market run, fueled by strength in megacap tech and chip stocks.\n\nThe blue-chip Dow also surpassed the 38,000-point mark for the first time on Monday, gaining for the third trading day.\n\nThe personal consumption expenditure (PCE) index - the Fed's preferred inflation gauge - along with the S&P Global PMI readings and an advance fourth-quarter GDP print this week will be key in assessing the central bank's next policy decision when it meets on Jan. 31.\n\nStory continues\n\nWall Street had lost steam at the start of 2024, struck by a mixed bag of inflation data and Federal Reserve policymakers clamping down on market speculation of interest-rate cuts arriving as early as March this year.\n\nTraders' expectations of U.S. monetary policy easing have now deferred to May, with an 84% odd for an at least 25-basis-point cut, as per the CME Group's FedWatch Tool, compared with earlier expectations of March.\n\nAt 9:48 a.m. ET, the Dow Jones Industrial Average was down 78.55 points, or 0.21%, at 37,923.26, the S&P 500 was up 4.05 points, or 0.08%, at 4,854.48, and the Nasdaq Composite was up 21.07 points, or 0.14%, at 15,381.35.\n\nEight of the 11 S&P 500 sectors crawled higher, with the communication services sector leading with a 0.7% rise.\n\nD.R. Horton\n\nshed 7.3% as the homebuilder missed estimates for first-quarter profit, while Procter & Gamble topped second-quarter profit expectations, sending shares of the consumer goods firm up by 4.8%.\n\nRTX jumped 8.1% on a 10% surge in fourth-quarter revenue, while United Airlines gained 8.3% following an upbeat full-year outlook.\n\nAdvancing issues outnumbered decliners by a 1.95-to-1 ratio on the NYSE and by a 1.78-to-1 ratio on the Nasdaq.\n\nThe S&P index recorded 22 new 52-week highs and no new low, while the Nasdaq recorded 63 new highs and 37 new lows.\n\n(Reporting by Ankika Biswas, Johann M Cherian and Shubham Batra; Editing by Pooja Desai and Maju Samuel)", "link": "https://finance.yahoo.com/news/us-stocks-p-500-nasdaq-151823430.html", "symbols": ["BAC.F", "BAC.XETRA", "DJI.INDX", "GE.MX", "GE.SW", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "IXIC.INDX", "MHL.F", "SPGI.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.984, "neg": 0.056, "neu": 0.845, "pos": 0.1}}, {"date": "2024-01-23T15:17:00+00:00", "title": "Verizon (VZ) Tops Q4 Earnings Estimates on Wireless Traction", "content": "Verizon Communications Inc. VZ reported healthy fourth-quarter 2023 results with the top and bottom lines beating the respective Zacks Consensus Estimate. The telecom giant is witnessing significant 5G adoption and wireless traction. Strong demand for fixed wireless products also led to healthy broadband performance with total broadband net additions of 413,000, including 375,000 fixed wireless net additions.\r\n\r\nVerizon witnessed solid momentum in the wireless business with 449,000 total postpaid phone net additions in the quarter along with retail postpaid net additions of 1,460,000. This buoyed the shares in pre-market trading.\n\nNet Income\n\nOn a GAAP basis, net loss in the quarter was $2,573 million or a loss of 64 cents per share against $6,698 million or $1.56 per share in the prior-year quarter. The year-over-year decrease was primarily attributable to higher operating expenses led by a goodwill impairment charge of $5,841 million. Excluding non-recurring items, quarterly adjusted earnings were $1.08 per share compared with $1.19 in the prior-year quarter. The bottom line beat the Zacks Consensus Estimate by a penny.\n\nVerizon Communications Inc. Price, Consensus and EPS Surprise Verizon Communications Inc. Price, Consensus and EPS Surprise\n\nVerizon Communications Inc. price-consensus-eps-surprise-chart | Verizon Communications Inc. Quote\n\nFor 2023, GAAP earnings declined to $12,095 million or $2.75 per share from $21,748 million or $5.06 per share in 2022. Adjusted earnings for 2023 were $4.71 per share compared with $5.18 in 2022.\n\nRevenues\n\nQuarterly total operating revenues decreased to $35,130 million from $35,251 million in the prior year owing to lower wireless equipment revenues driven by a challenging macroeconomic environment and lower postpaid phone upgrades. The top line beat the consensus estimate of $34,819 million. For 2023, revenues declined to $133,974 million from $136,835 million in 2022.\n\nQuarterly Segment Results\n\nConsumer: Total revenues from this segment improved 0.7% year over year to $26,954 million, as higher service revenues were partially offset by lower equipment revenues in the quarter. However, it exceeded our revenue estimate of $26,133.8 million for the segment led by solid wireless momentum.\r\n\r\nService revenues were up 2.6% to $18,927 million, while wireless equipment revenues declined 1.4% to $6,435 million. Other revenues totaled $1,592 million, down 11.5% year over year.\r\n\r\nThe segment recorded 318,000 wireless retail postpaid phone net additions and 289,000 wireless retail prepaid net losses in the quarter. Wireless retail postpaid churn was 1.08%, while retail postpaid phone churn was 0.88%. The company recorded 53,000 Fios Internet net additions as high demand for reliable fiber optic broadband was spurred by higher video consumption. Fixed wireless broadband net additions were 231,000 for the quarter. However, Verizon registered 62,000 Fios Video net losses in the quarter, reflecting the ongoing shift from traditional linear video to over-the-top offerings.\r\n\r\nThe segment’s operating income remained flat at $7,035 million with a margin of 26.1%. EBITDA increased 2.4% to $10,379 million with a margin of 38.5% compared with 37.9% in the prior-year quarter due to lower costs of wireless equipment.\r\n\r\nBusiness: The segment revenues were down 3.6% to $7,618 million due to lower wireline and wireless equipment revenues, partially offset by growth in wireless service revenue. It also was lower than our estimates of $7,876 million largely due to challenging macroeconomic conditions.\r\n\r\nThe segment had 292,000 wireless retail postpaid net additions in the quarter, including 131,000 postpaid phone net additions. Wireless retail postpaid churn was 1.48%, while retail postpaid phone churn was 1.12%. Fixed wireless broadband net additions were 144,000 for the quarter. Operating income declined to $443 million from $585 million in the year-ago quarter with respective margins of 5.8% and 7.4%. EBITDA was down 4.5% to $1,607 million owing to decline in high margin wireline revenues for a margin of 21.1% compared with 21.3% in the year-earlier quarter.\n\nStory continues\n\nOther Quarterly Details\n\nTotal operating expenses increased 23.2% year over year to $34,530 million, while operating income was down 91.7% to $600 million. Consolidated adjusted EBITDA declined to $11,678 million from $11,747 million for respective margins of 33.2% and 33.3%.\n\nCash Flow & Liquidity\n\nVerizon generated $37,475 million of net cash from operating activities in 2023 compared with $37,141 million in the year-ago period. The improvement was primarily due to working capital improvements driven by lower inventory levels, fewer phone upgrades and a modest improvement in customer payment patterns. Free cash flow was $4,074 million for the quarter compared with $1,666 million in the prior-year period.\r\n\r\nAs of Dec 31, 2023, the company had $2,065 million in cash and cash equivalents with $137,701 million of long-term debt compared with respective tallies of $2,605 million and $140,676 million in the year-ago period.\n\nGuidance\n\nFor 2023, Verizon expects wireless service revenue growth in the range of 2%-3.5%. Adjusted EBITDA is likely to grow 1%-3%. The company expects adjusted earnings in the range of $4.50 to $4.70 per share. Capital expenditure is estimated to be within the range of $17 billion and $17.5 billion.\n\nZacks Rank & Stock to Consider\n\nVerizon currently has a Zacks Rank #3 (Hold).\r\n\r\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nHere are some better-ranked stocks from the broader industry.\r\n\r\nWorkday Inc. WDAY, carrying a Zacks Rank #2 (Buy), delivered a trailing four-quarter average earnings surprise of 13.24%. In the last reported quarter, it delivered an earnings surprise of 9.29%. It has a long-term earnings growth expectation of 26.5%.\r\n\r\nWorkday is a provider of enterprise-level software solutions for financial management and human resource domains. The company’s cloud-based platform combines finance and HR in a single system that makes it easier for organizations to provide analytical insights and decision support.\r\n\r\nHeadquartered in Wilmington, DE, InterDigital, Inc. IDCC is a pioneer in advanced mobile technologies that enable wireless communications and capabilities. The company engages in designing and developing a wide range of advanced technology solutions, which are used in digital cellular as well as wireless 3G, 4G and IEEE 802-related products and networks.\r\n\r\nThis Zacks Rank #2 stock has a long-term earnings growth expectation of 17.4% and has surged 75.3% in the past year. A well-established global footprint, diversified product portfolio and ability to penetrate different markets are key growth drivers for InterDigital. The addition of technologies related to sensors, user interface and video to its already strong portfolio of wireless technology solutions is likely to drive considerable value, given the massive size of the market it offers licensing technologies to.\r\n\r\nJuniper Networks Inc. JNPR, carrying a Zacks Rank #2, is a leading provider of networking solutions and communication devices. The company develops, designs and sells products that help build network infrastructure used for services and applications based on a single Internet protocol network worldwide. Juniper offers a broad range of routing, switching and security products.\r\n\r\nIt delivered an earnings surprise of 6.5%, on average, in the trailing four quarters. Juniper has a long-term earnings growth expectation of 9.9%. It has a VGM Score of B.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nVerizon Communications Inc. (VZ) : Free Stock Analysis Report\n\nJuniper Networks, Inc. (JNPR) : Free Stock Analysis Report\n\nInterDigital, Inc. (IDCC) : Free Stock Analysis Report\n\nWorkday, Inc. (WDAY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/verizon-vz-tops-q4-earnings-151700985.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.026, "neu": 0.862, "pos": 0.112}}, {"date": "2024-01-23T14:30:13+00:00", "title": "Compared to Estimates, Verizon (VZ) Q4 Earnings: A Look at Key Metrics", "content": "For the quarter ended December 2023, Verizon Communications (VZ) reported revenue of $35.13 billion, down 0.3% over the same period last year. EPS came in at $1.08, compared to $1.19 in the year-ago quarter.\n\nThe reported revenue compares to the Zacks Consensus Estimate of $34.82 billion, representing a surprise of +0.90%. The company delivered an EPS surprise of +0.93%, with the consensus EPS estimate being $1.07.\n\nWhile investors scrutinize revenue and earnings changes year-over-year and how they compare with Wall Street expectations to determine their next move, some key metrics always offer a more accurate picture of a company's financial health.\n\nSince these metrics play a crucial role in driving the top- and bottom-line numbers, comparing them with the year-ago numbers and what analysts estimated about them helps investors better project a stock's price performance.\n\nHere is how Verizon performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\n\nBusiness - Churn rate - Wireless - Retail postpaid: 1.5% versus 1.4% estimated by five analysts on average. Business - Wireless - Net subscribers additions - Retail postpaid phones: 131 thousand versus the five-analyst average estimate of 138.52 thousand. Consumer - Wireline - Net subscribers additions - Broadband: 39 thousand versus the four-analyst average estimate of 46.46 thousand. Consumer - Wireline - Net subscribers additions - Fios Internet: 53 thousand compared to the 63.8 thousand average estimate based on four analysts. Operating revenues- Business: $7.62 billion versus the six-analyst average estimate of $7.82 billion. The reported number represents a year-over-year change of -3.6%. Operating revenues- Consumer - Other: $1.59 billion versus the six-analyst average estimate of $1.53 billion. The reported number represents a year-over-year change of -11.5%. Operating revenues- Consumer - Wireless equipment: $6.44 billion versus the six-analyst average estimate of $5.85 billion. The reported number represents a year-over-year change of -1.4%. Operating revenues- Consumer - Service: $18.93 billion versus $19.09 billion estimated by six analysts on average. Compared to the year-ago quarter, this number represents a +2.6% change. Operating revenues- Consumer: $26.95 billion versus $26.45 billion estimated by six analysts on average. Compared to the year-ago quarter, this number represents a +0.7% change. Wireless service revenue- Consumer: $16.03 billion compared to the $16.06 billion average estimate based on five analysts. Wireless service revenue- Business: $3.36 billion versus $3.40 billion estimated by five analysts on average. Operating revenues- Business- Enterprise and Public Sector: $3.72 billion versus the five-analyst average estimate of $3.91 billion. The reported number represents a year-over-year change of +142.9%.\n\nStory continues\n\nView all Key Company Metrics for Verizon here>>>\r\n\r\nShares of Verizon have returned +5.6% over the past month versus the Zacks S&P 500 composite's +2.1% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nVerizon Communications Inc. (VZ) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/compared-estimates-verizon-vz-q4-143013990.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.972, "neg": 0, "neu": 0.941, "pos": 0.059}}, {"date": "2024-01-23T13:45:38+00:00", "title": "Stocks to Watch Tuesday: Verizon, Netflix, United Airlines", "content": "↗️ [**Verizon Communications (VZ)**](https://www.wsj.com/market-data/quotes/VZ): The telecom giant posted a small drop in revenue after lower wireless-equipment sales offset healthy gains wireless subscribers and price increases.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1bf7a3a3-e4d8-3713-90a3-bc9135e01159/stocks-to-watch-tuesday%3A.html", "symbols": ["0NOF.LSE", "0O59.LSE", "0Q1S.LSE", "BAC.F", "BAC.XETRA", "DHI.US", "HO2.F", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "PG.BA", "PG.MX", "PG.US", "PRG.F", "PRG.XETRA", "SAN.PA", "SANF.MI"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0.133, "neu": 0.71, "pos": 0.157}}, {"date": "2024-01-23T13:27:00+00:00", "title": "Verizon Earnings Meet Estimates. Here’s the Nmber Driving the Stock Higher.", "content": "Telecom firm Verizon Communications reported fourth-quarter earnings in line with the consensus estimate.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1aa04f47-e30c-39dd-9f0b-1e39fa33a3b0/verizon-earnings-meet.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-01-23T13:13:34+00:00", "title": "J&amp;J, P&amp;G, GE, 3M, Verizon, Defense Contractors Report Earnings", "content": "This earnings season is hitting its stride with a swath of the country’s largest companies providing quarterly updates as the [stock market reaches new highs](https://www.wsj.com/livecoverage/stock-market-today-dow-jones-01-22-2024).\n\nContinue reading", "link": "https://finance.yahoo.com/m/b2e6141b-e2ec-3fd7-9c22-b8c1b7a5808e/j%26j%2C-p%26g%2C-ge%2C-3m%2C-verizon%2C.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "GE.MX", "GE.SW", "GE.US", "GEC.LSE", "GEC.XETRA", "GEOO34.SA", "GNE.PA", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0, "neu": 0.954, "pos": 0.046}}, {"date": "2024-01-23T13:10:03+00:00", "title": "Verizon Communications (VZ) Tops Q4 Earnings and Revenue Estimates", "content": "Verizon Communications (VZ) came out with quarterly earnings of $1.08 per share, beating the Zacks Consensus Estimate of $1.07 per share. This compares to earnings of $1.19 per share a year ago. These figures are adjusted for non-recurring items.\n\nThis quarterly report represents an earnings surprise of 0.93%. A quarter ago, it was expected that this largest U.S. cellphone carrier would post earnings of $1.17 per share when it actually produced earnings of $1.22, delivering a surprise of 4.27%.\n\nOver the last four quarters, the company has surpassed consensus EPS estimates four times.\n\nVerizon , which belongs to the Zacks Wireless National industry, posted revenues of $35.13 billion for the quarter ended December 2023, surpassing the Zacks Consensus Estimate by 0.90%. This compares to year-ago revenues of $35.25 billion. The company has topped consensus revenue estimates just once over the last four quarters.\n\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\n\nVerizon shares have added about 5% since the beginning of the year versus the S&P 500's gain of 1.7%.\n\nWhat's Next for Verizon?\n\nWhile Verizon has outperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\n\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\n\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\n\nStory continues\n\nAhead of this earnings release, the estimate revisions trend for Verizon: mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $1.13 on $33.55 billion in revenues for the coming quarter and $4.60 on $135.71 billion in revenues for the current fiscal year.\n\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Wireless National is currently in the bottom 10% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nOne other stock from the same industry, Cambium (CMBM), is yet to report results for the quarter ended December 2023.\n\nThis company is expected to post quarterly loss of $0.34 per share in its upcoming report, which represents a year-over-year change of -194.4%. The consensus EPS estimate for the quarter has been revised 2.2% lower over the last 30 days to the current level.\n\nCambium's revenues are expected to be $40.03 million, down 52.6% from the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nVerizon Communications Inc. (VZ) : Free Stock Analysis Report\n\nCambium Networks Corporation (CMBM) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/verizon-communications-vz-tops-q4-131003378.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.014, "neu": 0.893, "pos": 0.093}}, {"date": "2024-01-23T12:33:06+00:00", "title": "Verizon Earnings Meet Estimates; VZ Stock Jumps On Strong Wireless Subscriber Adds", "content": "Verizon earnings were in line, but VZ jumped rose as wireless subscriber additions topped estimates amid a shake-up in the consumer business.\n\nContinue reading", "link": "https://finance.yahoo.com/m/8b9c7231-bb79-3156-933e-023c9b6cbb3e/verizon-earnings-meet.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-01-23T12:09:03+00:00", "title": "UPDATE 1-Verizon's flexible mobile plans drive subscriber additions, strong forecast", "content": "(Updates with shares in paragraph 3)\n\nJan 23 (Reuters) - Verizon Communications forecast annual profit above estimates on Tuesday after strong demand for its wireless plans and Black Friday promotions helped the U.S. carrier post its highest quarterly subscriber additions in nearly two years.\n\nThe telecom firm added net 449,000 monthly bill-paying wireless phone subscribers in the last three months of 2023, blowing past estimates of 223,800 additions, according to Factset.\n\nShares of the New York-based telecom company rose nearly 3% in trading before the bell.\n\nThe company - whose services typically cost more than rivals - has seen strong adoption for its customizable \"myPlan\" that was launched in May last year. To make the plan more attractive, Verizon is also offering subscriptions to Netflix and Warner Bros Discovery's Max streaming service in some bundles.\n\nVerizon said it expects adjusted profit in 2024 to be between $4.50 and $4.70 per share, the midpoint of which was higher than the estimates of $4.59, according to LSEG data.\n\nIts fourth-quarter results also benefited from promotions for the Black Friday shopping event and the release of the iPhone 15 series, which drove up smartphone upgrade activity.\n\nThe company's consumer segment reported 318,000 wireless retail postpaid phone net additions in the quarter, after three consecutive quarters of losses.\n\nThat, as well as price hikes implemented over the course of last year, helped Verizon post revenue of $35.1 billion, which topped estimates of $34.64 billion.\n\nNet loss was $2.6 billion, or 64 cents per share, compared with a profit of $6.7 billion, or $1.56 per share, a year earlier. The company took a $5.8 billion write-down in the quarter as it cut the value of its declining wireline business, among other charges.\n\nFull-year free cash flow, a metric closely watched by investors to help determine dividend payouts, came in at $18.7 billion, an increase from $14.1 billion in 2022. (Reporting by Samrhitha Arunasalam and Harshita Mary Varghese in Bengaluru; Editing by Anil D'Silva)", "link": "https://finance.yahoo.com/news/1-verizons-flexible-mobile-plans-120903931.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.984, "neg": 0.03, "neu": 0.846, "pos": 0.124}}, {"date": "2024-01-23T12:03:10+00:00", "title": "Verizon's flexible mobile plans drive subscriber additions, strong forecast", "content": "(Reuters) -Verizon Communications forecast annual profit above estimates on Tuesday after strong demand for its wireless plans and Black Friday promotions helped the U.S. carrier post its highest quarterly subscriber additions in nearly two years.\n\nShares of the New York-based telecom firm rose more than 5% in premarket trading, as the company's consumer business also added subscribers after three straight quarters of declines.\n\nVerizon - whose services typically cost more than rivals - has seen strong adoption for its customizable \"myPlan\" that was launched in May last year. To make the plan more attractive, the company is also offering subscriptions to Netflix and Warner Bros Discovery's Max streaming service in some bundles.\n\nThe company said it expects adjusted profit in 2024 to be between $4.50 and $4.70 per share, the midpoint of which was higher than the estimates of $4.59, according to LSEG data.\n\nIts quarterly results also benefited from promotions for the Black Friday shopping event and the release of the iPhone 15 series, which drove up smartphone upgrade activity.\n\nThe company added net 449,000 monthly bill-paying wireless phone subscribers in the last three months of 2023, blowing past estimates of 223,800 additions, according to Factset.\n\nIts consumer business reported 318,000 wireless retail postpaid phone net additions in the quarter.\n\nThat, as well as price hikes implemented over the course of last year, helped Verizon post revenue of $35.1 billion, which topped estimates of $34.64 billion.\n\nNet loss was $2.6 billion, or 64 cents per share, compared with a profit of $6.7 billion, or $1.56 per share, a year earlier. The company took a $5.8 billion write-down in the quarter as it cut the value of its declining wireline business, among other charges.\n\nFull-year free cash flow, a metric closely watched by investors to help determine dividend payouts, came in at $18.7 billion, an increase from $14.1 billion in 2022.\n\n(Reporting by Samrhitha Arunasalam and Harshita Mary Varghese in Bengaluru; Editing by Anil D'Silva)", "link": "https://ca.finance.yahoo.com/news/verizons-flexible-plans-drive-subscriber-120310767.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.023, "neu": 0.853, "pos": 0.124}}, {"date": "2024-01-23T12:00:59+00:00", "title": "Verizon's flexible plans drive subscriber additions, strong forecast", "content": "Jan 23 (Reuters) - Verizon Communications forecast annual profit above estimates on Tuesday after strong demand for its wireless plans and Black Friday promotions helped the U.S. carrier post its highest quarterly subscriber additions in nearly two years.\n\nThe telecom firm added net 449,000 monthly bill-paying wireless phone subscribers in the last three months of 2023, blowing past estimates of 223,800 additions, according to Factset.\n\nThe company - whose services typically cost more than rivals - has seen strong adoption for its customizable \"myPlan\" that was launched in May last year. To make the plan more attractive, Verizon is also offering subscriptions to Netflix and Warner Bros Discovery's Max streaming service in some bundles.\n\nThe company said it expects adjusted profit in 2024 to be between $4.50 and $4.70 per share, the midpoint of which was higher than the estimates of $4.59, according to LSEG data.\n\nIts fourth-quarter results also benefited from promotions for the Black Friday shopping event and the release of the iPhone 15 series, which drove up smartphone upgrade activity.\n\nThe company's consumer segment reported 318,000 wireless retail postpaid phone net additions in the quarter, after three consecutive quarters of losses.\n\nThat, as well as price hikes implemented over the course of last year, helped Verizon post revenue of $35.1 billion, which topped estimates of $34.64 billion.\n\nNet loss was $2.6 billion, or 64 cents per share, compared with a profit of $6.7 billion, or $1.56 per share, a year earlier. The company took a $5.8 billion write-down in the quarter as it cut the value of its declining wireline business, among other charges.\n\nFull-year free cash flow, a metric closely watched by investors to help determine dividend payouts, came in at $18.7 billion, an increase from $14.1 billion in 2022. (Reporting by Samrhitha Arunasalam and Harshita Mary Varghese in Bengaluru; Editing by Anil D'Silva)", "link": "https://finance.yahoo.com/news/verizons-flexible-plans-drive-subscriber-120059113.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.979, "neg": 0.032, "neu": 0.849, "pos": 0.119}}, {"date": "2024-01-23T12:00:00+00:00", "title": "Verizon finishes 2023 with strong cash flow and wireless customer growth", "content": "Verizon Sourcing LLC\n\nPosts double-digit gains across fixed wireless and total wireless postpaid net additions\n\nFull-year 2023 wireless service revenue was $76.7 billion, up 3.2 percent from full-year 2022\n\nFixed wireless net additions for full-year 2023 were up over 31 percent year over year reflecting the increased demand driven by the strength and reliability of the product\n\nTotal wireless postpaid net additions for full-year 2023 spike 26 percent compared to 2022\n\nTotal wireless postpaid phone net additions jump to 449,000 for fourth-quarter 2023 compared to 217,000 for fourth-quarter 2022\n\nConsumer postpaid phone gross additions for fourth-quarter 2023 increase nearly 17 percent year over year, marking the best quarterly performance in four years\n\n2023 highlights\n\nConsolidated:\n\nFull-year 2023 earnings per share (EPS) of $2.75, compared with $5.06 in 2022; adjusted EPS1, excluding special items, of $4.71, compared with 2022 adjusted EPS1 of $5.18. Total operating revenue of $134.0 billion in full-year 2023, down 2.1 percent year over year. Full-year 2023 cash flow from operations of $37.5 billion, an increase from $37.1 billion in 2022. Full-year 2023 free cash flow1 of $18.7 billion, an increase from $14.1 billion in 2022.\n\n4Q 2023 highlights\n\nConsolidated:\n\nEarnings per share was $(0.64), compared with earnings per share of $1.56 in fourth-quarter 2022; adjusted EPS1, excluding special items, of $1.08, compared with $1.19 in fourth-quarter 2022. Total operating revenue of $35.1 billion, a decrease of 0.3 percent from fourth-quarter 2022. Consolidated net loss for the fourth-quarter of $2.6 billion, compared to consolidated net income of $6.7 billion in fourth-quarter 2022, and consolidated adjusted EBITDA1 of $11.7 billion, in line with the 2022 result.\n\nTotal Broadband:\n\nTotal broadband net additions of 413,000, represented the fifth consecutive quarter that Verizon reported more than 400,000 broadband net additions. Total broadband net additions included 375,000 fixed wireless net additions, bringing the subscriber base to over 3 million. In fourth-quarter 2023, more than 80 percent of Consumer fixed wireless gross additions were in Verizon's first 76 C-Band markets. Verizon is ahead of schedule to achieve its goal of 4 to 5 million subscribers by the end of 2025. 55,000 Fios Internet net additions, down 4,000 from the fourth-quarter 2022. 10.7 million total broadband subscribers as of the end of fourth-quarter 2023.\n\nStory continues\n\nTotal Wireless:\n\nTotal wireless service revenue2 of $19.4 billion, a 3.2 percent increase year over year. Retail postpaid phone net additions of 449,000, and retail postpaid net additions of 1,460,000. Retail postpaid churn of 1.18 percent, and retail postpaid phone churn of 0.93 percent.\n\nNEW YORK, Jan. 23, 2024 (GLOBE NEWSWIRE) -- Verizon Communications Inc. (NYSE, Nasdaq: VZ) reported strong fourth-quarter and full-year 2023 results highlighted by total wireless postpaid net additions, fixed wireless net additions and increased wireless service revenue.\n\n\"After delivering continuous improvement throughout 2023, we ended the year strong and continue to pursue the right balance of growth and profitability,\" said Verizon Chairman and CEO Hans Vestberg. \"2023 was a year of change. We have the right assets and the best team in place and are well-positioned for growth in 2024.\"\n\nFor fourth-quarter 2023, Verizon reported earnings per share of $(0.64), compared with earnings per share of $1.56 in fourth-quarter 2022. On an adjusted basis1, excluding special items, EPS was $1.08 in fourth-quarter 2023, compared with adjusted EPS1 of $1.19 in fourth-quarter 2022.\n\nFourth-quarter 2023 financial results reflected a pre-tax loss from special items of approximately $7.8 billion. This includes the impacts of a previously disclosed goodwill impairment charge related to our Business reporting unit of $5.8 billion, a market-to-market adjustment for our pension and Other Post Employment Benefits (OPEB) liabilities of $992 million, asset rationalization charges of $325 million primarily relating to Business network assets that Verizon has ceased the use of, a severance charge of $296 million, the amortization of intangible assets related to Tracfone and other acquisitions of $227 million, and a $100 million charge relating to the settlement of a litigation matter regarding certain administrative fees.\n\nFor full-year 2023, Verizon reported $2.75 in EPS, compared with $5.06 for full-year 2022. On an adjusted basis1, excluding special items, 2023 EPS was $4.71, compared with $5.18 for 2022.\n\nConsolidated results\n\nTotal consolidated operating revenue in fourth-quarter 2023 of $35.1 billion, down 0.3 percent from fourth-quarter 2022. The decrease can be attributed to wireless equipment revenue, which was 2.0 percent lower than 2022, as total postpaid upgrades declined by 17.9 percent. Full-year 2023 consolidated operating revenue was $134.0 billion, down 2.1 percent year over year. Total wireless service revenue2 in fourth-quarter 2023 was $19.4 billion, up 3.2 percent year over year, driven primarily by pricing actions implemented in recent quarters, the larger allocation of our administrative and telco recovery fees from other revenue into wireless service revenue, higher premium price plan adoption and growth from fixed wireless access offerings. Full-year 2023 cash flow from operations was $37.5 billion, an increase from $37.1 billion in 2022. This marks a year over year increase of over $300 million, primarily due to working capital improvements. Full-year 2023 capital expenditures were $18.8 billion, down from $23.1 billion in 2022. The company ended 2023 with free cash flow1 of $18.7 billion, an increase from $14.1 billion in 2022. Consolidated net loss for the fourth-quarter 2023 was $2.6 billion, compared to consolidated net income of $6.7 billion in fourth-quarter 2022, and consolidated adjusted EBITDA1 was $11.7 billion, in line with the 2022 result. Verizon's total unsecured debt as of the end of the year was $128.5 billion, a $2.1 billion increase sequentially, but $2.1 billion lower year over year. The company's net unsecured debt1 at the end of the year was $126.4 billion, a $4.2 billion increase from third-quarter 2023, but $1.6 billion lower year over year. At the end of fourth-quarter 2023, Verizon's ratio of unsecured debt to net income (LTM) was approximately 10.6 times and net unsecured debt to adjusted EBITDA ratio1 was approximately 2.6 times.\n\nVerizon Consumer results\n\nTotal Verizon Consumer revenue in fourth-quarter 2023 was $27.0 billion, an increase of 0.7 percent year over year as growth in service revenue was offset by declines in wireless equipment revenue and other revenue. For full-year 2023, total Consumer revenue was $101.6 billion, a decrease of 1.8 percent from full-year 2022. Wireless service revenue in fourth-quarter 2023 increased 3.2 percent year over year driven primarily by growth in Consumer wireless postpaid Average Revenue Per Account (ARPA) resulting from pricing actions implemented in recent quarters, the larger allocation of our administrative and telco recovery fees from other revenue into wireless service revenue, higher premium price plan adoption, and growth from fixed wireless access offerings. For full-year 2023, total Consumer wireless service revenue was $63.4 billion, an increase of 3.0 percent from full-year 2022. Consumer wireless retail postpaid churn was 1.08 percent in fourth-quarter 2023, and wireless retail postpaid phone churn was 0.88 percent. In fourth-quarter 2023, Consumer reported 318,000 wireless retail postpaid phone net additions, representing an improvement of 369,000 from third-quarter 2023 and 277,000 from fourth-quarter 2022. Consumer postpaid phone gross additions in the fourth-quarter 2023 increased 16.9 percent year over year, the best performance in four years. Verizon continues to see better performance in the markets where C-Band is deployed. In Verizon's first 76 C-Band markets, fourth-quarter growth in Consumer postpaid phone gross additions was more than 8 percentage points better than in non C-Band markets and postpaid phone churn remains lower than non C-Band markets. Consumer reported 289,000 wireless retail prepaid net losses in fourth-quarter 2023. Consumer reported 231,000 fixed wireless net additions and 53,000 Fios Internet net additions in fourth-quarter 2023. Consumer Fios revenue was $2.9 billion in fourth-quarter 2023, an increase of 1.0 percent year over year. Full-year 2023 Consumer Fios revenue was $11.6 billion, relatively flat year over year. In fourth-quarter 2023, Consumer operating income was $7.0 billion, an increase of 0.1 percent year over year, and segment operating income margin was 26.1 percent, a decrease from 26.3 percent in fourth-quarter 2022. Full-year 2023 Consumer operating income was $29.0 billion, an increase of 0.6 percent year over year, and segment operating income margin was 28.5 percent, an increase from 27.9 percent in full-year 2022. Segment EBITDA1 in fourth-quarter 2023 was $10.4 billion, an increase of 2.4 percent year over year. This improvement can be attributed to wireless service revenue growth and lower upgrade volumes. Segment EBITDA margin1 in fourth-quarter 2023 was 38.5 percent, an increase from 37.9 percent in fourth-quarter 2022. Full-year 2023 segment EBITDA margin1 was 41.4 percent, an increase from 40.2 percent in 2022.\n\nVerizon Business results\n\nTotal Verizon Business revenue was $7.6 billion in fourth-quarter 2023, a decrease of 3.6 percent year over year as lower wireline revenue and lower wireless equipment revenue was partially offset by higher wireless service revenue. For full-year 2023, total Business revenue was $30.1 billion, a 3.1 percent decrease year over year. Business wireless service revenue in fourth-quarter 2023 was $3.4 billion, an increase of 3.0 percent year over year. This was driven by the larger allocation of our administration and telco recovery fees from other revenue into wireless service revenue, continued strong net additions and the benefit of pricing actions implemented earlier in the year. Full-year 2023 Business wireless service revenue was $13.4 billion, an increase of 4.1 percent compared to full-year 2022. Business reported 292,000 wireless retail postpaid net additions in fourth-quarter 2023, including 131,000 postpaid phone net additions. This was the 10th consecutive quarter that Business reported more than 125,000 postpaid phone net additions. Business continues to grow volumes and expand its relationships with customers strengthening its position as a wireless market share leader. Business wireless retail postpaid churn was 1.48 percent in fourth-quarter 2023, and wireless retail postpaid phone churn was 1.12 percent. Business reported 144,000 fixed wireless net additions in fourth-quarter 2023. In fourth-quarter 2023, Verizon Business operating income was $443 million, a decrease of 24.3 percent year over year, and segment operating income margin was 5.8 percent, a decrease from 7.4 percent in fourth-quarter 2022. Full-year 2023 segment operating income was $2.1 billion, a decrease of 21.5 percent year over year, and segment operating income margin was 6.9 percent, compared with 8.5 percent in full-year 2022. Segment EBITDA1 in fourth-quarter 2023 was $1.6 billion, a decrease of 4.5 percent year over year, driven by continued declines in high margin wireline revenues. Segment EBITDA margin1 in fourth-quarter 2023 was 21.1 percent, a decrease from 21.3 percent in fourth-quarter 2022. For the full year, segment EBITDA margin1 was 21.8 percent, a decrease from 22.3 percent in 2022.\n\nOutlook and guidance\n\nThe company does not provide a reconciliation for any of the following adjusted (non-GAAP) forecasts because it cannot, without unreasonable effort, predict the special items that could arise, and the company is unable to address the probable significance of the unavailable information.\n\nFor 2024, Verizon expects the following:\n\nTotal wireless service revenue growth2 of 2.0 percent to 3.5 percent. Adjusted EBITDA growth1 of 1.0 percent to 3.0 percent. Adjusted EPS1 of $4.50 to $4.70. Capital expenditures between $17.0 billion and $17.5 billion. Adjusted effective income tax rate1 in the range of 22.5 percent to 24.0 percent.\n\n1Non-GAAP financial measure. See the accompanying schedules and www.verizon.com/about/investors for reconciliations of non-GAAP financial measures cited in this document to most directly comparable financial measures under generally accepted accounting principles (GAAP).\n\n2 Total wireless service revenue represents the sum of Consumer and Business segments.\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $134.0 billion in 2023. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nForward-looking statements\r\nIn this communication we have made forward-looking statements. These statements are based on our estimates and assumptions and are subject to risks and uncertainties. Forward-looking statements include the information concerning our possible or assumed future results of operations. Forward-looking statements also include those preceded or followed by the words “anticipates,” “assumes,” “believes,” “estimates,” “expects,” “forecasts,” “hopes,” “intends,” “plans,” “targets” or similar expressions. For those statements, we claim the protection of the safe harbor for forward-looking statements contained in the Private Securities Litigation Reform Act of 1995. We undertake no obligation to revise or publicly release the results of any revision to these forward-looking statements, except as required by law. Given these risks and uncertainties, readers are cautioned not to place undue reliance on such forward-looking statements. The following important factors, along with those discussed in our filings with the Securities and Exchange Commission (the “SEC”), could affect future results and could cause those results to differ materially from those expressed in the forward-looking statements: the effects of competition in the markets in which we operate, including the inability to successfully respond to competitive factors such as prices, promotional incentives and evolving consumer preferences; failure to take advantage of, or respond to competitors' use of, developments in technology and address changes in consumer demand; performance issues or delays in the deployment of our 5G network resulting in significant costs or a reduction in the anticipated benefits of the enhancement to our networks; the inability to implement our business strategy; adverse conditions in the U.S. and international economies, including inflation and changing interest rates in the markets in which we operate; cyber attacks impacting our networks or systems and any resulting financial or reputational impact; damage to our infrastructure or disruption of our operations from natural disasters, extreme weather conditions, acts of war, terrorist attacks or other hostile acts and any resulting financial or reputational impact; disruption of our key suppliers’ or vendors' provisioning of products or services, including as a result of geopolitical factors or the potential impacts of global climate change; material adverse changes in labor matters and any resulting financial or operational impact; damage to our reputation or brands; the impact of public health crises on our operations, our employees and the ways in which our customers use our networks and other products and services; changes in the regulatory environment in which we operate, including any increase in restrictions on our ability to operate our networks or businesses; allegations regarding the release of hazardous materials or pollutants into the environment from our, or our predecessors’, network assets and any related government investigations, regulatory developments, litigation, penalties and other liability, remediation and compliance costs, operational impacts or reputational damage; our high level of indebtedness; significant litigation and any resulting material expenses incurred in defending against lawsuits or paying awards or settlements; an adverse change in the ratings afforded our debt securities by nationally accredited ratings organizations or adverse conditions in the credit markets affecting the cost, including interest rates, and/or availability of further financing; significant increases in benefit plan costs or lower investment returns on plan assets; changes in tax laws or regulations, or in their interpretation, or challenges to our tax positions, resulting in additional tax expense or liabilities; and changes in accounting assumptions that regulatory agencies, including the SEC, may require or that result from changes in the accounting rules or their application, which could result in an impact on earnings.\n\nNon-GAAP Reconciliations - Consolidated Verizon\n\nConsolidated EBITDA and Consolidated Adjusted EBITDA\n\n(dollars in millions) Unaudited 3 Mos. Ended 12/31/23 3 Mos. Ended 9/30/23 3 Mos. Ended 6/30/23 3 Mos. Ended 3/31/23 3 Mos. Ended 12/31/22 3 Mos. Ended 9/30/22 3 Mos. Ended\r\n 6/30/22 3 Mos. Ended\r\n 3/31/22 Consolidated Net Income (Loss) $ (2,573 ) $ 4,884 $ 4,766 $ 5,018 $ 6,698 $ 5,024 $ 5,315 $ 4,711 Add: Provision for income taxes 756 1,308 1,346 1,482 2,113 1,496 1,542 1,372 Interest expense 1,599 1,433 1,285 1,207 1,105 937 785 786 Depreciation and amortization expense (1) 4,516 4,431 4,359 4,318 4,218 4,324 4,321 4,236 Consolidated EBITDA $ 4,298 $ 12,056 $ 11,756 $ 12,025 $ 14,134 $ 11,781 $ 11,963 $ 11,105 Add/(subtract): Other (income) expense, net (2) $ 807 $ (170 ) $ (210 ) $ (114 ) $ (2,687 ) $ 439 $ (49 ) $ 924 Equity in losses (earnings) of unconsolidated businesses 11 18 33 (9 ) (4 ) (2 ) (41 ) 3 Severance charges 296 — 237 — 304 — — — Verizon Business Group goodwill impairment 5,841 — — — — — — — Asset rationalization 325 — 155 — — — — — Legal settlement 100 — — — — — — — Business transformation costs — 176 — — — — — — Non-strategic business shutdown — 158 — — — — — — 7,380 182 215 (123 ) (2,387 ) 437 (90 ) 927 Consolidated Adjusted EBITDA $ 11,678 $ 12,238 $ 11,971 $ 11,902 $ 11,747 $ 12,218 $ 11,873 $ 12,032 Consolidated Adjusted EBITDA - Year over year change % (0.6)% Footnotes: (1) Includes Amortization of acquisition-related intangible assets and a portion of the Non-strategic business shutdown, where applicable. (2) Includes Pension and benefits remeasurement adjustments and Early debt redemption costs, where applicable.\n\nConsolidated EBITDA and Consolidated Adjusted EBITDA (LTM)\n\nUnaudited 12 Mos. Ended \r\n12/31/23 12 Mos. Ended \r\n9/30/23 12 Mos. Ended\r\n 12/31/22 Consolidated Net Income $ 12,095 $ 21,366 $ 21,748 Add: Provision for income taxes 4,892 6,249 6,523 Interest expense 5,524 5,030 3,613 Depreciation and amortization expense (1) 17,624 17,326 17,099 Consolidated EBITDA $ 40,135 $ 49,971 $ 48,983 Add/(subtract): Other (income) expense, net (2) $ 313 $ (3,181 ) $ (1,373 ) Equity in losses (earnings) of unconsolidated businesses 53 38 (44 ) Severance charges 533 541 304 Verizon Business Group goodwill impairment 5,841 — — Asset rationalization 480 155 — Legal settlement 100 — — Business transformation costs 176 176 — Non-strategic business shutdown 158 158 — 7,654 (2,113 ) (1,113 ) Consolidated Adjusted EBITDA $ 47,789 $ 47,858 $ 47,870 Footnotes: (1) Includes Amortization of acquisition-related intangible assets and a portion of the Non-strategic business shutdown, where applicable. (2) Includes Pension and benefits remeasurement adjustments and Early debt redemption costs, where applicable.\n\nNet Unsecured Debt and Net Unsecured Debt to Consolidated Adjusted EBITDA Ratio (dollars in millions) Unaudited 12/31/23 9/30/23 12/31/22 Debt maturing within one year $ 12,973 $ 12,950 $ 9,963 Long-term debt 137,701 134,441 140,676 Total Debt 150,674 147,391 150,639 Less Secured debt 22,183 20,951 20,008 Unsecured Debt 128,491 126,440 130,631 Less Cash and cash equivalents 2,065 4,210 2,605 Net Unsecured Debt $ 126,426 $ 122,230 $ 128,026 Consolidated Net Income (LTM) $ 12,095 $ 21,748 Unsecured Debt to Consolidated Net Income Ratio 10.6x 6.0x Consolidated Adjusted EBITDA (LTM) $ 47,789 $ 47,870 Net Unsecured Debt to Consolidated Adjusted EBITDA Ratio 2.6x 2.7x Net Unsecured Debt - Quarter over quarter change $ 4,196 Net Unsecured Debt - Year over year change $ (1,600 )\n\nAdjusted Earnings per Common Share (Adjusted EPS)\n\n(dollars in millions, except per share amounts) Unaudited 3 Mos. Ended 12/31/23 3 Mos. Ended 12/31/22 Pre-tax Tax After-Tax Pre-tax Tax After-Tax EPS $ (0.64 ) $ 1.56 Amortization of acquisition-related intangible assets $ 227 $ (57 ) $ 170 0.04 $ 115 $ (34 ) $ 81 0.02 Severance, pension and benefits charges (credits) 1,288 (319 ) 969 0.23 (2,214 ) 552 (1,662 ) (0.40 ) Verizon Business Group goodwill impairment 5,841 (52 ) 5,789 1.37 — — — — Asset rationalization 325 (80 ) 245 0.06 — — — — Legal settlement 100 (25 ) 75 0.02 — — — — $ 7,781 $ (533 ) $ 7,248 $ 1.72 $ (2,099 ) $ 518 $ (1,581 ) $ (0.38 ) Adjusted EPS $ 1.08 $ 1.19 Footnotes: Adjusted EPS may not add due to rounding.\n\n(dollars in millions, except per share amounts) Unaudited 12 Mos. Ended 12/31/23 12 Mos. Ended 12/31/22 Pre-tax Tax After-Tax Pre-tax Tax After-Tax EPS $ 2.75 $ 5.06 Amortization of acquisition-related intangible assets $ 865 $ (219 ) $ 646 0.15 $ 826 $ (214 ) $ 612 0.15 Severance, pension and benefits charges (credits) 1,525 (378 ) 1,147 0.27 (1,371 ) 339 (1,032 ) (0.25 ) Verizon Business Group goodwill impairment 5,841 (52 ) 5,789 1.37 — — — — Asset rationalization 480 (113 ) 367 0.09 — — — — Legal settlement 100 (25 ) 75 0.02 — — — — Business transformation costs 176 (45 ) 131 0.03 — — — — Non-strategic business shutdown 179 (83 ) 96 0.02 — — — — Early debt redemption costs — — — — 1,241 (316 ) 925 0.22 $ 9,166 $ (915 ) $ 8,251 $ 1.96 $ 696 $ (191 ) $ 505 $ 0.12 Adjusted EPS $ 4.71 $ 5.18 Footnotes: Adjusted EPS may not add due to rounding.\n\nFree Cash Flow (dollars in millions) Unaudited 12 Mos. Ended\r\n 12/31/23 12 Mos. Ended \r\n12/31/22 Net Cash Provided by Operating Activities $ 37,475 $ 37,141 Capital expenditures (including capitalized software) (18,767 ) (23,087 ) Free Cash Flow $ 18,708 $ 14,054\n\nNon-GAAP Reconciliations - Segments\n\nSegment EBITDA and Segment EBITDA Margin Consumer (dollars in millions) Unaudited 3 Mos. Ended\r\n 12/31/23 3 Mos. Ended \r\n12/31/22 12 Mos. Ended \r\n12/31/23 12 Mos. Ended \r\n12/31/22 Operating Income $ 7,035 $ 7,028 $ 29,011 $ 28,846 Add Depreciation and amortization expense 3,344 3,111 13,077 12,716 Segment EBITDA $ 10,379 $ 10,139 $ 42,088 $ 41,562 Year over year change % 2.4 % 1.3 % Total operating revenues $ 26,954 $ 26,770 $ 101,626 $ 103,506 Operating Income Margin 26.1 % 26.3 % 28.5 % 27.9 % Segment EBITDA Margin 38.5 % 37.9 % 41.4 % 40.2 %\n\nBusiness  (dollars in millions) Unaudited 3 Mos. Ended \r\n12/31/23 3 Mos. Ended\r\n 12/31/22 12 Mos. Ended \r\n12/31/23 12 Mos. Ended \r\n12/31/22 Operating Income $ 443 $ 585 $ 2,066 $ 2,631 Add Depreciation and amortization expense 1,164 1,098 4,488 4,312 Segment EBITDA $ 1,607 $ 1,683 $ 6,554 $ 6,943 Year over year change % (4.5) % (5.6) % Total operating revenues $ 7,618 $ 7,900 $ 30,122 $ 31,072 Operating Income Margin 5.8 % 7.4 % 6.9 % 8.5 % Segment EBITDA Margin 21.1 % 21.3 % 21.8 % 22.3 %\n\nMedia contacts:\n\nKatie Magnotta\r\n201-602-9235 \r\nkatie.magnotta@verizon.com\n\nEric Wilkens\r\n201-572-9317\r\neric.wilkens@verizon.com", "link": "https://finance.yahoo.com/news/verizon-finishes-2023-strong-cash-120000539.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.99, "neg": 0.071, "neu": 0.84, "pos": 0.089}}, {"date": "2024-01-23T08:00:20+00:00", "title": "United Airlines, Verizon and Fisker rise premarket; 3M, General Electric fall", "content": "Investing.com -- U.S. futures edged lower Tuesday, consolidating after recent gains as the earnings season kicks into full gear.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nUnited Airlines (NASDAQ:UAL) stock rose 6.4% after the carrier reported strong fourth-quarter results, thanks in part to its \"busiest\" travel period ever in the last two weeks of December, but it said it expects a wider-than-expected loss in its current quarter.\n\nVerizon (NYSE:VZ) stock rose 4.6% after the telecommunications giant said it was \"well-positioned\" for growth in 2024, as it unveiled an annual earnings forecast range that was above expectations.\n\nJohnson & Johnson (NYSE:JNJ) stock fell 0.3% after the pharmaceutical giant reiterated its full-year guidance for 2024 even after its fourth-quarter results beat expectations.\n\n3M (NYSE:MMM) stock fell 6.9% after the industrial conglomerate unveiled an annual earnings forecast that was below expectations, noting that the outlook does not reflect the potential impact of recent settlements in legal battles involving public water systems and U.S. military earplugs.\n\nProcter & Gamble (NYSE:PG) stock rose 0.9% despite the consumer goods giant cutting its annual profit forecast as the boost from earlier price hikes fades and on writing down the value of its Gillette business in December.\n\nGeneral Electric  (NYSE:GE) stock fell 3.3% after the industrial conglomerate disappointed with its first-quarter outlook even as its fourth-quarter earnings came in ahead of expectations on strong demand for parts and services at its jet engine business.\n\nCoinbase (NASDAQ:COIN) stock fell 4.3%, with the cryptocurrency exchange hurt after bitcoin, the most popular digital currency, fell below the $40,000-mark, hitting a more than seven-week low.\n\nExxon Mobil  (NYSE:XOM) stock rose 0.2% after TD Cowen upgraded the oil major to ‘outperform’ from ‘market perform’, citing an attractive valuation.\n\nStory continues\n\nArcher-Daniels-Midland (NYSE:ADM) stock rose 2.1%, rebounding after slumping 24% on Monday following the announcement of an investigation into accounting practices in the company’s Nutrition segment.\n\nHalliburton (NYSE:HAL) stock rose 1.7% after the oil services company’s fourth-quarter profit beat expectations on strength for offshore and overseas drilling activities internationally.\n\nFisker (NYSE:FSR) stock rose 9.7% after the EV startup said it expects to sell all its nearly 5,000 unsold vehicles made last year by the end of the first quarter and that its newly announced dealer-partner model has gained traction.\n\nUpgrade your investing with our groundbreaking, AI-powered InvestingPro+ stock picks. Use coupon INVESTINGPRO+24 to get a limited time discount on our Pro+ subscription plans. Click here to find out more, and don't forget to use the discount code when checking out!\n\nRelated Articles\n\nUnited Airlines, Verizon and Fisker rise premarket; 3M, General Electric fall\n\nUS stocks mixed on earnings deluge; Netflix to report after close\n\nWells Fargo downgrades Bill.com on 'growing list of risks'", "link": "https://finance.yahoo.com/news/united-airlines-verizon-fisker-rise-080020995.html", "symbols": ["ADM.F", "ADM.MX", "ADM.US", "ADM.XETRA", "BAC.F", "BAC.XETRA", "COIN.US", "EXXO34.SA", "FSR.US", "GE.MX", "GE.SW", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "HAL.F", "HAL.MX"], "tags": [], "sentiment": {"polarity": 0.982, "neg": 0.056, "neu": 0.83, "pos": 0.114}}, {"date": "2024-01-23T07:55:31+00:00", "title": "Verizon unveils strong annual forecast, says it is \"well-positioned\" for growth", "content": "Investing.com -- Verizon has unveiled an annual earnings forecast range that was above analyst estimates at the midpoint, as the telecoms group said it was \"well-positioned\" for growth in 2024.\n\nAdjusted profit per share for the current year is seen at between $4.50 to $4.70. Bloomberg consensus projections had seen the outlook at $4.58.\n\nShares in the company moved higher in premarket U.S. trading on Tuesday.\n\nThe firm added 449,000 new monthly bill-paying phone subscribers for the three months ended on Dec. 31, beating predictions of 223,800, according to FactSet data cited by Reuters.\n\nWhen coupled with price hikes implemented earlier in the year, the additions helped partially offset a downturn in wireless equipment revenue. Operating sales of $35.1 billion in the fourth quarter beat expectations of $34.49B.\n\nThe group reported a net loss of $2.6B, due in large part to the impact of a $5.8B write-down related to its business-facing unit and pension liabilities. In the fourth quarter of 2022, Verizon (NYSE:VZ) posted consolidated net income of $6.7B.\n\nMeanwhile, free cash flow -- a closely-watched gauge of possible dividend payouts -- came in at to $18.7B at the end of 2023, up from $14.1B in 2022.\n\n\"2023 was a year of change. We have the right assets and the best team in place and are well-positioned for growth in 2024,\" said Chief Executive Hans Vestberg in a statement.\n\nUpgrade your investing with our groundbreaking, AI-powered InvestingPro+ stock picks. Use coupon PROPLUSBIYEARLY to get a limited time discount on our Pro and Pro+ subscription plans. Click here to find out more, and don't forget to use the discount code when checking out!\n\nRelated Articles\n\nVerizon unveils strong annual forecast, says it is \"well-positioned\" for growth\n\nD.R. Horton misses profit estimates on higher incentives; shares fall\n\nLufthansa's ITA Airways deal could reduce competition, EU warns", "link": "https://finance.yahoo.com/news/verizon-unveils-strong-annual-forecast-075531733.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.973, "neg": 0.038, "neu": 0.85, "pos": 0.112}}, {"date": "2024-01-23T00:00:00+00:00", "title": "3 Dogs of the Dow With Dividend Yields Above 4%", "content": "These three Dogs of the Down represent companies that sport impressive yields and long histories of dividend increases.", "link": "https://investorplace.com/2024/01/3-dogs-of-the-dow-with-dividend-yields-above-4-percent/", "symbols": ["IBM.US", "MMM.US", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.511, "neg": 0, "neu": 0.837, "pos": 0.163}}, {"date": "2024-01-22T22:22:01+00:00", "title": "Netflix earnings, NH primary, Oscar nominees: What to Watch", "content": "Yahoo Finance Live anchors Julie Hyman and Josh Lipton preview the top stories for Tuesday, January 23, which investors should watch closely, including Netflix earnings (NFLX), Nikki Haley's New Hampshire primary race between former President Donald Trump, and the Oscars are revealing its nominations.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Luke Carberry Mogan.", "link": "https://finance.yahoo.com/video/netflix-earnings-nh-primary-oscar-222201012.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA", "MMM.F", "MMM.MX", "MMM.SW", "MMM.US", "MMM.XETRA", "MMMC34.SA", "NFC.F"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0, "neu": 0.976, "pos": 0.024}}, {"date": "2024-01-22T21:02:26+00:00", "title": "Dow Jones Stocks: From 3M To Intel, A Big Earnings Week For Blue Chips", "content": "Eight Dow Jones stock report earnings this week. Several, including Verizon and 3M, are in buy zones or near buy points.\n\nContinue reading", "link": "https://finance.yahoo.com/m/febb010a-0401-3b70-a979-55a6b1f806d2/dow-jones-stocks%3A-from-3m-to.html", "symbols": ["AEC1.F", "AEC1.XETRA", "AXP.BA", "AXP.MX", "AXP.US", "AXPB34.SA", "BAC.F", "BAC.XETRA", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "PG.BA", "PG.MX", "PG.US", "PRG.F", "PRG.XETRA", "VERZ34.SA", "VZ.MX"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-01-22T20:46:00+00:00", "title": "Verizon wins J.D. Power award for Wireless Network Quality 32nd time in a row", "content": "Verizon Sourcing LLC\n\nVerizon is the most awarded for Network Quality, according to J.D. Power – 32 times in a row; more than any other wireless provider.  Verizon continues to rank first, significantly above the industry average in the Northeast, Southeast, and Southwest regions, with fewest call, messaging and data problems reported. Verizon received J.D. Power awards in all six regions -- achieving top score across all problem areas.**\n\nNEW YORK, Jan. 22, 2024 (GLOBE NEWSWIRE) -- Verizon prides itself on delivering the most reliable, highest performing and most secure network, and for the 32nd consecutive time, customers agree that Verizon is unmatched in wireless network quality. The latest J.D. Power 2024 U.S. Wireless Network Quality Performance Study – Volume 1, names Verizon as the most awarded brand for Wireless Network Quality.\n\nVerizon achieved the best PP100 score across all areas, with the fewest call, messaging and data problems reported*; consistently performing above the industry average.\n\nVerizon was also named #1 for Network Quality across all six regions in the country. Verizon maintains its position as the most winning brand of J.D. Power Awards for Network Quality, more than any other U.S. network provider in the history of this study.\n\n“Our Test Force is obsessed with providing our best, most reliable, highest performing and secure wireless service to our customers and being recognized by J.D. Power – the ‘voice of the customer’ – means our customers value the work we do,” said Joe Russo, EVP, Global Networks and Technology for Verizon. “This award is motivation to keep making the best network experience even better for our customers. That’s what they expect from us and why they rely on the Verizon network.“\n\nThe J.D. Power findings include responses from more than 26,725 wireless customers who participated in a national survey conducted between July and December 2023. J.D. Power recognizes the highest-ranking companies from results based on customer experience from the companies evaluated.\n\nStory continues\n\nVerizon Communications Inc. (NYSE, Nasdaq: VZ) was formed on June 30, 2000 and is one of the world’s leading providers of technology and communications services. Headquartered in New York City and with a presence around the world, Verizon generated revenues of $136.8 billion in 2022. The company offers data, video and voice services and solutions on its award-winning networks and platforms, delivering on customers’ demand for mobility, reliable network connectivity, security and control.\n\n* Tied in the Southeast, Mid-Atlantic, and North Central Regions. For J.D. Power 2024 award information, visit jdpower.com/awards\n\n**Tied for #1 in Call Quality; Messaging Quality; and Data Quality in the Mid-Atlantic Region, and tied for #1 in Data Quality in the Southeast and North Central Regions\n\nVERIZON’S ONLINE MEDIA CENTER: News releases, stories, media contacts and other resources are available at verizon.com/news. News releases are also available through an RSS feed. To subscribe, visit www.verizon.com/about/rss-feeds/.\n\nMedia contact: \r\nIlya Hemlin\r\nilya.hemlin@gmail.com\r\n908.227.0536", "link": "https://finance.yahoo.com/news/verizon-wins-j-d-power-204600208.html", "symbols": ["0Q1S.LSE", "BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.024, "neu": 0.867, "pos": 0.109}}, {"date": "2024-01-22T18:39:06+00:00", "title": "7 Stocks to Buy for the Age of 5G Connectivity", "content": "As we look upon the New Year, we see that the landscape for 5G stocks is ripe for an exciting journey. The ongoing rollout of 5G networks globally presents an enticing opportunity for investors. However, this burgeoning market has challenges, so wagering on the right 5G stock picks is imperative. 5G connectivity, known for its ultra-fast speeds, remarkably lower latency and capability to support an unprecedented number of connected devices, is set to revolutionize many sectors globally.\n\nFurthermore, the burgeoning 5G services market is anticipated to expand at a staggering CAGR of 59.4% from 2023 to 2030, according to Grand View Research. This represents a golden opportunity for investors to place their bets on the top 5G stocks at the forefront of this transformative shift, promising a chance to be part of a tech evolution.\n\nQualcomm (QCOM) Qualcomm (QCOM) logo on the side of a building in San Jose, CA.\n\nSource: jejim / Shutterstock.com\n\nQualcomm (NASDAQ:QCOM) is an American semiconductor titan, riding the 5G wave with aplomb. Stationed in the tech hub of San Diego, CA, this tech behemoth boasts a legacy of spearheading critical wireless innovations. From the bedrock of CDMA 2000 to 4G and now 5G, the firm’s strategic foresight is unequaled. Moreover, it forecasts a staggering annual 5G capital expenditure surge, hitting an astronomical $265 billion over the upcoming 15 years, signifying a seismic industry transformation.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nIn the financial realm, Qualcomm’s prowess shines bright. Its fourth-quarter adjusted earnings of $2.02 per share eclipsed the anticipated consensus of $1.91. Additionally, the company’s automotive sector sales are on an impressive trajectory, marking a significant 15% year-over-year growth, reaching $535 million. Peering into the future with confidence, Qualcomm forecasts a rosy first quarter, with sales projected to fall between $9.1 billion and $9.9 billion.\n\nT-Mobile US (TMUS) Merger Speeds Up the Comeback of T-Mobile US Inc (TMUS)\n\nSource: Shutterstock\n\nStory continues\n\nT-Mobile US (NASDAQ:TMUS) is a front-runner in the 5G sphere, making it a top pick for savvy investors eyeing the sector’s boom. As a global 5G infrastructure leader, T-Mobile has built the largest and fastest 5G network in the United States. This achievement sets the stage for a streak of continued outperformance this year.\n\nMoreover, in an innovative move, T-Mobile marked an industry first by successfully executing a six-carrier aggregation call in the sub-6 GHz spectrum, achieving tremendous bandwidth. This technical milestone underscores its commitment to advancing 5G technology.\n\nFinancially, T-Mobile’s financial position is equally striking, with its third quarter results being a testament to this. TMUS reported a whopping 322% year-over-year increase in net income, equal to $2.1 billion. Furthermore, earnings per share leaped by an astounding 355% year-over-year, while free cash flow numbers nearly doubled to a robust $4 billion.  It will post its fourth quarter results on Thursday, with average earnings per share estimates at $1.90, a 61% bump on YoY.\n\nCisco Systems (CSCO) the cisco (CSCO) logo on a wall\n\nSource: Valeriya Zankovych / Shutterstock.com\n\nCisco Systems (NASDAQ:CSCO) is another formidable contender in the 5G arena, earmarking itself as a top stock to watch in 2024. The company’s foray into private 5G services caters to various sectors, including manufacturing, energy, utilities and others. Also, Meraki, its cutting-edge 5G cloud wireless solution, stands out with its MG51 and MG51E models boasting lower latency, heightened security and faster speed times.\n\nThe fiscal year 2023 was nothing short of stellar for Cisco, with a revenue bump of 10% year-over-year, hitting a whopping $57 billion. This impressive growth is a testament to Cisco’s adept market strategy, capturing shares in AI, security and cloud domains. The convergence of 5G and cloud security forms a major tailwind for Cisco, propelling it towards another year of powerful performance in 2024. This blend of innovation and market adaptability positions Cisco as a leader in shaping the future of 5G technology.\n\nVerizon Communications (VZ) 5G stocks, VZ stock\n\nSource: Ken Wolter / Shutterstock.com\n\nVerizon Communications (NYSE:VZ) has been steadily fortifying its position in the 5G landscape. With its operational wings, the Verizon Consumer Group and Verizon Business Group, it delivers a variety of services, notably 5G and 4G wireless connectivity, alongside high-speed Internet and digital TV across the U.S.\n\nHowever, VZ’s third quarter did have its challenges. The company reported a dip in total operating revenue, down 2.6% to $33.3 billion, and a 2.8% drop in net income year-over-year. Despite these hurdles, Verizon surpassed expectations with an EPS of $1.22, beating the consensus by a notable 4.3%. Additionally, its attractive 6.76% annual dividend yield remains a strong pull for the investing world. As eyes turn to Tuesday’s upcoming fourth quarter report, with analyst earnings estimated at $1.07, reflecting a 10% year-over-year drop, the anticipation is tinged with cautious optimism.\n\nBroadcom (AVGO)\n\nSource: Shutterstock\n\nBroadcom (NASDAQ:AVGO) is a formidable player in the semiconductor sphere and stands out as one of the leading 5G stocks. Renowned for its diverse product array, Broadcom’s prowess in sectors including set-top box SoCs and RF semiconductors has propelled it to the center stage of 5G technology. Notably, its Trident 5-X12 chip, equipped with the innovative NetGNT neural network, doubles bandwidth while cutting power consumption by 25%.\n\nFinancially, Broadcom’s recent performance has been encouraging, with a revenue leap to $8.88 billion in the third quarter, up 5% year-over-year, and a significant jump in adjusted EBITDA from $5.38 to $5.80 billion. Additionally, the repurchase of 2.9 million shares totaling $2.17 billion reflects confidence in its financial standing.\n\nBroadcom’s 2024 outlook is brimming with ambition. The company forecasts an impressive $50 billion revenue, with EBITDA margins hitting 60%. Moreover, despite acknowledging some cyclical slowness in its broadband and storage semiconductor businesses, Wall Street remains optimistic about Broadcom’s prospects, especially at the back end of the year.\n\nCrown Castle International (CCI) Image of Crown Castle (CCI) logo on a web browser highlighted through the lens of a magnifying glass\n\nSource: Casimiro PT / Shutterstock.com\n\nCrown Castle International (NYSE:CCI) stands tall as a top real-estate-investment-trust (REIT) in the 5G landscape, boasting an impressive arsenal of over 40,000 cell towers. This formidable presence cements its role as a top player in the fast-evolving U.S. 5G market. Furthermore, with it poised for a leap in its small cell segment, CCI predicts 13% organic growth in 2024. This trajectory, fueled by powerful investments and the addition of new nodes, signals a bright future in this niche.\n\nFinancially, CCI demonstrates resilience, with a healthy dividend yield of 5.8%. Management’s forward-looking stance anticipates a return to growth in the 7% to 8% range by 2025. Additionally, with the 5G expansion wave, CCI is well-positioned to reap benefits from the soaring demand for wireless infrastructure. Furthermore, with the arrival of Anthony Melone as the interim CEO following Jay Brown’s retirement, CCI could be in for a spirited recovery.\n\nAs it gears up to release its fourth-quarter earnings on Wednesday, expectations are set for an EPS of 74 cents, reflecting a 20.43% dip from the previous year. Nevertheless, the seeds of a potential turnaround under new leadership are keeping investors keenly watching CCI’s next moves.\n\nWipro (WIT) network server room with computers for digital tv ip communications and internet,3d rendering. Tech stocks\n\nSource: Connect world / Shutterstock.com\n\nWipro (NYSE:WIT), mainly operating in IT services with a focus on financial services, consumer and healthcare sectors, is poised for massive growth with expected sales of $10.8 billion by March 2024. The company’s expansion of its client base, mainly those exceeding $100 million, highlights its adaptability and strength. Wipro’s expertise in the 5G sphere is evident in its “5G Def-i” platform, enabling seamless integration of networks, applications and cloud services. Additionally, its collaboration with Cisco on a managed private 5G-as-a-Service solution further strengthens its 5G network sector position.\n\nThe company’s promising third quarter 2024 report, which saw a nearly 17% rally, reflects a strong upside potential in the upcoming quarters. Moreover, Wipro’s strategic workforce optimization and productivity enhancement signal a positive trajectory aligned with market shifts.\n\nOn the date of publication, Muslim Farooque did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines\n\nMuslim Farooque is a keen investor and an optimist at heart. A life-long gamer and tech enthusiast, he has a particular affinity for analyzing technology stocks. Muslim holds a bachelor’s of science degree in applied accounting from Oxford Brookes University.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\n\nThe post 7 Stocks to Buy for the Age of 5G Connectivity appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-stocks-buy-age-5g-183906125.html", "symbols": ["0I4W.LSE", "0YXG.LSE", "1YD.BE", "1YD.DU", "1YD.F", "1YD.HA", "1YD.HM", "1YD.MU", "1YD.STU", "1YD.XETRA", "8CW.F", "8CW.STU", "AVGO.US", "AVGO34.SA", "C1CI34.SA", "CCI.US", "CIS.BE", "CIS.DU"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.012, "neu": 0.852, "pos": 0.135}}, {"date": "2024-01-22T10:51:00+00:00", "title": "3 Ultra-High-Yield Dividend Stocks That Are Simply Too Cheap to Ignore", "content": "Pay less, receive more. That sounds like a great proposition, doesn't it? Such opportunities don't come around as often as we'd like.\n\nHowever, I think some stocks currently offer the chance to pay less and receive more thanks to their attractive valuations and juicy dividends. Here are three ultra-high-yield dividend stocks that are simply too cheap to ignore.\n\n1. Ares Capital\n\nAres Capital(NASDAQ: ARCC) is the largest publicly traded business development company (BDC) based on market cap. It provides financing to middle-market businesses with a focus on the upper tier of the market.\n\nThe company's dividend yield is nearly 9.5%. This sky-high yield is largely due to BDCs being required to return at least 90% of their income to shareholders in the form of dividends to be exempt from paying federal taxes.\n\nAres Capital's shares trade at only 8.8 times forward earnings. Its price-to-book ratio is a low 1.07. These metrics would make any stock's valuation look attractive.\n\nBut Ares Capital isn't cheap because it's performing poorly. The company's business is booming with core earnings per share jumping 18% year over year in the third quarter of 2023. It has also delivered total returns that topped the S&P 500 by more than 85% since its initial public offering in 2004. Ares Capital's total return has also beaten the S&P 500 in the last three-year and five-year periods as well.\n\n2. Pfizer\n\nPfizer(NYSE: PFE) ranks as one of the largest drugmakers in the world. The company has been in business since 1849. It currently markets eight products with annual sales of $1 billion or more.\n\nBig pharma stocks have long been favorites for income investors because of their strong dividends. Pfizer is no exception. That's especially the case now with its dividend yield at nearly 6%.\n\nPfizer's forward earnings multiple is 12.5, well below the healthcare sector average of nearly 18.4. This low valuation is the result of declining sales for the company's COVID-19 products and the upcoming loss of exclusivity for several top-selling drugs.\n\nStory continues\n\nHowever, Pfizer's long-term prospects look good. The drugmaker expects to add roughly $20 billion in annual revenue by 2030 from new product launches and new indications for existing products. Business development deals could generate another $25 billion in additional annual revenue.\n\n3. Verizon Communications\n\nYou're probably familiar with Verizon Communications(NYSE: VZ) even if you're not one of the company's customers. Verizon provides wireless services in the U.S. and other countries. It's one of the largest telecommunications companies in the world.\n\nVerizon's dividend yield of over 6.8% should catch investors' attention. In addition to this ultra-high yield, the company has also increased its dividend for 17 consecutive years. That's the longest streak of dividend hikes in the U.S. telecommunications industry.\n\nWhat about valuation? Verizon looks pretty good on that front, too. Its shares currently trade at close to 8.4 times expected earnings. By comparison, the average forward earnings multiple of S&P 500 stocks in the communications services sector is 17.3.\n\nTo be sure, Verizon faces some challenges. The wireless market is highly competitive. However, the company appears to be headed in the right direction. Verizon reported a significant improvement in free cash flow in the third quarter of 2023. Its streaming bundle with Netflix and Max should also attract more subscribers.\n\nShould you invest $1,000 in Verizon Communications right now?\n\nBefore you buy stock in Verizon Communications, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Verizon Communications wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of January 16, 2024\n\nKeith Speights has positions in Ares Capital and Pfizer. The Motley Fool has positions in and recommends Pfizer. The Motley Fool recommends Verizon Communications. The Motley Fool has a disclosure policy.\n\n3 Ultra-High-Yield Dividend Stocks That Are Simply Too Cheap to Ignore was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/3-ultra-high-yield-dividend-105100356.html", "symbols": ["ARCC.US", "PFE.US", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.048, "neu": 0.848, "pos": 0.104}}, {"date": "2024-01-22T10:12:00+00:00", "title": "High-Yield Dividend Stocks: Why Verizon and AT&amp;T Don't Make the Cut", "content": "In this video, Motley Fool contributors Jason Hall and Jeff Santoro discuss why AT&T (NYSE: T) and Verizon Communications (NYSE: VZ), despite very appealing high-dividend yields, are unlikely to prove good long-term investments going forward.\n\n*Stock prices used were from the afternoon of Jan. 19, 2024. The video was published on Jan. 21, 2024.\n\nShould you invest $1,000 in Verizon Communications right now?\n\nBefore you buy stock in Verizon Communications, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Verizon Communications wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of January 16, 2024\n\nJason Hall has no position in any of the stocks mentioned. Jeff Santoro has no position in any of the stocks mentioned. The Motley Fool recommends Verizon Communications. The Motley Fool has a disclosure policy. Jason Hall is an affiliate of The Motley Fool and may be compensated for promoting its services. If you choose to subscribe through their link, they will earn some extra money that supports their channel. Their opinions remain their own and are unaffected by The Motley Fool.\n\nHigh-Yield Dividend Stocks: Why Verizon and AT&T Don't Make the Cut was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/high-yield-dividend-stocks-why-101200304.html", "symbols": ["T.US", "VZ.US"], "tags": [], "sentiment": {"polarity": -0.777, "neg": 0.09, "neu": 0.846, "pos": 0.064}}, {"date": "2024-01-22T00:00:00+00:00", "title": "7 Stocks to Buy for the Age of 5G Connectivity", "content": "Invest in these top 5G stocks to buy pioneering the next digital frontier, offering tremendous long-term upside potential.", "link": "https://investorplace.com/2024/01/7-stocks-to-buy-for-the-age-of-5g-connectivity/", "symbols": ["AVGO.US", "CCI.US", "CSCO.US", "QCOM.US", "TMUS.US", "VZ.US", "WIT.US"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0, "neu": 0.904, "pos": 0.096}}]