[{"date": "2023-11-02T22:38:00+00:00", "title": "How to Find the Next Stock Winners", "content": "(1:00) - Finding The Next Industry Heading Into A Bull Market (7:20) - Tracey’s Top Stock Picks: Where Should You Be Looking Right Now? (31:00) - Episode Roundup: V, NFLX, BAC, XOM, CVX, VRT, DFIN Podcast@Zacks.com\n\nWelcome to Episode #348 of the Value Investor Podcast.\n\nEvery week, Tracey Ryniec, the editor of Zacks Value Investor portfolio, shares some of her top value investing tips and stock picks.\n\nWith the growth stock rebound seemingly stalling, suddenly, valuations do matter. The day of reckoning seems to have come for those companies trading at 50, or 60 times, forward earnings. Many have pulled back from 2021 highs.\n\nBut should investors be diving into what worked in the past, like FAANG, when trying to find the next winners, or should they look at what might work in the future?\n\nScreening for Future Winners\n\nThere are no set screens you can run, unfortunately, which will tell you which companies will be the next decade’s big winner. I wish it was that easy to find the “next” Apple.\n\nBut investors can use screening tools, like screening for top Zacks Rank Strong Buy stocks, to help weed through the lists of stocks and get some names to start your search.\n\nInvestors are going to have to do a lot of research and drilling down into the company’s details, however. And not every stock investment will turn out as well as expected. There are no guarantees.\n\nPast, and Future, Stock Winners\n\n1. Visa Inc. (V)\n\nVisa has been a big winner since it went public in 2008. Warren Buffett even owns it in the Berkshire Hathaway portfolio. If you had bought it’s 2008 IPO, you would have seen gains of 1,372%.\n\nHowever, shares of Visa have stalled in the last 2 years, gaining just 12.6% during that period. But in 2021, when it hit new highs, Visa was trading with the sky-high P/E of 45 and in 2023, it is trading at just 24x.\n\nHas the valuation finally caught up with Visa?\n\n2. Netflix, Inc. (NFLX)\n\nNetflix was THE stock to own over the last 20 years. Since it’s 2002 IPO, it’s up 35,561%. But over the last 2 years, Netflix has given up some of its momentum, falling 34.9%.\n\nStory continues\n\nNetflix isn’t cheap, trading with a forward P/E of 34.\n\nIs Netflix’s amazing run finally over?\n\n3. Bank of America Corp. (BAC)\n\nBank of America is one of the largest holdings in Berkshire Hathaway’s equity portfolio and is one of the largest banks in the United States. But shares have struggled. Bank of America is down 41% over the last 2 years and is down 1.0% over the last 5 years.\n\nIt’s dirt cheap now, trading at 7.4x. Bank of America also has a price-to-book ratio of just 0.8. A P/B ratio under 1.0 for a bank is very cheap.\n\nBank of America pays a dividend, yielding 3.6%.\n\nAre you daring enough to put Bank of America on your watch list?\n\n4. Vertiv Holdings Co. (VRT)\n\nVertiv is a global provider of critical digital infrastructure. Vertiv has been one of the hottest stocks on Wall Street this year with shares up 192% year-to-date.\n\nBut earnings are also expected to soar 224% this year and another 27.9% next year as it posted a record high backlog of $5 billion at the end of the third quarter 2023. Vertiv remains attractively valued, with a forward P/E of 23.\n\nCould Vertiv be the “next” Apple?\n\n5. Donnelley Financial Solutions, Inc. (DFIN)\n\nDonnelley Financial Solutions is a small cap company with a market cap of $1.6 billion. It offers global risk and compliance. In the third quarter 2023, Donnelley Financial saw record software solutions sales up 5.3% year-over-year.\n\nShares of Donnelley Financial are up 43.4% year-to-date and have gained 243% over the last 5 years. Apple, by comparison, has gained 233% during that same 5-year time. Donnelley Financial is trading with a forward P/E of just 18.2.\n\nShould Donnelley Financial be on your watch list?\n\nWhat Else Do You Need to Know About Finding the Next Winning Stocks?\n\nTune into this week’s podcast to find out.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBank of America Corporation (BAC) : Free Stock Analysis Report\n\nVisa Inc. (V) : Free Stock Analysis Report\n\nNetflix, Inc. (NFLX) : Free Stock Analysis Report\n\nDonnelley Financial Solutions (DFIN) : Free Stock Analysis Report\n\nVertiv Holdings Co. (VRT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/next-stock-winners-223800232.html", "symbols": ["1DN.F", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DFIN.US", "MSC.US", "NCB.XETRA", "NFC.F", "NFC.XETRA", "NFLX.MX", "NFLX.US", "NFLX34.SA", "VRT.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.026, "neu": 0.822, "pos": 0.152}}, {"date": "2023-11-02T19:05:30+00:00", "title": "Diamond Hill Capital's Q3 2023 13F Filing: A Deep Dive into Key Transactions", "content": "Significant Position Increases in Laboratory Corp of America Holdings\n\nDiamond Hill Capital (Trades, Portfolio), a renowned investment advisory firm, recently disclosed its 13F report for the third quarter of 2023. The report provides valuable insights into the firm's investment activities during this period. Diamond Hill Capital (Trades, Portfolio), established in 2000 and based in Columbus, Ohio, is a publicly owned, independent investment adviser listed on the NASDAQ (ticker symbol: DHIL) and included in the Russell 2000 Index. The firm manages a diverse range of traditional and alternative equity strategies, serving a broad client base that includes institutions, financial intermediaries, and individuals. Diamond Hill's investment approach is primarily bottom-up, focusing on comprehensive fundamental analysis of a company's profitability, market position, financial and competitive standing, management quality, valuation, and growth components of valuation. The firm also conducts top-down analysis, focusing on industry dynamics, including sector economic factors, long-term capital flows, and the regulatory environment. Diamond Hill Capital's Q3 2023 13F Filing: A Deep Dive into Key Transactions\n\nNew Stock Additions\n\nIn the third quarter of 2023, Diamond Hill Capital (Trades, Portfolio) added a total of 7 stocks to its portfolio. The most significant addition was Extra Space Storage Inc (NYSE:EXR), with 1,428,043 shares, accounting for 0.84% of the portfolio and a total value of $173.62 million. The second-largest addition was Diamondback Energy Inc (NASDAQ:FANG), with 831,092 shares, representing approximately 0.62% of the portfolio, with a total value of $128.72 million. The third-largest addition was Mid-America Apartment Communities Inc (NYSE:MAA), with 148,761 shares, accounting for 0.09% of the portfolio and a total value of $19.14 million.\n\nKey Position Increases\n\nDiamond Hill Capital (Trades, Portfolio) also increased stakes in a total of 61 stocks. The most notable increase was in Laboratory Corp of America Holdings (NYSE:LH), with an additional 1,108,776 shares, bringing the total to 1,280,884 shares. This adjustment represents a significant 644.23% increase in share count, a 1.08% impact on the current portfolio, and a total value of $257.52 million. The second-largest increase was in Target Corp (NYSE:TGT), with an additional 1,022,437 shares, bringing the total to 2,839,156 shares. This adjustment represents a significant 56.28% increase in share count, with a total value of $313.93 million.\n\nStory continues\n\nComplete Exits\n\nDiamond Hill Capital (Trades, Portfolio) completely exited 8 holdings in the third quarter of 2023. The firm sold all 779,777 shares of Sherwin-Williams Co (NYSE:SHW), resulting in a -0.93% impact on the portfolio. Additionally, the firm liquidated all 1,059,496 shares of Phinia Inc (NYSE:PHIN), causing a -0.15% impact on the portfolio.\n\nKey Position Reductions\n\nDiamond Hill Capital (Trades, Portfolio) also reduced positions in 89 stocks. The most significant changes include a reduction in Verizon Communications Inc (NYSE:VZ) by 6,019,899 shares, resulting in a -89.69% decrease in shares and a -1% impact on the portfolio. The stock traded at an average price of $33.79 during the quarter and has returned 9.72% over the past 3 months and -2.48% year-to-date. The firm also reduced The Walt Disney Co (NYSE:DIS) by 2,476,369 shares, resulting in a -88.14% reduction in shares and a -1% impact on the portfolio. The stock traded at an average price of $85.41 during the quarter and has returned -3.89% over the past 3 months and -4.53% year-to-date.\n\nPortfolio Overview\n\nAs of the third quarter of 2023, Diamond Hill Capital (Trades, Portfolio)'s portfolio included 167 stocks. The top holdings included 4.36% in American International Group Inc (NYSE:AIG), 3.2% in ConocoPhillips (NYSE:COP), 2.65% in NVR Inc (NYSE:NVR), 2.46% in KKR & Co Inc (NYSE:KKR), and 2.44% in Bank of America Corp (NYSE:BAC). The holdings are mainly concentrated in 11 industries: Financial Services, Industrials, Healthcare, Consumer Cyclical, Technology, Energy, Consumer Defensive, Real Estate, Basic Materials, Communication Services, and Utilities. Diamond Hill Capital's Q3 2023 13F Filing: A Deep Dive into Key Transactions Diamond Hill Capital's Q3 2023 13F Filing: A Deep Dive into Key Transactions\n\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/diamond-hill-capitals-q3-2023-190530478.html", "symbols": ["AIG.US", "BAC.US", "COP.US", "DHIL.US", "DIS.US", "EXR.US", "FANG.US", "KKR.US", "LH.US", "MAA.US", "NVR.US", "PHIN.US", "SHW.US", "TGT.US", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.003, "neu": 0.854, "pos": 0.143}}, {"date": "2023-11-02T18:27:45+00:00", "title": "Wall Street Predicts These 3 Warren Buffett Stocks Will Soar 88% to 242%", "content": "Warren Buffett is undeniably the greatest living investor. Since becoming chairman of Berkshire Hathaway (NYSE:BRK-A)(NYSE:BRK-B) in 1965, he generated returns of 3.7 million percent for investors. That’s a near 20% annual return or twice that of the S&P 500 index.\n\nWhile partially a result of his buy-and-hold philosophy, the best Warren Buffett stocks are those with a simple, consumer-facing business that he bought at a good price. Allowing management do its thing and letting his winners run, the investing genius amassed a fortune for himself and his followers.\n\nThat doesn’t mean sometimes his stocks don’t do poorly. But Buffett’s overarching themes for investing remain in place, and sometimes his stocks go on sale. It means patient investors can sometimes buy the same stocks as Buffett at prices even better than what he paid. And right now Wall Street says some of them are poised for liftoff.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThe following three stocks are forecast by analysts to grow between 88% and 242% over the next year. While you can ride the coattails on these Warren Buffett stocks to profit, do your due diligence anyway. Even the Oracle of Omaha says he’s made mistakes with stocks he bought.\n\nUnited Parcel Services (UPS) United Parcel Service (UPS) truck on Interstate in the American West. UPS stock.\n\nSource: sladkozaponi / Shutterstock\n\nPackage delivery giant United Parcel Service (NYSE:UPS) has been a part of Buffett’s portfolio since 2006. He paid on average around $75 per share. UPS never split its stock, but it has paid a dividend ever since going public. The carrier also increased the payout for 14 straight years. It currently yields 4.6% annually.\n\nThe stock was never a large holding in Berkshire Hathaway’s portfolio. At its peak, he owned about 1.4 million shares. Today, though, Buffett only holds 59,400 shares. At the current price of $140 per share, that values his stake at $8.4 million. Not too shabby for mere mortals, but for Buffett it’s a paltry sum. UPS is the smallest position in the Berkshire portfolio.\n\nStory continues\n\nWhile you won’t be buying the stock at less than what Buffett did, it’s still worth considering. Wall Street has a high-end target price of $265 per share, which implies there is 88% upside in its stock over the next year.\n\nUPS business is a solid, steady grower. Although it often lagged behind the benchmark index, it still generated a 9% total return over the past 15 years. The stock dropped recently on a lower revenue outlook ahead of the peak holiday season, but that puts UPS at one of its lowest valuations in over a decade. It goes for 14 times trailing and estimated earnings while the dividend yield is at its highest point, save for during the pandemic.\n\nDon’t expect UPS stock to become a rocket, but for a “steady Eddie” stock for your portfolio, the package delivery expert will perform admirably over time.\n\nBank of America (BAC) The logo of Bank of America (BAC) in modern office building in Beverly Hills, California\n\nSource: Tero Vesalainen/Shutterstock\n\nGoing from least to most, Bank of America (NYSE:BAC) is the biggest stock holding in Buffett’s portfolio on a shares-owned basis. Berkshire Hathaway owns over 1 billion shares of the bank, putting its valuation at $27.2 billion. That’s second only to Apple (NASDAQ:AAPL).\n\nThe stock is down 20% year-to-date after investor confidence in the banking system was shaken following the collapse of several high-profile financial institutions earlier this year. However, Buffett never wavered on Bank of America. Even as he sold off other financial stocks, he held firm with this bank.\n\nAfter excoriating the way most banks operate, Buffett told shareholders he remained cautious about owning bank stocks, but “we do remain with one bank…I like Bank of America and I like the management.”\n\nWall Street is just as confident in its future. Analysts see as much as 108% upside in the stock with a high-end price target of $55 per share. There’s good reason for the exuberance. Although high interest rates are weighing heavily on consumers, Bank of America exceeded earnings and revenue estimates due to increased interest income as a result of higher borrowing costs. More consumers are using their credit cards, lifting average loan and lease balances. It’s an indictment of current economic conditions, but a silver lining of sorts for investors.\n\nBank of America is trading at severely discounted valuations, including at just a fraction of its book value. The market still views its earnings growth suspiciously, but that will turn eventually. Buying now will reward you handsomely later on.\n\nParamount Global (PARA) PARA stock: the Paramount plus logo on a phone in front of a screen displaying various Paramount TV shows and movies\n\nSource: viewimage / Shutterstock\n\nAdmittedly Paramount Global (NASDAQ:PARA) isn’t a stock Buffett has expressed the greatest confidence in. He told CNBC, “It isn’t fundamentally that good of a business.” He said the movie studio’s decision to slash its dividend was “not good news.” And he’s worried about Paramount’s future in the streaming business because higher prices are needed but that’s incompatible with retaining viewers.\n\nStill, Buffett maintains a significant holding of Paramount stock, some 93.7 million shares worth over $1 billion. It’s equivalent to a 15% stake in the entertainment company. Analysts are especially exuberant about where its price can go. They have a $37 per share high-side price target on the stock, which means Wall Street expects to see shares nearly quadruple in value.\n\nThe stock trades at less than 10 times earnings estimates and a miniscule fraction of its sales. Still it’s a tough business that will likely see more fallout from providers. The ongoing Hollywood strike isn’t helping business and theaters are ailing. Although Buffett owns a good chunk of the company and Wall Street seems enamored with the stock, Paramount Global isn’t one that I’d be rushing to buy.\n\nOn the date of publication, Rich Duprey did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nRich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post Wall Street Predicts These 3 Warren Buffett Stocks Will Soar 88% to 242% appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/wall-street-predicts-3-warren-182745747.html", "symbols": ["AAPL.US", "BAC.US", "PARA.US", "UPAB.F", "UPS.MX", "UPS.US", "UPSS34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.033, "neu": 0.822, "pos": 0.144}}, {"date": "2023-11-02T16:41:36+00:00", "title": "Dimon: The excess savings amassed by low-income consumers are now gone", "content": "JPMorgan Chase (JPM) CEO Jamie Dimon sees a divergence between the two ends of his customer base, with lower-income consumers running out of a cash cushion they amassed during the pandemic.\n\n“They don't have excess savings anymore,” said JPMorgan Chase CEO Jamie Dimon in a interview with Yahoo Finance on Wednesday night where he discussed topics ranging from geopolitics to the future direction of interest rates.\n\nExecutives from other banks view it the same way, noting that lower-income consumers are feeling more pain on several fronts. Wells Fargo’s CEO of consumer lending, Kleber Santos, called it a \"tale of two cities\" on Thursday.\n\nMiddle and upper-class customers are \"performing quite well\" while there are \"signs of stress\" among those with lower incomes, Santos said while speaking at a Bancanalysts Association of Boston conference. \"That’s where the deterioration is mostly.\" Wells Fargo bank branch in Beverly Hills, Calif. (Photo by PATRICK T. FALLON/AFP via Getty Images) (PATRICK T. FALLON via Getty Images)\n\nAs a result, he said, Wells (WFC) is becoming \"more conservative\" on extending loans to that income segment, and not originating subprime loans \"anywhere, any asset class, nothing.\"\n\nThe strength of the US consumer is a subject of debate across the financial world at a time when economic data has been coming in largely stronger than expected despite the Federal Reserve’s interest rate hiking campaign as the central bank seeks to cool inflation.\n\nThe Fed on Wednesday maintained its benchmark interest rate in a range of 5.25%-5.50%, the highest in 22 years, while leaving the door open for further action as officials work to bring inflation back to the central bank's 2% target.\n\nThe Fed also upgraded its assessment of the economy to \"strong\" in the third quarter from \"solid\" in September, a change that comes after third quarter GDP data published last week showed growth clocked in at a whopping 4.9% annualized rate over the summer months. That was driven in large part by strong consumer spending.\n\nStory continues Federal Reserve Chair Jerome Powell speaks during a news conference Wednesday. (AP Photo/Susan Walsh) (ASSOCIATED PRESS)\n\n\"We may have underestimated the balance sheet strength of households and small businesses,\" Fed chair Jerome Powell said at a press conference Wednesday while discussing the strength of the consumer.\n\n\"The question is how long can that continue.\"\n\nAs of the end of the second quarter, total US credit card debt crossed $1 trillion as delinquency rates edged closer to pre-pandemic levels, according to a household debt and credit report from the Federal Reserve Bank of New York. On Tuesday the New York Fed will release third quarter results.\n\nWhat the market is 'most worried about'\n\nSeveral other banks have offered warnings about slowing consumer spending while releasing their third-quarter earnings in recent weeks, highlighting the pain they see among the lower end of their customer bases.\n\nCitigroup (C) CEO Jane Fraser said affluent customers are accounting for almost all of the spending growth, and weakness is showing among those with lower credit scores. Citi expects its credit card losses to reach pre-COVID levels by the end of the year. Jane Fraser, CEO of Citigroup. REUTERS/Mike Blake (Mike Blake / reuters)\n\nBank of America (BAC) CEO Brian Moynihan said its consumer bank balances are still above pre-pandemic levels but they are coming down. In late September, he said the bank's consumers were spending at pre-pandemic rates \"consistent with 2016, 2017, 2018.\"\n\nFifth Third (FITB) executives also cited more economic pain among lower-end subprime borrowers. And that, according to Fifth Third CEO Tim Spence, is what the market is \"most worried about right now.\"\n\nCapital One (COF) CEO Richard Fairbank said spending and delinquencies among lower-end consumers, which the bank saw rising in past quarters, is beginning to stabilize, but now higher-income customers are starting to follow the same downward trend.\n\n\"Our upmarket segments are sort of just a little bit behind,\" he said.\n\n'There are a lot of different ways to measure it'\n\nTo be sure, Dimon told Yahoo Finance that overall the consumer \"is in very good shape,\" and that if the economy does go into recession \"the consumer is going in better shape than they gone in most recessions.\"\n\nAt the same time, the boss of the largest US bank said the lower third of consumers who have accounts with the largest US bank have run out of their excess savings amassed during the pandemic.\n\nThe middle class is getting close to zero, he said, with no excess savings. \"But they still have jobs and wages are going up.\"\n\nThe wealthy, he added, “still have excess.\" JPMorgan Chase CEO Jamie Dimon. REUTERS/Elizabeth Frantz (Elizabeth Frantz / reuters)\n\nTaken together, the savings in an average checking account at JPMorgan \"is being spent down\" and \"we’ve seen that number coming down.\"\n\nThere is still disagreement even within JPMorgan about when the overall figure from all consumers will drop further.\n\nDimon said he saw three different forecasts, all produced by JPMorgan. One said this savings number would come down by the first quarter of next year, one said the third quarter and one said the end of next year.\n\n\"There are a lot of different ways to measure it.\"\n\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/dimon-the-excess-savings-amassed-by-low-income-consumers-are-now-gone-164136390.html", "symbols": ["0Q16.LSE", "0R01.LSE", "0R2F.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CAON34.SA", "CFX.F", "CMC.F", "CMC.XETRA", "COF.MX", "COF.US"], "tags": [], "sentiment": {"polarity": 0.285, "neg": 0.05, "neu": 0.891, "pos": 0.059}}, {"date": "2023-11-02T13:00:00+00:00", "title": "Spontaneous Family Wealth Discussions and Decisions Can Lead to Regrets, Finds Merrill Study", "content": "Merrill Center for Family Wealth™ publishes guide to productive family conversations about money and relationships\n\nNEW YORK, Nov. 2, 2023 /PRNewswire/ -- Nearly four in five wealthy families have had unplanned discussions about wealth with 26% later regretting it, according to a new study published by the Merrill Center for Family Wealth™, a part of Merrill Private Wealth Management. The research found 33% of families increased family conversations about wealth since the Pandemic; however, many families dive in without a plan, process, or skills to make well-intended conversations productive. This can lead to unintended stress, potential family rifts and under-functioning heirs.\n\nTo better understand how families approach discussions about wealth and decisions around gifting money, distributing assets among heirs, managing shared assets, and preparing the rising generation to handle wealth, Merrill surveyed 270+ individuals from families with $50 million or more in assets. The report, Pulling back the curtain: Wealthy families open up about money, relationships and decision-making, offers insights from a rarely-studied demographic and provides valuable lessons and action steps for all families navigating the complexities of intergenerational wealth.\n\nThe survey found:\n\n78% of families who recently had conversations about family wealth said the discussion came up spontaneously. 26% of those who have had these conversations said they regretted it after the fact. 48% say that financial decision-making is shared among two or more generations. 54% report that one of their biggest challenges when co-managing shared assets is limited governance, such as a lack of transparency or clarity about roles, responsibilities, and how decisions are made, by whom. Just 14% say that the technical complexity of co-managing shared assets is a top challenge, while the remaining 86% point to non-technical challenges like complex family dynamics and limited governance\n\nStory continues\n\n\"Our research pulls back the curtains on the intricacies of family wealth, a topic that still remains taboo in many circles,\" said Valerie Galinskaya, head of the Merrill Center for Family Wealth and principal author of a report on the study findings. \"When families learn to navigate wealth together, starting with an intentional plan and thoughtful conversations, they can do great things and thrive.\"\n\nGifting and distributing assets: What could go wrong? Beyond looking at how families make decisions and communicate about wealth, the study also explored practices around lifetime gifting and the distribution of estate assets.\n\nThe survey found:\n\n83% of families provide some sort of ongoing support for adult children or other heirs, including 39% who provide recurring lifestyle support, such as payment of living expenses and repayment of debt or loans. 56% who make or plan to make financial gifts during their lifetime do so with an intent to share gifts equally among their children or other family recipients. 35% of those making lifetime gifts do so on a case-by-case basis, depending on the age and readiness of the recipient, their financial need, and how much time they have put into the family.\n\nThe Merrill Center for Family Wealth (the Center), a highly specialized group within Merrill Private Wealth Management, works closely with families to develop the skills and processes for more productive family wealth conversations and effective decision-making. In its report on the study findings, the Center provides recommended guidance based on years of experience facilitating family wealth discussions, particularly among families with substantial wealth, complex dynamics or circumstances.\n\nBank of America Bank of America is one of the world's leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 68 million consumer and small business clients with approximately 3,900 retail financial centers, approximately 15,000 ATMs and award-winning digital banking with approximately 57 million verified digital users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 4 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and more than 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange.\n\nInvesting involves risk. There is always the potential of losing money when you invest in securities.\n\nMerrill, its affiliates and financial advisors do not provide legal, tax or accounting advice. You should consult your legal and/or tax advisors before making any financial decisions.\n\nMerrill Lynch, Pierce, Fenner & Smith Incorporated (also referred to as \"MLPF&S\" or \"Merrill\") makes available certain investment products sponsored, managed, distributed or provided by companies that are affiliates of Bank of America Corporation (\"BofA Corp.\").  MLPF&S is a registered broker-dealer, registered investment adviser, Member SIPC and a wholly owned subsidiary of BofA Corp.\n\nMerrill Private Wealth Management is a division of MLPF&S that offers a broad array of personalized wealth management products and services. Both brokerage and investment advisory services (including financial planning) are offered by the Private Wealth Advisors through MLPF&S. The nature and degree of advice and assistance provided, the fees charged, and client rights and Merrill's obligations will differ among these services. Investments involve risk, including the possible loss of principal investment.\n\nThe banking, credit and trust services sold by the Private Wealth Advisors are offered by licensed banks and trust companies, including Bank of America, N.A., Member FDIC, and other affiliated banks.\n\nTrust, fiduciary and investment management services, including assets managed by the Specialty Asset Management team, are provided by Bank of America, N.A., Member FDIC and wholly owned subsidiary of Bank of America Corporation (\"BofA Corp.\"), and its agents.\n\nInvestment products:\n\nAre Not FDIC Insured  Are Not Bank Guaranteed  May Lose Value\n\n© 2023 Bank of America Corporation. All rights reserved.\n\nReporters May Contact: Julia Ehrenfeld, Bank of America\r\nPhone: 1.646.855.3267\r\nJulia.Ehrenfeld@bofa.com\n\nMAP5963378 (PRNewsfoto/Bank of America Corporation) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/spontaneous-family-wealth-discussions-and-decisions-can-lead-to-regrets-finds-merrill-study-301975458.html\n\nSOURCE Bank of America Corporation", "link": "https://finance.yahoo.com/news/spontaneous-family-wealth-discussions-decisions-130000859.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.034, "neu": 0.799, "pos": 0.168}}, {"date": "2023-11-02T11:09:48+00:00", "title": "What JP Morgan Chase CEO Jamie Dimon just told investors is very important", "content": "Perspective in life — and investing — is critically important.\n\nIt's one thing to write about the words emanating from the world's most powerful chief executive officer, but something else entirely to sit across from them for 25 minutes asking questions on live TV.\n\nHow do I know this? Well, I just did it — and in Frisco, Texas no less!\n\nAfter several weeks of damn near begging average investors to carefully consider the warnings from JP Morgan Chase chairman and CEO Jamie Dimon, I got to chat with banking's top dog late Wednesday.\n\nA total of 25 minutes exclusively on Yahoo Finance Live with someone whose career I have followed closely, mere hours after the Federal Reserve left interest rates at 22-year highs.\n\nRare.\n\nAdded intrigue: Fed chair Jerome Powell sounded quite cautious on the economic outlook in his presser, mostly as he (and others at the Fed) can't quite measure the impact of their aggressive rate hikes since March 2022.\n\nWith that as a backdrop (and October's poor market performance), here are a few observations from being inches away from Dimon — who was in Texas for JP Morgan's \"Make Your Move Summit\" dedicated to empowering small businesses. They are in no precise order, random in fact.\n\nChill on the succession stuff: People need to stop asking Dimon about when he is going to retire, it's getting tiring. I found Dimon to be classic Dimon — wicked knowledge of incredible details, enjoys engaging with clients and employees, and on the ready to phone up a powerful friend if need be. I am sure Dimon has laid out a succession plan to JPM's board, but it's unlikely to be executed anytime soon. And that is a good thing for JP Morgan and its investors.\n\n\"Jamie is the LeBron James of banking,\" Wells Fargo's long-time bank analyst Mike Mayo told Yahoo Finance Live post our interview with Dimon.\n\nJust like LeBron, Dimon has earned the right to go out on his own terms when he sees fit.\n\nStory continues\n\nHousing in 2024 is going to be tough: Powell struck a note of caution on the outlook for housing amid 8% mortgage rates. Dimon came off to me equally as cautious, given the steep ascent in housing costs. Higher rates are \"slowing down people's ability to move,\" Dimon told me. \"People today are doing adjustable rate mortgages, but the cost of carrying a mortgage is higher. So buyers either are going to buy a smaller house, which is a choice, or they're going to wait, or not buy at all,\" Dimon added.\n\nAre we nearing a housing crisis? No, this is of course not Great Recession stuff. But the reality is that it has become way more expensive to own a home, and housing supply is scarce. Hence a powerful driver of economic activity is drying up ahead of 2024. It's hard to see the situation improving as the Fed made it clear (at least to me) that higher rates for longer are the new normal.\n\nBring on those Home Depot earnings... JP Morgan & Chase chairman and CEO Jamie Dimon talks exclusively with Yahoo Finance about the path forward for interest rates, the economy and small businesses.\n\nThe Lag: \"I personally believe that at one point it will rattle the markets,\" Dimon said on the lagged impact of the Fed's quantitative tightening (defined by Yahoo Finance here). No further context needed — let that statement sink in.\n\nThe Folo Up:As I wrote a couple weeks back, for Dimon to say this is the \"most dangerous\" time he has seen for the world was a major wakeup call to investors under-pricing geopolitical risks. I asked Dimon to expand on what he meant on his latest earnings release.\n\n\"This is maybe a little bit more like pre-World War 2,\" Dimon said, pointing to the Russia/Ukraine and Israel/Hamas wars. \"Like we have to get this right. I like the fact that the Biden administration and others now, Mitch McConnell, and [other] leaders are saying we need to take care of this. It is for America. Because if we don't fix this the world may not be completely safe for freedom.\"\n\nI came away from my chat with Dimon glad to have asked investors to listen to his words several weeks ago.\n\nSitting across from Dimon, it's obvious he takes these interviews seriously. It's not to talk his book or scare the hell out of people. This is just the most connected person in business doing what he does best — offering invaluable insight while trying to keep JPM humming along.\n\n\"Study everything. Learn, learn, learn. Don't get rigid in how you think,\" Dimon added.\n\nListen to that, too investors.\n\nProgramming Note: Yahoo Finance anchor Seana Smith will be reporting live from JP Morgan Chase's 'Make Your Move Summit' in Frisco, Texas all-day Thursday. Key guests include Chase Business Banking CEO Ben Walter, Southwest CEO Bob Jordan and NFL Hall of Famer Emmitt Smith.\n\nBrian Sozzi is Yahoo Finance's Executive Editor. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn. Tips on deals, mergers, activist situations, or anything else? Email brian.sozzi@yahoofinance.com.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/what-jp-morgan-chase-ceo-jamie-dimon-just-told-investors-is-very-important-110948290.html", "symbols": ["0Q16.LSE", "0R2F.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "CMC.F", "CMC.XETRA", "DWD.F", "DWD.XETRA", "HD.MX", "HD.US", "HDI.F", "HDI.XETRA", "HOME34.SA", "JPM-PC.US"], "tags": [], "sentiment": {"polarity": 0.982, "neg": 0.087, "neu": 0.796, "pos": 0.117}}, {"date": "2023-11-02T11:09:48+00:00", "title": "What JPMorgan Chase CEO Jamie Dimon just told investors is very important", "content": "Perspective in life — and investing — is critically important.\n\nIt's one thing to write about the words emanating from the world's most powerful chief executive officer, but something else entirely to sit across from them for 25 minutes asking questions on live TV.\n\nHow do I know this? Well, I just did it — and in Frisco, Texas, no less!\n\nAfter several weeks of damn near begging average investors to carefully consider the warnings from JPMorgan Chase chairman and CEO Jamie Dimon, I got to chat with banking's top dog late Wednesday.\n\nA total of 25 minutes exclusively on Yahoo Finance Live with someone whose career I have followed closely, mere hours after the Federal Reserve left interest rates at 22-year highs.\n\nRare.\n\nAdded intrigue: Fed chair Jerome Powell sounded quite cautious on the economic outlook in his presser, mostly as he (and others at the Fed) can't quite measure the impact of their aggressive rate hikes since March 2022.\n\nWith that as a backdrop (and October's poor market performance), here are a few observations from being inches away from Dimon — who was in Texas for JPMorgan's \"Make Your Move Summit\" dedicated to empowering small businesses. They are in no precise order, random in fact.\n\nChill on the succession stuff: People need to stop asking Dimon about when he is going to retire, it's getting tiring. I found Dimon to be classic Dimon — wicked knowledge of incredible details, enjoys engaging with clients and employees, and on the ready to phone up a powerful friend if need be. I am sure Dimon has laid out a succession plan to JPM's board, but it's unlikely to be executed anytime soon. And that is a good thing for JPMorgan and its investors.\n\n\"Jamie is the LeBron James of banking,\" Wells Fargo's long-time bank analyst Mike Mayo told Yahoo Finance Live post our interview with Dimon.\n\nJust like LeBron, Dimon has earned the right to go out on his own terms when he sees fit.\n\nStory continues\n\nHousing in 2024 is going to be tough: Powell struck a note of caution on the outlook for housing amid 8% mortgage rates. Dimon came off to me equally as cautious, given the steep ascent in housing costs. Higher rates are \"slowing down people's ability to move,\" Dimon told me. \"People today are doing adjustable rate mortgages, but the cost of carrying a mortgage is higher. So buyers either are going to buy a smaller house, which is a choice, or they're going to wait, or not buy at all,\" Dimon added.\n\nAre we nearing a housing crisis? No, this is of course not Great Recession stuff. But the reality is that it has become way more expensive to own a home, and housing supply is scarce. That means a powerful driver of economic activity is drying up ahead of 2024. It's hard to see the situation improving as the Fed made it clear (at least to me) that higher rates for longer are the new normal.\n\nBring on those Home Depot earnings... JPMorgan & Chase chairman and CEO Jamie Dimon talks exclusively with Yahoo Finance about the path forward for interest rates, the economy and small businesses.\n\nThe Lag: \"I personally believe that at one point it will rattle the markets,\" Dimon said on the lagged impact of the Fed's quantitative tightening (defined by Yahoo Finance here). No further context needed — let that statement sink in.\n\nThe Folo Up:As I wrote a couple weeks back, for Dimon to say this is the \"most dangerous\" time he has seen for the world was a major wakeup call to investors under-pricing geopolitical risks. I asked Dimon to expand on what he meant on his latest earnings release.\n\n\"This is maybe a little bit more like pre-World War 2,\" Dimon said, pointing to the Russia/Ukraine and Israel/Hamas wars. \"Like we have to get this right. I like the fact that the Biden administration and others now, Mitch McConnell, and [other] leaders are saying we need to take care of this. It is for America. Because if we don't fix this the world may not be completely safe for freedom.\"\n\nI came away from my chat with Dimon glad to have asked investors to listen to his words several weeks ago.\n\nSitting across from Dimon, it's obvious he takes these interviews seriously. It's not to talk his book or scare the hell out of people. This is just the most connected person in business doing what he does best — offering invaluable insight while trying to keep JPM humming along.\n\n\"Study everything. Learn, learn, learn. Don't get rigid in how you think,\" Dimon added.\n\nListen to that, too investors.\n\nProgramming Note: Yahoo Finance anchor Seana Smith will be reporting live from JPMorgan Chase's 'Make Your Move Summit' in Frisco, Texas all-day Thursday. Key guests include Chase Business Banking CEO Ben Walter, Southwest CEO Bob Jordan and NFL Hall of Famer Emmitt Smith.\n\nBrian Sozzi is Yahoo Finance's Executive Editor. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn. Tips on deals, mergers, activist situations, or anything else? Email brian.sozzi@yahoofinance.com.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/what-jpmorgan-chase-ceo-jamie-dimon-just-told-investors-is-very-important-110948739.html", "symbols": ["0Q16.LSE", "0R2F.LSE", "2SI.F", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "CMC.F", "CMC.XETRA", "DWD.F", "DWD.XETRA", "HD.MX", "HD.US", "HDI.F", "HDI.XETRA", "HOME34.SA"], "tags": [], "sentiment": {"polarity": 0.911, "neg": 0.089, "neu": 0.81, "pos": 0.102}}, {"date": "2023-11-02T09:00:55+00:00", "title": "Dimon on the Fed, inflation, and the consumer: YF Exclusive", "content": "In an exclusive interview, JPMorgan Chase CEO Jamie Dimon (JPM) speaks with Yahoo Finance Executive Editor Brian Sozzi from the Chase for Business \"Make Your Move Summit\" in Texas.\n\nDimon first weighed in on the Federal Reserve's decision to keep its rate hiking cycle on pause. \"I think they did the right thing to raise rates rapidly and I think they are kind of right to pause here a little bit and see what happens. But I suspect that they might not be done,\" Dimon said, adding that \"there's a chance inflation is a little bit stickier than people think.\"\n\nWhen it comes to the consumer, Dimon thinks they are in \"rather good shape\" given low unemployment and high home equity values. Dimon cautioned, however, that lower-income consumers have spent the excess savings they built up during the pandemic. \"The middle class is getting close to zero, no excess savings,\" Dimon said, \"but they still have jobs and wages are going up.\"\n\nDimon thinks there may be a \"sea change\" in the economy, noting factors like government spending and an aging population. Dimon said of the future: \"I don't see anything which is...disinflationary.\"\n\nDimon also had strong words for leaders in Washington. \"D.C. goes out of its way to make it hard...for small to large businesses to grow and expand,\" Dimon said. \"Some of our regulations are, they're barnacles. They've been there for years. They should be taken away because they're just slowing down growth. I mean, I'm in favor of good regulations, just not endless regulations.\"\n\nDimon added that geopolitical concerns such as the Israel-Hamas war and Russia's invasion of Ukraine remain top of mind, advising the average investor to keep things like that in mind, saying \"look at a potential range of outcomes and...how you feel about if those range of outcomes happened, so you've really thought it through.\"\n\nKey video moments\n\n00:00:45 Dimon on the Fed's path\n\n00:03:50 Dimon’s take on housing\n\n00:06:30 Dimon on the \"sea change\" in the economy and higher for longer rates\n\nStory continues\n\n00:08:30 Dimon on the deficit\n\n00:10:00 Dimon on lending to businesses\n\n00:11:50 Dimon describes the state of the U.S. consumer\n\n00:13:00 How Dimon feels about the U.S. government\n\n00:16:30 Dimon on his biggest concerns, geopolitical events\n\n00:19:50 Dimon on why he's hopeful for America\n\n00:21:45 Dimon's message for small businesses", "link": "https://finance.yahoo.com/video/dimon-fed-inflation-consumer-yf-090055883.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "CMC.F", "CMC.XETRA", "DWD.F", "DWD.XETRA", "GOS.F", "GOS.XETRA", "GS-PA.US", "GS-PC.US", "GS-PD.US", "GS-PK.US", "GS.MX"], "tags": [], "sentiment": {"polarity": 0.96, "neg": 0.038, "neu": 0.878, "pos": 0.084}}, {"date": "2023-11-02T05:13:26+00:00", "title": "The Bank of America Corp (BAC) Company: A Short SWOT Analysis", "content": "Bank of America Corp (NYSE:BAC) continues to leverage its strong brand and extensive customer base to maintain a competitive edge. Despite facing threats from regulatory changes and market volatility, BAC has significant opportunities for growth through digital transformation and expansion into emerging markets. BAC's high levels of debt and reliance on the U.S. market are notable weaknesses that could impact its future performance. The company's strategic plans aim to address these weaknesses and threats while capitalizing on its strengths and opportunities.\n\nWarning! GuruFocus has detected 2 Warning Sign with BAC.\n\nBank of America Corp (NYSE:BAC), one of the largest financial institutions in the United States, recently filed its 10-Q report with the Securities and Exchange Commission (SEC) on October 31, 2023. The report provides a comprehensive overview of the company's financial performance, revealing a net income of $7.8 billion for the third quarter of 2023. Despite facing challenges such as high levels of debt and market volatility, BAC has demonstrated resilience, leveraging its strong brand, loyal customer base, and robust balance sheet to maintain a competitive edge. This SWOT analysis delves into the strengths, weaknesses, opportunities, and threats that shape BAC's strategic outlook. The Bank of America Corp (BAC) Company: A Short SWOT Analysis\n\nStrengths\n\nBrand Power and Extensive Customer Base: Bank of America Corp (NYSE:BAC) boasts a strong brand and a vast customer base, serving approximately 69 million consumer and small business clients. Its extensive network of branches, ATMs, and digital banking platforms, including a website with approximately 46 million active users, underscores its market dominance. This extensive reach enhances BAC's ability to attract and retain customers, driving its revenue growth.\n\nRobust Balance Sheet: BAC's robust balance sheet, with total assets of $3.2 trillion as of September 30, 2023, underscores its financial strength. This strong financial position enables BAC to weather economic downturns, invest in growth opportunities, and provide returns to shareholders, enhancing its competitive advantage.\n\nStory continues\n\nWeaknesses\n\nHigh Levels of Debt: Despite its strong balance sheet, BAC has high levels of debt, which could pose financial risks. High debt levels can increase the company's interest expenses and reduce its financial flexibility, potentially impacting its profitability and ability to invest in growth opportunities.\n\nDependence on the U.S. Market: BAC's operations are primarily U.S.-focused, making it susceptible to economic fluctuations and regulatory changes in the U.S. market. This dependence on a single market could limit BAC's growth potential and increase its vulnerability to market-specific risks.\n\nOpportunities\n\nDigital Transformation: The ongoing digital transformation in the banking sector presents significant opportunities for BAC. By investing in digital banking platforms, artificial intelligence, and data analytics, BAC can enhance its customer service, improve operational efficiency, and develop innovative products and services, driving its future growth.\n\nExpansion into Emerging Markets: Emerging markets offer promising growth opportunities for BAC. By expanding its operations in these markets, BAC can tap into their growing middle-class populations, increasing demand for financial services, and favorable economic growth prospects.\n\nThreats\n\nRegulatory Changes: As a financial institution, BAC faces the risk of regulatory changes that could impact its operations and profitability. Changes in banking regulations, tax laws, and financial reporting standards could increase BAC's compliance costs and affect its business strategies.\n\nMarket Volatility: BAC is exposed to market volatility, which could impact its financial performance. Fluctuations in interest rates, exchange rates, and stock market prices can affect BAC's net interest income, foreign exchange earnings, and investment returns, posing risks to its profitability.\n\nIn conclusion, while Bank of America Corp (NYSE:BAC) faces challenges such as high levels of debt and market volatility, it has significant strengths and opportunities that it can leverage to drive its future growth. By focusing on digital transformation and expansion into emerging markets, BAC can address its weaknesses and mitigate its threats, positioning it for long-term success.\n\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/bank-america-corp-bac-company-051326625.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.072, "neu": 0.729, "pos": 0.199}}, {"date": "2023-11-02T02:05:39+00:00", "title": "Financial Steals: 3 Bank Stocks With Outstanding Value", "content": "Bank stocks continue to be under pressure, with the shares of many lenders now at a 52-week low. The Standards and Practices (S&P) Banks Index is currently down 22% versus a year-to-date gain of 10% in the benchmark S&P 500 index. The continued pullback comes despite all the major American lenders posting strong third-quarter earnings that by-and-large beat Wall Street forecasts. The concerns weighing on bank stocks seem to have more to do with the impacts of high interest rates, a continued dearth of deals on Wall Street, geopolitical instability, and fears of an economic recession.\n\nThough the continued slump in bank stocks is disappointing, it presents an opportunity for investors to buy these quality stocks at distressed prices. It’s worth noting that hedge funds around the world bought bank stocks to start the year’s fourth quarter, allocating capital on expectations that the financial services sector will rebound in the near-term. Here are financial steals: three bank stocks with outstanding value.\n\nJPMorgan Chase (JPM) Chase Bank logo and storefront\n\nSource: Daryl L / Shutterstock.com\n\nIf there’s one bank stock to own, it’s JPMorgan Chase (NYSE: JPM). The largest bank in the world with assets under management of $3 trillion, JPMorgan Chase is seen as a bellwether for the entire United States financial industry. In late September, JPMorgan Chase raised its quarterly dividend to stockholders by 5% to $1.05 per share, giving it a yield of 3.02%. The dividend increase comes after the bank successfully completed the U.S. Federal Reserve’s stress test process, ensuring that it is well capitalized and able to withstand any financial pressures that arise.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nMore recently, JPMorgan Chase issued third-quarter financial results that handily beat Wall Street forecasts. The lender announced earnings per share (EPS) of $4.33, which was greater than the $3.95 consensus estimate among analysts who cover the bank. Revenue totaled $40.69 billion, which was also above the $39.63 billion expected among analysts. Executives credited the strong Q3 results to greater levels of interest income and lower credit costs than expected. JPMorgan’s latest financial results were helped by its acquisition earlier this year of distressed regional lender First Republic Bank. Profit at JPMorgan rose 35% in Q3 but would have been up only 24% had First Republic not been included.\n\nStory continues\n\nJPM stock has increased only 3% this year. The bank’s valuation is rock bottom right now, with shares trading at eight times forward earnings.\n\nMorgan Stanley (MS) The logo for Morgan Stanley is displayed on the side of a building.\n\nSource: Ken Wolter / Shutterstock.com\n\nWall Street investment bank Morgan Stanley (NYSE:MS) has a new CEO. Ted Pick, a veteran insider at the bank, has been chosen to succeed retiring CEO James Gorman who will step down on Jan. 1, 2024. Pick climbed the ranks to lead the bank’s Wall Street operations. He currently runs Morgan Stanley’s institutional securities group, which includes investment banking and trading activities, and has been co-president of Morgan Stanley for the past two years. Pick, who is a Harvard MBA, joined Morgan Stanley in 1990 and has been with the firm his entire career.\n\nOne of Pick’s top priorities will surely be to get MS stock moving in the right direction again. Down 17% on the year, Morgan Stanley’s share price is currently trading at at 52-week low. The stock is at the same level it was at nearly three years ago. The succession drama surrounding the replacement of Gorman, who led Morgan Stanley since 2010, was part of the problem. So too has been the turmoil in the entire banking sector. The poor stock performance has come despite Morgan Stanley consistently posting better-than-expected results. The lender has positioned itself as a wealth management leader.\n\nMS stock looks like good value right now, trading at 12 times future earnings and offering a dividend that pays 85 cents a share per quarter for a yield of nearly 5%.\n\nBank of America (BAC) bank of america stock\n\nSource: PL Gould / Shutterstock.com\n\nBank of America (NYSE:BAC) is another lender that continues to fire on all cylinders. Recently, the bank reported a 10% year-over-year increase in its third-quarter profit, driven by stronger-than-expected interest income. The second largest bank in the U.S. after JPMorgan Chase, Bank of America announced a profit of $7.8 billion, or 90 cents per share, for Q3, up 10% from a year ago and ahead of Wall Street forecasts that had called for EPS of 82 cents.\n\nThe bank’s revenue for the three months ended Sept. 30 rose 3% to $25.32 billion, beating analyst expectations for $25.14 billion in sales. Bank of America attributed the strong performance to elevated interest rates, which are currently at a 22-year high, as well as continued growth in its loan book. The bank also continues to benefit from its large retail banking operations, which have helped to power results as consumers continue spending. BAC stock too has lagged the market this year, falling 21% since January. The shares are currently trading at seven times future earnings and offer a quarterly dividend payment of 24 cents a share for a yield of 3.64%.\n\nOn the date of publication, Joel Baglole held a long position in BAC. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post Financial Steals: 3 Bank Stocks With Outstanding Value appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/financial-steals-3-bank-stocks-020539933.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DWD.F", "DWD.XETRA", "JPM.US", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US", "MSBR34.SA", "MSC.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.053, "neu": 0.816, "pos": 0.131}}, {"date": "2023-11-02T00:00:00+00:00", "title": "Wall Street Predicts These 3 Warren Buffett Stocks Will Soar 88% to 242%", "content": "Wall Street is very excited about these Warren Buffett stocks and their growth potential over the coming year.", "link": "https://investorplace.com/2023/11/wall-street-predicts-these-3-warren-buffett-stocks-will-soar-88-to-242/", "symbols": ["BAC.US", "UPS.US"], "tags": [], "sentiment": {"polarity": 0.644, "neg": 0, "neu": 0.752, "pos": 0.248}}, {"date": "2023-11-01T12:18:00+00:00", "title": "Why Warren Buffett Loves Dividend Stocks", "content": "Warren Buffett is widely regarded as one of the best investors of all time. When you look at his holdings, the majority of his positions within the Berkshire Hathaway (NYSE: BRK.B) portfolio are dividend stocks.\n\nContinue reading", "link": "https://finance.yahoo.com/m/eb8391ae-147f-3063-9293-163111b5e6d3/why-warren-buffett-loves.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "BRK-B.US", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.637, "neg": 0, "neu": 0.896, "pos": 0.104}}, {"date": "2023-11-01T09:06:00+00:00", "title": "3 Warren Buffett Stocks That Are Screaming Buys in November", "content": "Berkshire Hathaway's $326 billion investment portfolio has three clear-as-day bargains hiding in plain sight.\n\nContinue reading", "link": "https://finance.yahoo.com/m/b9ca5b60-c222-3c77-bbb4-7c7f974ed03d/3-warren-buffett-stocks-that.html", "symbols": ["0VV.F", "0VVB.F", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "COMB.BR", "M4I.F", "M4I.XETRA", "MA.MX", "MA.US", "MSC.US", "MSCD34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": -0.296, "neg": 0.128, "neu": 0.872, "pos": 0}}, {"date": "2023-11-01T06:42:55+00:00", "title": "Q3 2023 Green Plains Inc and Green Plains Partners LP Earnings Call", "content": "Participants\n\nDevin Mogler; SVP of Government Relations, Sustainability & Communications; Green Plains Inc.\n\nGrant D. Kadavy; EVP of Commercial Operations; Green Plains Inc.\n\nJames E. Stark; CFO & Principal Accounting Officer; Green Plains Inc.\n\nPhil Boggs; EVP of IR Green Plains Holdings LLC; Green Plains Partners LP\n\nTodd A. Becker; President, CEO & Director; Green Plains Inc.\n\nAndrew Strelzik; Senior Restaurant Analyst; BMO Capital Markets Equity Research\n\nBenjamin Shelton Bienvenu; MD & Analyst; Stephens Inc., Research Division\n\nCraig Irwin; MD & Senior Research Analyst; ROTH MKM Partners, LLC, Research Division\n\nEric Stine; Senior Research Analyst; Craig-Hallum Capital Group LLC, Research Division\n\nJordan Levy; Research Analyst; Truist Securities, Inc., Research Division\n\nKristen Owen; Executive Director & Senior Analyst; Oppenheimer & Co. Inc., Research Division\n\nManav Gupta; Analyst; UBS Investment Bank, Research Division\n\nSalvator Tiano; Analyst; BofA Securities, Research Division\n\nUnidentified Analyst\n\nPresentation\n\nOperator\n\nGood morning, and welcome to the Green Plains Inc. and Green Plains Partners Third Quarter 2023 Earnings Conference Call. (Operator Instructions)\r\nI will now turn the call over to your host, Phil Boggs, Executive Vice President of Investor Relations. Mr. Boggs, please go ahead.\n\nPhil Boggs\n\nThank you, and good morning, everyone. Welcome to Green Plains Inc. and Green Plains Partners third quarter 2023 earnings call. Participants on today's call are Todd Becker, President and Chief Executive Officer; and Jim Stark, Chief Financial Officer. There is a slide presentation available and you can find it on the Investor page under the Events and Presentations link on both corporate websites.\r\nDuring this call, we will be making forward-looking statements, which are predictions, projections or other statements about future events. These statements are based on current expectations and assumptions that are subject to risks and uncertainties. Actual results could materially differ because of factors discussed in today's press releases and comments made during this conference call and in the Risk Factors section of our Form 10-K, Form 10-Q and other reports and filings with the Securities and Exchange Commission. We do not undertake any duty to update any forward-looking statement.\r\nNow I'd like to turn the call over to Todd Becker.\n\nStory continues\n\nTodd A. Becker\n\nThanks, Phil and good morning, everyone and thanks for joining our call today. This morning, we reported $52 million in EBITDA for the third quarter and an ethanol operating rate of 93.9% and very strong ultra-high protein production and sales. These results begin to demonstrate our platform's capabilities and we believe we can and we will build on these record rates moving forward and start to see the real benefits in Q4 and beyond.\r\nThe team was focused on bringing our platform back to consistent operations after our first-half headwinds, some of which continued into July of this quarter, but we really started to gain positive momentum as the quarter progressed and that has continued into Q4. We executed on the market opportunities that were and continue to be available. As I just said, we have continued the same focus in the fourth quarter and have positioned ourselves based on current market dynamics to perform better across every product we produce. We remain largely open to the expanded margins in the fourth quarter, although we were able to lock in our veg oil pricings, higher than the current market and now own our winter gas at or below market.\r\nIn addition, corn basis which has been a significant headwind for the past 2 years has moderated significantly on the forward look. And while we still have some needs to buy in for the quarter, we are generally covered at or below market as well as on a physical corn basis. In Q3, for reference, the corn basis in our areas was $0.44 higher than the five-year average during Q3, as we finished up bringing in the last of the old crop. In addition, as ethanol remains inverted slightly on the curve and as we always try to reduce our inventories, this always is a slight negative when the market is and was set up like that against the end of the quarter.\r\nDuring the quarter, we restarted our Wood River MSC protein system late in July and operated at consistent rates across the entire platform. We achieved new record production levels for ultra-high protein in the third quarter and are on pace to set new highs in the fourth quarter. Not only did our ethanol -- our entire platform operating more consistently, so we continue to see higher average yields per bushel. We continue to refine our process and apply learnings across our 5 locations, for example, last month in Shenandoah, we averaged over 4 pounds per bushel and you will recall that our original investment thesis was based on 3 pounds to 3.5 pounds per bushel. So we can achieve our 2025 targeted volumes with fewer locations but investments that we -- and lower than we originally anticipated, although we are continuing to roll this out through our platform.\r\nOur JV with Tharaldson, which will be the largest MSC facility ever built, is slated to come online in Q1 of 2024 and later in the call, I will dive more deeply into protein economics, production, 60 Pro, current dynamics and some other exciting ingredient opportunities that are coming our way. I will also update you on our decarbonization, clean sugar launch and veg oil marketing. Our liquidity improved in the third quarter with our platform turning to free cash flow generation and also benefiting from the sale of our Atkinson plant above that. With strong margins on paper today, we expect even better free cash flow in the fourth quarter and to end the year stronger yet.\r\nLast month, we executed a definitive merger agreement with Green Plains Partners. We are continuing to work through the process and anticipate completion before the end of the year. We expect that the proposed transaction will simplify our corporate structure and governments -- and governance, generate near-term earnings and cash flow accretion, reduce SG&A expense related to the partnership, improve the credit quality of the combined enterprise and align the strategic interest between Green Plains shareholders and the partnership unitholders. There will be some one-time deal expenses that will hit in Q4 and Q1, but we will call it out for you after the close.\r\nAnd now, I'll hand the call over to Jim to provide an update on the overall financial results.\n\nJames E. Stark\n\nThank you, Todd, and good morning, everyone. Green Plains consolidated revenues for the third quarter were $892.8 million, which was $62.2 million or approximately 6.5% lower than the same period a year ago. The lower revenue is attributable to lower prices for ethanol and dry distillers grains in Q3 of '23 as compared to the third quarter of '22. As Todd stated earlier, our plant utilization rate was 93.9% during the third quarter compared to the 90.9% run rate reported in the same period last year, but significantly improved from 81.5% in the second quarter of this year. We anticipate our plants to continue to perform, targeting utilization rates in the mid-90% range of our stated capacity.\r\nFor the quarter, we reported net income attributable to Green Plains of $22.3 million or $0.35 per diluted share. That compares to a net loss of $73.5 million or $1.27 loss per diluted share for the same period in 2022. EBITDA for the quarter was $52 million, that compares to a negative $35.6 million in the prior year period. Our depreciation and amortization expense was slightly lower by $0.7 million versus a year ago at $23.9 million. We realized $48.5 million in consolidated crush for Q3 of '23 compared to a negative $20.5 million in the prior year. Our Ag and Energy segment performed well, recording $12.2 million in EBITDA, which was about $5.6 million higher than the prior year. This increase was driven by opportunities in our merchant businesses.\r\nFor the third quarter, our SG&A costs for all segments was $35.5 million compared to $29.1 million reported in Q3 of 2022. This increase was driven by legal fees associated with the GPP buy-in and other legal activities during the quarter. Interest expense was $9.6 million for the quarter, which includes the impact of debt amortization and capitalized interest. This was in line with the prior year's third quarter.\r\nOur income tax benefit for the quarter was $7.8 million compared to a tax benefit of $1.9 million for the same period in 2022. The increase in the tax benefit year-over-year is a result of a decrease in our total deferred tax assets, which allowed us to reduce our valuation allowance against those deferred tax assets. At the end of the quarter, the net loss carryforwards available to the company were $128.9 million, which may be carried forward indefinitely. We continue to anticipate that our normalized tax rate for the year for Green Plains Inc., excluding minority interest should be around 23%.\r\nOur liquidity position at the end of the quarter remained solid, which included $366.2 million in cash, cash equivalents and restricted cash along with approximately $200 million available under our working capital revolver. Our financial strength is growing due to the strong execution of our platform and favorable industry fundamentals as we are well positioned to execute on the next steps of our transformation plan. As a reminder, we have no debt maturities until 2026 and 2/3 of our debt is locked in at a fixed rate, leading to our overall cost of borrowing during the quarter being around 7.2%.\r\nFor the third quarter, we allocated $29 million of capital across the platform, including $15 million to our clean sugar build in Shenandoah and other MSC protein initiatives, about $8 million to other growth initiatives and approximately $6 million for maintenance, safety and regulatory capital. For the remainder of 2023, we anticipate CapEx will be in the range of $25 million to $45 million as we continue to work diligently on the timing of permitting for MSC technology deployment at a couple of our larger plants.\r\nFor Green Plains Partners, we reported net income of $9.4 million and an adjusted EBITDA of $12.7 million for the quarter, in line with the $13 million reported for the same period a year ago. The partnership declared a quarterly distribution of $0.455 per unit with a 0.99x coverage ratio for the quarter. The partnership had distributable cash flow of $10.7 million for the quarter, slightly lower than the $11.3 million for the same quarter of '22. Over the last 12 months, the partnership has adjusted -- produced adjusted EBITDA of $50.6 million, distributable cash flow of $42.9 million and declared distributions of $43.2 million, resulting in a 0.99x coverage ratio, excluding any adjustment for the principal payments made in the past year.\r\nNow I'd like to turn the call back over to Todd.\n\nTodd A. Becker\n\nThanks, Jim. So our path forward continues to be focused on maximizing what we can produce from a kernel of corn at each of our biorefineries and all of our initiatives tie back to one consistent theme, making low-carbon ingredients that matter. We consistently pointed the need to operate our core business well to maximize the opportunity in protein and higher renewable corn oil yields, and we are starting to achieve those higher run rates once again. Our assets have aged and we needed to put a lot of care into them, and we hired a new operations executive leadership team that is fully focused on the modernization and automation and they know how to do it correctly. We've been investing in technology and are making great progress towards the goal across the platform.\r\nToday, we have 5 facilities operating our MSC ultra-high protein technology. Construction of both Madison, Illinois and Fairmont, Minnesota continues to be pending favorable outcomes from the permitting process in both states, which continues to take longer than we thought. We are in a good path in Illinois as the permit will unlock the full potential of the plant in terms of total volume of all of our products in addition to the MSC installation.\r\nWhat I'm really excited about is our MSC turnkey joint venture with Tharaldson is on track to be in commissioning and start-up in the first quarter of 2024. This will be the largest plant ever built with the Fluid Quip Technologies and will bring approximately 100,000 tons of production to our sales platform. We remain on our path to have our total annual capacity with 580,000 tons at the base yield of 3.5 pounds per bushel. Yet, we are also starting to achieve higher yields at almost all of our locations with some consistently achieving over 4 pounds per bushel daily and believe that over the long run, we could achieve improved yields across the entire platform.\r\nOur production was significantly higher than in the prior quarter and continues to grow. Our commercial team focused on protein successfully work with our diverse customer base to sell all of the products we produce. This confirms what we have always believed that we have a great product that is in high demand. We have a solid customer base and we continue to have access to new business opportunities. We increased the number of customers by 25% to 30% during this quarter alone. Our protein product is also growing demand around the world and we are now selling our protein to North and South America, Europe, Middle East and Asia.\r\nNow let's talk about the 60% protein initiative, because that's one of the most important and exciting things that we're going to be doing over the next several years. We executed a successful full-scale 60% protein production run during the third quarter at Wood River and began to deliver commercial quantities of 60% protein to end customers and are in a position to begin delivering an additional 60% protein sales in the fourth quarter. We are continuing to debottleneck the production process around this, both mechanically and biologically as we learn how to transition these MSC systems from 50% to 60% protein production at full scale. Once we lined out the system in Wood River, we consistently produced our 60% protein product and have achieved as high as 62.3% during the quarter. The team overall at the plant as well as in our office here did a great job in a very difficult task, which is why we know we have something unique.\r\nWe now have our first repeat 60 Pro business and the product is being utilized in several large-scale commercial diets, along with additional trials in the U.S. and around the world. We remain committed to achieving our goal of dedicating 20% to 30% of our portfolio to 60 Pro during 2024. We can see the business in front of us and customers are starting to ask for it. In addition to the high-quality nutritional digestibility and taste profiles of our protein, we are already getting value from our lower CI from our ultra-high protein relative to corn gluten meal from wet mills and received updated data during the quarter on the advantage we have. Now that we've been running our platform for several months, we anticipate the fourth quarter ultra-high protein production will be higher than what we achieved in the third quarter and growing.\r\nAs we look at the EBITDA opportunity in 2024 based on the 5 facilities we have operating, plus a partial year impact from our turnkey JV, EBITDA contributions could be $80 million to $120 million during the 2024 fiscal year.\r\nIn corn oil, our renewable corn oil remains a feedstock of choice among renewable diesel producers and even in the face of new soybean crush capacity coming online, our corn oil maintains a distinct advantage due to its lower carbon intensity. I don't think we need to spend a lot of time on this for this call as most of you know everything you need to know about this great product. Pricing was strong during Q3 and we sold most of our Q4 production at higher values in the current market. So we're happy about that. We believe our renewable corn oil platform is well positioned to take advantage of industry drivers towards advantaged feedstocks. The low-carbon premium has developed and we believe renewable corn oil beginning in 2025 is even more advantaged in the IRA, so don't ignore that positive factor as we get into next year and the year beyond.\r\nDecarbonization continues to be a crucial strategy that we are pursuing. The most significant step we can take is participation in carbon capture and sequestration opportunities. Four of our facilities representing approximately 316 million gallons per year are committed to the Summit Carbon Solutions projects. We are confident this project gets completed, although Summit is now indicating looking at a 2026 startup. They continue to make great progress on permitting and right away and we expect that many of the stranded Navigator plants will end up on this project.\r\nAs noted over the past quarter, 3 of our facilities are now in a separate CCS project in Nebraska, Central City, Wood River and New York represents about 287 million gallons. This project appears to be on track for a 2025 startup. We have expanded and diversified our partnerships for carbon capture and sequestration and believe that we will be in a significant advantage beginning in early 2025 when 45Z goes into effect. Decarbonization through carbon capture and storage provides a critical milestone to not only lower the CI of the fuel ethanol we produce but also further drive delineation in all of our ingredient pathways, ultimately, having a decarbonized ethanol platform positions fuel ethanol to be a crucial low CI feedstock for the development of sustainable aviation fuel, which, as you know, we are keeping a close eye on.\r\nWe expect to get some more clarity from the administration on SAF before the end of the year. We are approaching completion of the world's first commercial clean sugar technology facility in Shenandoah, Iowa as it is on track to be mechanically completed by the end of the year and we are still only waiting for final electrical gear. We believe we should have it in time to begin commissioning in Q1 of 2024, the interest from potential customers exceeds anything we could have anticipated and we have been looking at plans to quickly expand the capacity at Shenandoah as well as completing additional installations elsewhere when we can. This is truly disruptive and game-changing for Green Plains.\r\nOur clean sugar has up to a 40% lower CI than from a wet mill and that is before we have carbon capture deployed. We look forward to demonstrating to the market the true value of this technology, our ongoing commercial sales discussions around our dextrose product reflects the value of the lower carbon intensity of which we got brand-new results during the quarter, which have basically shown that we are at least a 40% lower carbon intensity score than the incumbent products.\r\nSo where does that leave us with regard to our path to our 2025 EBITDA and transformation that we laid out to you a couple of years ago? For 2024, starting with the 5 MSC facilities plus a partial year for the Tharaldson JV to drive EBITDA contributions of $80 million to $120 million, excluding any uplift for 60% protein, our base corn oil renewable -- our base renewable corn oil business, excluding the corn oil uplift from our MSC to actually about 250 million pounds and depending on how veg oil pricing goes, it could be $130 million to $160 million annual contribution as well. We have recently seen veg oil prices drop, so once again, we'll see what develops in 2025 as more renewable diesel projects come online and we'll see what the impact it has. And if the government will continue to allow Chinese used cooking oil to really receive our tax credits.\r\nOur Ag and Energy business consistently generates $20 million to $30 million in EBITDA annually and our corporate SG&A is approximately $65 million to $70 million. Just to be clear, we have pre-invested both in protein marketing and technology as well as our sugar marketing and technology. So that when we kick off these new products, we are fully ready to go. I'll let you put in your own assumption for ethanol margins, but we do believe fundamentals for the ethanol demand will remain strong for the foreseeable future, notwithstanding those normal ups and downs we see seasonally or from quarter-to-quarter. Yes, we are also focused on consistent operations from our core products as well.\r\nAs we move into 2025, we should see incremental value from additional MSC facilities, but most critically, will be the startup of our decarbonization strategy, with our platform having a significant advantage in terms of timing to completion relative to other projects that are out there. I'm incredibly proud of our entire team for pulling together and delivering a solid quarter and positioning us for even greater success that's possible in Q4 based, of course, as we always say, on current markets. We have made our significant changes to our executive team throughout the organization over the past 12 to 24 months. We assembled a new senior management team and leadership team in operations with hires from industry leaders in wet milling and value-added production who can also maximize the capabilities of our plants. This team has many, many decades of operational expertise.\r\nWe built a new commercial leadership that's focused on building value-added marketing and distribution that was needed for our new products that have expertise in traditional commodity margin management. We also have new leadership in human resources as we are focusing on taking care of our team members' needs and recruiting great talent. And of course, I can't leave this out, Jim taking over as CFO. We also have a great bench of leaders and employees from sales to marketing, to trade, to production to nutrition to technology and our finance organization, of course, our plant management who all help us continue to execute on our transformation and deliver results from many industry leaders we compete with on many of our new products.\r\nWe knew this would be a challenging process. And of course, I'm humbled in by the dedication and inspired by the passion of all of our team members across the organization in every position week in and week out. Finally, our commitment to safety of our employees is, first and foremost, before anything else we do, we will never put profits before safety, and I preach this continuously anytime I can.\r\nAnd with that, I'll leave it there. Thanks for joining our call today, and we can start the Q&A session.\n\nQuestion and Answer Session\n\nOperator\n\n(Operator Instructions) Our first question is from Jordan Levy with Truist Securities.\n\nJordan Levy\n\nMaybe to start on the protein side of things, it seems like we're getting into that time of the year when you start to look at allocations. Maybe if we just start looking back 12 months or so versus where we are now, if you could just talk to how those are shaping up, what sort of the customer mix and how that's changed and how the economics look now versus how they did maybe a year ago?\n\nTodd A. Becker\n\nSo let's talk first about the economics. What we've seen is with corn prices kind of hanging in there a little bit lower and protein prices increasing against that, the economics on paper have clearly gotten better just basically financial to financial. Now during the quarter, last quarter, we saw weakness in the soybean meal basis, which affects the overall margin structure, but that has come roaring back as well as the overall price for protein has come roaring back as well. So we're optimistic with in terms of our price competitiveness relative to incumbent products. We get a lot of calls around that and the use of our product and we're seeing higher inclusion rates. And in general, we've seen good uplift in terms of new demand showing up for our product across all of the species.\r\nWe're happy to report, we renewed our pet food contract for 2024. We got 100% of that business back, and it's growing from there. The company that we're partnered with continues to grow their volumes every single year from when we started in Shenandoah by selling part of that plant out as well.\r\nSo relatively speaking, from 12 months ago, we continue to see uplift in all the species and continue to see growing volumes across our whole customer base even with more volumes coming into the market.\n\nJordan Levy\n\nAnd then maybe just moving on to the carbon side of things. I appreciate the commentary you gave there and sort of the diversification strategy you all are kind of continuing to pursue. Maybe just with some of the recent headlines around some of the plants, some of the other plants in the market or the other [types] in the market rather. Maybe if you could just talk to how you're thinking about that over the -- and the confidence you have over the next few years and being able to execute on the carbon strategy.\n\nTodd A. Becker\n\nYes, I think we start with our core pipeline strategies with -- the partner with Summit and what a great job they've done. They've secured 75% to 80% of the right away. Nobody else has been able to -- nobody else building a new pipeline has been able to do that. While they certainly have seen some headwinds in terms of just overall permitting, we believe -- strongly believe they'll get through that and kind of get their route established. A lot of it's about the routing and some of it's about local communities, making sure that they get what they need. And I think Summit is fully prepared to make those concessions and they continue to negotiate.\r\nFirst comes the Iowa permit, we're confident in North Dakota, and we're also really confident that they'll get through the South Dakota process as well with some rerouting. That's really what it takes is that line running from Iowa to North Dakota. It's strong from the standpoint of the early funding they raised. Obviously, they need -- we're waiting for their final permit, so they can raise the final funding. They've -- we're confident in the team and their ability to execute. And it's going to be a massive project that gives a massive uplift to our industry overall.\r\nAnd then with obviously the other pipeline that decided to cease their operations, I think that's advantaged Summit relative to where they're building and to pick up other plants and increase their volumes, which just makes everything more economic in the end. It's absolutely the right thing to do not without any pipeline that has its normal challenges, we're confident that we made the right choice. We made an early investment. So we're a shareholder and we really like to position that they're in. Maybe it takes a little bit longer, but overall, really good execution so far.\r\nIn terms of Nebraska, we had mentioned a different project there that we believe startup will be in 2025 and the [e-cons] are very favorable to Green Plains as well. Those will be early e-cons we outlined those during our earlier calls and discussions, but we really feel like we're in a really great advantaged position, especially for the early startup. And then when Summit comes online, it really just drives our capability to earn from the carbon initiative significantly for our shareholders.\n\nOperator\n\nThe next question is from Manav Gupta with UBS.\n\nManav Gupta\n\nSo I was wondering if you could help us a little bit to understand where can we -- when -- by when can we get more guidance from the treasury as it relates to 45Z? And I'm also trying to understand, we have seen a little bit of a pullback in corn oil prices. I think it's more of a function of D4. You have a lot of capacity coming on, which would need that corn oil. And then as LCFS prices move up, the demand for corn oil should be higher. So trying to understand some more -- whatever guidance you can provide on 45Z and then how do you see near- to medium-term corn oil price hike?\n\nTodd A. Becker\n\nYes, thanks. I have Devin here with me who led our IRA call. So I'll let him comment on where we're at on that.\n\nDevin Mogler\n\nHey Manav, the government had said they were going to come out with 40B SAF guidance by September 15. Obviously, that's in the rearview mirror by 45 days. We're still expecting that by the end of the year and that the life cycle modeling they put out there for SAF will likely inform their thinking on 45Z. As far as the model they're using and how farm carbon and carbon capture can play in that, hope we're still optimistic that we will see 45Z guidance by the end of the year, but that could slip into early next year.\n\nTodd A. Becker\n\nYes. So from that perspective, and as we move to your second and third question on corn oil and LCFS, we have seen a drop. I think that was due a little bit to overall market dynamics of the unwind between meal and oil. We saw meal rally and oil retreat from the highs, although we got most of our corn oil sold at higher values for the fourth quarter. So we're happy about the position we have on at this point. That was the one thing we wanted to make sure that we locked in to at least get that locked away as we saw some downtimes in renewable diesel and maybe some delays in start-ups.\r\nOverall, I think another big impact, and I mentioned it in the script is Chinese used cooking oil, which to us is disgraceful as it has the ability to come into the United States and earn our tax credits. It's sitting down at the Gulf. I think it pressured overall of [ethanol] prices as well. And we'll see where that transpires, I think it was preloaded against some start-ups of some of the newer plants as well. But we're going to watch that closely and make sure that we defend our position as a U.S.-made product against a foreign-made product, getting our tax credits, and we're very focused on that.\r\nBut overall, I think we've seen oil prices stabilize here down in the mid-50s and we're still trading at a premium to that on any given day. So overall, we're still not unhappy about the values. And then lastly, you've seen these -- the great equalization of the D4, D5 and D6 RINs and D3 is just significantly higher than that. And that's really what the goal, I think, of the last round of EPA rulemaking was -- was to kind of equalize all those, let RINs be a little more agnostic and then see what wins. But overall, it still RINs are in the high-80s and 90s. And overall, those economics are pretty well.\r\nAnd lastly, LCFS, I think California is committed to making sure that, that program is successful. So between RINs, between LCFS and obviously the biodiesel tax credit and then moving into 45Z into the program into 2025, look, I mean, we think we're in an advantaged position as an industry, not just Green Plains, but as an industry overall to make what we think is the second large lowest carbon feedstock available and we think that will continue over time. And it's just really, a lot of it continues to be rebalancing all the time between kind of the protein and the oil contribution.\n\nManav Gupta\n\nTodd, very quickly, the fundamentals at ethanol are even better in 4Q versus 3Q. And I'm hoping somewhere you would say that you were not really hedged for 4Q, so you can get the full benefit of this market rally, if you could clarify?\n\nTodd A. Becker\n\nYes, I mean we've seen overall better margin structures that have been available during Q4. It's been volatile, though in the last couple of weeks, I think if you watched it, you've seen it come off the highs. So there are days I wish I would have hedged some of that volume. But we remain open on a daily basis other than small positions we have as we mentioned. But generally speaking, the crush is -- the margin structure is better than what we have seen, but it has come off its highs. And we'll see what transpires every Wednesday, is an adventure, as we say. But overall, driving demand has remained solid. We've seen it a little bit below 9 million a day, which is good for ethanol. We've seen good export demand coming out of -- for our products about 100 million a day or 100,000 barrels a day, sorry.\r\nAnd overall, we just got to watch production. There's definitely some noise of more plants trying to start back up, got to watch that. But our industry is aging and I've preached that over the last several calls, and that's kind of what some of the headwinds we faced over the last 12 to 18 months, our assets have aged. I had to -- had to hire a new operational team to address those issues prior to the old operational team and management at the plant as well. So it's just harder to run these plants. I think you're seeing that on a weekly basis in EIA data, but generally, we're stabilized.\n\nOperator\n\nThe next question is from Craig Irwin with ROTH MKM.\n\nCraig Irwin\n\nSo Todd, I wanted to ask you about 60 Pro, you said 25% in '24, that's up from last quarter. Can we maybe read that to be the majority of High Pro production being 60 Pro in the back end of the year or maybe even most. Can you maybe just give us color on how you see this potentially progressing over the year?\n\nTodd A. Becker\n\nYes. I think what we learned and what we're seeing in terms of the demand for the product is because of the quality of the product, not only from a protein standpoint, but digestibility, feed conversion ratios, those types of things that are coming out of these long trials that we've been in. And we're seeing really good interest in the product. For us, when we think about what's the biggest thing we can do relative to non-government-related programs, non-carbon programs, those type of things in the short term is move as fast as we can to make as much 60 Pro as we can starting in 2024 and then into 2025.\r\nLook, if I could wave my magic wand and make 100% today, but it takes time for the market to uptick the new products and there's never been a new product like this in a very, very long time. So all roads are going to lead to 60 Pro for us. We have initiatives to look at what we need to do to bring a second plant on next year and then look at basically initiative around 100% of our plants moving to 60 Pro. The some of it -- what we're learning is some of it's biological, but some of it is mechanical. It's -- there are some things that the traditional 50 Pro systems just can't do in 60 Pro and so we're making some of those changes. We'll keep those private at this point.\r\nBut I think that's our clear path is to ultimately make as much 60% protein as we can and even start to go higher from there. But what a great success we had at Wood River during the quarter. We learned a lot going to full commercial scale. We scaled up. We spent a lot of time in the 58% range before we solve that last problem and then we spend a lot of time above 61%. So we're very happy about that, which is what you really need to do when you start averaging into these products.\r\nSo -- but what we're really more excited about is that we're getting calls in for the product now. Now it's going to take time for larger volumes, but the margin structure is there, the demand is there, the need for this high-quality, low-carbon, high digestibility, feed conversion ratio product is there and it's there not just from the United States, but we've sold now 60 Pro in smaller quantities, commercial quantities though, into Middle East, Southeast Asia, South America and growing, so we're really excited about that. And then we're really focused on some U.S. business as well.\n\nCraig Irwin\n\nSo my follow-up question, I mean, maybe this one is for Devin. But last week, I was in D.C. meeting with lobbyists from the oil and renewable fuels industry. And couple of people suggested that the delay of the credits we're looking for the (inaudible) treasury is related to changes that we made in the Greek model or potentially made in the Greek model. The disadvantaged green gas, in particular, and they're suggesting that there's an open dialogue about the Greek model, whether or not it needs to be revised. The original model is right.\r\nCan you maybe just give us color on why you're confident this is likely to be finalized by the end of the year? Is there anything in the potential changes that may have happened that would impact the carbon credits the way you look at it or SAF or anything related to ethanol?\n\nDevin Mogler\n\nYes, Craig, so we've heard the exact same thing. They're looking at the renewable natural gas, the [tweaking degree] model for that. Ultimately, we think they will arrive at something that we can play in. We've heard all the indications from the administration is that they want ethanol and soy-based feedstocks to be able to play in sustainable aviation fuel. We've heard that from the President. He's actually going to be in Minnesota tomorrow. He may comment on the topic there. So while the timing does slip and they are still looking at updating the Greek model, we are confident that there will be a place for us to play there.\n\nOperator\n\nThe next question is from Ben Bienvenu with Stephens.\n\nBenjamin Shelton Bienvenu\n\nTodd, I wanted to pick up on your commentary that you offered around the contribution from Tharaldson and then the 5 MSC facilities. You talked about the $80 million to $120 million to next year's EBITDA. Can you help us think about kind of what determines the range there? Is it the ramping and scaling of production or something else?\n\nTodd A. Becker\n\nYes. I mean it's a little bit of timing, it's a little bit of just watching the spreads between corn and soy and what will happen there. When we think about 560 million gallons converted, plus Tharaldson, it gets us to 640 million gallons, and we look at, let's call it, what we kind of guided earlier at $0.15 a gallon, that gets you right in the middle of the range. So it's just kind of we're watching the ratio of corn against soy meal. What we are doing is looking at that and then saying what markets -- we get the values for exports sometimes are better than domestic and the values for domestic are sometimes better than export. But some of it is also this volatility we've seen in the soybean meal basis as of late. It's come back roaring back. But -- and 60 Pro is not even included in that at this point. So we just put it in a range around it, but the middle of the range is kind of that $0.15 a gallon that we kind of outlined as a contribution, and then we go from there.\n\nBenjamin Shelton Bienvenu\n\nMy second question is on the clean sugar technology and you talked about commissioning of Shenandoah and the overwhelming demand that you're seeing there, which is really encouraging. As you think about potentially expanding that production, can you talk a little bit about your appetite for the pace of doing that? And do you think you would be in a place to self-fund that as some of your other CapEx projects start to wind down as we head into 2024 and your cash flow picks up from some of the investments you've made already?\n\nTodd A. Becker\n\nYes. I think where we look first is, obviously, Shenandoah, which is the easiest expansion and we're working with customers to look at that. We got to make sure that, relatively speaking, all of what we need resources locally are there from electricity through gas to water, all those type of things. But where we'll look after that, that's an easy one to fund. Where we'll look after that is what's the next best plan to build in? Is it a Nebraska plant online? Or is it going to be one of our plants that really aren't on, don't have a carbon solution, maybe like a Madison or a Obion at this point. So we'll look at that.\r\nWhen we look at cash generation, what we've learned this quarter now and then going into the fourth quarter is we're really set up well for free cash flow generation to start to help self-fund although we are -- we still have a lot of cash on the balance sheet and we're generating more. But we see our -- how we set our balance sheet up with low debt levels, relatively speaking, high cash levels. You saw our rate is still sitting around 7% in a high-rate environment. New capital is much more expensive. So we would start to say, well, can we fund off the balance sheet? What assets do we have if we needed to finance anything. But beyond that, free cash flow generation should take care of, I would say, plant #2 very easily over the next 12 to 18 months as we start to look at where that should be.\n\nOperator\n\nThe next question is from Adam Samuelson with Goldman Sachs.\n\nUnidentified Analyst\n\nThis is actually (inaudible) for Adam. I was wondering if you could provide some color on the corn basis and how has that impacted your margins in this quarter? And what would be your expectation going forward?\n\nTodd A. Becker\n\nYes. With us today, we have Grant Kadavy. He's our EVP of Commercial Operations. I'll let him give a quick comment on the corn basis and what he's seen, I wanted to introduce everybody to Grant. He'll be on future calls as well and we'll get him introduced to all of you. But Grant now runs all of our marketing and all of our proteins. Anything -- anytime anything commercializes, it will move under him and he runs our commercial operations across the platform. So Grant, real quick on the corn basis.\n\nGrant D. Kadavy\n\nSure. During the third quarter, we did see the transition from old crop and new crop. So we did see a material decrease in the overall corn basis. Heading into the fourth quarter, into the new crop season, I would say we've seen more of a normalization of corn basis during harvest and then the potential for a more normalized scenario through the balance of the year.\n\nUnidentified Analyst\n\nAnd as a follow-up, if I could ask on your outlook for ethanol exports, where will be your expectations going forward?\n\nTodd A. Becker\n\nAs we said, we've seen 100,000 barrels a day or so of export capacity, someday is a little bit higher, someday is a little less. I think obviously, the world is an interesting place today. We've got to watch where we ship our products to. But again, no lower price for octane on the planet, still. It's an advantage of what we produce globally. But generally, Canada continues to have a really strong low carbon fuel program and we see good uptake from there. And then randomly around the world, we see some going to the EU again. That market has opened up for us and generally strong. We started to see volumes again starting out in the Middle East, but with what's going on there that may drop a little bit.\r\nBut overall, we have strong exports out of the U.S., and we'll watch the Brazilian -- because when you have Brazilian sugar prices where they're at, we also have high Brazilian ethanol prices at this time. So we're able to at least get some other business coming our way. So I think we'll remain at those levels really throughout the year.\n\nUnidentified Analyst\n\nAnd last one for me. As we've seen the divergence between DDGS prices and soy meal, how has that impacted the High Pro pricing competitiveness?\n\nTodd A. Becker\n\nWell, I think what we saw is soy meal was quite weak earlier in the quarter and then you've seen it come roaring back, I think that's kind of what the viewpoint is that while it narrowed up during the quarter, spreads -- there's some areas that still have very strong distillers prices. North Dakota has strong distillers prices, Nebraska has strong distillers prices as well. But generally, the spread has widened back out to the levels where we're able to start to achieve our margins. When you have soy meal futures at [$425, $426] or something like that and you've got Indiana sitting at $175 or Shenandoah sitting at $190, that spreads now book on to historically wider levels, which then gives us a little bit more margin and the meal basis has rallied as well. So generally, overall, I think we're in a better position today.\n\nOperator\n\nThe next question is from Eric Stine with Craig-Hallum.\n\nEric Stine\n\nSo I know for EBITDA for '24, I mean, it's roughly $200 million plus ex-ethanol somewhere in that range. Not sure if you gave '25, I might have missed that. I know previously you talked about $400 million to $600 million at a run rate in '25. I guess given the commentary around Summit and the carbon capture opportunity, I mean, is it better to think of low end of that range and that obviously upside as you get into '26?\n\nTodd A. Becker\n\nYes. I don't know that we gave $400 million to $600 million, but I think what we're talking about in '25 was the previous guidance that we gave, it still stands. And it's because really it's an advantage in Nebraska to start with Summit coming on in '26. And so -- and when you take that, when you take 60 Pro, when you take overall veg oil yields, when you take expanded protein production as we get into 2025, we're still staying in the previous guidance ranges. And then on top of that, where do you put ethanol margin on top of that. Phil, do you have any other comments on that?\n\nPhil Boggs\n\nNo, I think that's right, Todd. We're still in those ranges that we bullied out previously. The path forward to 2025 includes completing the facilities, bring those new facilities online sometime in 2025 with Madison and [Thermal].\n\nOperator\n\nThe next question is from Salvator Tiano with Bank of America.\n\nSalvator Tiano\n\nYes. So firstly, I wanted to understand, you made these comments about kind of the asset base aging and you guys are making some changes. You're going to just modernize your assets. Can you provide us some details on what these [entails] in terms of CapEx spend in the next few years? And also whether we should expect any meaningful EBITDA contribution from this plant?\n\nTodd A. Becker\n\nWell, look, what we produced this quarter at 94% was rounded up to 0.1%. But what we produced this quarter at 94%, we still have a ways to go. We can get more out of these plants. And we're just starting to unlock the capabilities of these plants from the last round of CapEx. And some of that's coming through automation. So it's a little bit lower, cheaper to do that. We have literally working around the clock to put as much automation as fast as we can in these plants, not because our employees or labor, it's just because we got -- we can operate better when we're managing that through automation, whether it's how much enzyme going to fermenter, whether it's how much yeast is going to get applied and make sure it gets applied consistently every day at the same rate and what we want it to be applied at and less room for human error, which we learned, obviously, was a bit of a headwind at times.\r\nAnd so those are not high-cost CapEx relative to making our plants run better. There's still more to unlock, we can ultimately make over I believe, over 100% of our stated capacity, that's coming down the road. I mean, we can -- we have more to unlock in these assets. Madison were held back on permit on how much ethanol we can make, and we're maximizing that every single day. And we're not making the full capability of that plant because we're waiting for Illinois, hopefully, to expand our operating permit not just for protein, but to give us more ethanol headway as well. So we can make more ethanol.\r\nAnd part of that -- and the second thing is that we have to invest smart and correct in all of these plants. And that's why I brought a new team in. The old team can take us so far and the new team is really taking us to the next level. It's a little bit uncomfortable for some people when we want to run these plants harder and it's a bit like the analogy you use when you have -- I've heard this a few times. When you have a Ferrari, you don't run it in first gear. You try to run it as hard as you can. We know they're going to break a little bit, but then you get through that and you keep going.\r\nAnd so while we say we're going to modernize our plants, we've done a lot already. Now we're going to maximize that investment. And so I don't think our CapEx relative to our plans change as much past our previous guidance. Jim, what is our normal CapEx range?\n\nJames E. Stark\n\nI would say to answer Sal's question, when you look at historically, we spend somewhere between $30 million to $35 million in CapEx -- maintenance CapEx and another $30 million to $35 million on other growth initiatives outside the big MSC or dextrose or sugar projects that we have. So if you take those 2 together in the $60 million to $70 million range of kind of normal capital that we would spend, so the modernization, the upgrades we will spend on will be within -- contain within that on an annual basis. So it's not going to -- there might be a little bit more in maintenance CapEx, a little less in growth initiatives. But I would tell you, when you look at next year, we're still dialed in to be probably plus or minus around $150 million of capital next year, including one of the big MSCs to get -- to really get built during the year.\r\nBut when you look at historically, that's way down from certainly what we spent over the last few years. So we feel very good about where we are from managing the capital side. Also to remind you, once the partnership is completed, there's an additional $25 million plus of free cash flow that stays home that can help us fund these projects going forward.\n\nSalvator Tiano\n\nPerfect. And I also wanted to clarify a little bit on the 60 Pro side. Firstly, you're getting the renewals. So as we think about Q4, is it going to comprise perhaps 5%, 10%, 15% of your high protein sales as I think was -- there were some targets regarding that? And secondly, can you clarify a little bit the comments that $80 million to $120 million will be the High Pro contribution next year, but there's upside from High Pro -- from 60% High Pro. So what does that mean essentially in terms of what's assumed in your base case, $80 million to $120 million? What's -- how can we quantify the upside and what will be -- whether you do get that upside or not?\n\nTodd A. Becker\n\nYes. So much like 50 Pro, it takes time to get full uplift. And so that's where rather we can make 60 Pro and commercial quantities, we've proven that to the market. The market now starts to adapt to that. I think when we look at 60 Pro for 2024 and the goal of 20% to 30% of our platform shipping, it's probably -- well, not probably, it increases during the year as a percentage. So we have identified and outlined enough demand for all of our 50 pro and all of our 60 Pro we produce. It's really about getting that executed into the market and that will just grow during 2024 fiscal year. When we gave you the outline guidance, it's 560 million gallons converted today, half of the Tharaldson earnings, which is about 85 million gallons gets us to about 650 million gallons, that $0.15 midrange margin, that's about $100 million a year roughly of guidance for 50 Pro.\r\nNow if we do better because of the -- if you look at the spread between meal or protein and corn that's wide right now. So possibly that gives us the higher end of the range. And if it narrows in, it gives us the lower end of the range. And then on top of that, we see and watching the corn -- watching the meal base obviously watching Argentina what's going on there. And then on top of that, depending on how much and how fast the 60 Pro uptake happens. As we said, it probably grows during the year, it accelerates towards the (inaudible) and then into '25. That's where the upside is.\n\nOperator\n\nThe next question is from Andrew Strelzik with BMO.\n\nAndrew Strelzik\n\nSo I guess the first question is on the corn oil side and the decision to lock some of the prices at the higher levels. How much of that and how far out did you go? And has anything changed in your thinking with respect to your willingness to do that on an ongoing basis?\n\nTodd A. Becker\n\nI think corn oil is a different animal for sure, right? I mean, we saw veg oil prices starting to weaken. We noticed that there are some downtimes. We were able to -- I mean, look, I wish we locked it in higher, but we didn't. But I mean we locked it in above market, and we just put it out for the quarter, a little bit of Q1, but not very much. And so I mean, the market doesn't extend coverage much further than that anyway. So we were able to get most of our sales on. I think we're fortunate to be able to do that. But I mean maybe $0.05 to $0.07 a pound above market today. There's nothing dramatic -- it doesn't change our view at all.\r\nOur view in '24 is steady and our in '25 is strong because of the conversion to the IRA and 45Zs and all the credits available and the advantage for corn oil once that starts to happen. It's overall, we're focused on quarter-to-quarter and we'll have to deal with some of that volatility. But I think generally, we stabilized oil -- against the oil meal online.\n\nAndrew Strelzik\n\nAnd then obviously, there's been a lot of headlines and news around carbon sequestration away from what you guys are doing and the optimism that you have around the Nebraska plant. So I guess my question is, is there anything with those Nebraska plants that could get in the way of that optimism? Or I guess, are there any hurdles left? Or how are you thinking about the line of sight to the EBITDA potential from those plants specifically within the carbon sequestration?\n\nTodd A. Becker\n\nYes. I think our line of sight is very strong there. The project is on track. Most of what is needed. It's funded. There's no funding needed for that project. So -- and then we've been able to secure what we need from a compression standpoint as well. So every day, we just -- we evaluate it. It's not a lot of right of way that has to happen. And overall, most of which -- a lot of it's -- that part kind of derisked the ready, and it's really about converting what's happening there into transportable assets and then going into a state like Wyoming, which has primacy so you don't have an EPA permitting process. I think that's key. I think that's a key to the Summit project as well, which is going in North Dakota with primacy. It's a great choice to make relative to having to go to the EPA for permitting, which is like 70 or 80 or 90 permits that are still in backlog today, where I think when you're in those couple of states, it's advantaged Summit, which is why they're still persevering advantage in Nebraska, which is why they're still in a strong position.\r\nSo look, at the end of the day, if none of it happens, it's a different discussion, but we're confident, at least from the standpoint of what we outlined and then the numbers that we previously outlined in Nebraska advantaged Nebraska and our assets there. It's really advantaged Green Plains shareholders, quite frankly, as we're one of the biggest producers in the state.\n\nAndrew Strelzik\n\nAnd then if I could just squeeze in one more clarification. You mentioned where basis was relative to the 5-year average in the third quarter. Obviously, it's gotten much better. Did you quantify or how can we think about the delta or the contribution there as we roll forward and the change in the corn basis?\n\nTodd A. Becker\n\nI'll let Grant talk just a little bit about maybe Nebraska and Iowa corn basis, what we've seen here recently from the highest of the lows and kind of where we're stabilizing. But I think what the key is, is that we're getting a little more towards traditional levels, but I don't think we're fully there yet, but go ahead, Grant.\n\nGrant D. Kadavy\n\nYes. I think as Todd is mentioning, specifically, one of the major changes that we saw was in Nebraska, we're coming off a crop year where we had a lack of production in Nebraska, we've now seen that to be one of the areas where we've had the greatest year-over-year change in production and production levels have improved dramatically. If you look at where corn basis was at its high in last year in Nebraska, the basis levels were well in excess of $1 over of the CME. Basis levels have, again, I'd say, normalized quite a bit to where we've seen values come off close to $1 a bushel. I think once you get post harvest, farmer puts their crop away, you're going to see traditional sort of ups and downs and slight movements in the market, but we don't expect that we're going to see basis levels return to the values that we saw in the last few years.\n\nOperator\n\nThe next question is from Kristen Owen with Oppenheimer.\n\nKristen Owen\n\nTwo quick ones for me. First, on MSC protein. If you can speak a little bit to the spread over DDGs. And then, Todd, you mentioned sort of looking out the soybean meal versus corn ratio, soybean stocks very tight, corn, not so much. So just wanted to ask how much pricing you're willing to lock in for 2024?\n\nTodd A. Becker\n\nWell, most people are starting to move from flat price to plenty of sales on basis. We don't see extended -- other than a few of our longer-term customers like the pet business that we redid and were awarded for 2024 again. A lot of the business is on basis and a lot of it is done quarter-by-quarter, more than it has done for the whole year. Kind of when you look out forward, even out forward, the spread between corn and meal continues to remain strong, which means DDGs against meal remains strong. You can go all the way out to April or go out further than that and you're well over $200 a ton spread. So we'll have to wait and see what corn does.\r\nBut it's advantaged our business that we've outlined. I mean this is -- as we've indicated, we had a thesis that the world's protein short in the world was oil short. That was a long thesis that we've developed over time, and it's playing -- kind of playing out that way with genetics and corn and acres and yields relative to the tightness in soy. So it's kind of playing out nicely. We went through some years where it was the opposite. So kind of remember as we were ramping up. Some of that was the opposite was happening. And we even saw that as a blade even in the last kind of 120 days. But finally, we've readjusted to the current USDA numbers. And I think that will stay around for a while.\r\nAnd I think the next big thing we'll look at is acreage for 2024. And what's the shift and what's advantaged in any given state. But at this point, it doesn't look like it's going to change much. So we're pretty happy about that position.\n\nKristen Owen\n\nAnd then sort of a related question, just given the advantage of corn, talking about the sugar markets and the favorable backdrop for dextrose, no additional capacity coming online there, except for your own. I'm just wondering if you can talk a little bit about how quickly you can get Shenandoah scaled up in the first half of the year? And apologies if you did discuss this, but just where you are in terms of an offtake discussion there?\n\nTodd A. Becker\n\nYes. So relative to the lower corn prices, they're still relatively high towards that $5 a bushel. So dextrose pricing has remained steady to strong. We've seen customers who call us say they've been put on allocation from the traditional players. So there's definitely a demand and growing demand, quite frankly, from the -- all the way from beverage to chemical use down into candy and confectionery and then you -- so ours is coming out next year. It's not going to be dramatically changed the supply and demand balance sheet for dextrose 2024, there's one other project that was, I think, announced a few years ago over in Fort Dodge at 200 million pounds or something like that.\r\nBut generally, we think we're in a strong position. Offtakes, we have -- we're negotiating at this point with several customers on, I want to make sure that we hit the window correctly because as you are commissioning a brand-new technology and we learned from MSC, take longer than we probably expected. So we're going to be very careful. But generally speaking, we are trying to get most of our production that we're going to produce in 2024 spoken for and we have enough discussions going on for that to happen. And it's a bit of a -- I think we'll get some of that done by the end of the year as we negotiate.\r\nAs we say, if you -- this is kind of our, I will tell you, a bit of a motto of ours. If you -- if we buy products from you and you use dextrose, then we're going to have a bilateral arrangement that you'll be buying dextrose from us or else we won't buy the product that we'll look elsewhere. So we feel like we buy a lot of product that's made using dextrose into our operations. And so that's our first -- but we have good rate partners. So that's not -- it's not a -- it's certainly not anything that is antagonistic. It's just the fact that we believe we're finally in a position to have some bilateral arrangements and that's really where our first extras will go as we scale up and get food grade certified in the last half of the year and then we move more into the beverage and other markets as well. So we're really happy about that.\r\nAs you can see, there's tons of new or lots of new technologies that are coming online as well that are going to take more and more dextrose over the next 5 to 10 years. And we just think we're in a great position. We will show the world what this platform can really do. And the margin structure is extreme -- there's nothing stronger from a margin structure than there is to make dextrose at our plant and the first of its kind in the world will happen next quarter.\n\nOperator\n\nNo further questions. At this time, I'll turn it to Todd Becker for any closing remarks.\n\nTodd A. Becker\n\nWell, thanks for being patient with us. A lot of questions. We had a lot to cover. We're on track. We feel like we have more to unlock in our core business, which I think that's a renewed focus on that in terms of getting more oil, getting more alcohol, getting more distillers grains, but really starting to gain momentum in our new technologies. Yes, we wish we could go faster on building more. We have the demand for it. We've identified the demand for all of our products. And next op is clean sugar in Shenandoah in the first quarter, starting to decommission that plant, and that's really the game changer. And then we get into '25 and we see great earnings start to transpire from some of our carbon initiatives. So overall on track. I feel like this was a good quarter to get a win on the board, operations returning back to normal, but more to unlock there as well. So we appreciate all your support, and we'll see you next quarter. Thank you.\n\nOperator\n\nThis concludes today's conference call. Thank you for participating. You may now disconnect.", "link": "https://finance.yahoo.com/news/q3-2023-green-plains-inc-064255745.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "G3V.F", "GPRE.US", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.021, "neu": 0.856, "pos": 0.123}}, {"date": "2023-11-01T00:00:00+00:00", "title": "Financial Steals: 3 Bank Stocks With Outstanding Value", "content": "With bank stocks under continued pressure and trading at 52-week lows, investors should take advantage and buy these securities.", "link": "https://investorplace.com/2023/11/financial-steals-3-bank-stocks-with-outstanding-value/", "symbols": ["BAC.US", "JPM.US", "MS.US"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0.172, "neu": 0.647, "pos": 0.181}}, {"date": "2023-10-31T10:55:00+00:00", "title": "4 Things You Need to Know if You Buy Bank of America Today", "content": "Bank of America (NYSE: BAC) recently reported third-quarter results that beat Wall Street expectations. Here are four things you need to know about Bank of America. The other three important divisions are wealth and investment management, commercial banking, and global markets.\n\nContinue reading", "link": "https://finance.yahoo.com/m/316339b5-6e6e-3aff-a742-c6874a0cc4c4/4-things-you-need-to-know-if.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.612, "neg": 0, "neu": 0.891, "pos": 0.109}}]