[{"date": "2023-07-18T21:18:06+00:00", "title": "Trump probe, bank earnings, Microsoft's record high close: Top stories", "content": "Former President Donald Trump reports being the center of a second federal investigation tied to the 2020 election. Bank of America and Morgan Stanley stocks close higher after reporting earnings today. And Microsoft shares close at a record-high following announcements on its new AI services.\n\nVideo Transcript\n\nAKIKO FUJITA: It is closing time here at Yahoo Finance. Here's a look at some of the top stories of the day. Former president Donald Trump is facing the possibility of a second federal indictment in connection with efforts to overturn the results of the 2020 election. Trump posting on Truth Social that he received a letter from special counsel Jack Smith. This is possibly the clearest sign. Yet, he could face those charges heading into the 2024 race.\n\nDespite legal headwinds, Trump is still leading in the polls. Banks in focus on Wall Street on the heels of earnings from Bank of America and Morgan Stanley. Bank of America beating on the top and bottom lines telling our own Brian Sozzi earlier that the consumer is resilient. Meantime, Morgan Stanley shares jumping after better than expected second quarter results. Executives offering an upbeat outlook for deal making activity.\n\nAnd finally, Microsoft shares closing at a record high. The company revealing pricing for its AI subscription service. The Copilot service adds artificial intelligence to Microsoft's suite of office products which will cost an additional $30 a month.", "link": "https://finance.yahoo.com/video/trump-probe-bank-earnings-microsofts-211806196.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DWD.F", "DWD.XETRA", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US", "MSBR34.SA", "MSF.F", "MSF.XETRA", "MSFT.MX"], "tags": [], "sentiment": {"polarity": 0.918, "neg": 0.026, "neu": 0.887, "pos": 0.087}}, {"date": "2023-07-18T21:11:26+00:00", "title": "Office real estate values are moving down so fast that banking giants like Wells Fargo are already bracing for losses", "content": "As the undeniable permanence of remote and hybrid work takes hold, the profound impact on the office sector is becoming increasingly clear. Vacancies are rising and values are falling, and it’s all happening in an era of higher interest rates and tightened credit. Banks are taking notice of the distress within commercial real estate, and in some cases, with their own office loan portfolios, they’re bracing for losses.\n\nMorgan Stanley reported its financial results for the second quarter of 2023 this week, which stated: “increases in provisions for credit losses were primarily driven by credit deteriorations in the commercial real estate sector as well as modest growth across the portfolio.” Morgan Stanley’s provision for credit losses rose from $82 million in the second quarter of last year to $97 million, where it currently stands.\n\nBank of America also reported its earnings for the quarter, showing an increase in its allowance for credit losses. For commercial real estate, that rose from $1.2 billion in the first quarter of this year to $1.3 billion in the second quarter. Among its commercial real estate loans, 25% are in the office category, totaling to $18.3 billion. In a breakdown of Bank of America’s scheduled office loan maturities, we can see that $6.3 billion worth of loans are coming due in 2024.\n\nMeanwhile, Wells Fargo’s chief executive officer, Charlie Scharf, said the bank experienced “higher losses in commercial real estate, primarily in the office portfolio,” per its earnings report released last week.\n\nScharf continued: “We had a $949 million increase in the allowance for credit losses, primarily for commercial real estate office loans, as well as for higher credit card loan balances. While we haven’t seen significant losses in our office portfolio to-date, we are reserving for the weakness that we expect to play out in that market over time.”\n\nFurther down in the earnings report, that $949 million increase in the allowance for credit losses was labeled as primarily for commercial real estate office loans. Still Wells Fargo’s commercial real estate revenue increased to $1.33 billion, up 2% from the previous quarter and 26% from the previous year. Whether that positive trend will continue, we’ll have to wait and see, given the bank attributed the increase to “higher interest rates and higher loan balances.”\n\nWells Fargo had $154.3 billion worth of commercial real estate loans outstanding at the end of the second quarter, with $33.1 billion worth of office loans—that’s 3% of its total outstanding loans. How much of that will be maturing in the next year or so, we don’t know. When an analyst asked the bank’s chief financial officer during its earnings call, he responded that they don’t disclose that information, but that we should assume the bank’s loans are three to five years as that’s the standard, according to a transcript of the call.\n\nRegarding JPMorgan, which announced its second-quarter earnings last week, the company reported a provision for credit losses amounting to $1.1 billion. This provision included a reserve of $608 million specifically established for the First Republic portfolio, which JPMorgan acquired in May subsequent to the collapses of Silicon Valley Bank and Signature Bank.\n\n“Excluding First Republic, the provision [for credit losses] was $489 million, reflecting a net reserve build of $389 million, driven by updates to certain assumptions related to office real estate, as well as net downgrade activity in Middle Market. Net charge-offs of $100 million were predominantly driven by office real estate,” according to the release.\n\nHowever, JPMorgan’s commercial real estate revenue increased to $806 million in the second quarter, from $642 million the previous quarter. In JPMorgan’s earnings call, its chief financial officer told investors and analysts that the bank’s office portfolio is “quite small and our exposure to sort of so-called urban dense office is even smaller. The vast majority of our overall portfolio is multifamily lending,” according to a transcript of the call.\n\nThis story was originally featured on Fortune.com\n\nMore from Fortune: \r\n5 side hustles where you may earn over $20,000 per year—all while working from home\r\nLooking to make extra cash? This CD has a 5.15% APY right now\r\nBuying a house? Here's how much to save\r\nThis is how much money you need to earn annually to comfortably buy a $600,000 home", "link": "https://finance.yahoo.com/news/office-real-estate-values-moving-211126568.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "CMC.F", "CMC.XETRA", "DWD.F", "DWD.XETRA", "JPM-PC.US", "JPM-PD.US", "JPM.MX", "JPM.US", "JPMC34.SA", "MS-PA.US", "MS-PF.US", "MS-PK.US"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0.035, "neu": 0.862, "pos": 0.103}}, {"date": "2023-07-18T20:30:41+00:00", "title": "BofA and Morgan Stanley earnings, Pinterest upgrade, Chipotle locations: Top stocks", "content": "Bank of America and Morgan Stanley shares rise as both companies reported quarterly earnings that beat expectations. Pinterest shares rise as the stock receives an upgrade from Evercore ISI. Chipotle stock rises as the company plans to expand into the Middle East, partnering with Alshaya Group. Yahoo Finance Live takes a look at some of the trending tickers of the day.", "link": "https://finance.yahoo.com/video/bofa-morgan-stanley-earnings-pinterest-203041375.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C9F.F", "CMG.MX", "CMG.US", "DWD.F", "DWD.XETRA", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US", "MSBR34.SA"], "tags": [], "sentiment": {"polarity": 0.691, "neg": 0, "neu": 0.895, "pos": 0.105}}, {"date": "2023-07-18T20:24:33+00:00", "title": "Buy Bank of America, Sell Apple &amp; Nvidia: Strategist's stock picks", "content": "Bank of America shares trend higher, still riding off of this morning's earnings beat, while global automotive part supplier Cooper-Standard could stand to benefit from rising demands in new cars. Great Hill Capital Chairman and Managing Member Thomas Hayes discusses his latest stock picks. Hayes identifies tech giants Apple and Nvidia as \"two of the greatest businesses in the world\", but notes that the stocks may not see much growth potential at the already high prices they stand at now.", "link": "https://finance.yahoo.com/video/buy-bank-america-sell-apple-202433185.html", "symbols": ["0Q16.LSE", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C31.F", "CPS.US", "NCB.XETRA", "NVD.F", "NVD.XETRA", "NVDA.MX"], "tags": [], "sentiment": {"polarity": 0.723, "neg": 0.02, "neu": 0.878, "pos": 0.102}}, {"date": "2023-07-18T20:20:48+00:00", "title": "Big Banks Top Q2 Estimates But Fail To Excite The Market As Caution Is In The Air", "content": "Bank of America Corporation (NYSE: BAC) posted a second quarter profit that beat analyst forecasts as the company boosted interest income due to higher interest rates. Yet its shares traded only 0.6% higher in pre-market trading but rising more than 4% after earnings.  On Friday, Citigroup Inc (NYSE: C) reported earnings and revenue beat expectations buy its shares sank 4.05%. Likewise, Wells Fargo & Company (NYSE: WFC) reported better-than-expected top and bottom lines, while also raising its guidance for full-year net interest income but its shares still slipped 0.34%. Even JPMorgan Chase & Co (NYSE: JPM), known as the great dame of U.S. banks, didn’t manage to rouse investor interest with its net income skyrocketing 67% YoY but its stock only going up 0.6%.\n\nBank Of America\n\nFor its second quarter, Bank of America posted earnings of 88 cents, topping the 84 cents that Wall Street expected, on the back of revenue of $25.33 billion which also topped the expected $25.05 billion due to a 14% rise in interest income amid higher rates that resulted in a revenue rise of 11%. Earnings rose 19% YoY to $7.41 billion. On the other hand, Bank of America also rose its allowance for credit losses on loans from the first quarter’s $900 million to $1.1 billion which translates to a 120% rise compared last year’s reserves.\n\nCitigroup\n\nCitigroup saw its profit shrink more than a third last quarter due to slower corporate spending and costly layoffs, among other factors. As fears of a U.S. recession materialize, net income went down from $4.5 billion it made during last year’s Q2 to $2.9 billion. Like its peers, Citigroup was affected by a slowdown in dealmaking, causing a 1% drop in revenue that amounted to $19.4 billion as corporate and investment banking slowdown caused the segment’s revenue to tank as much as 44%. Its performance was considerably worse compared to its peers.\n\nCitigroup also raised its provision for loan losses nearly 40 per cent to approximately $1.8 billion.\n\nWells Fargo & Company\n\nHaving kicked off the earnings season, Wells Fargo did not see expected damage to its commercial loan portfolio. Its net interest income rose 29% with net income surging 57% to $4.9 billion on the back of revenue rising 20% to $20.5 billion.\n\nIt also boosted its provisions for credit losses rose 43% compared to first quarter to $1.713 billion, which is 195% above the $580 million it reported in 2022’s Q2. CEO Charlie Scharf noted that the allowance was primarily related to its expectations of commercial real estate office loans which, according to Bloomberg data, make up about 22% of its outstanding commercial property loans.\n\nJPMorgan Chase & Co\n\nJPMorgan Chase posted a 67% jump in Q2  profit as it earned more from borrowers' interest payments and benefited from the purchase of regional lender First Republic Bank.\n\nView more earnings on BAC\n\nJP Morgan revenue rose 34% to $42.4 billion as the bank made good use of higher rates and solid loan growth, with net income surging 67% to $14.5 billion, JPMorgan also increased its net interest income guidance the full year by $3 million to $87 billion compared to its May outlook.  Net interest income forecast for the year was also hiked from prior 10% growth projection to 14%. JPMorgan’s credit loss provisions also expanded 62% from 2022’s Q2 and 27% from the previous quarter, this year’s Q1, to $2.9 billion.\n\nHealth of the banking system is better than expected, but there’s increased caution regarding what lies ahead.\n\nAlong with Morgan Stanley (NYSE: MS), five of the six largest U.S. banks largely topped Q2 estimates,  fueled by higher net interest income that came with higher interest rates. But the market’s response was muted. The big picture is that the banking system is healthier than expected, at least for the largest players, as Brian Mulberry, client portfolio manager at Zacks Investment Management, concluded in his note. However, the results did show clear signs that increased caution is in the air as all the above banks rose increased their funds for anticipated losses. Morgan Stanley, who also reported today, also followed this trend with a 59% rise in credit loss provisions that amounted to $161 million. However, Mulberry believes this is simply prudent risk management that protects against worst-case scenario, if there is one, as opposed to a warning of doomsday.\n\nDISCLAIMER: This content is for informational purposes only. It is not intended as investing advice.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Big Banks Top Q2 Estimates But Fail To Excite The Market As Caution Is In The Air originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/big-banks-top-q2-estimates-202048092.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CMC.F", "CMC.XETRA", "CTGP34.SA", "JPM-PC.US", "JPM-PD.US", "JPM.MX", "JPM.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.062, "neu": 0.761, "pos": 0.177}}, {"date": "2023-07-18T20:14:12+00:00", "title": "Earnings season pessimism proving to be 'overdone': Strategist", "content": "As bank earnings roll out, earnings season is proving to be a promising one heading despite previous negative forecasts. Thomas Hayes, Great Hill Capital Chairman and Managing Member, shines a lot on the analyst pessimism and institutional skepticism on shifting economic outlooks. Hayes gives his thoughts on the likelihood of the Fed hiking interest rates just one more time based on disinflation data, saying a decision to stick to original Fed rate hikes would take a soft landing scenario \"from a 95% possibility\" to that of \"maybe a coin flip.\"", "link": "https://finance.yahoo.com/video/earnings-season-pessimism-proving-overdone-201412084.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DJI.INDX", "DWD.F", "DWD.XETRA", "GSPC.INDX", "IXIC.INDX", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US", "MSBR34.SA"], "tags": [], "sentiment": {"polarity": 0.855, "neg": 0.047, "neu": 0.807, "pos": 0.146}}, {"date": "2023-07-18T19:53:22+00:00", "title": "Watch: Bank of America CEO 'not surprised by the resilience of the consumer'", "content": "Bank of America's second quarter results beat Wall Street estimates on both the top and bottom lines. In an interview with Yahoo Finance Live, Bank of America Chairman and CEO Brian Moynihan credits \"the power of our franchise\" for the bank's (BAC) strong results.\n\nWhen it comes to the consumer, Moynihan says he is not surprised by how strong the U.S. consumer has been, saying \"our customers still have multiples in their accounts\" than they did pre-pandemic.\n\nOne of the big areas of concern for banks has been commercial real estate. Moynihan says \"there is stress going on in the system, but we underwrote assuming someday there was going to be stress.\"\r\n\r\nMoynihan also cautioned on efforts to raise capital requirements, highlighting the importance of maintaining international competitiveness and \"making sure that we keep the balance right of how we treat the U.S. economy.\"", "link": "https://finance.yahoo.com/video/watch-bank-america-ceo-not-195322523.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.921, "neg": 0.02, "neu": 0.87, "pos": 0.111}}, {"date": "2023-07-18T19:38:50+00:00", "title": "Bank of America CEO: The consumer is resilient, and here is why", "content": "Bank of America (BAC) CEO Brian Moynihan is dialing back his expectation for a mild recession this year, mostly thanks to resilience in the US consumer.\n\n\"People are working, and they are getting paid more, and they are spending,\" the longtime leader of BofA told Yahoo Finance Live on Tuesday. \"It's going to be hard to have a tough US economy because of the amount that is driven by that [spending].\"\n\nMoynihan pointed out that his research team sees a \"light\" recession in the first half of 2024. And given that, the economy won't feel like it's in a recession.\n\n\"In a broad context across 60 million customers, across $4 trillion of spending, it's a pretty resilient group,\" Moynihan added. Brian Moynihan, CEO of Bank of America, talks with reporters at Associated Press headquarters in New York, Tuesday, Nov. 29, 2022. (AP Photo/Seth Wenig)\n\nThe upbeat tone came after BofA largely delivered the goods for investors in the second quarter.\n\nNet income was up 19% to $7.4 billion compared to the year-earlier period, roughly in line with consensus forecasts. Earnings of $0.88 a share beat analysts' estimates by $0.04.\n\nThat's the bottom line benefit from higher interest rates and another quarter of tight expense control by management.\n\nRevenue rose 11% from the prior year to $25.2 billion, $200 million above consensus estimates. The company also saw above-consensus results in key parts of its business, such as fixed income and equities trading.\n\nOn an earnings call with analysts, BofA lifted its net interest income outlook slightly from its prior expectations, citing a healthy consumer and modest loan growth.\n\n\"That's really because of the power of our franchise,\" Moynihan told Yahoo Finance Live.\n\nThe guidance lift and quality of the quarter sent Bank of America stock higher by 4.1% near the close of trading. BofA's ticker page was the third most active on the Yahoo Finance platform.\n\nEvercore ISI banking analyst Glenn Schorr said the quarter was \"pretty good,\" and left his Outperform rating on BofA's stock.\n\nOthers on the Street agreed.\n\n\"The fact that the stock is quite cheap (at just 8.7x forward earnings)…sports a nice 3% dividend yield…and has a strong management team…are very good reasons for those who are bullish on the banking sector to take a hard look at Bank of America in the days and weeks ahead,\" Miller Tabak chief market strategist Matt Maley pointed out in a client note.\n\nYahoo Finance's David Hollerith contributed to this story.\n\nBrian Sozzi is Yahoo Finance's Executive Editor. Follow Sozzi on Twitter @BrianSozzi and on LinkedIn. Tips on deals, mergers, activist situations, or anything else? Email brian.sozzi@yahoofinance.com.\n\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/bank-of-america-ceo-the-consumer-is-resilient-and-here-is-why-193850783.html", "symbols": ["0Q16.LSE", "0R01.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "NCB.XETRA", "USB-PH.US"], "tags": [], "sentiment": {"polarity": 0.98, "neg": 0.029, "neu": 0.888, "pos": 0.083}}, {"date": "2023-07-18T19:10:02+00:00", "title": "Dow futures steady, Western Alliance Bancorp falls 3.1% after earnings", "content": "Investing.com - U.S. stock futures were trading within a tight range during Tuesday's evening trade, after major benchmark indices posted a positive session, with the Dow Jones notching its longest winning streak since 2021.\n\nBy 6:45pm ET (10:45pm GMT) Dow Jones Futures were flat while S&P 500 Futures and Nasdaq 100 Futures fell 0.1% apiece.\n\nIn extended deals, Western Alliance Bancorporation (NYSE:WAL) dipped 3.1% after the company posted Q2 EPS of $1.96 versus $1.97 expected on revenues of $669 million versus $658.5 million expected.\n\nOmnicom Group Inc (NYSE:OMC) shed 5.7% after reporting Q2 EPS of $1.81 versus $1.80 expected on revenues of $3.61 billion versus $3.67 billion expected.\n\nInteractive Brokers Group Inc (NASDAQ:IBKR) slid 5% after reporting Q2 EPS of $1.32 versus $1.40 expected, while revenues were reported at $1.06 billion, in-line with expectations.\n\nJB Hunt Transport Services Inc (NASDAQ:JBHT) added 2% after the company reported Q2 EPS of $1.81 versus $1.92 expected on revenues of $3.13 billion versus $3.31 billion expected.\n\nAhead in Wednesday's trade, market participants will be monitoring monthly building permits and housing starts data.\n\nAmong earnings, companies including Tesla Inc (NASDAQ:TSLA), Netflix Inc (NASDAQ:NFLX), Goldman Sachs Group Inc (NYSE:GS), International Business Machines (NYSE:IBM) and U.S. Bancorp (NYSE:USB) are scheduled to report quarterly results.\n\nGet the latest earnings results with InvestingPro.\n\nDuring Tuesday's regular session, the Dow Jones Industrial Average added 366.6 points or 1.1% to 34,951.9, the S&P 500 gained 32.2 points or 0.7% to 4,555 and the NASDAQ Composite lifted 108.7 points or 0.8% to 14,353.6. All 3 major indices extended 15-month highs.\n\nMajor bankers ms Bank of New York Mellon (NYSE:BK) and Bank of America Corp (NYSE:BAC) reported better than expected earnings, while retail sales data came in at 0.2% for June versus 0.5% expected.\n\nOn the bond markets, United States 10-Year rates were at 3.792%.\n\nRelated Articles\n\nDow futures steady, Western Alliance Bancorp falls 3.1% after earnings\n\nPrivate equity firm One Equity investigated by SEC - WSJ\n\nWhite House partners with Amazon, Google, Best Buy to secure devices from cyberattacks", "link": "https://finance.yahoo.com/news/dow-futures-steady-western-alliance-191002728.html", "symbols": ["BAC.US", "BK.US", "DJI.INDX", "GS.US", "IBKR.US", "IBM.US", "IXIC.INDX", "JBHT.US", "NFLX.US", "OMC.US", "TSLA.US", "USB.US", "WAL.US", "WEA.F"], "tags": [], "sentiment": {"polarity": 0.971, "neg": 0, "neu": 0.932, "pos": 0.068}}, {"date": "2023-07-18T19:00:21+00:00", "title": "Bank of America (BAC) Q2 2023 Earnings Call Transcript", "content": "BAC earnings call for the period ending June 30, 2023.", "link": "https://finance.yahoo.com/m/3d28a560-6787-3a52-be97-4dafab49efc4/bank-of-america-%28bac%29-q2-2023.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-07-18T17:46:04+00:00", "title": "Why Shares of Bank of America, Morgan Stanley, and PacWest Bancorp Are Rising Today", "content": "Bank stocks rose on well-received earnings reports from some of the largest names in the sector that pointed to a more optimistic outlook than investors had expected. Shares of Bank of America (NYSE: BAC) traded more than 4.5% higher as of 1:24 p.m. ET Tuesday. Meanwhile, shares of Morgan Stanley (NYSE: MS) traded more than 6% higher, while shares of PacWest Bancorp (NASDAQ: PACW) were up roughly 8%.", "link": "https://finance.yahoo.com/m/da92cd0a-5ffd-3446-bf03-5c98f005819c/why-shares-of-bank-of.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DWD.F", "DWD.XETRA", "F8B.F", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US", "MSBR34.SA", "MSC.US"], "tags": [], "sentiment": {"polarity": 0.8, "neg": 0, "neu": 0.873, "pos": 0.127}}, {"date": "2023-07-18T17:15:00+00:00", "title": "Merrill Lynch Set Record for New Client Growth in Second Quarter", "content": "With client and advisor counts on the rise, the wealth management segment contributed to a strong second quarter for Bank of America.", "link": "https://finance.yahoo.com/m/8019f4e6-9f9b-3308-80cf-9d6532608e99/merrill-lynch-set-record-for.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.758, "neg": 0, "neu": 0.745, "pos": 0.255}}, {"date": "2023-07-18T17:00:00+00:00", "title": "Wall Street Can’t Shake Off Investment-Banking Slump", "content": "Morgan Stanley said second-quarter profit fell 13% from a year ago, driven by a 22% decline in trading revenue.", "link": "https://finance.yahoo.com/m/ddd1d1f1-c931-3e0f-8c4c-998db7979b10/wall-street-can%E2%80%99t-shake-off.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DWD.F", "DWD.XETRA", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US", "MSBR34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.44, "neg": 0, "neu": 0.847, "pos": 0.153}}, {"date": "2023-07-18T16:05:25+00:00", "title": "Stock market today: Dow extends gains as banks shine, Microsoft hits record high", "content": "Investing.com -- The S&P 500 delivered swashbuckling gains Tuesday as investors cheered better-than-expected quarterly results from a slew of major corporations including Wall Street banks and a record high in Microsoft amid AI-optimism.\n\nThe Dow Jones Industrial Average rose 1.1%, or 366 points, the Nasdaq was up 0.8%, and the S&P 500 rose 0.7% to end the day at 52-week highs.\n\nWall Street banks continue to impress on earnings stage\n\nBank of America Corp (NYSE:BAC) led the move higher in banking stocks, rising more than 4% after reporting second-quarter earnings that topped analyst estimates as higher interest rates boosted loan income.\n\nMorgan Stanley (NYSE:MS), meanwhile, rallied 6% after its second-quarter results beat estimates on both the top and bottom lines as performance in its wealth management business offset weakness in its trading business amid a drop in equity and fixed-income revenue.\n\nCharles Schwab Corp (NYSE:SCHW) topped the list of gainers, up more than 12% following its better-than-expected quarterly results.\n\nMicrosoft drives big tech higher after hitting record high flexing AI muscle\n\nMicrosoft (NASDAQ:MSFT) rose 4% as investors piled into the stock on AI-optimism after the tech giant said it would charge businesses $30 per user to access the tech giant’s suite of artificial intelligence tool.\n\nThe initial pricing details are “very bullish for the total addressable cloud AI market opportunity for Microsoft that could increase cloud revenue annually by 20% by 2025 based on our estimate,” Wedbush said in a note.\n\nTesla, Netflix race higher as earnings come into focus\n\nTesla Inc (NASDAQ:TSLA) and Netflix Inc (NASDAQ:NFLX) were in rally mode ahead of the quarterly results due Wednesday after the market closes.\n\nFor Tesla's quarterly results, the focus will likely be on margins following the electric vehicle maker’s recent price cuts, while investor focus on Netflix’s quarterly results will likely center on the boost to subscriber numbers as well as guidance following the streaming giant’s crackdown on password sharing.\n\nWeaker retail sales flag slowing consumer, but July hike still in play\n\nRetail sales rose 0.2% in June following a 0.5% gain the month prior, missing economists’ estimates for a rise 0.5% and providing further optimism that the Federal Reserve’s series of rate hikes delivered so far are starting to slow the economy.\n\nStill, economists continue to expect the Fed to lift rates for one final time next week.\n\nThe positive retail sales figure for June suggests the economy continued to grow at a moderate pace, Desjardins said in a note, and [the] “Fed is therefore likely to announce one last 25 basis point increase in July.”\n\nRelated Articles\n\nStock market today: Dow extends gains as banks shine, Microsoft hits record high\n\nAfter-hours movers: Carvana falls after pushing up EPS report, Constellation Brands gains on Elliott agreement\n\nAurora Innovation plans $600 million private placement, shares fall", "link": "https://finance.yahoo.com/news/stock-market-today-dow-extends-160525058.html", "symbols": ["BAC.US", "DJI.INDX", "MS.US", "MSFT.US", "NFC.F", "NFC.XETRA", "NFLX.MX", "NFLX.US", "NFLX34.SA", "SCHW-PD.US", "SCHW.MX", "SCHW.US", "SCHW34.SA", "SWG.F", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.02, "neu": 0.855, "pos": 0.125}}, {"date": "2023-07-18T16:05:00+00:00", "title": "Bank of America Seemingly Had a Good Quarter, But Another Bank Stock Is Enticing", "content": "Bank of America released the firm's second quarter financial results on Tuesday morning. For the three month period ended June 30th, Bank of America posted a GAAP EPS of $0.88 on revenue of $25.197B. The earnings print for this Action Alerts PLUS holding compares to $0.73 for the year ago comparison as net income increased 19% year over year to $7.408B.", "link": "https://finance.yahoo.com/m/e0646aee-dfe4-3089-b496-b4868f1ea8d4/bank-of-america-seemingly-had.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.273, "neg": 0, "neu": 0.966, "pos": 0.034}}, {"date": "2023-07-18T16:04:10+00:00", "title": "U.S. banks shares spark after interest income boost, but outlook mixed", "content": "WASHINGTON (Reuters) - Big U.S. banks on Tuesday said higher interest rates had helped boost profits in the second quarter, causing shares to spike, but a pullback in consumer spending, slower loan growth and increased deposit costs may cloud the outlook for the sector.\n\nBank of America and Bank of New York Mellon Corp, two of the country's largest lenders, earned a windfall from charging clients higher interest rates as the Federal Reserve raised borrowing costs to rein in stubborn inflation.\n\nBank of America's net interest income (NII), which measures the difference between what banks earn on loans and pay out on deposits, rose 14% to $14.2 billion in the second quarter, helping it to beat Wall Street estimates. The bank said it expects full year NII to be up about 8% at about $57 billion.\n\nBNY Mellon also beat analyst estimates thanks to a 33% rise in net interest income to $1.1 billion, while PNC Financial Services Group, a major regional lender, reported a 15% jump in NII to $3.51 billion for the second quarter.\n\nThat was in contrast with U.S. custodian bank State Street warning on Friday of a further decline of 12-18% on net interest income on a sequential basis, driven by lower deposit levels. Deposits at large banks have been dropping as consumers move money in search of higher yields.\n\n\"Net interest margin seems to be somewhat increasing and the earnings seem to be good,\" said Robert Pavlik, senior portfolio manager at Dakota Wealth, but added some investors were waiting on more regional bank earnings to get a better picture of the sector outlook before rejigging their portfolios.\n\n\"A lot of people are just waiting for a little bit more on the earnings front.\"\n\nBank of America jumped nearly 5% on Tuesday, while BNY was also up nearly 5%. The S&P 500 Banks index was up 2%, while the KBW Regional Banking index was up more than 3% to highest levels since late March.\n\nJPMorgan Chase, Wells Fargo and Citigroup likewise said on Friday they got a profit boost from higher rates and painted a picture of a resilient economy, but also warned of risks ahead with U.S. consumers pulling back on spending and loan growth expected to slow.\n\nThose warnings were echoed on Tuesday by PNC, which cut its forecast for full-year NII, casting a shadow over its second-quarter earnings beat. The bank estimated NII will rise 5% to 6% in 2023 from last year, compared with its previous forecast of 6% to 8%. That decline is due to modestly lower loan growth and slightly higher deposit costs. Still, its stock was up 3.5%.\n\nThe results follow a tumultuous first quarter in which a banking crisis, triggered by the collapse of Silicon Valley Bank, led panicked consumers to yank deposits. That has forced some banks to offer consumers higher returns to deter them from moving their deposits to competitors.\n\nCharles Schwab on Tuesday said its NII had slumped 10% to $2.29 billion in the second quarter, as some clients have been moving cash to alternatives that fetch better returns. However, its shares were up 12%.\n\nWall Street titan Morgan Stanley said NII of $2.2 billion was virtually flat versus the prior quarter, and that the bank did not expect NII to expand.\n\nOverall, the bank's profit slipped 18% in the second quarter as Wall Street's deal-making drought stunted revenue from investment banking, although investors were cheered by executives' positive outlook for M&A. Its shares were up 6%.\n\nInvestment banking and trading were also a drag on earnings for big banks on Friday, although JPMorgan said the bank was seeing “green shoots” in trading and investment banking.\n\nIn contrast, BofA said on Tuesday that its investment banking business and trading fared better than expected.\n\n(Reporting by Mehnaz Yasmin, Niket Nishant, Manya Saini in Bengaluru and Saeed Azhar, Tatiana Bautzer in New York and by Lance Tupper, Johann Cherian; Writing by Michelle Price; editing by Megan Davies and Nick Zieminski)", "link": "https://finance.yahoo.com/news/u-banks-shares-spark-interest-160410204.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.06, "neu": 0.813, "pos": 0.127}}, {"date": "2023-07-18T15:59:04+00:00", "title": "WRAPUP 1-U.S. banks shares spark after interest income boost, but outlook mixed", "content": "WASHINGTON, July 18 (Reuters) - Big U.S. banks on Tuesday said higher interest rates had helped boost profits in the second quarter, causing shares to spike, but a pullback in consumer spending, slower loan growth and increased deposit costs may cloud the outlook for the sector.\n\nBank of America and Bank of New York Mellon Corp , two of the country's largest lenders, earned a windfall from charging clients higher interest rates as the Federal Reserve raised borrowing costs to rein in stubborn inflation.\n\nBank of America's net interest income (NII), which measures the difference between what banks earn on loans and pay out on deposits, rose 14% to $14.2 billion in the second quarter, helping it to beat Wall Street estimates. The bank said it expects full year NII to be up about 8% at about $57 billion.\n\nBNY Mellon also beat analyst estimates thanks to a 33% rise in net interest income to $1.1 billion, while PNC Financial Services Group, a major regional lender, reported a 15% jump in NII to $3.51 billion for the second quarter.\n\nThat was in contrast with U.S. custodian bank State Street warning on Friday of a further decline of 12-18% on net interest income on a sequential basis, driven by lower deposit levels. Deposits at large banks have been dropping as consumers move money in search of higher yields.\n\n\"Net interest margin seems to be somewhat increasing and the earnings seem to be good,\" said Robert Pavlik, senior portfolio manager at Dakota Wealth, but added some investors were waiting on more regional bank earnings to get a better picture of the sector outlook before rejigging their portfolios.\n\n\"A lot of people are just waiting for a little bit more on the earnings front.\"\n\nBank of America jumped nearly 5% on Tuesday, while BNY was also up nearly 5%. The S&P 500 Banks index was up 2%, while the KBW Regional Banking index was up more than 3% to highest levels since late March.\n\nJPMorgan Chase, Wells Fargo and Citigroup likewise said on Friday they got a profit boost from higher rates and painted a picture of a resilient economy, but also warned of risks ahead with U.S. consumers pulling back on spending and loan growth expected to slow.\n\nThose warnings were echoed on Tuesday by PNC, which cut its forecast for full-year NII, casting a shadow over its second-quarter earnings beat. The bank estimated NII will rise 5% to 6% in 2023 from last year, compared with its previous forecast of 6% to 8%. That decline is due to modestly lower loan growth and slightly higher deposit costs. Still, its stock was up 3.5%.\n\nThe results follow a tumultuous first quarter in which a banking crisis, triggered by the collapse of Silicon Valley Bank, led panicked consumers to yank deposits. That has forced some banks to offer consumers higher returns to deter them from moving their deposits to competitors.\n\nCharles Schwab on Tuesday said its NII had slumped 10% to $2.29 billion in the second quarter, as some clients have been moving cash to alternatives that fetch better returns. However, its shares were up 12%.\n\nWall Street titan Morgan Stanley said NII of $2.2 billion was virtually flat versus the prior quarter, and that the bank did not expect NII to expand.\n\nOverall, the bank's profit slipped 18% in the second quarter as Wall Street's deal-making drought stunted revenue from investment banking, although investors were cheered by executives' positive outlook for M&A. Its shares were up 6%.\n\nInvestment banking and trading were also a drag on earnings for big banks on Friday, although JPMorgan said the bank was seeing “green shoots” in trading and investment banking.\n\nIn contrast, BofA said on Tuesday that its investment banking business and trading fared better than expected.\n\n(Reporting by Mehnaz Yasmin, Niket Nishant, Manya Saini in Bengaluru and Saeed Azhar, Tatiana Bautzer in New York and by Lance Tupper, Johann Cherian; Writing by Michelle Price; editing by Megan Davies and Nick Zieminski)", "link": "https://finance.yahoo.com/news/wrapup-1-u-banks-shares-155904558.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.06, "neu": 0.813, "pos": 0.127}}, {"date": "2023-07-18T15:49:59+00:00", "title": "Higher Rates Prop Bank of America's Profits But Commercial Real Estate Loan Concerns Loom", "content": "Bank of America reported double-digit growth in revenue and net income in the second quarter on Tuesday, as higher interest rates boosted income it generated from lending money.", "link": "https://finance.yahoo.com/m/d2cc48db-4f50-3c81-bc23-dcd301543644/higher-rates-prop-bank-of.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.796, "neg": 0, "neu": 0.755, "pos": 0.245}}, {"date": "2023-07-18T15:46:34+00:00", "title": "NBCUniversal's Peacock Raises Prices First Time Since Launch, Warren Buffett Sells Majority of Activision Blizzard Stake Before Microsoft Deal Approval, Novartis Launches $15B Share Buyback: Today's Top Stories", "content": "Wall Street Journal\n\nNBCUniversal's Peacock Streaming Service Raises Subscription Price For First Time Since Debut\n\nNBCUniversal has announced that Peacock's first price increase since the streaming platform debuted in 2020 will go into effect next month. The decision to raise prices comes as Peacock's subscriber figures continue to grow. In the first three months of 2023, the platform reached nearly 22 million subscribers, marking a 60% year-over-year increase. The price hike will take effect on August 17. Peacock's Premium tier (with ads) price will rise by $1, bringing it to $5.99 per month. Meanwhile, the Premium Plus tier (without ads) will rise by $2 to $11.99 per month.\n\nBenzinga\n\nNovartis Q2 Earnings: Company Lifts Outlook, Launches $15B Share Buyback, Maps Out Sandoz Spin-Off\n\nNovartis AG (NYSE: NVS) reported Q2 FY23 sales of $13.62 billion, up 7% Y/Y and 9% on constant currency, beating the consensus of $13.17 billion. The pharma major is also initiating a share buyback program worth up to $15 billion to be completed by year-end 2025, following the completion of its previous share buyback in June 2023. Novartis also said its board of directors has \"unanimously\" endorsed the total spin-off of the generics division Sandoz, first announced last year.\n\nLockheed Martin Q2: 8% Revenue Growth, Solid Demand, Raised FY23 Guidance & More\n\nLockheed Martin Corp (NYSE: LMT) reported second-quarter FY23 net sales growth of 8.1% year-over-year to $16.69 billion, above the consensus of $15.91 billion. Adjusted EPS of $6.73 (+6.5% Y/Y) topped the consensus of $6.45. Lockheed Martin expects net sales of ~$66.25 billion - $66.75 billion (prior view $65 billion -$66 billion) versus the consensus of $65.84 billion. It sees EPS of ~$27.00 - $27.20 (prior view ~$26.60-$26.90) versus the consensus of $27.15.\n\nMorgan Stanley Q2 Profits Dip: Wall Street Giant Struggled With Slowdown In Deal Making, Trading\n\nMorgan Stanley (NYSE: MS) reported Q2 earnings per share of $1.24, beating the consensus of $1.15. Revenues reached $13.46 billion, up 2% Y/Y, vs. expected $13.08 billion and down 7% sequentially. The bank's profit declined 13% to $2.18 billion as Wall Street's deal-making drought stunted revenue from investment banking. Revenue from investment banking stood at $1.16 billion, in line with last year.\n\nToyota Inks Pact With Abu Dhabi National Oil Company To Test High-Speed Hydrogen Refueling Station\n\nToyota Motor Corporation (NYSE: TM) will provide hydrogen-powered vehicles to test a high-speed hydrogen refueling station in Abu Dhabi. For the development, oil giant Abu Dhabi National Oil Company, or ADNOC, announced a partnership with Toyota and Al-Futtaim Motors to test the high-speed hydrogen refueling station using a fleet of clean hydrogen-powered vehicles. The station, built in Masdar City by ADNOC, will create clean hydrogen from water using an electrolyzer powered by clean grid electricity.\n\nBank Of New York Mellon Beats Q2 Street Expectations\n\nThe Bank Of New York Mellon Corporation (NYSE: BK) reported a second-quarter total revenue increase of 5% year-over-year to $4.45 billion, beating the consensus of $4.37 billion. Net interest revenue increased 33% YoY to $1.1 billion due to higher interest rates, and Fee revenue decreased 2% to $3.26 billion, reflecting lower foreign exchange revenue, the impact of the Alcentra divestiture.\n\nBank of America Clocks 19% Q2 Net Income Growth: Performance By The Numbers\n\nBank of America Corp (NYSE: BAC) shares are up Tuesday morning following its second-quarter results that surpassed the Street view. BAC reported a second-quarter FY23 net income growth of 19% year-over-year to $7.4 billion. EPS for the quarter was $0.88, compared to $0.73 in 2Q22, beating the consensus of $0.84. Revenue increased 11% Y/Y to $25.33 billion, beating the consensus of $25.05 billion.\n\nAstraZeneca-Sanofi's Respiratory Syncytial Virus Treatment Scores FDA Approval To Prevent Infection In Infants\n\nThe FDA approved AstraZeneca Plc (NASDAQ: AZN) and Sanofi SA's (NASDAQ: SNY) Beyfortus (nirsevimab) for the prevention of respiratory syncytial virus (RSV) lower respiratory tract disease (LRTD) in newborns and infants. The approval covers newborns and infants during or entering their first RSV season and children up to 24 months of age who remain vulnerable to severe RSV disease through their second RSV season. Beyfortus will be available in the US before the 2023-2024 RSV season.\n\nReuters\n\nWarren Buffett's Berkshire's Missed Gains: Buffett Sells Majority of Activision Blizzard Stake Before Microsoft Deal Approval\n\nWarren Buffett's Berkshire Hathaway Inc (NYSE: BRK-A) (NYSE: BRK-B) sold 70% of its exposure to Activision Blizzard Inc (NASDAQ: ATVI) in the second quarter. Buffett appeared to miss out on some gains when a federal judge said Microsoft Corp (NASDAQ: MSFT) could complete its $68.7 billion takeover of the video game maker. The Activision investment was a form of arbitrage, with Buffett viewing investors as too pessimistic over the regulatory approval for the merger.\n\nTaiwan Semiconductor Manufacturing Expects Q2 Profits To Fall\n\nTaiwan Semiconductor Manufacturing Company Ltd (NYSE: TSM) shares are trading lower Tuesday amid reports that the company will likely report a 27% decline in second-quarter net profit on Thursday as global economic woes weigh on semiconductor demand. Interestingly, analysts say otherwise. Taiwan's Fubon Investment analysts expected Q2 to be the bottom of the current downcycle. However, while the situation should improve in Q3, it would be weaker than usual, given continued inventory build-ups.\n\nBloomberg\n\nVerizon Investigates Lead Contamination Problem\n\nVerizon Communications Inc (NYSE: VZ) announced launching an investigation to clarify the extent of potential lead contamination probably linked to its aging phone cables. The telecom operator is testing various sites where lead was reported to be leaching into the ground from wiring dating back to the early 20th century. The report noted Verizon saying that lead in the environment may come from various industrial uses other than telecom.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article NBCUniversal's Peacock Raises Prices First Time Since Launch, Warren Buffett Sells Majority of Activision Blizzard Stake Before Microsoft Deal Approval, Novartis Launches $15B Share Buyback: Today's Top Stories originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/nbcuniversals-peacock-raises-prices-first-154634018.html", "symbols": ["AIY.F", "AIY.XETRA", "ATVI.MX", "ATVI.US", "AZN.US", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.F", "BAC.MX", "BAC.US", "BAC.XETRA", "BK.US", "BML-PL.US", "BN9.F", "BOAC34.SA"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.043, "neu": 0.849, "pos": 0.108}}, {"date": "2023-07-18T15:35:19+00:00", "title": "What to watch in bank earnings: Deposits, interest, loan losses", "content": "Bank of America's Q2 earnings came in slightly better than expected, while Morgan Stanley reported a mixed second-quarter outcome. After this year's financial system shakeup, what should investors be looking at more carefully in big bank earnings? Yahoo Finance Reporter David Hollerith joins Jared Blikre to examine the banks' declining bottom line as deposits continue to fall.", "link": "https://finance.yahoo.com/video/watch-bank-earnings-deposits-interest-153519844.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DWD.F", "DWD.XETRA", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US", "MSBR34.SA", "NCB.XETRA", "SCHW-PD.US", "SCHW.MX"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0.027, "neu": 0.898, "pos": 0.075}}, {"date": "2023-07-18T15:04:00+00:00", "title": "Bonds Are a Problem, and One Solution, for Bank of America", "content": "Bank of America’s enormous portfolio including government debt and mortgage bonds—nearly $760 billion at the end of the second quarter, with an unrealized loss of almost $110 billion—is for now a drag on its ability to grow its net interest income. The upshot is a drag on the bank’s ability to grow interest earnings as quickly as peers like JPMorgan even as higher-yielding loans like credit cards jump.", "link": "https://finance.yahoo.com/m/f8fca35a-07d3-317e-b6dc-2b5446f6f591/bonds-are-a-problem%2C-and-one.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.863, "neg": 0.105, "neu": 0.672, "pos": 0.222}}, {"date": "2023-07-18T14:33:45+00:00", "title": "Bank of America, Morgan Stanley, Chipotle, and Pinterest: Trending stocks", "content": "The S&P 500 is trading flat after retail sales come in softer-than-expected. Bank of America shares rise as the company's earnings report beat expectations, boosted by higher interest rates. Morgan Stanley stock rises after the company also reported earnings. The results showed profits declined compared to the year before, but were boosted by the company's wealth management results due to higher interest income. Chipotle is planning to open locations in the Middle East next year. Pinterest shares rise after receiving an upgrade from Evercore ISI. Yahoo Finance Live takes a look as some of the trending tickers of the day.", "link": "https://finance.yahoo.com/video/bank-america-morgan-stanley-chipotle-143345894.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C9F.F", "CMG.MX", "CMG.US", "DWD.F", "DWD.XETRA", "GSPC.INDX", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US"], "tags": [], "sentiment": {"polarity": 0.962, "neg": 0, "neu": 0.808, "pos": 0.192}}, {"date": "2023-07-18T13:56:22+00:00", "title": "Banks are 'cheating' depositors: Analyst", "content": "Bank of America's second quarter results topped analyst estimates. Odeon Capital Group Financial Strategist Dick Bove tells Yahoo Finance Live that BofA's results show that \"on a year-over-year basis the numbers look pretty good, but on a quarter-over-quarter basis, it shows that there is some weakness developing.\" Bove also says that the big banks are \"feeling the same stress\" over deposits. \"Banks are cheating the depositors. Basically, banks got this huge windfall gain as a result of something they had nothing to do with, the Fed increased interest rates, and they didn't pass it along to their depositors,\" Bove said in the interview. Bove adds that \"the results is, in a deposit basis, even the big banks are showing declines in deposits.\"\n\nVideo Transcript\n\nDIANE KING HALL: Bank of America beating the Street with results this morning. Profit jumped 19% year-over-year and the second quarter to $7.4 billion or $0.88 a share. That's ahead of forecast expectations of $0.84 a share.\n\nNow, BofA's net interest income also rising 14% to meet expectations at $14.2 billion. But it indeed falls short of JP Morgan's 44% jump last week. Now, Brian Moynihan calls it quote, \"one of the strongest quarters in the company's history.\" Of course, don't miss our interview with Bank of America CEO at 3 PM Eastern Time.\n\nJoining us for analysis on the quarterly results, we have Dick Bove, Odeon Capital Group financial strategist. Dick, thanks so much for joining us once again. So let's jump right into the results from Bank of America today.\n\nIt was a beat. You had an initial pop in the pre-market in response to its earnings. It's cooled a bit, as they handle their earnings call. What's your first takeaway?\n\nDICK BOVE: Well, I think that what you're seeing is that on a year-over-year basis, the numbers look pretty good. But on a quarter-over-quarter basis, it shows that the there is some weakness developing.\n\nAnd I think that's a traditional-- well, I shouldn't say, traditional. I think it's similar to what other banks are showing in the quarter. In other words, what we're seeing is if you're solely in the banking business, a PNC, for example, you're not doing particularly well. If you have a big capital markets operation to assist you, and JP Morgan or a company like Wells Fargo, which you're seeing is some strength in that area.\n\nSo I'd say that what Bank of America is doing at the present time is showing those trends. The banking industry weakened. The banking business weakened in the quarter-over-quarter results. And they were surprisingly strong in the capital markets arena. And I think if you're looking forward for banking, again, you have to make your call on whether there's going to be a recession or not.\n\nBut if you're looking forward, I think that the trends that you're likely to see are similar to what we saw in this quarter. I think that you're going to see capital markets activity being very strong over the next few quarters. You're going to see banking being lackluster.\n\nYou'll see some little pickup, maybe in commercial industrial lending. But home mortgages should be flat. And you should see credit card lending, which was extremely strong coming down somewhat as people are borrowing a little bit too much right now for their income.\n\nJULIE HYMAN: Yeah. We did see an increase in credit card write offs for Bank of America. Although, it's still well below where it was even pre-pandemic, which is interesting. Something else that stuck out to me Dick is consumer unit deposits, which were down 1% quarter-over-quarter.\n\nOn a relative basis on that front, how is Bank of America doing versus its competitors?\n\nDICK BOVE: Well, again, JP Morgan's numbers are all messed up because of the acquisition of First Republic. If you took the First Republic numbers out of JP Morgan, OK, you would see that JP Morgan's, if you will, organic numbers were down across the board.\n\nSo I know people get very enthused about the JP Morgan numbers. But they tend to forget that they're not as a result of organic growth at JP Morgan. The result of a major acquisition, which gave them $2.7 billion in profits.\n\nAll right. So if you take a look at the deposits at JP Morgan, you take a look at the deposits at Wells Fargo, if you take a look at the deposits at Bank of America, they're all feeling the same stress. And they're feeling that stress for a very logical reason.\n\nThe banks are cheating the depositors. Basically, the banks got this huge windfall gain as a result of something that they had nothing to do with the fed increased interest rates. And they didn't pass it along to their depositors. So the result is that on a deposit basis, even the big banks are showing declines in deposits, despite this theory that everybody's taking money out of the regional banks and putting it into the big banks. I'm not seeing that.\n\nAlthough, PNC's deposit numbers were not particularly good at all in this quarter. I think that if the banks want these deposits back, it's easy to get them back. All they have to do is raise their rates closer to a market rate. They are reluctant to do that however because their margins are not doing well.\n\nThey're in a box because the yield on their assets are not enough to allow them to pay market rates on deposits. So they don't pay market rates on deposits. And the deposits go to money market funds or other areas. But they don't stay in these banks.\n\nDIANE KING HALL: So in their earnings report, net charge offs increased to $869 million. So it's up from a year ago. And total loan loss levels are at $602 million. Is that concerning at all for you for Bank of America. Dick?\n\nDICK BOVE: Yes, it is. I think that what you're going to see is a very, very significant increase in loan losses in the consumer sector over the next couple of quarters.\n\nI can give you a simple example, which tends to bear what I'm talking about. One of my friends called me the other day and said that he bought a car three years ago for $63,000. The blue book value of that car today is $36,000. But the size of his loan is $45,000. And he's got four years to go in paying for that loan.\n\nIf you multiply him by hundred of thousands of auto buyers over the last three years, you'll find that they're in a similar situation because used car prices are coming down. And they took these six- and seven-year loans outstanding. And that is going to hit them hard. And not every one of them is going to continue to make the auto payment. And if unemployment were to rise at all, then you would see a substantial increase.\n\nThe same deal is going on with credit cards. People got this huge largesse in terms of all of this money dumped into their pocket by the government, a few years ago. That money is now been spent. And so now, they're borrowing. And they're not borrowing on necessities. They're borrowing on tourism, on homes outside the house, on a variety of recreational products.\n\nI think the consumer is in a very vulnerable position. And I think that loan losses will increase substantially as they said a minute ago, over the next few quarters.\n\nJULIE HYMAN: And Dick, just finally, quickly, I want to ask you about Morgan Stanley on the other side of the spectrum. the non-consumer bank side of the spectrum. Because they're, too, even though at some of its competitors trading operations were a little bit stronger, Morgan Stanley's results were middling, I guess. Is that your assessment?\n\nDICK BOVE: They disappointed me because I raised the rating on Morgan Stanley last Thursday expecting that they would show much stronger results in investment banking, and better trading. I realize that trading would not be good because it just hasn't been good for anyone, except for Bank of America.\n\nAnd I realized that the first two months of the quarter were not great in investment banking. But June was so strong in terms of a massive increase in M&A activity and in equity offerings. That I thought Morgan Stanley would do much better than it has. So I'm disappointed by those results.\n\nJULIE HYMAN: Dick, it's good to see you. Dick Bove, Odeon Capital Group financial strategist, and on the topic of financials and of Bank of America. Stay tuned for our 3 to 5 PM show. Our executive editor, Brian Sozzi, is going to be speaking with Bank of America CEO, Brian Moynihan, on the back of those earnings. You don't want to miss that.", "link": "https://finance.yahoo.com/video/banks-cheating-depositors-analyst-135622553.html", "symbols": ["0Q16.LSE", "0R01.LSE", "0R2F.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CMC.F", "CMC.XETRA", "CTGP34.SA", "DWD.F", "DWD.XETRA", "JPM-PC.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.089, "neu": 0.776, "pos": 0.135}}, {"date": "2023-07-18T13:30:11+00:00", "title": "Bank of America (BAC) Q2 Earnings: Taking a Look at Key Metrics Versus Estimates", "content": "For the quarter ended June 2023, Bank of America (BAC) reported revenue of $25.2 billion, up 11.1% over the same period last year. EPS came in at $0.88, compared to $0.73 in the year-ago quarter.\n\nThe reported revenue represents a surprise of +0.93% over the Zacks Consensus Estimate of $24.97 billion. With the consensus EPS estimate being $0.84, the EPS surprise was +4.76%.\n\nWhile investors scrutinize revenue and earnings changes year-over-year and how they compare with Wall Street expectations to determine their next move, some key metrics always offer a more accurate picture of a company's financial health.\n\nAs these metrics influence top- and bottom-line performance, comparing them to the year-ago numbers and what analysts estimated helps investors project a stock's price performance more accurately.\n\nHere is how Bank of America performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\n\nEfficiency Ratio (FTE basis): 63.31% versus the seven-analyst average estimate of 62.8%. Net interest income/yield on earning assets - Yield/rate: 2.06% versus the seven-analyst average estimate of 2.14%. Total earning assets - Average balance: $2,772.94 billion versus the seven-analyst average estimate of $2,680.33 billion. Net charge-off / Average Loans: 0.33% compared to the 0.36% average estimate based on six analysts. Total nonperforming loans, leases and foreclosed properties: $4.27 billion versus the five-analyst average estimate of $4.38 billion. Tier 1 Capital Ratio: 13.3% versus 13.07% estimated by four analysts on average. Total Non-Performing Loans: $4.13 billion versus $4.27 billion estimated by four analysts on average. Tier 1 Leverage Ratio: 7.1% compared to the 7.06% average estimate based on three analysts. Total Noninterest Income: $11.04 billion compared to the $10.77 billion average estimate based on seven analysts. Net Interest Income- Fully taxable-equivalent basis: $14.29 billion versus $14.28 billion estimated by seven analysts on average. Investment and brokerage services: $3.84 billion compared to the $3.98 billion average estimate based on six analysts. Investment banking fees: $1.21 billion compared to the $1.16 billion average estimate based on six analysts.\n\nView all Key Company Metrics for Bank of America here>>>\r\n\r\nShares of Bank of America have returned +0.7% over the past month versus the Zacks S&P 500 composite's +2.7% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBank of America Corporation (BAC) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/bank-america-bac-q2-earnings-133011475.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.979, "neg": 0, "neu": 0.929, "pos": 0.071}}, {"date": "2023-07-18T13:27:19+00:00", "title": "Bank of America &amp; Morgan Stanley earnings, slowing retail sales: 3 Things", "content": "The bank earnings train keeps on rolling as Bank of America and Morgan Stanley report this morning. Bank of America posts an earnings beat with mixed forecasts, while Morgan Stanley also reported a beat with net interest incomes reporting underwhelming shareholders. Lastly, U.S. retail sales data slowed in the month of June. Yahoo Finance's Julie Hyman breaks down several of the leading stories this morning.", "link": "https://finance.yahoo.com/video/bank-america-morgan-stanley-earnings-132719568.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DWD.F", "DWD.XETRA", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US", "MSBR34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.459, "neg": 0, "neu": 0.955, "pos": 0.045}}, {"date": "2023-07-18T13:21:31+00:00", "title": "What These 2 Big Bank Stocks Are Saying About the Bull Market", "content": "The stock market appeared ready to open on a flat note on Tuesday morning, largely playing a waiting game as market participants wait for the latest financial results for some top companies in areas like technology and communication services. Stock index futures eased very slightly lower in premarket trading before the open. More banks reported their latest results on Tuesday morning, and Bank of America (NYSE: BAC) and Morgan Stanley (NYSE: MS) in particular gave their shareholders a nice view on the current state of the industry.", "link": "https://finance.yahoo.com/m/cbfc45e2-8b87-36c2-812b-f827e2547894/what-these-2-big-bank-stocks.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DWD.F", "DWD.XETRA", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US", "MSBR34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.855, "neg": 0.024, "neu": 0.83, "pos": 0.147}}, {"date": "2023-07-18T13:11:00+00:00", "title": "Banks Are on a Roll. Bank of America’s Profit Got a 19% Boost From Higher Rates.", "content": "Bank earnings season got off to a good start last week, and Bank of America ‘s results Tuesday showed the momentum can keep going. Bank of America (ticker: BAC) saw profit increase by 19% year over year to $7.4 billion, or 88 cents a share, share topping expectations of analysts surveyed by FactSet who forecast profit of $6.9 billion, or 84 cents. An increase in net interest income—or the spread between the interest banks earn on assets, such as loans, versus the interest paid out on deposits—was one main driver of profit gains.", "link": "https://finance.yahoo.com/m/b7a378d9-3e08-35ef-b703-e820b7f0b130/banks-are-on-a-roll.-bank-of.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.983, "neg": 0, "neu": 0.698, "pos": 0.302}}, {"date": "2023-07-18T13:01:13+00:00", "title": "US STOCKS-Wall St eyes lower open as investors digest more big bank earnings", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nBank of America, Morgan Stanley report Q2 results\n\n*\n\nLockheed Martin rise on strong FY outlook\n\n*\n\nJune retail sales up 0.2% vs est 0.5%\n\n*\n\nFutures down: Dow 0.03%, S&P 0.08%, Nasdaq 0.15%\n\n(Updated at 8:38 a.m. ET/1238 GMT)\n\nBy Bansari Mayur Kamdar and Johann M Cherian\n\nJuly 18 (Reuters) - Wall Street was set to open lower on Tuesday as investors digested more earnings reports from top lenders including Morgan Stanley and Bank of America, after the markets rallied last week in anticipation of the results and signs of inflation cooling.\n\nBank of America edged lower in volatile premarket trading though the lender posted a 20% surge in second-quarter profit, and Morgan Stanley slid after a drop in its quarterly profit as dealmaking and trading in stocks and bonds slumped.\n\n\"The markets and the sectors have gotten ahead of themselves and probably some digestion of gains is necessary,\" said Sam Stovall, chief Investment strategist at CFRA Research, New York.\n\n\"Most of the major banks have reported so now the question is what about smaller banks because the smaller banks are more lending focused and as a result of the inverted yield curve, they might not have the kind of net interest income strength.\"\n\nSome of the largest U.S. banks, including JPMorgan Chase and Wells Fargo, said on Friday they got a profit boost from higher rates, pointing towards a resilient economy.\n\nBank of New York Mellon fell 0.7% even as the lender posted upbeat quarterly earnings, while PNC Financial Services shed 3.1% after it lowered its forecast for full-year net interest income (NII).\n\nThe S&P 500 banks index has fallen 5.2% so far this year, underperforming the S&P 500 index which has notched a 17.8% gain after the biggest banking crisis since 2008 earlier this year took down three lenders and pummeled the sector.\n\nLockheed Martin added 1.0% after the weapons maker raised its annual profit and sales outlook on strong demand for military equipment, stoked by ongoing geopolitical uncertainties.\n\nOverall earnings across industries are expected to decline 8.1% for the quarter, according to Refinitiv data.\n\nAt 8:38 a.m. ET, Dow e-minis were down 11 points, or 0.03%, S&P 500 e-minis were down 3.5 points, or 0.08%, and Nasdaq 100 e-minis were down 24.5 points, or 0.15%.\n\nWall Street rallied last week after consumer prices and producer prices data provided evidence that the economy had entered a disinflation phase, stoking hopes that the U.S. Federal Reserve will soon end its monetary policy tightening.\n\nMeanwhile, domestic retail sales, reported on Tuesday, rose less than expected in June, though consumer spending appeared to be solid, which likely kept the economy afloat in the second quarter.\n\nPinterest gained 3.3% as Evercore ISI upgraded its rating on the stock to \"outperform\" and Marvell Technology climbed 1.1% after Bank of America added the chipmaker to its U.S. No.1 list.\n\n(Reporting by Bansari Mayur Kamdar and Johann M Cherian in Bengaluru; Editing by Nivedita Bhattacharjee and Shinjini Ganguli)", "link": "https://finance.yahoo.com/news/us-stocks-wall-st-eyes-130113854.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "GSPC.INDX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.972, "neg": 0.04, "neu": 0.875, "pos": 0.086}}, {"date": "2023-07-18T12:42:00+00:00", "title": "Bank of America’s Bond Losses Widened to $106 Billion in Second Quarter", "content": "The loss on the portfolio, which totals $614 billion, increased by nearly $7 billion relative to the first quarter.", "link": "https://finance.yahoo.com/m/7dfa8965-414d-3983-bc5b-eff2d1bc3946/bank-of-america%E2%80%99s-bond-losses.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": -0.052, "neg": 0.107, "neu": 0.794, "pos": 0.098}}, {"date": "2023-07-18T12:37:59+00:00", "title": "The Rich Are Borrowing Less Against Their Portfolios", "content": "Rising markets don’t appear to be pushing wealthy people to borrow against their stock-and-bond portfolios. Outstanding securities-based loans were down again at Bank of America and Morgan Stanley, both of which have large wealth-management businesses.", "link": "https://finance.yahoo.com/m/66502d33-8bc4-32ef-ac1d-fe3df793f564/the-rich-are-borrowing-less.html", "symbols": ["0Q16.LSE", "0R2F.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DWD.F", "DWD.XETRA", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US", "MSBR34.SA", "NCB.XETRA", "NWT.F"], "tags": [], "sentiment": {"polarity": 0.758, "neg": 0, "neu": 0.835, "pos": 0.165}}, {"date": "2023-07-18T12:32:00+00:00", "title": "Morgan Stanley’s Profit Falls, Hurt by Lower Trading Revenue", "content": "Results show that Wall Street-style businesses like investment banking and trading are still in the doldrums.", "link": "https://finance.yahoo.com/m/ddd1d1f1-c931-3e0f-8c4c-998db7979b10/morgan-stanley%E2%80%99s-profit.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DWD.F", "DWD.XETRA", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US", "MSBR34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.361, "neg": 0, "neu": 0.857, "pos": 0.143}}, {"date": "2023-07-18T12:24:50+00:00", "title": "Stocks to Watch Tuesday: Bank of America, AT&amp;T, Novartis", "content": "↘️ [**Bank of America (BAC)**](https://www.wsj.com/market-data/quotes/BAC): The nation’s second-largest bank [reported a 19% rise in quarterly profit](https://www.wsj.com/livecoverage/stock-market-today-dow-jones-07-18-2023/card/bank-of-america-profit-rises-19--fNqFzHVKFzJnF3NIg7hk) and said earnings totaled a forecast-beating 88 cents a share.", "link": "https://finance.yahoo.com/m/5c0d14a4-a5c1-3105-acb9-109110ff9e67/stocks-to-watch-tuesday%3A-bank.html", "symbols": ["0Q16.LSE", "3M4.F", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.F", "BAC.MX", "BAC.US", "BAC.XETRA", "BML-PL.US", "BOAC34.SA", "DWD.F", "DWD.XETRA", "MASI.US", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.913, "pos": 0.087}}, {"date": "2023-07-18T12:14:02+00:00", "title": "US STOCKS-Futures slip as investors digest more big bank earnings", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nBank of America climbs on strong Q2 profit\n\n*\n\nFutures down: Dow 0.05%, S&P 0.08%, Nasdaq 0.17%\n\n(Updated at 0742 a.m. ET/ 1142 GMT)\n\nBy Bansari Mayur Kamdar and Johann M Cherian\n\nJuly 18 (Reuters) - U.S. stock index futures slipped on Tuesday as investors digested more earnings reports from top lenders including Morgan Stanley and Bank of America, after the markets rallied last week in anticipation of the results and signs of inflation cooling.\n\nBank of America rose marginally in premarket trading after the lender posted a 20% surge in second-quarter profit, while Morgan Stanley's shares pared early gains after the bank's profit slipped 18%, hurt by a deal-making drought.\n\n\"The markets and the sectors have gotten ahead of themselves and probably some digestion of gains is necessary,\" said Sam Stovall, chief Investment strategist at CFRA Research, New York.\n\n\"Most of the major banks have reported so now the question is what about smaller banks because the smaller banks are more lending focused and as a result of the inverted yield curve, they might not have the kind of net interest income strength.\"\n\nSome of the largest U.S. banks, including JPMorgan Chase and Wells Fargo, said on Friday they got a profit boost from higher rates, pointing towards a resilient economy.\n\nBank of New York Mellon fell 1.2% even as the lender posted upbeat quarterly earnings, while PNC Financial Services shed 2.9% after it lowered its forecast for full-year net interest income (NII).\n\nThe S&P 500 banks index has fallen 5.2% so far this year, underperforming the S&P 500 index which has notched a 17.8% gain after the biggest banking crisis since 2008 earlier this year took down three lenders and pummeled the sector.\n\nLockheed Martin inched 0.8% up after the weapons maker raised its annual profit and sales outlook on strong demand for military equipment, stoked by ongoing geopolitical uncertainties.\n\nOverall earnings across industries are expected to decline 8.1% for the quarter, according to Refinitiv data.\n\nAt 7:42 a.m. ET, Dow e-minis were down 18 points, or 0.05%, S&P 500 e-minis were down 3.75 points, or 0.08%, and Nasdaq 100 e-minis were down 26.25 points, or 0.17%.\n\nWall Street has rallied since last week after consumer prices and producer prices data provided evidence that the economy had entered a disinflation phase, stoking hopes that the Federal Reserve will soon end its monetary policy tightening.\n\nInvestors are also focused on further signs that inflation is cooling, with the readings on U.S. retail sales and industrial production to be released later on Tuesday.\n\nPinterest gained 3.3% as Evercore ISI upgraded its rating on the stock to \"outperform\" and Marvell Technology climbed 1.1% after Bank of America added the chipmaker to its U.S. No.1 list.\n\n(Reporting by Bansari Mayur Kamdar and Johann M Cherian in Bengaluru; Editing by Nivedita Bhattacharjee and Shinjini Ganguli)", "link": "https://finance.yahoo.com/news/us-stocks-futures-slip-investors-121402785.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "GSPC.INDX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.035, "neu": 0.861, "pos": 0.105}}, {"date": "2023-07-18T12:14:00+00:00", "title": "2 Portfolio Holdings Deliver Nice Beats as We Await June Retail Sales", "content": "The two holdings, one a bank and the other a defense giant, also look like they're setting up well for the rest of the year.", "link": "https://finance.yahoo.com/m/66d33c05-9f09-3a5b-b1df-fe6b7c10678f/2-portfolio-holdings-deliver.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.625, "neg": 0, "neu": 0.766, "pos": 0.234}}, {"date": "2023-07-18T11:52:00+00:00", "title": "Bank of America’s trading arm helps profits beat expectations", "content": "Bank of America on Tuesday reported better than expected second-quarter profits, buoyed by its trading arm and the benefits of higher interest rates. The nation’s second-largest bank profits increased 19 per cent in the second quarter from a year ago to $7.4bn, ahead of analyst expectations of $6.9bn. BofA was boosted by its markets business with revenue from bond, commodities and currency trading up 18 per cent in the quarter, as clients turned to the bank to help manage interest rate increases.", "link": "https://finance.yahoo.com/m/812fc9d7-45b1-3aec-9169-f8da2e61b8ba/bank-of-america%E2%80%99s-trading-arm.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.971, "neg": 0, "neu": 0.745, "pos": 0.255}}, {"date": "2023-07-18T11:51:11+00:00", "title": "Morgan Stanley profits drop 14% on Wall Street slump", "content": "Profits fell at Morgan Stanley (MS) as the Wall Street giant struggled with a global slowdown in deal making and trading.\n\nIts net income of $2.2 was down 13% from the same period a year ago, falling to its lowest level in more than three years. Its revenue of $13.5 billion was up 2% from a year ago.\n\n“The firm delivered solid results in a challenging market environment,\" said CEO James Gorman, who has announced plans to step down within the next year. The firm has yet to name his successor.\n\nTrading revenues of $4.26 billion were slightly worse than analyst expected. Revenues for trading equities and fixed income fell 22% from a year ago and more than 19% from the previous quarter.\n\nInvestment banking revenues were flat when compared to a year ago and down from the first quarter.\n\nMorgan Stanley's sizable wealth management business helped offset some of that weaknesses. Revenues in that unit were up 16% from a year ago, to $6.7 billion.\n\n\"The quarter started with macroeconomic uncertainties and subdued client activity, but ended with a more constructive tone,\" Gorman added. \"We remain confident in our ability to grow in various market environments while maintaining a strong capital position.\" Morgan Stanley CEO James Gorman. (Photo by Vernon Yuen/NurPhoto via Getty Images)\n\nSlowdown on the Street\n\nMorgan Stanley is the latest of several big banks to report a slowdown in investment banking and trading. Revenues from those businesses dropped during the last quarter at Citigroup (C), JPMorgan Chase (JPM), but were up at Bank of America (BAC).\n\nThose results do not bode well for rival Goldman Sachs (GS), which is scheduled to report its results tomorrow. Goldman also relies heavily on deal making and trading for revenue but has a much smaller wealth management business than Morgan Stanley.\n\nGoldman is expected to show an investment banking revenue decline of 32% from a year ago and a trading decline of 17%, according to analyst estimates.\n\nThat could intensify the scrutiny of CEO David Solomon, who is wrestling with partner unrest and concerns about strategy as he tries to put a consumer-banking experiment behind the company. Goldman Sachs CEO David Solomon. (AP Photo/Patrick Semansky)\n\nGoldman is \"indicating that the second quarter might be ‘throw the kitchen sink in’ with larger write offs of some of these non-core businesses,\" Ken Leon, CFRA research director of equity research, told Yahoo Finance Friday.\n\nThus there will be a focus on Solomon and \"whether he can show the strategy they have is going to work,\" Leon said. \"It is going to be a tough issue\" for the CEO.\n\nGerard Cassidy, a banking analyst with RBC Capital Markets, told Yahoo Finance Monday that if Solomon is unable to put together a plan showing how the bank will return to its profits of old, \"his tenure there could be in trouble.\"\n\n'Too early'\n\nThe global slowdown in dealmaking began last year, following a boom in 2021, causing firms across Wall Street to slash bonuses and staff. It continued in 2023. This year, worldwide investment banking revenues for the second quarter fell 52% from a year ago, according to Dealogic.\n\nCitigroup, Morgan Stanley, Goldman and other firms with big investment banking and trading units have made or announced cuts of roughly 12,000 jobs since the end of 2022.\n\nSome observers are still predicting \"green shoots\" ahead, citing an uptick in announced M&A deals over the second quarter which could mean an improvement during the back half of 2023.\n\nJPMorgan Chief Financial Officer Jeremy Barnum on Friday said investment banking was better than expected in June, but cautioned analysts that it was “too early” to label it a trend.\n\n\"We will see,\" he said. For overall capital markets \"July should be a good indicator for the remainder of the year.\"\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/morgan-stanley-profits-drop-14-on-wall-street-slump-115111697.html", "symbols": ["0Q16.LSE", "0R01.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CMC.F", "CMC.XETRA", "CTGP34.SA", "DWD.F", "DWD.XETRA", "GOS.F", "GOS.XETRA"], "tags": [], "sentiment": {"polarity": 0.984, "neg": 0.028, "neu": 0.906, "pos": 0.066}}, {"date": "2023-07-18T11:34:59+00:00", "title": "Big Banks Are Paying Up For Deposits, But Deposits Are Still Shrinking", "content": "Banks took in tons of deposits [during the pandemic](https://www.wsj.com/articles/the-coronavirus-is-doing-weird-things-to-the-banking-industry-11598779800). Now those deposits are trickling out as customers yank money from accounts that don’t offer interest [for higher-yielding money-market accounts](https://www.", "link": "https://finance.yahoo.com/m/879cc774-e02b-3a74-aa34-b3be109423a6/big-banks-are-paying-up-for.html", "symbols": ["0Q16.LSE", "0R2F.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "CMC.F", "CMC.XETRA", "JPM-PC.US", "JPM-PD.US", "JPM.MX", "JPM.US", "JPMC34.SA", "NCB.XETRA", "NWT.F", "NWT.XETRA"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0.038, "neu": 0.865, "pos": 0.096}}, {"date": "2023-07-18T11:19:27+00:00", "title": "5 Things to Know Before Markets Open", "content": "Bank of America kicks off a busy day of bank earnings by beating its second quarter profit forecast and retail sales are expected to increase for June. Here’s what investors need to know today.", "link": "https://finance.yahoo.com/m/12543e4e-a85e-3f43-b4e3-de512d9c6877/5-things-to-know-before.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "MGG.F", "MGM.MX", "MGM.US", "MSC.US", "NCB.XETRA", "NOTA.F", "NOVN.SW"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0.079, "neu": 0.785, "pos": 0.136}}, {"date": "2023-07-18T11:10:11+00:00", "title": "Bank of America's profits jump 19% on strong Wall Street showing", "content": "Bank of America (BAC) churned out more profits and revenue in the second quarter after a surprisingly strong showing from its Wall Street unit and a solid performance from its consumer businesses.\n\nNet income was up 19% compared to the year-earlier period, to $7.4 billion. Revenue rose 11%, to $25.2 billion.\n\n\"We continue to see a healthy US economy that is growing at a slower pace, with a resilient job market,\" said CEO Brian Moynihan.\n\nThe results from the nation's second-largest bank are the latest demonstration of how high interest rates and the surprising strength of the US consumer continue to help some of the largest US lenders even as regional banks struggle.\n\nBank of America - like JPMorgan Chase (JPM) and Wells Fargo (WFC) — showed during the second quarter that it was able to earn more money from its loans despite paying a lot more for deposits.\n\nIt also managed to buck a trend of slower dealmaking and trading that is plaguing a number of other big banks. Bank of America CEO Brian Moynihan. (AP Photo/Andrew Harnik)\n\nRevenues from those businesses dropped during the last quarter at Citigroup (C) and JPMorgan Chase (JPM).\n\nThey were up at Bank of America when compared to the year-earlier period. It claims it had \"zero trading loss\" days during the first half of the year and the highest first-half sales and trading revenue in over a decade.\n\nWhat also helped Bank of America was that it reported a sizable increase in its net interest income compared to the year-earlier period. That measures the difference between what banks earn on their loans and pay out on their deposits.\n\nThat figure rose 14%, to $14.3 billion.\n\nJPMorgan, Wells Fargo and Citigroup all reported jumps in this key measure of profitability.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/bank-of-americas-profits-jump-19-on-strong-wall-street-showing-111011364.html", "symbols": ["0Q16.LSE", "0R01.LSE", "0R2F.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CMC.F", "CMC.XETRA", "CTGP34.SA", "DWD.F", "DWD.XETRA", "GOS.F"], "tags": [], "sentiment": {"polarity": 0.984, "neg": 0.018, "neu": 0.857, "pos": 0.125}}, {"date": "2023-07-18T11:04:21+00:00", "title": "Bank of America Profit Rises 19%", "content": "Bank of America joined the fray with its second-quarter earnings this morning. “We continue to see a healthy U.S. economy that is growing at a slower pace, with a resilient job market,” CEO Brian Moynihan said in a statement. Bank of America’s peers on Friday also [presented a picture of a resilient economy](https://www.wsj.com/articles/jpmorganchase-jpm-q2-earnings-report-2023-8694176b), with consumers and businesses continuing to borrow and spend.", "link": "https://finance.yahoo.com/m/5a2a2f3f-7331-3ee5-ac59-9ab817d3374e/bank-of-america-profit-rises.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.527, "neg": 0, "neu": 0.925, "pos": 0.075}}, {"date": "2023-07-18T11:02:42+00:00", "title": "Bank of America net income jumps 19%, extending the rally for big banks", "content": "Bank of America said its profits grew 19% in its most recent quarter, the latest of the big banks to see its bottom line boosted by higher interest rates.\n\nThe nation’s second-largest bank by assets posted a profit of $7.4 billion in the three months ended June 30, up from $6.2 billion in the same period a year earlier. On a per-share basis, BofA earned 88 cents, compared with 73 cents one year ago. Analysts were expecting profit of 84 cents per share, according to a poll by FactSet.\n\nRevenue of $25.2 billion came in just ahead of target.\n\nLike its major competitors, BofA has benefitted from wealthy clients, businesses and other customers moving deposits to the bank in search of safety after this spring’s bank failures. The nation’s biggest banks are seen as having an implicit government backstop, due to their “too big to fail” status among the country’s financial institutions.\n\nThe Federal Reserve has raised its benchmark interest rate to a range of 5% to 5.25% from near zero starting in March 2022. Those higher interest rates have allowed banks to charge more for customers to borrow. Bank of America's net interest income rose 14% to $14.2 billion in the second quarter.\n\nBofA set aside roughly $602 million to cover potentially bad loans in the quarter. Many banks have been increasing their so-called loan loss reserves the last few quarters as customers start borrowing again after not doing so during the pandemic, and inflation starts stretching household budgets.\n\nShares of Bank of America Corp. rose slightly before the opening bell Tuesday.", "link": "https://finance.yahoo.com/news/bank-america-net-income-jumps-110242622.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.98, "neg": 0.03, "neu": 0.832, "pos": 0.138}}, {"date": "2023-07-18T11:02:11+00:00", "title": "New York City pension chief urges pay clawbacks at Bank of America", "content": "By Ross Kerber\n\n(Reuters) - New York City's top pension official has urged Bank of America's board to claw back pay from executives after the bank agreed to pay $250 million to settle regulatory claims that it double-charged customers and took other steps without authorization.\n\nSince the financial crisis of 2008, provisions to recover pay have been strengthened at top U.S. banks to limit risk-taking. Bank of America did not admit wrongdoing in its July 11 agreements with the Consumer Financial Protection Bureau (CFPB) and the Office of the Comptroller of the Currency.\n\nVia a spokesperson the Charlotte, North Carolina-based bank and its board declined to comment.\n\nIn a July 17 letter seen by Reuters, New York City Comptroller Brad Lander asked the chair of a committee of the bank's board to disclose how much pay was recouped from senior and lower-level employees over what he called the bank's \"unsettling conduct.\" He also asked for internal reports.\n\n\"By holding financially accountable the executives responsible for Bank of America's costly compliance breakdowns, the Compensation and Human Capital Committee can take an important step toward re-establishing clear expectations of ethical conduct and responsible business practices,\" wrote Lander.\n\nLander oversees public-employee pension funds with some $300 million worth of Bank of America stock. Under a predecessor his office successfully pressed Wells Fargo to claw back pay from its then-CEO in 2016.\n\nOn Monday, New York City Assistant Comptroller Michael Garland said in an interview that although there was no admission of wrongdoing at Bank of America, the large fine showed \"there was detrimental conduct\" that could justify recovery from individual executives.\n\nThe CFPB has launched a crackdown on a range of fees it calls unfair including for overdrafts and nonsufficient funds. It said Bank of America charged multiple fees to customers who did not have enough funds in their accounts from February 2018 until February 2022.\n\nThe bank said it voluntarily reduced overdraft fees and eliminated all nonsufficient fund fees in 2022.\n\n(Reporting by Ross Kerber in Boston; Editing by Matthew Lewis)", "link": "https://ca.finance.yahoo.com/news/york-city-pension-chief-urges-110211113.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.909, "neg": 0.058, "neu": 0.85, "pos": 0.092}}, {"date": "2023-07-18T11:01:00+00:00", "title": "Bank of America Profit Tops Expectations on Higher Rates", "content": "Bank earnings season got off to a good start last week, and Bank of America ‘s results Tuesday showed the momentum can keep going. Bank of America (ticker: BAC) saw profit increase by 19% year over year to $7.4 billion, or 88 cents a share, share topping expectations of analysts surveyed by FactSet who forecast profit of $6.9 billion, or 84 cents. An increase in net interest income—or the spread between the interest banks earn on assets, such as loans, versus the interest paid out on deposits—was one main driver of profit gains.", "link": "https://finance.yahoo.com/m/b7a378d9-3e08-35ef-b703-e820b7f0b130/bank-of-america-profit-tops.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.983, "neg": 0, "neu": 0.698, "pos": 0.302}}, {"date": "2023-07-18T10:48:51+00:00", "title": "Bank of America profit beats on boost from interest income, investment banking", "content": "By Manya Saini and Saeed Azhar\n\n(Reuters) -Bank of America beat Wall Street estimates for second-quarter profit on Tuesday as it earned more from customers' loan payments, while its investment banking business and trading fared better than expected.\n\nThe bank reported a 7% rise in investment banking fees to $1.2 billion, driven by higher interest payments and leasing revenue, the company said. It also benefited from not booking mark-to-market losses on leveraged finance positions.\n\n\"We continue to see a healthy U.S. economy that is growing at a slower pace, with a resilient job market,\" CEO Brian Moynihan said in a statement, echoing comments from his peers.\n\nThe bank reported a profit of 88 cents per share in the second quarter, beating analysts' average expectations of 84 cents, according to IBES data from Refinitiv.\n\nNet income applicable to common shareholders rose to $7.10 billion, or 88 cents per diluted share, for the three months ended June 30, compared with $5.93 billion, or 73 cents per diluted share, a year earlier, the second-largest U.S. bank reported on Tuesday. BofA Shares were down 0.5%.\n\nThe lender, alongside rivals JPMorgan Chase and Wells Fargo, earned a windfall from charging clients higher interest rates as the Federal Reserve raised borrowing costs to rein in stubborn inflation. BofA's net interest income (NII) rose 14% to $14.2 billion in the second quarter.\n\nGlobal mergers and acquisitions (M&A) activity fell 36% year-on-year in the second quarter, but there has been optimism that the stock market's recovery will restore confidence in dealmaking.\n\nJPMorgan Chase's chief financial officer, Jeremy Barnum, highlighted \"green shoots\" in trading and investment banking in the bank's earnings last week, but said it was too early to call a trend.\n\nBank of America's Chief Financial Officer Alastair Borthwick told a media briefing that there has been a little pickup in equity capital markets, which is helping the bank.\n\nIn a surprise bright spot, the bank's sales and trading revenue outperformed expectations to post a 3% increase in revenue to $4.3 billion, including net debit valuation adjustment (DVA) losses of $102 million.\n\nRevenue from the fixed income currencies and commodities (FICC) business rose 7% to $2.7 billion from a year earlier.\n\nThe financial health of consumers underpins BofA's consumer banking unit, whose revenue rose 15% to $10.5 billion.\n\nHowever, banks are grappling with stress in their commercial real estate lending businesses, particularly office loan portfolios, which are taking a hit from higher financing costs and a permanent shift towards remote work.\n\nTo account for a gloomy backdrop, provision for credit losses rose $602 million to $1.1 billion in the quarter.\n\nDeposits at U.S. banks have become a focus for analysts and investors in recent months after regional bank failures in March prompted the biggest bout of banking turmoil since the 2008 financial crisis.\n\nAverage deposit balances fell $18 billion, or 1%, from the prior quarter to $1.9 trillion.\n\nRevenue, net of interest expense, increased 11% to $25.2 billion in the quarter.\n\nBofA's CFO said the bank recorded $276 million for litigation expense, which was pushed higher in the quarter because of recent consumer fines.\n\nBank of America last week agreed to pay $250 million in fines and compensation to settle claims the bank systematically double-charged customers fees, withheld promised credit card perks, and opened accounts without customer authorization..\n\n(Reporting by Manya Saini in Bengaluru and Saeed Azhar in New York; Editing by Lananh Nguyen and Anil D'Silva)", "link": "https://finance.yahoo.com/news/bank-america-profit-rises-boost-104851001.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.979, "neg": 0.054, "neu": 0.836, "pos": 0.11}}, {"date": "2023-07-18T10:47:35+00:00", "title": "UPDATE 4-Bank of America profit beats on boost from interest income, investment banking", "content": "(Adds CFO's comment on ECM in paragraph 9, legal costs in paras 18-19; adds file photos)\n\nBy Manya Saini and Saeed Azhar\n\nJuly 18 (Reuters) - Bank of America beat Wall Street estimates for second-quarter profit on Tuesday as it earned more from customers' loan payments, while its investment banking business and trading fared better than expected.\n\nThe bank reported a 7% rise in investment banking fees to $1.2 billion, driven by higher interest payments and leasing revenue, the company said. It also benefited from not booking mark-to-market losses on leveraged finance positions.\n\n\"We continue to see a healthy U.S. economy that is growing at a slower pace, with a resilient job market,\" CEO Brian Moynihan said in a statement, echoing comments from his peers.\n\nThe bank reported a profit of 88 cents per share in the second quarter, beating analysts' average expectations of 84 cents, according to IBES data from Refinitiv.\n\nNet income applicable to common shareholders rose to $7.10 billion, or 88 cents per diluted share, for the three months ended June 30, compared with $5.93 billion, or 73 cents per diluted share, a year earlier, the second-largest U.S. bank reported on Tuesday.\n\nBofA Shares were down 0.5%.\n\nThe lender, alongside rivals JPMorgan Chase and Wells Fargo, earned a windfall from charging clients higher interest rates as the Federal Reserve raised borrowing costs to rein in stubborn inflation.\n\nBofA's net interest income (NII) rose 14% to $14.2 billion in the second quarter.\n\nGlobal mergers and acquisitions (M&A) activity fell 36% year-on-year in the second quarter, but there has been optimism that the stock market's recovery will restore confidence in dealmaking.\n\nJPMorgan Chase's chief financial officer, Jeremy Barnum, highlighted \"green shoots\" in trading and investment banking in the bank's earnings last week, but said it was too early to call a trend.\n\nBank of America's Chief Financial Officer Alastair Borthwick told a media briefing that there has been a little pickup in equity capital markets, which is helping the bank.\n\nIn a surprise bright spot, the bank's sales and trading revenue outperformed expectations to post a 3% increase in revenue to $4.3 billion, including net debit valuation adjustment (DVA) losses of $102 million.\n\nRevenue from the fixed income currencies and commodities (FICC) business rose 7% to $2.7 billion from a year earlier.\n\nThe financial health of consumers underpins BofA's consumer banking unit, whose revenue rose 15% to $10.5 billion.\n\nHowever, banks are grappling with stress in their commercial real estate lending businesses, particularly office loan portfolios, which are taking a hit from higher financing costs and a permanent shift towards remote work.\n\nTo account for a gloomy backdrop, provision for credit losses rose $602 million to $1.1 billion in the quarter.\n\nDeposits at U.S. banks have become a focus for analysts and investors in recent months after regional bank failures in March prompted the biggest bout of banking turmoil since the 2008 financial crisis.\n\nAverage deposit balances fell $18 billion, or 1%, from the prior quarter to $1.9 trillion.\n\nRevenue, net of interest expense, increased 11% to $25.2 billion in the quarter.\n\nBofA's CFO said the bank recorded $276 million for litigation expense, which was pushed higher in the quarter because of recent consumer fines.\n\nBank of America last week\n\nagreed to pay $250 million\n\nin fines and compensation to settle claims the bank systematically double-charged customers fees, withheld promised credit card perks, and opened accounts without customer authorization..\n\n(Reporting by Manya Saini in Bengaluru and Saeed Azhar in New York; Editing by Lananh Nguyen and Anil D'Silva)", "link": "https://finance.yahoo.com/news/1-bank-america-profit-rises-104735346.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.979, "neg": 0.053, "neu": 0.838, "pos": 0.109}}, {"date": "2023-07-18T10:45:00+00:00", "title": "Bank of America Reports Second-Quarter 2023 Financial Results", "content": "CHARLOTTE, N.C., July 18, 2023 /PRNewswire/ -- Bank of America reported its second-quarter 2023 financial results today. The news release, supplemental filing and investor presentation can be accessed at Bank of America's Investor Relations website at https://investor.bankofamerica.com/quarterly-earnings.\n\nInvestor Conference Call information: Chief Executive Officer Brian Moynihan and Chief Financial Officer Alastair Borthwick will discuss the financial results in a conference call at 8:30 a.m. ET today. For a listen-only connection to the conference call, dial 1.877.200.4456 (U.S.) or 1.785.424.1732 (international), and the conference ID is 79795.  Please dial in 10 minutes prior to the start of the call.\n\nInvestors can also listen to live audio of the conference call and view the presentation slides by visiting the Events and Presentations section of the company's Investor Relations website.\n\nReplay information for Investor Conference Call: Investors can access replays of the conference call by visiting the Investor Relations website or by calling 1.800.934.4850 (U.S.) or 1.402.220.1178 (international) from noon on July 18 through 11:59 p.m. ET on July 28.\n\nBank of America Bank of America is one of the world's leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 68 million consumer and small business clients with approximately 3,900 retail financial centers, approximately 15,000 ATMs and award-winning digital banking with approximately 57 million verified digital users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 4 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and more than 35 countries. Bank of America Corporation stock (NYSE: BAC) is listed on the New York Stock Exchange.\n\nFor more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for news email alerts.\n\nwww.bankofamerica.com\n\nInvestors May Contact:\n\nLee McEntire, Bank of America\r\nPhone:  1.980.388.6780\r\nlee.mcentire@bofa.com\n\nJonathan G. Blum, Bank of America (Fixed Income)\r\nPhone: 1.212.449.3112\r\njonathan.blum@bofa.com\n\nReporters May Contact:\n\nBill Halldin, Bank of America\r\nPhone: 1.916.724.0093\r\nwilliam.halldin@bofa.com\n\nChristopher P. Feeney, Bank of America\r\nPhone: 1.980.386.6794\r\nchristopher.feeney@bofa.com\n\nSOURCE Bank of America Corporation", "link": "https://finance.yahoo.com/news/bank-america-reports-second-quarter-104500445.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.959, "neg": 0.008, "neu": 0.935, "pos": 0.057}}, {"date": "2023-07-18T09:59:00+00:00", "title": "3 Financial Stocks That Shine on the Bottom Line", "content": "In the months since Silicon Valley Bank's collapse, the sector has vastly underperformed the broader market. Few businesses have a competitive advantage quite as strong as credit card and payment processing giant Visa (NYSE: V). Regarding reach, there's no close second to Visa -- it has more than 100 million merchants in its network.", "link": "https://finance.yahoo.com/m/1d3dd6d3-10d9-3fe8-ad9d-10ad16709fc6/3-financial-stocks-that-shine.html", "symbols": ["3V64.F", "3V64.XETRA", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA", "V.MX", "V.US", "VISA34.SA"], "tags": [], "sentiment": {"polarity": 0.554, "neg": 0.087, "neu": 0.737, "pos": 0.176}}, {"date": "2023-07-18T09:57:00+00:00", "title": "Stocks Mixed, Retail Sales On Deck, Bank of America, Lockheed Martin, AT&amp;T Bounce - 5 Things To Know", "content": "Stock futures mixed as earnings season ramps up; Retail sales on deck as job market likely supports spending; Bank of America earnings on deck as U.S. Lenders outpace forecasts; Lockheed Martin earnings in focus following F-35 payments report and AT&T shares rise from 30-year low amid lead cable risks.", "link": "https://finance.yahoo.com/m/85231525-7ccd-361b-849a-6ad1db14de32/stocks-mixed%2C-retail-sales-on.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DJI.INDX", "FTSE.INDX", "GSPC.INDX", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA", "MSC.US", "NCB.XETRA", "SOBA.F", "SOBA.XETRA"], "tags": [], "sentiment": {"polarity": 0.128, "neg": 0.078, "neu": 0.835, "pos": 0.087}}, {"date": "2023-07-18T08:09:11+00:00", "title": "Bank of America, Pinterest, Chipotle rise premarket; Morgan Stanley falls", "content": "Investing.com -- U.S. futures edged lower Tuesday, with investors digesting a deluge of corporate earnings ahead of the release of retail sales and industrial production data.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nBank of America (NYSE:BAC) stock rose 0.5% after the lending giant reported a rise in second quarter profit as it earned more from customers' loan payments, while its trading arm fared better than expected.\n\nMorgan Stanley  (NYSE:MS) stock fell 0.3% after the banking giant's profit slipped 18% in the second quarter as Wall Street's deal-making drought stunted revenue from investment banking.\n\nShopify (NYSE:SHOP) stock fell 1% after Evercore ISI downgraded its stance on the e-commerce company to ‘in line’ from ‘outperform’, saying the risk-reward outlook on the stock is now less compelling.\n\nPinterest (NYSE:PINS) stock rose 3.5% after Evercore ISI upgraded its stance on the image-sharing company to ‘outperform‘ from ‘in line’, citing evidence of stabilizing digital ad spend and potential for recovery.\n\nPfizer  (NYSE:PFE) stock rose 0.2% after the drugmaker and venture capital firm Flagship Pioneering agreed to invest $100 million to discover and develop 10 new potential drugs.\n\nChipotle (NYSE:CMG) stock rose 1.3% after the fast food chain signed a deal with Kuwait-based Alshaya Group, its first-ever franchise partner, to open locations in the Middle East next year.\n\nNovartis (NYSE:NVS) ADRs rose 2.6% after the Swiss drugmaker raised its full-year profit and revenue outlook following solid second quarter sales, and proposed a timeline for the spin-off of its Sandoz generic medicines unit.\n\nMasimo (NASDAQ:MASI) stock fell 28.1% after the medical device maker reported weaker-than-expected second quarter sales due to a weak performance at its healthcare segment.\n\nRelated Articles\n\nBank of America, Pinterest, Chipotle rise premarket; Morgan Stanley falls\n\nUS opens new special probe into fatal Tesla crash\n\nMorgan Stanley profit drops 14% as deal drought persists", "link": "https://finance.yahoo.com/news/bank-america-pinterest-chipotle-rise-080911880.html", "symbols": ["3M4.F", "BAC.US", "C9F.F", "CMG.US", "MASI.US", "MS.US", "NVS.US", "PFE.F", "PFE.MX", "PFE.US", "PFE.XETRA", "PFIZ34.SA", "PINS.US", "SHOP.US"], "tags": [], "sentiment": {"polarity": 0.864, "neg": 0.035, "neu": 0.89, "pos": 0.075}}, {"date": "2023-07-18T06:59:28+00:00", "title": "Bank of America Earnings Are Coming. Profit Is Expected to Jump.", "content": "Bank earnings season got off to a good start last week, and Tuesday will show if Bank of America can keep the momentum going. Wall Street is expecting Bank of America’s (ticker: BAC) profit to jump by 11% to $6.", "link": "https://finance.yahoo.com/m/c0ce1fcd-8c32-3a87-a330-509dc11f75d4/bank-of-america-earnings-are.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.7, "neg": 0, "neu": 0.864, "pos": 0.136}}, {"date": "2023-07-18T05:26:54+00:00", "title": "Earnings wave, Novartis guidance, ARK's Twitter stake - what's moving markets", "content": "Investing.com -- Investors look ahead to a busy week of earnings, including quarterly results from some of the largest U.S. banks. Meanwhile, drug-making giant Novartis improves its guidance as it eyes a spin-off of its Sandoz generics division later this year, and Cathie Wood says her ARK investment management firm has written down its stake in Twitter.\n\n1. Bank of America, Morgan Stanley on deck\n\nCorporate earnings Tuesday will include a fresh batch of U.S. banks, with investors keen to see how they have fared since the turmoil in regional lenders hit the financial services sector earlier this year.\n\nBank of America (NYSE:BAC) and Morgan Stanley (NYSE:MS) are set to report their latest results before the start of U.S. trading, as well as smaller players Bank of New York Mellon (NYSE:BK) and PNC Financial (NYSE:PNC).\n\nLast week, higher interest rates helped underpin improved targets for net interest income – the difference between what a bank makes from loans and pays for deposits – at larger peers JPMorgan Chase (NYSE:JPM), Wells Fargo (NYSE:WFC) and Citigroup (NYSE:C). Second quarter net income also jumped at JPMorgan and Wells Fargo, although a dearth of dealmaking weighed on profit at Citigroup.\n\n2. U.S. futures mixed\n\nU.S. stock futures were largely mixed on Tuesday as traders awaited the next round of earnings.\n\nAt 04:45 ET (08:45 GMT), the Dow futures contract gained 22 points or 0.06%, S&P 500 futures edged up by 1 point or 0.02%, and Nasdaq 100 futures lost 6 points or 0.04%.\n\nThe main indices closed in the green in the prior session, boosted in part by a stronger-than-anticipated reading from the Federal Reserve Bank of New York's manufacturing index that hinted at resilient business activity in the face of elevated borrowing costs.\n\nCoupled with last week's June inflation reading that was slower than expected and a jump in preliminary consumer sentiment for July, the manufacturing survey bolstered hopes for continued strength in the broader U.S. economy.\n\n3. Novartis lifts profit guidance, lays out timeline for Sandoz spin-off\n\nNovartis raised its profit and revenue outlook for 2023 following solid second quarter sales, while the Swiss drugmaker also proposed a timeline for the spin-off of its Sandoz generic medicines unit.\n\nSales increased by 7% to $13.7 billion at constant currencies, which chief executive Vas Narasimhan said was linked to strong performance across \"core therapeutic areas and key geographies.\" As a result, the company said it now estimates that annual group sales will grow in the high single digit, an improvement from the prior guidance of mid-single-digit. Yearly group core operating income expansion is now seen in the low double digits, up from the high-single-digit previously.\n\nMeanwhile, Novartis said its shareholders will vote on the planned Sandoz spin-off at an extraordinary general meeting in September. If approved, a listing on the SIX Swiss Exchange, as well as an American Depositary Receipt program in the U.S., could come as soon as early in the fourth quarter.\n\nShares in Novartis (SIX:NOVN) rose in early trading in Switzerland on Monday, while Novartis ADRs (NYSE:NVS) in the U.S. also ticked higher in premarket dealmaking.\n\n4. Wood's ARK writes down Twitter stake - WSJ\n\nCathie Wood's ARK Investment Management has written down its stake in Twitter by 47% since Elon Musk bought the social media platform and took it private last year, Wood told the Wall Street Journal.\n\nIn an interview with the paper, Wood noted that the write-down reflects how ARK, which owns a small stake in Twitter through its venture fund, takes fair valuation \"very seriously.\" But she remained upbeat about the prospects for Twitter, saying she would \"love\" to snap up more shares at the new value.\n\nIn particular, Wood said she still thinks Musk is \"serious\" about his plan to turn Twitter into a so-called \"everything app\" that features a wide range of services like messaging, e-commerce shopping, and peer-to-peer payments.\n\nWood's comments come as Twitter faces a large debt pile and dwindling advertising revenues, while Musk himself said over the weekend that the company is now cash-flow negative.\n\nAt the same time, Twitter must contend with fresh competition from Meta's (NASDAQ:META) own short-text messaging platform Threads. Wood, however, argued that this rivalry could light a competitive \"fire\" under Twitter.\n\n5. Oil steadies as U.S. inventory data looms\n\nCrude prices edged up on Tuesday, with the focus turning from concerns over economic weakness in top oil importer China towards a potential tightening of U.S. crude supplies.\n\nTraders are awaiting new figures from the American Petroleum Institute later in the session, as well as numbers from the Energy Information Administration on Wednesday. The data is expected to show a decline in stockpiles after a substantially bigger-than-anticipated build in the prior week.\n\nBut sentiment is still dampened by statistics on Monday that showed underwhelming growth in China in the second quarter. Investors are now trying to gauge if Beijing will roll out further stimulus measures in an attempt to refuel the country's sputtering post-pandemic recovery.\n\nBy 08:45 ET, the U.S. crude futures traded 0.31% higher at $74.31 a barrel, while the Brent contract added 0.15% to $78.62 per barrel.\n\nRelated Articles\n\nEarnings wave, Novartis guidance, ARK's Twitter stake - what's moving markets\n\nIMF chief: Prospects for medium-term global growth weak\n\nECB hawk says bank will carefully weigh inflation data after July", "link": "https://finance.yahoo.com/news/earnings-wave-novartis-guidance-arks-052654858.html", "symbols": ["BAC.US", "BK.US", "C.US", "JPM.US", "META.US", "MS.US", "NOTA.F", "NOVN.SW", "NVS.US", "NVSEF.US", "PNC.US", "WFC.US"], "tags": [], "sentiment": {"polarity": 0.99, "neg": 0.044, "neu": 0.859, "pos": 0.098}}, {"date": "2023-07-17T23:18:43+00:00", "title": "Asian stocks pressured by China jitters, India outperforms", "content": "Investing.com-- Most Asian stocks moved in a flat-to-low range on Tuesday amid persistent concerns over slowing economic growth in China, while Indian stocks eyed new highs on the back of a positive earnings season.\n\nRegional financial stocks saw some buying ahead of key earnings from some of the biggest American banks this week, including Bank of America (NYSE:BAC), Morgan Stanley (NYSE:MS) and Goldman Sachs (NYSE:GS).\n\nWall Street indexes also closed higher overnight, offering some positive cues to local stocks.\n\nBut this was largely offset by weak economic indicators from China, after data showed that growth in the country’s gross domestic product slowed in the second quarter. The reading triggered steep losses in Chinese stocks, which extended into Tuesday.\n\nChinese stocks fall further, stimulus measures in focus\n\nHong Kong’s Hang Seng index was the worst performer in Asia on Tuesday, tumbling nearly 2% in catch-up trade after adverse weather conditions suspended trading on Monday.\n\nLosses were concentrated in locally-listed Chinese real estate and technology stocks, with heavyweights including Baidu (HK:9888) (NASDAQ:BIDU), Alibaba Group Holding Ltd (HK:9988) (NYSE:BABA) and Tencent Holdings Ltd (HK:0700) seeing a heavy dose of profit taking after strong gains last week.\n\nChina’s Shanghai Shenzhen CSI 300 and Shanghai Composite indexes also fell about 0.4% each, extending losses from Monday. But their pace of losses somewhat slowed as the weak economic data pushed up expectations for more stimulus measures in China.\r\nLocal media reports suggested that the People’s Bank of China could cut its key interest rates and bank reserve requirements in the third quarter, to unlock more liquidity. PBOC officials have also flagged more policy support in recent weeks.\n\nBut concerns over a Chinese slowdown weighed on most broader Asian markets. South Korea’s KOSPI and the Taiwan Weighted index shed 0.4% each, while Japan’s Nikkei 225 index fell slightly after a long weekend.\n\nAustralia’s ASX 200 fell 0.4% as the minutes of the Reserve Bank’s July meeting showed that the lender was still considering more rate hikes, despite a pause earlier this month.\n\nIndian stocks at record highs amid positive earnings\n\nSingapore-traded futures for India’s Nifty 50 index pointed to a flat open on Tuesday, after both the Nifty and the BSE Sensex 30 notched record highs in the prior session.\n\nStrength in conglomerate Reliance Industries Ltd (NS:RELI), before the demerger of its financial services unit, and a rally in bank stocks, following strong results from lender HDFC Bank (NS:HDBK), were the biggest drivers of Monday’s gains.\n\nRobust foreign capital inflows, optimism over the Indian economy and a strong start to the second-quarter earnings season were the biggest drivers of a local stock market rally over the past month.\n\nBut analysts have warned that any negative news could trigger a heavy amount of capitulation in Indian stocks.\n\nRelated Articles\n\nAsian stocks pressured by China jitters, India outperforms\n\nExclusive-China's CITIC to move dozens of Hong Kong bankers to mainland to cut costs -sources\n\nAustralian developer Lendlease to cut about 740 jobs globally", "link": "https://finance.yahoo.com/news/asian-stocks-pressured-china-jitters-231843885.html", "symbols": ["0700.HK", "9888.HK", "9988.HK", "BABA.US", "BAC.US", "BIDU.US", "GS.US", "HSI.INDX", "MS.US"], "tags": [], "sentiment": {"polarity": 0.913, "neg": 0.08, "neu": 0.821, "pos": 0.099}}, {"date": "2023-07-17T21:36:48+00:00", "title": "Bank earnings, Microsoft-Activision deal, economic data: What to watch on Tuesday", "content": "Yahoo Finance Live breaks down what to watch on Tuesday, including earnings reports from Bank of America (BAC) and Morgan Stanley (MS), as well as the Microsoft-Activision Blizzard deal deadline. On the economic front, retail sales and the NAHB index are set to be released.", "link": "https://finance.yahoo.com/video/bank-earnings-microsoft-activision-deal-213648464.html", "symbols": ["0Q16.LSE", "AIY.F", "AIY.XETRA", "ATVI.MX", "ATVI.US", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DWD.F", "DWD.XETRA", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US"], "tags": [], "sentiment": {"polarity": 0.273, "neg": 0, "neu": 0.954, "pos": 0.046}}, {"date": "2023-07-17T21:07:09+00:00", "title": "Big bank earnings had 'a little bit of good, a little bit of bad' news for regional banks: Analyst", "content": "Banks such as JPMorgan, Wells Fargo, and Citigroup posted quarterly results that topped analyst estimates. Wedbush Securities Managing Director David Chiaverini tells Yahoo Finance Live that big bank results \"weren't entirely comfortable\" for mid-cap banks, but that there are some silver linings in the reports too.", "link": "https://finance.yahoo.com/video/big-bank-earnings-had-little-210709581.html", "symbols": ["0Q16.LSE", "0R01.LSE", "0R2F.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CMA.US", "CMC.F", "CMC.XETRA", "CTGP34.SA", "JPM-PC.US", "JPM-PD.US"], "tags": [], "sentiment": {"polarity": 0.184, "neg": 0.029, "neu": 0.906, "pos": 0.065}}, {"date": "2023-07-17T20:27:15+00:00", "title": "Shady Business: 3 Well-Known Stocks That Deserve to Be on Your Blacklist", "content": "Bank of America (NYSE:BAC) is one of the country’s largest banks. It’s also one of America’s most well-known stocks thanks to Warren Buffett’s 13% ownership stake. While the bank has found itself in a bit of hot water recently, I’ve learned over the years that the Oracle of Omaha isn’t afraid to own controversial stocks that get into trouble with regulators and consumers.\n\nOne that comes to mind is Wells Fargo (NYSE:WFC). Berkshire Hathaway (NYSE:BRK-B) held on to shares for several years after it came to light that the bank opened at least 3.5 million fraudulent accounts to meet growth targets. The holding company eventually bailed on the bank stock in mid-2022.\n\nFor its part, Bank of America was recently fined a combined $150 million by two government agencies — $90 million by the Consumer Financial Protection Bureau (CFPB) and $60 million by the Office of the Comptroller of the Currency. In addition, it had to refund $100 million to customers.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\n“Bank of America wrongfully withheld credit card rewards, double-dipped on fees, and opened accounts without consent,” CFPB Director Rohit Chopra said in a statement. “These practices are illegal and undermine customer trust.”\n\nThis wasn’t the first time Bank of America has been fined for illegal practices and it probably won’t be the last. While that doesn’t necessarily mean investors should throw in the towel on the stock (Buffett certainly isn’t), here are three other companies you may want to put on your list of stocks to avoid due to controversies surrounding them.\n\nAlibaba (BABA) A photo of the Alibaba (BABA) app on a smartphone.\n\nSource: BigTunaOnline / Shutterstock.com\n\nThings have gotten so bad for Chinese e-commerce giant Alibaba (NYSE:BABA) that Chief Executive Officer (CEO) Daniel Zhang stepped down in June after eight years in the top job.\n\nOfficially, Zhang is stepping aside to focus on taking the company’s cloud unit public as part of Alibaba’s plan to split into six units. And many seem to believe the move is a good one.\n\nPer Reuters:\n\n“The appointment of Daniel to focus on running cloud is really a show of confidence and trust in him to take the most precious business and run with it to develop it in the right way given this age of generative artificial intelligence (AI),” said Brian Wong, a former Alibaba employee and author of the book, “The Tao of Alibaba”.\n\n“The idea or expectation that one person could manage the business’ crown jewel Cloud and at the same time manage the entire Alibaba Group is an unreasonable expectation.”\n\nMaybe so, but I find it hard to believe that Alibaba couldn’t have found someone capable of growing the cloud unit.\n\nOn July 10, Alibaba’s share price jumped on news that the $985 million fine levied by Chinese regulators against the company’s Ant Group affiliate could end the government’s crackdown on Chinese tech companies.\n\nZhang presided over the company during the period in question, as well as that of the $2.8 billion antitrust fine it got in 2021. It’s more than possible that he stepped down to appease regulators or, at the very least, to avoid any further confrontation with the government.\n\nOnce upon a time, I thought Alibaba stock was undervalued because of its cloud unit. In May 2019, I suggested a profitable cloud business could help get BABA shares to $250. They surpassed that level in July 2020, riding the pandemic wave. But since topping out later that year above $300, shares have lost around 70% of their value.\n\nGiven the slowdown in Chinese economic growth and continued regulatory uncertainty, it’s best to put BABA on your list of stocks to avoid.\n\nIllumina (ILMN) Illumina (ILMN) logo displayed on reddish stone facade building against blue sky background\n\nSource: shutterstock.com/JHVEPhoto\n\nIllumina (NASDAQ:ILMN) stock is down nearly 9% year to date compared with an 18% advance for the S&P 500.\n\nPart of the problem is the San Diego-based biotech firm’s fight with Carl Icahn, who himself is in the crosshairs of short-seller Hindenburg Research, which published a report in May suggesting the billionaire would be subject to margin calls if shares of Icahn Enterprises (NASDAQ:IEP) fell further. Icahn restructured his debt and, as a result, was forced to pledge 95% of his IEP stock as collateral on his new financing.\n\nSo, how does this relate to Illumina?\n\nIcahn owns 1.4% of the biotech company. In May, he won a proxy fight with the company that saw Chairman John Thompson resign, replaced by Icahn appointee Andrew Teno. In addition, the billionaire wanted CEO Francis deSouzato to step down and be replaced by former Illumina CEO Jay Flatley over DeSouza’s controversial $7.1 billion acquisition of gene-sequencing technology company Grail in 2021.\n\nDeSouza eventually stepped down on June 12. One month later, the European Union fined Illumina $475 million for closing the Grail acquisition without its approval. The Federal Trade Commission has also ordered the company to sell Grail because the deal would stifle innovation in cancer testing technology.\n\nIt’s bad enough to be fined nearly half a billion for arrogantly flouting regulators’ wishes. But to be entangled with someone like Icahn, who’s got a history of activism that’s not always a winning hand, leaves me wondering why anyone would bother with ILMN when there are so many other biotechs to choose from.\n\nMeta Platforms (META) Meta Written On The Googles - Man Wearing Virtual Reality Goggles Inside A Metaverse. FTC investigating META.\n\nSource: Aleem Zahid Khan / Shutterstock.com\n\nMeta Platforms (NASDAQ:META) got fined $1.3 billion in May for violating European Union data protection rules. Eventually, North America will get wise to the Facebooks of the world and seriously start protecting consumer privacy.\n\nHere in Canada, where I live, Facebook and Google are acting like spoiled children, threatening to ban news from their Canadian news feeds because a new law was passed on June 22. C-18 requires online advertising behemoths such as Facebook and Google to pay media outlets for sharing their content with social media users.\n\nAs the Los Angeles Times points out, Australia implemented similar legislation in 2021 and it’s been a boon to publishers down under.\n\n“That bill has already restored tens of millions of dollars in revenue to Australia’s troubled newsrooms, and, while far from perfect, has transformed the media environment dramatically,” wrote columnist Brian Merchant.\n\nMeta and Facebook have been fined more than $6 billion since 2000. That seems like a lot. However, when you consider that Mark Zuckerberg’s wealth in 2023 has increased by nearly $67 billion due in large part to Meta shares’ 158% year-to-date gain, it’s a drop in the bucket.\n\nZuckerberg will do whatever he wants, including trampling all over publishers’ intellectual property worldwide. His company has no redeeming qualities. It’s the worst of social media.\n\nInvesting in META is no better than buying tobacco stocks. The sooner investors realize this, the better.\n\nOn the date of publication, Will Ashworth did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nWill Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live Wall Street Titan: Here’s My #1 Stock for 2023 The $1 Investment You MUST Take Advantage of Right Now It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post Shady Business: 3 Well-Known Stocks That Deserve to Be on Your Blacklist appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/shady-business-3-well-known-202715662.html", "symbols": ["9988.HK", "AHLA.F", "AHLA.XETRA", "BABA.US", "BABA34.SA", "BABAF.US", "BAC.US", "BERK34.SA", "BRH.F", "BRK-A.US", "BRK-B.US", "BRKB.MX", "BRYN.F", "BRYN.XETRA", "IEP.US", "ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.973, "neg": 0.08, "neu": 0.82, "pos": 0.1}}, {"date": "2023-07-17T20:15:35+00:00", "title": "UPDATE 2-Angelo Mozilo, Countrywide Financial's former CEO, dies at 84", "content": "(Adds background in paragraph 5-6, 8-9)\n\nJuly 17 (Reuters) - Angelo Mozilo, who propelled Countrywide Financial Corp into the largest U.S. mortgage lender before its crash in the 2008 financial crisis, has died, his family foundation said.\n\nMozilo, 84, died of natural causes, the foundation said in a statement on Sunday.\n\nHe became the face of the mortgage meltdown when the subprime crisis surfaced in 2007. He was the son of a Bronx butcher who embodied a rags-to-riches success story.\n\nIn 2006, when Mozilo was the chief of the mortgage lender Countrywide Financial, the firm originated $461 billion worth of loans -- close to $41 billion of which were subprime. Subprime loans were responsible for the global financial crisis.\n\nThe firm was later bought by\n\nBank of America\n\nfor $2.5 billion, less than 10% of what it was worth in early 2007.\n\nMozilo was also charged by securities regulators of insider trading and securities fraud. Once named as one of the best chief executives in the United States, the disgraced CEO was subsequently named as the second worst U.S. chief executive of all time by Conde Nast Portfolio.\n\nBloomberg earlier reported news of Mozilo's death.\n\nMozilo had defended himself several times against accusations that he was a key architect of the 2007-2009 financial crisis.\n\n\"Somehow, for some unknown reason, I got blamed for it,\" he earlier said. (Reporting by Shubhendu Deshmukh in Bengaluru and Nupur Anand in New York, Editing by Franklin Paul and Deepa Babington)", "link": "https://finance.yahoo.com/news/1-angelo-mozilo-countrywide-financials-201535797.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": -0.981, "neg": 0.167, "neu": 0.751, "pos": 0.082}}, {"date": "2023-07-17T20:00:00+00:00", "title": "Bank of America Earnings Are Coming. Profit Is Expected to Jump.", "content": "Wall Street is expecting Bank of America’s profit to increase by 11% to $6.9 billion compared with the year-ago quarter.", "link": "https://finance.yahoo.com/m/b7a378d9-3e08-35ef-b703-e820b7f0b130/bank-of-america-earnings-are.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.637, "neg": 0, "neu": 0.776, "pos": 0.224}}, {"date": "2023-07-17T19:05:00+00:00", "title": "Bank of America’s Huge Bond Losses Could Grow Even Larger in Second Quarter", "content": "Bank of America likely has another loss to report on its bond portfolio when it reports earnings tomorrow. JPMorgan’s bond loss was about $33 billion on June 30, versus $30 billion on March 31. The bank’s view is that the held-to-maturity portfolio, mostly agency mortgage securities with minimal credit risk, will ultimately mature and that the losses will melt away over time.", "link": "https://finance.yahoo.com/m/6e7a08a5-dad5-3f63-be3f-f9df1570f9a2/bank-of-america%E2%80%99s-huge-bond.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "CMC.F", "CMC.XETRA", "JPM-PC.US", "JPM-PD.US", "JPM.MX", "JPM.US", "JPMC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": -0.202, "neg": 0.131, "neu": 0.764, "pos": 0.106}}, {"date": "2023-07-17T18:45:48+00:00", "title": "7 Undervalued Dividend Stocks With Growth Potential for Investors", "content": "Dabbling in the vast ocean of stock market investing, savvy players continue to be drawn by the allure of undervalued dividend stocks. These attractions could prove irresistible, particularly for those plotting a long-term investment course where valuation and investment return assume a towering significance over time. Yet, the landscape is strewn with dividend stocks offering unsustainable distributions, which could trap investors.\n\nHence, the quest for firms with a robust business model that can uphold their distribution over the long haul becomes massive. Investors get a generous safety net when wagering on shares of undervalued enterprises, not to mention a heftier dividend yield. Discovering such stocks may seem akin to looking for a needle in the haystack, but it’s worth the effort.\n\nTherefore, investing for income is a strategic play that could offer massive long-term rewards. Investing in undervalued dividend stocks puts you in that sweet spot where prudence meets reward.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nPrudential (PRU) Prudential logo\n\nSource: JHVEPhoto / Shutterstock.com\n\nPrudential (NYSE:PRU) is a behemoth in the global financial services realm, continuing to pique investor interest with its tenacity and overall robustness. Despite kicking off 2023 on a rough note, PRU stock is down roughly 8% year-to-date. Much of that has to do with the steep drop in reported revenue and earnings each quarter last year. Nevertheless, its recent record suggests the company continues to navigate choppy waters with its impressively diversified portfolio with aplomb.\n\nPrudential made a statement with a net income of $1.46 billion and revenue of $15.9 billion in its first quarter. Evidently, the firm is back in the saddle, ready to ride the bull market again. Despite its resilience, the stock is trading at just 0.6 times forward sales estimates while yielding a mighty impressive dividend yield of almost 5.5%. Moreover, its dividend payout has risen by 14 consecutive years, significantly adding to its allure.\n\nBank of America (BAC) bank of America stock BAC stock\n\nSource: Shutterstock\n\nBank of America (NYSE:BAC) is effectively riding the turbulent currents of the financial industry. The firm has showcased an admirable knack for charting a path forward, emerging stronger from every challenge that’s come its way. The Silicon Valley Bank debacle in March could have thrown a lesser entity off course, but BAC stood tall amidst the turmoil. Moreover, it welcomed a torrential influx of $15 billion in deposits as investors sought the sturdy shelter of an established player.\n\nBAC delivered spectacular results in the first quarter, blowing past analyst estimates on both lines. The bank’s robust earnings per share growth, a substantial hike in net interest income, and stellar revenue growth across all segments effectively bolster its long-term position. With it managing a whopping $3 trillion in assets and a savory dividend yield of more than 3%, it would be wise to have BAC stock in your portfolios now.\n\nPublic Storage (PSA) a Public Storage sign in front of a facility of storage buildings\n\nSource: Ken Wolter / Shutterstock.com\n\nPublic Storage (NYSE:PSA) is a popular real estate investment trust (REIT) specializing in acquiring and maintaining self-storage properties. Its business has done remarkably well despite the crippling economic headwinds. Moreover, the firm has reported funds from operations (FFO) of $4.08 per diluted share in the first quarter, a key measure for REIT investors in examining the dividend’s safety.\n\nIts robust $4.08 FFO per share comfortably outpaces its quarterly dividend, indicating strong coverage. Additionally, Public Storage showcased strong growth, with its FFO and revenues soaring by 11.8% and 12.4% year-over-year, respectively, in the first quarter of 2023. This pattern points to a healthy financial trajectory for this REIT. Moreover, its 4-year average dividend yield is at an extraordinary 4.1%, backed by industry-leading growth numbers. Additionally, analysts at TipRanks rated the stock as a Moderate Buy with about a 9% upside from current levels.\n\nNorthrop Grumman (NOC) Northrop Grumman (NOC) logo on a corporate building\n\nSource: Kristi Blokhin / Shutterstock.com\n\nNorthrop Grumman (NYSE:NOC) is arguably one of the best defense contractors known for its steady and dependable dividend payout. It channeled over 70% of its free cash flow into dividends last year, a testament to its shareholder commitment.\n\nThe company has effectively surpassed first-quarter expectations despite some turbulence, as evidenced by profit declines across key business units such as mission and aeronautics systems. It reported earnings per share of $5.50 on revenue of $9.3 billion, beating out the forecasted $5.09 on $9.2 billion. Particularly, its space unit offers a ray of optimism, with first-quarter sales skyrocketing 17% year-over-year. Impressively, its revenue eclipses that of the aeronautics division by over 35%.\n\nNOC stock is down almost 16% year-to-date, offering a powerful dividend yield of 1.7%, with consecutive dividend growth for almost 20 years.\n\nAgnico Eagle Mines (AEM) gold mining\n\nSource: ©iStock.com/TomasSereda\n\nRising above cost and workforce challenges, Agnico Eagle Mines (NYSE:AEM) posted robustly in the gold production sphere last year. Hailed as the third-largest gold producer globally, the firm effectively showcased strong cost control and strategic expansion projects, leading to record-breaking margins. Notably, Agnico Eagle has maintained its position in lucrative mining jurisdictions and witnessed significant production growth compared to its peers.\n\nMoreover, with an array of projects in the U.S. and Colombia lined up and aimed at augmenting its gold and silver production profile, the firm is set for long-term growth expansion ahead. While rising costs due to persistent inflation could be considered a risk, Agnico Eagle seems well-equipped to manage labor and other costs. Additionally, the company offers a healthy and sustainable dividend yield, exceeding the 3% mark for its shareholders. With minimal political risk and a low valuation, the stock emerges as an appealing buy.\n\nRestaurant Brands (QSR) Three young adult friends sit around a vintage restaurant booth eating hamburgers. image represents restaurant stocks\n\nSource: Shutterstock\n\nRestaurant Brands (NYSE:QSR) boasts a robust global footprint, operating around 29,000 restaurants in over 100 countries. The company continues to demonstrate impressive financial health with encouraging numbers across both lines. Consolidated total revenues and adjusted EBITDA grew over 9.5% and nearly 11% for the first quarter year-over-year, comfortably outpacing sector averages. Moreover, it has been an excellent performer in the stock market in the past year, generating a total return of 56% compared to the S&P 500’s of just 21%.\n\nFurthermore, in its first quarter, it reported a notable year-over-year increase in sales to $1.59 billion, alongside a net income of $277 million. The driving forces behind this success lie in the company’s diverse brand portfolio and the massive scale at which it operates.\n\nHence, with its international presence and commitment to continuous operational improvements, QSR stock represents one of the best income stocks at this time. Additionally, it offers a 2.79% yield with seven years of consecutive payout growth.\n\nKellogg (K) Kellogg's sign on their Canada's head office building in Mississauga\n\nSource: JHVEPhoto / Shutterstock.com\n\nIn the world of consumer stocks, Kellogg (NYSE:K) has been somewhat static, with its stock dipping 5% over the last five years with only a modest increase of 2% in the past decade. That stagnation stems from limited growth in its traditional cereal business, which faces challenges due to changing consumer behaviors and increased competition.\n\nThe company wants to spin off its cereal business from its other faster-growing consumer products, particularly snack items. The business will split its high-growth sections into a new entity named “Kellanova,” while rebranding its cereal branch as “WK Kellogg Co.”\n\nFor investors, this could present a strategic opportunity wager on K stock before the split at the end of 2023. Moreover, despite recent challenges, the company has maintained a solid track record of 18 consecutive years of dividend growth, yielding an appealing 3.5%.\n\nOn the date of publication, Muslim Farooque did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMuslim Farooque is a keen investor and an optimist at heart. A life-long gamer and tech enthusiast, he has a particular affinity for analyzing technology stocks. Muslim holds a bachelor’s of science degree in applied accounting from Oxford Brookes University.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live Wall Street Titan: Here’s My #1 Stock for 2023 The $1 Investment You MUST Take Advantage of Right Now It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 7 Undervalued Dividend Stocks With Growth Potential for Investors appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-undervalued-dividend-stocks-growth-184548132.html", "symbols": ["AEM.TO", "AEM.US", "BAC.US", "K.US", "NOC.US", "NOCG34.SA", "NTH.F", "PRU.US", "PSA-PH.US", "PSA-PK.US", "PSA.US", "PUP.F", "QSR.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.018, "neu": 0.794, "pos": 0.189}}, {"date": "2023-07-17T18:32:02+00:00", "title": "Dow futures steady, major earnings in focus", "content": "Investing.com - U.S. stock futures held within a tight range during Monday's overnight trading, following a positive session among major indices, with the Dow, S&P 500 and Nasdaq each finishing at 15-month highs.\n\nBy 6:25:pm ET (10:25pm GMT) Dow Jones Futures were steady while S&P 500 Futures and Nasdaq 100 Futures slipped 0.1% apiece.\n\nAhead in Tuesday's session, traders are bracing for corporate earnings from companies including Bank of America Corp (NYSE:BAC), Morgan Stanley (NYSE:MS), Charles Schwab Corp (NYSE:SCHW) and Lockheed Martin Corporation (NYSE:LMT).\n\nAmong data, retail sales, industrial production, business inventories and the NAHB housing market index will be closely monitored by market participants.\n\nDuring Monday's regular trade, the Dow Jones Industrial Average added 76.3 points or 0.2% to 34,585.4, the S&P 500 lifted 17.4 points or 0.4% to 4,522.8 and the NASDAQ Composite lifted 131.3 points or 0.9% to 14,245.\n\nOn the bond markets, United States 10-Year rates were at 3.809%.\n\nRelated Articles\n\nDow futures steady, major earnings in focus\n\nMicrosoft in talks to extend deal contract with Activision -source\n\nBiden to meet labor organizers from Starbucks, Minor League Baseball", "link": "https://finance.yahoo.com/news/dow-futures-steady-major-earnings-183202623.html", "symbols": ["BAC.US", "DJI.INDX", "IXIC.INDX", "LMT.US", "MS.US", "SCHW-PD.US", "SCHW.MX", "SCHW.US", "SCHW34.SA", "SWG.F"], "tags": [], "sentiment": {"polarity": 0.796, "neg": 0, "neu": 0.956, "pos": 0.044}}, {"date": "2023-07-17T16:22:06+00:00", "title": "Stock market today: Dow rises as banks, tech shine, but telecoms stifle gains", "content": "Investing.com -- The Dow closed higher Monday, led by tech and financials as investors looked ahead to more quarterly results from Wall Street banks and other major corporations later this week, though broader market gains were kept in check by a stumble in telecoms.\n\nThe Dow Jones Industrial Average rose 0.2%, or 76 points, the Nasdaq was up 0.9%, and the S&P 500 rose 0.3%.\n\nFinancials rally ahead of earnings from Bank of America, Morgan Stanley and Goldman Sachs\n\nFinancials rallied more than 1% as investors anticipate further signs of the strength in banks ahead of quarterly results from Bank of America (NYSE:BAC) and Morgan Stanley (NYSE:MS) due Tuesday and Goldman Sachs (NYSE:GS) due Wednesday.\n\nSentiment on major banks was boosted last week following better-than-expected quarterly results from JPMorgan Chase & Co (NYSE:JPM) and Wells Fargo (NYSE:WFC), though Citi was the odd one after its earnings fell short of analyst expectations.\n\nUBS, however, warned against extrapolating the better-than-expected results to other banks, and expects “tougher results from regional banks.”\n\nPNC Financial Services Group Inc (NYSE:PNC) and Western Alliance Bancorporation (NYSE:WAL), which are down sharply year-to-date, are slated to report earnings on Friday.\n\nApple, chips lead tech higher\n\nA rise in Apple Inc (NASDAQ:AAPL) and semiconductor stocks including NVIDIA Corporation (NASDAQ:NVDA) pushed the broader tech sector more than 1% higher as AI-driven optimism ahead of tech earnings persists.\n\n“We believe overall the tech sector will be up another 12%-15% in the second half of this year led by software and the chip sector with Big Tech remaining the \"torch bearer\" for this tech rally continuing to heat up,” Wedbush said in a note.\n\nMicrosoft Corporation (NASDAQ:MSFT), meanwhile, traded just above the flatline even as its pending $69 billion acquisition of Activision Blizzard Inc (NASDAQ:ATVI) inched closer after the Federal Trade Commission lost its appeal to pause the deal.\n\nTesla gets Cybertruck production underway; Ford falters on price cut\n\nTesla (NASDAQ:TSLA) was up more than 3% after starting production of its Cybertruck in Texas, with the EV maker expected to ship around 2,000 units this year, Deutsche Bank estimated.\n\nThe gains come just ahead of Tesla’s quarterly results due Wednesday, in which margins are likely to dominate attention following recent price cuts.\n\n“The big focus on this print will be Auto GM (ex credits) to gauge the impact of the price cuts and what this means for margins going forward,” Wedbush said in a note.\n\nFord Motor (NYSE:F), meanwhile, fell more than 5% after cutting prices of its F-150 Lightning by up to $10,000 amid increased competition from Rivian Automotive Inc (NASDAQ:RIVN) and Tesla’s Cybertruck.\n\nParamount stumbles as latest 'Mission: Impossible' blockbuster falls short at box office; AT&T Gets Downgrade Call\n\nParamount Global's (NASDAQ:PARA) \"Mission: Impossible” movie underperformed expectations at the box office, sending the entertainment company’s share more than 3% lower.\n\nThe latest installment in the Mission Impossible franchise racked in $56.2 million domestically over the weekend, below expectations of at least $60 million or more, which would have marked a new franchise record.\n\nTelecoms giant AT&T (NYSE:T) fell 6% after Citi downgraded the stock to Neutral from Buy on concerns that the firm and others face significant costs removing legacy copper cables - used for telephony and other related-purposes - that reportedly may pose a risk environment. AT&T, which some estimate may face costs of up to $59 million, was also downgraded to neutral from overweight by JPMorgan.\n\nAs the network of cables covered in toxic lead degrades, it \"is ending up in places where Americans live, work and play,\" the Wall Street Journal reported Sunday, citing tests of samples from nearly 130 underwater-cable sites, conducted by several independent laboratories. Verizon (NYSE:VZ), Frontier Communications (NASDAQ:FYBR) and Lumen Technologies (NYSE:LUMN), which were all also mentioned in the report, were down heavily.\n\nRelated Articles\n\nStock market today: Dow rises as banks, tech shine, but telecoms stifle gains\n\nUS FTC eyes options after Microsoft/Activision loss, source says\n\nUS probes United flight that lost evacuation slide before landing in Chicago", "link": "https://finance.yahoo.com/news/stock-market-today-dow-rises-162206513.html", "symbols": ["AAPL.US", "ATVI.US", "BAC.US", "DJI.INDX", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "FYBR.US", "GS.US", "JPM.US", "LUMN.US", "MS.US", "MSFT.US", "NVDA.US", "PARA.US", "PNC.US", "RIVN.US"], "tags": [], "sentiment": {"polarity": 0.558, "neg": 0.037, "neu": 0.924, "pos": 0.039}}, {"date": "2023-07-17T15:58:31+00:00", "title": "Retail sales, Bank of America earnings, Lockheed Martin: 3 things to watch", "content": "Investing.com -- Stocks are rising on Monday ahead of a big week of earnings including Goldman Sachs (NYSE:GS), Tesla (NASDAQ:TSLA), and Netflix (NASDAQ:NFLX).\n\nInvestors are studying earnings for clues about business and consumer spending trends. Goldman is expected to be affected by a slump in deal making, while Netflix could provide some context on how the Hollywood strike will affect its operations for the next few months.\n\nTesla has rolled out its Cybertruck, and could provide more details on when it can start delivering the electric vehicles.\n\nPositive news about cooling inflation in recent days has helped lift the tech sector, and with it the major indexes. Investors are expecting the Fed could approach the end of its interest rate increases sooner rather than later, though futures markets still expect the Fed to raise rates by a quarter of a percentage point this month.\n\nThis week also features housing market data that could give investors more insight into the effect of rising mortgage rates on housing demand. Existing home sales, due out on Thursday, are expected to dip slightly from the prior month.\n\nHere are three things that could affect markets tomorrow:\n\n1. Retail sales\n\nThe reading on retail sales for June is expected out at 8:30 ET (12:30 GMT). Analysts expect them to rise 0.5% for the month and 1.6% for the year.\n\n2. Bank of America earnings\n\nBank of America Corp (NYSE:BAC) is expected to report earnings per share of 84 cents on revenue of $25 billion. Other big banks also report on Tuesday, including Morgan Stanley (NYSE:MS), expected to unveil earnings per share of $1.23 on revenue of $13B.\n\n3. Lockheed Martin\n\nLockheed Martin Corporation (NYSE:LMT) is expected to report earnings per share of $6.45 on revenue of $15.9B.\n\nRelated Articles\n\nRetail sales, Bank of America earnings, Lockheed Martin: 3 things to watch\n\nExperimental drug works best for Alzheimer's patients treated as early as possible\n\nMasimo shares plunge 24% following disappointing preliminary Q2 results", "link": "https://finance.yahoo.com/news/retail-sales-bank-america-earnings-155831763.html", "symbols": ["BAC.US", "GS.US", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA", "MS.US", "NFC.F", "NFC.XETRA", "NFLX.MX", "NFLX.US", "NFLX34.SA", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.915, "neg": 0.023, "neu": 0.919, "pos": 0.058}}, {"date": "2023-07-17T15:32:00+00:00", "title": "BAC Investigation Alert: Johnson Fistel, LLP Encourages Investors to Submit Their Information Below", "content": "SAN DIEGO, July  17, 2023  (GLOBE NEWSWIRE) -- Shareholder rights law firm Johnson Fistel, LLP is investigating potential claims on behalf of Bank of America Corporation (\"Bank of America \" or \"the Company\") (NYSE: BAC) against certain of its officers and directors.\n\nWhat is Johnson Fistel investigating? On July 11, 2023, the Consumer Financial Protection Bureau announced that an investigation found that Bank of America harmed hundreds of thousands of customers across multiple product lines over several years through a series of illegal practices. Bank of America was ordered to pay more than $100 million to customers for double charging insufficient fund fees, withholding reward bonuses, and opening accounts without customers' knowledge or permission. The bank was also charged $150 million in penalties for the same violations.\n\nIf you are a current, long-term shareholder of Bank of America, you may have standing to hold Bank of America harmless from the alleged harm caused by the Company's officers and directors by making them personally responsible. You may also be able to assist in reforming the Company's corporate governance to prevent future wrongdoing. You can click or copy and paste the link below in a browser to join this action:\n\nhttps://www.johnsonfistel.com/investigations/bank-of-america-corporation\n\nThere is no cost or obligation to you.\n\nAbout Johnson Fistel, LLP:\r\nJohnson Fistel, LLP is a nationally recognized shareholder rights law firm with offices in California, New York and Georgia. The firm represents individual and institutional investors in shareholder derivative and securities class action lawsuits. Johnson Fistel seeks to recover losses incurred due to violations of federal securities laws. For more information about the firm and its attorneys, please visit http://www.johnsonfistel.com. Attorney advertising. Past results do not guarantee future outcomes.\n\nContact:\r\nJohnson Fistel, LLP\r\nJim Baker, 619-814-4471\r\nInvestor Relations\r\njimb@johnsonfistel.com", "link": "https://www.globenewswire.com/news-release/2023/07/17/2705835/0/en/BAC-Investigation-Alert-Johnson-Fistel-LLP-Encourages-Investors-to-Submit-Their-Information-Below.html", "symbols": ["BAC.US"], "tags": ["CLASS ACTION", "JOHNSON FISTEL", "LAW & LEGAL ISSUES", "LLP"], "sentiment": {"polarity": -0.648, "neg": 0.089, "neu": 0.836, "pos": 0.075}}, {"date": "2023-07-17T15:02:28+00:00", "title": "Earnings season: Big bank stocks are showing resiliency in Q2", "content": "Earnings season enters its second week, with big bank stocks JPMorgan, Wells Fargo, and Citi all reporting earnings beats last week. Bank of America, Morgan Stanley, and Goldman Sachs are on tap to report this week. Wall Street Journal Reporter Ben Eisen joins Yahoo Finance Live to discuss the resiliency of banks, especially as big banks benefitted the most from regional bank turmoil in early 2023. Eisen highlights bank deposit trends and how it is being reflected in current bank earnings.\n\nVideo Transcript\n\n- Big banks reporting Friday, JPMorgan Chase, Citigroup, Wells Fargo, they all delivered solid earnings. A strong showing in profits made it easy to forget the years earlier chaos. Our next guest says all signs from big banks point to a soft landing. But how will high interest rates weigh on banks, both big and small, in the months ahead?\n\nJoining us now is Ben Eisen, \"Wall Street Journal\" reporter. Ben, thanks so much for joining us this morning. All right, Ben.\n\nBEN EISEN: Thanks for having me.\n\n- Let's get right into it. Let's talk about these big banks. We had a guest on earlier who talked about this strength that we saw. You put out a report talking about just the picture that the banks are painting. What's the theme that you're seeing play out with regard to the reports that we've seen so far?\n\nBEN EISEN: So it's important to note that we've only had three of the big banks out of six that have disclosed their earnings so far. But what we saw on Friday was honestly pretty good, as far as what people were expecting. All of the three banks, Citigroup, Wells Fargo, and JPMorgan, they all beat estimates on profit and revenue.\n\nAnd when you kind of dug into the details a little bit, what you saw is that the money that they set aside for bad loans is really not that much. Their customers were borrowing. They were spending. And the economy kind of continued to hum along as shown kind of coursing through these banks. And that's despite some of the worst fears that people had.\n\nWhen you think about the economy, we've been talking for years about, are we going to have a soft landing or are we going to have a hard landing? Are we going to have a deep recession? And it's obviously we don't know what's going to happen. But as far as what the banks are seeing right now, it really hasn't been the kind of hard landing that we've seen. It points more towards the soft one.\n\n- And given that we've only had a few of the banks come out so far, Ben, do you expect to continue to hear that, particularly from, like, the regional banks when they start reporting?\n\nBEN EISEN: I think that's-- I think there will be a distinction between the big banks and the regional banks. You know, what we saw among the big banks is that-- some of what we saw during the financial during the crisis that we had earlier this year with deposits leaving banks, these regional banks, and those banks having to replace those deposits with higher cost funding, we did see that at the biggest banks to a smaller extent. It impacted them less. They have these more diversified big businesses where they can offset sort of higher deposit costs with other lines of business.\n\nNow, when you look at the regional banks, they sort of have less room to maneuver. These are banks that are more focused on taking deposits, making loans, investing in securities. So the higher interest rate-- the hit from higher interest rates is going to be more acute at these smaller banks in all likelihood.\n\nSo that may mean that a lot of these banks had to replace these deposits that left with higher cost funding. And when that happens, you know, that kind of directly hits profit. It narrows the net interest margin that they earn. So I think that's something to be on the lookout for.\n\nHow bad it will be? It's hard to say. And all banks are sort of faring differently, but, yeah, I don't think anyone expects the mid-sized banks to have as rosy earnings as the big banks have had.\n\nAnd the big banks have actually sort of benefited in some ways from the trouble that we've had with regional banks because when people took their deposits from SVB, for example, they brought them to JPMorgan and Wells and Bank of America. And so, you know, you've had sort of the haves and the have nots that we've seen over the course of the year.\n\n- Ben, speaking of the haves and the have, nots there's been some divergence, obviously, in share price. And you dig into this. But when we look at this as a basket, you look particularly at the KBW, NASDAQ bank index, it being down for the year. But that's different from the XLF. What does that tell you or what does that signal about the state of the banking sector?\n\nBEN EISEN: You definitely do see this kind of divergence that's playing out between the biggest banks and the regional banks that's playing out in their share prices. JPMorgan, Wells Fargo, Citigroup, the ones that reported on Friday, those stocks are all up for the year. But when you look at the PacWest and Zions and Comerica and all these banks that are in the regional space and have been just kind of battered all year long, they don't look so good. So there is sort of this pretty wide divergence that we're seeing.", "link": "https://finance.yahoo.com/video/earnings-season-big-bank-stocks-150228631.html", "symbols": ["0Q16.LSE", "0R01.LSE", "0R2F.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CMC.F", "CMC.XETRA", "CTGP34.SA", "DWD.F", "DWD.XETRA", "GOS.F"], "tags": [], "sentiment": {"polarity": 0.979, "neg": 0.031, "neu": 0.901, "pos": 0.068}}, {"date": "2023-07-17T14:51:48+00:00", "title": "Tesla, Netflix, Bank of America earnings, econ data on tap this week", "content": "Tesla (TSLA), Netflix (NFLX), Bank of America (BAC), and Morgan Stanley (MS), are just some of the companies set to release earnings this week. In addition to earnings, economic data such as retail sales, jobless claims, and existing home sales will also be released. Yahoo Finance Reporter Josh Schafer breaks down what to watch.", "link": "https://finance.yahoo.com/video/tesla-netflix-bank-america-earnings-145148598.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "DWD.F", "DWD.XETRA", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US", "MSBR34.SA", "NCB.XETRA", "NFC.F", "NFC.XETRA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-07-17T13:42:03+00:00", "title": "Did JPMorgan's earnings set too high of a bar for banks?", "content": "JPMorgan Chase's second quarter results handily topped Wall Street estimates, thanks in part to its acquisition of First Republic. RBC Capital Markets Managing Director Gerard Cassidy tells Yahoo Finance Live that the bank has managed to \"set themselves apart\" from the rest of the sector, which is why \"their valuation is the highest amongst the big banks, because they are the most profitable.\" For upcoming bank earnings, Cassidy says he expects Bank of America's profitability to be \"robust,\" while Goldman Sachs and Morgan Stanley are likely to feel the effects of the current market conditions.", "link": "https://finance.yahoo.com/video/did-jpmorgans-earnings-set-too-134203600.html", "symbols": ["0Q16.LSE", "0R01.LSE", "0R2F.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CMC.F", "CMC.XETRA", "CTGP34.SA", "DWD.F", "DWD.XETRA", "GOS.F"], "tags": [], "sentiment": {"polarity": 0.612, "neg": 0, "neu": 0.949, "pos": 0.051}}, {"date": "2023-07-17T05:15:37+00:00", "title": "U.S. corporate earnings ahead, Chinese GDP underwhelms - what's moving markets", "content": "Investing.com -- Investors prepare for a raft of fresh corporate earnings this week that will include some of the largest U.S. banks and major tech industry players. Elsewhere, Chinese quarterly growth figures provide further evidence of the country's sputtering recovery from the pandemic. Plus, Microsoft signs a licensing agreement with PlayStation over the \"Call of Duty\" gaming franchise that could bring the tech giant's mega-merger with Activision Blizzard one step closer to completion.\n\n1. U.S. stock futures mixed\n\nU.S. stock futures were mixed on Monday as investors looked ahead to a busy week of corporate results and digested underwhelming economic growth data out of China.\n\nBy 05:06 ET (09:06 GMT), the Dow futures contract had lost 50 points or 0.14%, S&P futures slipped slightly by 2 points or 0.03%, and Nasdaq 100 futures edged up by 18 points or 0.11%.\n\nAll three of these indices ended Friday with weekly gains of over 2%, driven in part by softer-than-expected inflation data for June that boosted hopes that the Federal Reserve may soon begin to step away from its recent policy tightening campaign. Traders also had a chance to parse through earnings from several major banks, including the biggest U.S. lender JPMorgan Chase (NYSE:JPM).\n\nMeanwhile, sentiment heading into U.S. dealmaking was dented by data out of China that showed that growth in the world's second-largest economy had slowed substantially in the second quarter (see below).\n\n2. Second-quarter earnings season kicks into gear\n\nThe earnings calendar on Monday will be relatively light compared to the parade of companies due to deliver their latest results this week.\n\nBig financial industry players Bank of America (NYSE:BAC), Morgan Stanley (NYSE:MS) and Goldman Sachs (NYSE:GS) are all scheduled to unveil quarterly earnings in the coming days. Bank balance sheets have come under heavy scrutiny in the wake of the failure of several regional rivals earlier this year, an event that plunged the financial services industry into crisis.\n\nOn Friday, lenders JPMorgan and Wells Fargo (NYSE:WFC) posted surges in year-on-year net income, although peer Citigroup's (NYSE:C) profit tumbled by over a third. Collectively, net interest income, the difference between what a bank earns for loans and loses from deposits, at the three groups rose 30%, boosted by a spike in interest rates.\n\nElsewhere this week, Elon Musk-led electric carmaker Tesla (NASDAQ:TSLA), streaming giant Netflix (NASDAQ:NFLX), and carrier United Airlines (NASDAQ:UAL) are among the key businesses to report.\n\n3. Chinese economic growth cools\n\nThe Chinese economy expanded at a much slower rate in the second quarter, casting further doubt over the country's nascent rebound from draconian pandemic-era restrictions.\n\nChina's second-quarter gross domestic product increased by 0.8% from the prior three-month period, slightly above expectations for an uptick of 0.5%, but cooling significantly from 2.2% in the first quarter.\n\nOn an annualized basis, GDP expanded by 6.3% thanks largely to a lower basis for comparison from the corresponding COVID-hit quarter last year. But this reading missed estimates for growth of 7.3%.\n\nFaltering property sector, sputtering exports, and weak retail sales have combined to weigh on an economic recovery in China that had seemed to be gathering momentum at the beginning of 2023.\n\n4. Microsoft signs \"Call of Duty\" licensing agreement with Sony\n\nMicrosoft's (NASDAQ:MSFT) contentious push to acquire Activision Blizzard (NASDAQ:ATVI) received a major boost over the weekend when the tech giant agreed to keep the mega-popular gaming franchise \"Call of Duty\" on Sony's (TYO:6758) PlayStation console.\n\nThe deal helps overcome a key hurdle facing Microsoft's $69 billion purchase of Activision, which would be the biggest in the history of the video gaming industry. Shares in Activision surged by more than 4% in premarket trading on Monday.\n\nSony (NYSE:SONY) has previously stood in opposition to the tie-up, arguing that Microsoft will use it to in effect prevent access to lucrative titles like action shooter \"Call of Duty\" to PlayStation.\n\nThe announcement comes after U.S. antitrust regulators, who have voiced concerns over lessening competition, had multiple attempts to prevent the merger from closing rejected by a federal court in San Francisco last week.\n\nThe decision in turn led the U.K.'s competition watchdog, which had blocked the deal in April, to offer Microsoft and Activision a new chance to remedy their worries.\n\n5. Oil volatile in the wake of Chinese data, Russian grain deal uncertainty\n\nOil prices moved lower in choppy trading on Monday, with traders gauging the health of demand in the top crude importer China and uncertainty around the West's response to Russia withdrawing from a U.N.-brokered Black Sea grain deal.\n\nMeanwhile, two of the three Libyan oil fields that were shut down on Thursday resumed production over the weekend, adding supply to the global market.\n\nBy 05:31 ET, the U.S. crude futures traded 1.25% lower at $74.38 a barrel, while the Brent contract shed 1.09% to $79.00 per barrel.\n\nBoth benchmarks recorded a third straight week of gains last week, touching their highest levels since April. Some support came from slower-than-expected U.S. inflation data as well as anticipated output cuts by Saudi Arabia and Russia later this summer.\n\nRelated Articles\n\nU.S. corporate earnings ahead, Chinese GDP underwhelms - what's moving markets\n\nNigeria inflation up slightly to 22.79% y/y in June\n\nIs the wild ride over? Fed faces broader debate as it tees up rate hike", "link": "https://finance.yahoo.com/news/u-corporate-earnings-ahead-chinese-051537088.html", "symbols": ["AIY.F", "AIY.XETRA", "ATVI.MX", "ATVI.US", "BAC.US", "C.US", "GS.US", "JPM.US", "MS.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NFLX.US", "SONY.US", "TSLA.US", "UAL.US"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0.066, "neu": 0.853, "pos": 0.081}}, {"date": "2023-07-17T03:43:06+00:00", "title": "European stocks fall after underwhelming Chinese growth data; earnings to ramp up", "content": "Investing.com - European stock markets retreated Monday after the release of underwhelming Chinese growth data, while the second-quarter earnings season gets underway in earnest.\n\nAt 03:30 ET (07:30 GMT), the DAX index in Germany traded 0.2% lower, the FTSE 100 in the U.K. traded down 0.1% and the CAC 40 in France fell 0.7%.\n\nChinese growth slowing sharply\n\nSentiment in Europe has been hit Monday by the release of data showing that economic growth in China, a major export market for Europe’s largest companies, slowed substantially through the second quarter.\n\nChina’s second-quarter gross domestic product grew 0.8% from the prior quarter, slightly above expectations for growth of 0.5%, but slowed substantially from the 2.2% seen in the prior quarter.\n\nOn an annualized basis, GDP grew 6.3% in the second quarter, thanks largely to a lower basis for comparison from the COVID-impacted period last year, and this was lower than expectations for growth of 7.3%.\n\nThe Chinese economy has now expanded a total 5.5% so far in 2023, thanks largely to a strong first quarter, but growth has slowed over the past three months.\n\nInvestors have used these numbers to sell into last week's healthy gains, with the broad-based Stoxx 600 index climbing nearly 3%, after data showing rapidly cooling inflation in the U.S. raised expectations the Federal Reserve may be close to ending its aggressive rate-hiking cycle, boosting the U.S. economy.\n\nECB speakers due\n\nThe economic data slate is largely empty Monday, with only final Italian consumer prices due, but investors will look to speeches from ECB Board members Fabio Panetta, Frank Elderson and Philip Lane, as well as President Christine Lagarde, during the session for clues of the central bank’s thinking ahead of the next policy-setting meeting near the end of this month.\n\nQuarterly earnings start to pour in\n\nThis week sees the new quarterly earnings season kick off in earnest, although Monday’s schedule is quite light.\n\nAdditionally, the Russian state has taken control of French foods giant Danone's (EPA:DANO) Russian subsidiary along with beer company Carlsberg's (CSE:CARLa) stake in a local brewer, according to a decree signed by President Vladimir Putin on Sunday. Danone stock fell 0.3% and Carlsberg dropped 0.9%.\n\nH&M (ST:HMb) stock slipped 0.2% after the fashion retailer announced it will launch stores and online trade in Brazil in 2025.\n\nAcross the pond, Tesla (NASDAQ:TSLA) will be the first of the massive growth and technology names to report on Wednesday, while bank earnings continue, with Bank of America (NYSE:BAC) on Tuesday and Goldman Sachs (NYSE:GS) on Wednesday.\n\nOil prices dip after weak Chinese GDP data\n\nOil prices fell Monday after the disappointing Chinese growth numbers raised concerns about the economic recovery and thus future demand from the world’s largest crude importer.\n\nAdditionally, two of the three Libyan oil fields that were shut down on Thursday, including the country’s second-largest, Sharara, resumed production over the weekend, adding supply to the global market.\n\nBy 03:30 ET, the U.S. crude futures traded 1.1% lower at $74.50 a barrel, while the Brent contract dropped 1.1% to $79.02.\n\nBoth benchmarks recorded a third straight week of gains last week, climbing to their highest levels since April.\n\nAdditionally, gold futures fell 0.4% to $1,955.95/oz, while EUR/USD traded 0.1% higher at 1.1242.\n\nRelated Articles\n\nEuropean stocks fall after underwhelming Chinese growth data; earnings to ramp up\n\nFutures lackluster as investors wait for more earnings\n\nAustralia stocks lower at close of trade; S&P/ASX 200 down 0.06%", "link": "https://finance.yahoo.com/news/european-stocks-fall-underwhelming-chinese-034306361.html", "symbols": ["BAC.US", "FCHI.INDX", "FTSE.INDX", "GDAXI.INDX", "GS.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.974, "neg": 0.058, "neu": 0.846, "pos": 0.097}}, {"date": "2023-07-17T00:00:00+00:00", "title": "7 Undervalued Dividend Stocks With Growth Potential for Investors", "content": "Unveil the potential of undervalued dividend stocks and explore rewarding long-term gains in your investment journey.", "link": "https://investorplace.com/2023/07/7-undervalued-dividend-stocks-with-growth-potential-for-investors/", "symbols": ["AEM.US", "BAC.US", "K.US", "NOC.US", "PRU.US", "PSA.US", "QSR.US"], "tags": [], "sentiment": {"polarity": 0.7, "neg": 0, "neu": 0.707, "pos": 0.293}}, {"date": "2023-07-16T20:14:04+00:00", "title": "Dow futures slip amid earnings kick off", "content": "Investing.com - U.S. stock futures were trading in a tight range during Sunday's evening deals, with major benchmark indices surging in the previous week as market participants look ahead to corporate earnings from major tech companies.\n\nBy 7:05:pm ET (11:05pm GMT) Dow Futures lost 0.2%, while S&P 500 Futures and Nasdaq 100 Futures dipped 0.1% apiece.\n\nAhead in the week, investors will be monitoring the NY empire state manufacturing index, retail sales, industrial production, business inventories, building permits, housing starts, existing home sales and Philadelphia Fed manufacturing data.\n\nOn the earnings front, companies including Bank of America Corp (NYSE:BAC), Morgan Stanley (NYSE:MS), Lockheed Martin Corporation (NYSE:LMT), Tesla Inc (NASDAQ:TSLA), International Business Machines (NYSE:IBM), Netflix Inc (NASDAQ:NFLX), and Goldman Sachs Group Inc (NYSE:GS) are set to release quarterly results.\n\nStay ahead of the curve this earnings season with InvestingPro.\n\nDuring Friday's regular trade, the Dow Jones Industrial Average added 113.9 points or 0.3% to 34,509, the S&P 500 eased 4.6 points or 0.1% to 4,505.4 and the NASDAQ Composite slipped 24.9 points or 0.2% to 14,113.7. For the week, the Dow popped 2.4% to 4-week highs, while the S&P 500 and NASDAQ added 2.5% and 2.2% respectively to finish at 15-month highs.\n\nOn the bond markets, United States 10-Year rates were at 3.834%.\n\nRelated Articles\n\nDow futures slip amid earnings kick off\n\nHong Kong Stock Exchange delays trading on typhoon warning\n\nUK consumer group calls for government action on grocery prices", "link": "https://finance.yahoo.com/news/dow-futures-slip-amid-earnings-201404215.html", "symbols": ["BAC.US", "DJI.INDX", "GS.US", "GSPC.INDX", "IBM.US", "IXIC.INDX", "LMT.US", "MS.US", "NFLX.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.402, "neg": 0.019, "neu": 0.951, "pos": 0.03}}, {"date": "2023-07-16T06:26:13+00:00", "title": "Top 5 things to watch in markets in the week ahead", "content": "Investing.com -- Second-quarter earnings season kicks into gear, the U.S. and China release economic data and inflation figures out of the U.K. will likely determine the size of the Bank of England’s next rate hike. Meanwhile, oil prices look poised for another weekly gain.\n\n1. Earnings time\n\nSecond-quarter earnings season gets underway in earnest in the coming week, with Tesla (NASDAQ:TSLA) the first of the massive growth and technology names that have dominated the U.S. stock market so far this year to report, with results expected on Wednesday.\n\nTesla is one of seven huge stocks, along with Apple (NASDAQ:AAPL), Microsoft (NASDAQ:MSFT), Alphabet (NASDAQ:GOOGL), Amazon (NASDAQ:AMZN), Nvidia (NASDAQ:NVDA) and Meta Platforms (NASDAQ:META) recently dubbed the “Magnificent Seven” by investors. Shares in the megacaps have soared between 40% and over 200% so far this year, accounting for almost all of the S&P 500’s rally.\n\nThere are indications the rally is broadening to other sectors, but the outsize gains have come with big earnings expectations so if Tesla or any other megacaps disappoint this quarter, the hit to equity indexes could be severe.\n\nA slew of other big companies also post results in the coming week. Bank earnings continue, with Bank of America (NYSE:BAC) on Tuesday and Goldman Sachs (NYSE:GS) on Wednesday. Also on the docket are Johnson&Johnson (NYSE:JNJ), Netflix (NASDAQ:NFLX) and Philip Morris (NYSE:PM).\n\n2. U.S. economic data\n\nU.S. retail sales data for June on Tuesday is expected to show an increase of 0.5%, boosted by rebounding auto sales and higher gasoline station sales, indicating that consumer demand remains resilient.\n\nInvestors will also get an update on the health of the housing sector with reports on building permits, housing starts and existing home sales. High mortgage rates are still weighing on sales of existing homes, but construction is improving given stable pricing and a pick-up in new home sales due to the lack of properties on the market.\n\nThere will also be reports on regionalmanufacturing activity, which is expected to remain sluggish along with the weekly data on initial jobless claims.\n\n3. China economic data\n\nA flurry of economic data from China on Monday is expected to show its post-pandemic bounce is rapidly losing momentum, fueling expectations that Beijing will soon need to unveil more stimulus measures.\n\nGross domestic product is expected to have grown by an annualized 7.3% in the three months to June, compared with growth of 4.5% in the first quarter.\n\nHowever, that reading will be heavily skewed by a sharp slump in activity in the spring, when large parts of the country were still locked down.\n\nMounting deflationary pressure and a slump in trade have added to concerns over the outlook for the world’s second-largest economy, which as recently as six months ago had investors betting on a robust recovery.\n\n4. U.K. inflation\n\nThe U.K. is to release June inflation data on Wednesday and investors will be watching closely as it will likely determine the size of the Bank of England’s next rate hike.\n\nThe headline consumer price index is expected to ease to 8.2% year-over-year from 8.7% in May as food and fuel prices dip. Core inflation is also expected to edge lower, but the services component is expected to hold steady at a post-COVID high of 7.4%.\n\nIn its June meeting minutes the BoE said further tightening would be required if there were signs of persistent inflationary pressures in the economy, including in services CPI.\n\nThis could make August’s meeting a close call: an uptick in services CPI would probably lock in bets for another 50-basis point hike, while a lower reading would probably nudge the dial in favor of a smaller 25 bps increase.\n\n5. Oil prices\n\nOil prices recorded their third-straight weekly gain last week and the rally could resume in the coming week as easing inflation, plans to refill the U.S. strategic reserve, supply cuts and disruptions underpin prices.\n\n\"While oil prices are likely slightly overbought in the very near term, touching the highest levels since early May, the bias appears to be for a grind higher,\" Rob Haworth, senior investment strategist at U.S. Bank Wealth Management told Reuters.\n\nOil prices gained nearly 2% last week, after supply disruptions in Libya and Nigeria heightened concerns that the markets will tighten in coming months.\n\nOil prices fell more than a dollar a barrel on Friday as the dollar strengthened and oil traders booked profits from a strong rally.\n\n--Reuters contributed to this report\n\nRelated Articles\n\nTop 5 things to watch in markets in the week ahead\n\nTrans-Pacific trade pact members gathering information on aspiring joiners\n\nExclusive-India to push G20 to raise share of taxes on firms where they earn 'excess profit' - sources", "link": "https://finance.yahoo.com/news/top-5-things-watch-markets-062613325.html", "symbols": ["AAPL.US", "AMZN.US", "BAC.US", "GOOGL.US", "GS.US", "JNJ.US", "META.US", "MSFT.US", "NFLX.US", "NVDA.US", "PM.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.98, "neg": 0.059, "neu": 0.847, "pos": 0.094}}]