[{"date": "2023-12-15T21:51:41+00:00", "title": "Buy Comerica, skip Bank of America: Good Buy or Goodbye", "content": "In this edition of Good Buy or Goodbye, Yahoo Finance Host Julie Hyman is joined by Unlimited Funds Co-Founder Bob Elliot to hear out his winners and losers in the banking sector.\n\nElliot puts a \"Good Buy\" rating on Comerica (CMA), highlighting the mid-sized lender for an attractive valuation, lower-risk balance sheet, and growth opportunities in key states like Texas and California. While Comerica felt ripples from earlier regional bank failures, Elliot says it is \"positioned to take advantage of the weakness in some of the other banks.\"\n\nConversely, Elliot assigns a \"Goodbye\" call on industry titan Bank of America (BAC). He notes that despite also facing collateral damage from the regional banking crisis, BofA trades at a higher valuation while seeing margin compression and stagnating market share in core lending businesses.\n\nClick here to see more \"Good Buy or Goodbye\" or you can watch this full episode of Yahoo Finance Live here.", "link": "https://finance.yahoo.com/video/buy-comerica-skip-bank-america-215141189.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "CMA.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.811, "neg": 0.093, "neu": 0.757, "pos": 0.151}}, {"date": "2023-12-15T21:15:00+00:00", "title": "Bank of America Declares First Quarter 2024 Preferred Stock Dividends", "content": "CHARLOTTE, N.C., Dec. 15, 2023 /PRNewswire/ -- Bank of America Corporation today announced the Board of Directors has authorized regular cash dividends on the outstanding shares or depositary shares of the following series of preferred stock: (PRNewsfoto/Bank of America Corporation)\n\nSeries of Preferred Stock Dividend per Share\r\nor Depositary Share1 Record Date Payment Date 7.25% Non-Cumulative Perpetual Convertible Preferred Stock, Series L  $18.125 January 1 January 30 5.875% Non-Cumulative Preferred Stock, Series HH $0.3671875 January 1 January 24 Fixed-to-Floating Rate Non-Cumulative Preferred Stock, Series MM $21.50 January 1 January 29  4.375% Non-Cumulative Preferred Stock, Series NN $0.2734375 January 15 February 5 4.125% Non-Cumulative Preferred Stock, Series PP $0.2578125 January 15 February 2 4.375% Fixed-Rate Reset Non-Cumulative Preferred Stock, Series RR $10.9375000 January 1 January 29 6.125% Fixed-Rate Reset Non-Cumulative Preferred Stock, Series TT $15.3125000 January 1 January 29\n\n1 Each series of preferred stock, other than Series L, is represented by depositary shares. Dividend payments are made on a quarterly basis for each series of preferred stock, other than Series MM, for which dividends are paid on a semi-annual basis.\n\nBank of America Bank of America is one of the world's leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 69 million consumer and small business clients with approximately 3,900 retail financial centers, approximately 15,000 ATMs (automated teller machines) and award-winning digital banking with approximately 57 million verified digital users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 4 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and more than 35 countries. Bank of America Corporation stock is listed on the New York Stock Exchange (NYSE: BAC).\n\nStory continues\n\nFor more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom and register for news email alerts.\n\nwww.bankofamerica.com\n\nInvestors May Contact:\n\nLee McEntire, Bank of America\r\nPhone:  1.980.388.6780\r\nlee.mcentire@bofa.com\n\nJonathan Blum, Bank of America (Fixed Income)\r\nPhone:  1.212.449.3112\r\njonathan.blum@bofa.com\n\nReporters May Contact:\n\nBill Halldin, Bank of America\r\nPhone: 1.916.724.0093\r\nwilliam.halldin@bofa.com\n\nChristopher P. Feeney, Bank of America\r\nPhone: 1.980.386.6794\r\nchristopher.feeney@bofa.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/bank-of-america-declares-first-quarter-2024-preferred-stock-dividends-302016922.html\n\nSOURCE Bank of America Corporation", "link": "https://finance.yahoo.com/news/bank-america-declares-first-quarter-211500128.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.987, "neg": 0.008, "neu": 0.901, "pos": 0.091}}, {"date": "2023-12-15T14:30:00+00:00", "title": "We're Taking Some Profits on Bank of America After a 35% Move", "content": "* After you receive this Alert, we will sell 305 shares of Bank of America at or near $33.75. * Following the trade, we will own 3,310 BAC shares, accounting for roughly 2.9% of the portfolio. We are following up on our earlier comments from today, where we said we would be taking advantage of the pronounced move in shares of Action Alerts PLUS position Bank of America -- roughly 35% since late October -- and the stock's increasingly overbought condition.\n\nContinue reading", "link": "https://finance.yahoo.com/m/2a12dc46-b77c-38d8-9d5e-947b60d74ebe/we%27re-taking-some-profits-on.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.765, "neg": 0, "neu": 0.9, "pos": 0.1}}, {"date": "2023-12-15T14:00:00+00:00", "title": "Strength Seen in Bank of America (BAC): Can Its 5.9% Jump Turn into More Strength?", "content": "Bank of America (BAC) shares soared 5.9% in the last trading session to close at $33.94. The move was backed by solid volume with far more shares changing hands than in a normal session. This compares to the stock's 8.2% gain over the past four weeks.\n\nShares of Bank of America rallied for the second consecutive day. The Federal Reserve signaled end of the current rate cycle and kept the interest rates unchanged at 22-year high of 5.25-5.5% at the end of two-day FOMC meeting. The central bank also indicated three interest rate cuts by 2024-end.\n\nThese developments turned investor sentiments bullish on bank stocks as high funding costs being faced by the industry players will somewhat come down next year. This will support net interest income and margin growth. Hence, the BAC stock moved higher.\n\nThis nation's second-largest bank is expected to post quarterly earnings of $0.71 per share in its upcoming report, which represents a year-over-year change of -16.5%. Revenues are expected to be $24.11 billion, down 1.7% from the year-ago quarter.\n\nWhile earnings and revenue growth expectations are important in evaluating the potential strength in a stock, empirical research shows a strong correlation between trends in earnings estimate revisions and near-term stock price movements.\n\nFor Bank of America, the consensus EPS estimate for the quarter has been revised 1.9% lower over the last 30 days to the current level. And a negative trend in earnings estimate revisions doesn't usually translate into price appreciation. So, make sure to keep an eye on BAC going forward to see if this recent jump can turn into more strength down the road.\n\nThe stock currently carries a Zacks Rank #3 (Hold). You can see the complete list of today's Zacks Rank #1 (Strong Buy) stocks here >>>>\n\nBank of America is part of the Zacks Banks - Major Regional industry. Northern Trust Corporation (NTRS), another stock in the same industry, closed the last trading session 3.7% higher at $85.93. NTRS has returned 10.6% in the past month.\n\nStory continues\n\nFor Northern Trust Corporation , the consensus EPS estimate for the upcoming report has remained unchanged over the past month at $1.24. This represents a change of -24.9% from what the company reported a year ago. Northern Trust Corporation currently has a Zacks Rank of #3 (Hold).\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBank of America Corporation (BAC) : Free Stock Analysis Report\n\nNorthern Trust Corporation (NTRS) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/strength-seen-bank-america-bac-140000722.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA", "NT4.F", "NTRS.US"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.017, "neu": 0.827, "pos": 0.156}}, {"date": "2023-12-15T14:00:00+00:00", "title": "Here's Our Game Plan for This Market -- And Specifically for Bank of America", "content": "* Equity futures point to the market rally continuing, giving further lift to our holdings. * Expectations are for seasonal factors to feed the rally through year-end despite overbought conditions. * We will prudently manage the portfolio during this period, taking advantage of outsized moves and overbought conditions.\n\nContinue reading", "link": "https://finance.yahoo.com/m/08406f0f-8b53-37ab-9c65-d4dd1c80b9df/here%27s-our-game-plan-for-this.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.527, "neg": 0, "neu": 0.911, "pos": 0.089}}, {"date": "2023-12-14T22:28:00+00:00", "title": "Why Bank of America and PNC Stocks Crushed the Market Today", "content": "Young person using an ATM\n\nOn Thursday, many investors were kind to bank stocks. One particular clutch of five stocks did particularly well after an analyst upgraded them as a group. Two of the more prominent titles in the quintet were Bank of America(NYSE: BAC) and PNC Financial Services(NYSE: PNC), which rose by nearly 6% and almost 5%, respectively.\n\nThat's one mega upgrade\n\nThe prognosticator behind the lifts was Odeon Capital's Dick Bove, who published his new take on the five banks before market open. He lifted his recommendation on all to buy from the previous hold. In addition to Bank of America and PNC, the quintet included other familiar lenders Wells Fargo, U.S. Bancorp, and Truist Financial.\n\nBove's series of upgrades were based on Federal Reserve Chairman Jerome Powell's comments in the wake of the Fed's interest-rate decision, which was handed down on Wednesday. The analyst said those comments were a \"clear\" indication that inflation has ended.\n\nThe Fed elected to hold its key interest rate steady that day. It also indicated a willingness to start reducing rates next year.\n\nLower rates bring increased demand for loans, especially for the big guys\n\nLower rates are a double-edged sword for banks. On one hand, they reduce the cost of loans, thereby raising demand for such products. On the other, all things being equal, the profit they earn from those cheaper borrowings is lower. Bank sector bulls likely believe that high-volume lenders like Bank of America and PNC, with its large regional footprint, will benefit from that theoretical increased demand for loans.\n\nShould you invest $1,000 in Bank of America right now?\n\nBefore you buy stock in Bank of America, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Bank of America wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStory continues\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of December 11, 2023\n\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Wells Fargo is an advertising partner of The Ascent, a Motley Fool company. Eric Volkman has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Bank of America, PNC Financial Services, Truist Financial, and U.S. Bancorp. The Motley Fool has a disclosure policy.\n\nWhy Bank of America and PNC Stocks Crushed the Market Today was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/why-bank-america-pnc-stocks-222800103.html", "symbols": ["BAC.US", "PNC.US"], "tags": [], "sentiment": {"polarity": 0.593, "neg": 0.077, "neu": 0.84, "pos": 0.083}}, {"date": "2023-12-14T22:22:04+00:00", "title": "Interest rate cuts would be a tailwind for banks in 2024", "content": "The regional bank collapse of early 2023 shook the financial sector and set the tone for banks for the rest of the year. Big Bank CEOs testified before Congress last week, responding to lawmakers' new capital requirement proposals.\n\nRBC Capital Markets Managing Director Gerard Cassidy joins Yahoo Finance Live to discuss how bank stocks could be expected to react to the Federal Reserve's interest rate pause in December, the potential for a 2024 soft landing, and current credit conditions.\n\n\"If rates were to come down and refinancing activity picks up at the long end of the curve, we don't want the Fed cutting too aggressively because that would suggest maybe the economy is weaker than expected,\" Cassidy explains, \"but if you get one or two Fed fund rate cuts in 2024, the yield curve starts to come down a bit — that's very positive for the banks because the credit picture really improves...\"\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/interest-rate-cuts-tailwind-banks-222204588.html", "symbols": ["0Q16.LSE", "0R01.LSE", "0R2F.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CMC.F", "CMC.XETRA", "CTGP34.SA", "DWD.F", "DWD.XETRA", "GOS.F"], "tags": [], "sentiment": {"polarity": 0.671, "neg": 0.065, "neu": 0.867, "pos": 0.068}}, {"date": "2023-12-14T21:41:43+00:00", "title": "Warren Buffett's Berkshire Trims Stake in HP Inc", "content": "Overview of Warren Buffett (Trades, Portfolio)'s Recent HP Inc Transaction\n\nWarren Buffett (Trades, Portfolio), the esteemed investor known as the \"Oracle of Omaha,\" has recently adjusted his holdings in HP Inc (NYSE:HPQ). On November 30, 2023, Buffett's firm reduced its stake in the technology company by a significant 47.37%, selling 46,351,068 shares. On the transaction date, HPQ's shares averaged $29.34 per share. This move has altered the landscape of Buffett's investment portfolio, where HP Inc now represents a 0.48% position, down from the previous 0.91%.\n\nThe Investment Strategy of Warren Buffett (Trades, Portfolio)\n\nWarning! GuruFocus has detected 9 Warning Signs with PAHC.\n\nWarren Buffett (Trades, Portfolio)'s investment philosophy has long been a beacon for value investors worldwide. As the chairman of Berkshire Hathaway, Buffett has transformed a modest textile company into a colossal conglomerate, primarily focusing on insurance and other diverse investments. His strategy, deeply influenced by Benjamin Graham, emphasizes understanding a business, investing with a margin of safety, and choosing companies with favorable long-term prospects and competent management. Buffett's top holdings reflect this approach, with major stakes in Apple Inc (NASDAQ:AAPL), American Express Co (NYSE:AXP), and Bank of America Corp (NYSE:BAC), among others. Warren Buffett's Berkshire Trims Stake in HP Inc\n\nDetails of Buffett's HP Inc Trade Action\n\nThe transaction on November 30 marked a reduction in Buffett's position in HP Inc, with the shares now accounting for 5.20% of the company's outstanding stock. The trade had a moderate impact on Buffett's portfolio, decreasing its weight by 0.43%. Despite the reduction, HP Inc remains a notable holding within the portfolio, showcasing Buffett's continued, albeit reduced, confidence in the company's value proposition.\n\nImpact on Buffett's Portfolio\n\nFollowing the sale, HP Inc stands as a smaller, yet still significant, component of Buffett's investment holdings. The current 0.48% portfolio position indicates a strategic shift, possibly suggesting a reallocation of capital towards other opportunities or a response to changing market conditions. Nevertheless, HP Inc continues to be a part of Buffett's diverse and carefully selected investment mosaic.\n\nStory continues\n\nHP Inc at a Glance\n\nHP Inc, a leading player in the PC and printing industries, has been a household name since its inception. With a global customer base and a focus on the commercial market, HP Inc has strategically positioned itself since separating from Hewlett Packard Enterprise in 2015. The company's reliance on channel partners and outsourced manufacturing has allowed it to maintain a strong presence in its market segments, including Corporate Investments, Personal Systems, and Printing.\n\nFinancial Health of HP Inc\n\nAs of the latest data, HP Inc boasts a market capitalization of $30.57 billion, with a stock price of $30.93. The company is fairly valued according to the GF Value, with a GF Value of $31.56 and a price to GF Value ratio of 0.98. HP Inc's financial strength is evident in its PE Ratio of 9.40, indicating profitability, and a GF Score of 88/100, suggesting a high potential for outperformance. The company's balance sheet, profitability, and growth ranks are commendable, further solidifying its financial stability. Warren Buffett's Berkshire Trims Stake in HP Inc\n\nOther Notable Investors in HP Inc\n\nBuffett is not the only guru with a vested interest in HP Inc. Other prominent investors include Dodge & Cox, Joel Greenblatt (Trades, Portfolio), and Jefferies Group (Trades, Portfolio), each maintaining their own positions in the company. Buffett's holdings, however, remain significant in comparison, reflecting his unique investment strategy and market influence.\n\nMarket Reaction and Prospects for HP Inc\n\nSince the trade date, HP Inc's stock has experienced a 5.42% increase, indicating a positive market reaction. The company's year-to-date performance also shows a 15.63% increase, suggesting a strong trajectory. With a solid GF Score and a stable financial outlook, HP Inc appears well-positioned for future growth, aligning with the market's optimistic view of its potential.\n\nTransaction Analysis and Influence\n\nWarren Buffett (Trades, Portfolio)'s decision to reduce his stake in HP Inc has undoubtedly caught the attention of the investment community. While the trade has slightly decreased the prominence of HP Inc within Buffett's portfolio, it remains a noteworthy holding, reflecting a calculated adjustment rather than a complete withdrawal. This move may signal Buffett's nuanced approach to portfolio management, balancing long-term value with the agility to adapt to market dynamics.\n\nThis article, generated by GuruFocus, is designed to provide general insights and is not tailored financial advice. Our commentary is rooted in historical data and analyst projections, utilizing an impartial methodology, and is not intended to serve as specific investment guidance. It does not formulate a recommendation to purchase or divest any stock and does not consider individual investment objectives or financial circumstances. Our objective is to deliver long-term, fundamental data-driven analysis. Be aware that our analysis might not incorporate the most recent, price-sensitive company announcements or qualitative information. GuruFocus holds no position in the stocks mentioned herein.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/warren-buffetts-berkshire-trims-stake-214143086.html", "symbols": ["7HP.F", "7HP.STU", "7HP.XETRA", "AAPL.US", "AXP.US", "BAC.US", "HPQ.MX", "HPQ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.008, "neu": 0.867, "pos": 0.124}}, {"date": "2023-12-14T19:21:47+00:00", "title": "The 3 Most Undervalued Warren Buffett Stocks to Buy in December", "content": "I have great respect for Warren Buffett. He’s one of the great “buy-and-hold” investors of all time. The man excels at identifying undervalued, high-quality stocks that are poised to climb over the long term. The Oracle of Omaha, as Buffett is sometimes called, also frequently invests in equities that both pay significant dividends and enable investors to benefit from their price gains. As a result, he gets paid to wait for these stocks to rally. However, Buffett certainly isn’t always right. He was wrong to sell airline stocks towards the beginning of the pandemic and his oil stocks are taking a pounding lately. Having said that, I still believe that there are many, great, undervalued Warren Buffett stocks from which to choose. Here are three such names for longer-term investors to consider.\n\nNu Holdings (NU) Online banking businessman using smartphone with credit card Fintech and Blockchain concept\n\nSource: Joyseulay / Shutterstock.com\n\nAs of the end of the third quarter, Buffett owned 107 million shares of Nu Holdings (NYSE:NU), a Latin American fintech company.\n\nNu is growing rapidly while generating huge profits. Last quarter, it added a net total of 5.4 million new customers, and it became Brazil’s ” fourth-largest financial institution by number of customers,” according to the firm. Its average revenue per customer jumped 18% versus the same period a year earlier, while its overall top line, excluding foreign currency fluctuations, soared 53% year-over-year to $2.1 billion. Finally, its net income, excluding some items, jumped to $355.6 million from $63.1 million in Q3 of 2022.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nAt least two billionaires besides Buffett owned NU stock as of the end of Q3, with both Daniel Sundheim and Lee Ainslie buying sizeable amounts of the shares.\n\nGiven the company’s very rapid growth, its 25.4 forward price-earnings ratio makes it one of the most undervalued. Warren Buffett stocks.\n\nBank of America (BAC) Street view on Bank of America branch in NYC with people waiting, pedestrians crossing, crosswalk, bike, road in Manhattan\n\nSource: Andriy Blokhin / Shutterstock.com\n\nAs of the end of Q3, Buffett owned 1.03 billion shares of Bank of America (NYSE:BAC) stock. The Oracle is one of the relatively few large investors who are fond of BAC, as many mutual funds are under weight the shares while a multitude of hedge funds are shorting it, Goldman Sachs reported earlier this month.\n\nStory continues\n\nNonetheless, after the Federal Reserve on Dec. 13 indicated that it was poised to cut interest rates three times next year, I expect BAC to have a great 2024. That’s because the bank’s shares have been in the dog house on Wall Street due to the fact that much of its balance sheet consists of bonds whose value has been pummeled as a result of interest rate increases.\n\nBut now, with the Fed turning quite dovish, rates are sinking, causing bonds’ value to surge. Furthermore, the latter phenomenon, in turn, should do wonders for BAC’s popularity on Wall Street.\n\nIndeed, in the month that ended on Dec. 14, BAC climbed 8.5%.\n\nNevertheless, the shares, which have a significant dividend yield of 3%, still have an extremely low price-earnings ratio of nine.\n\nHP (HPQ) HP sign with blue sky and autumn leaves as backdrop\n\nSource: Shutterstock\n\nBuffett has cut his holdings in HP (NYSE:HPQ) stock by almost 60% in recent months. The multi-billionaire, however, still has a 5% stake in the firm that’s now worth $1.6 billion.\n\nAnd for income investors and conservative investors, I view HPQ stock as a good pick at this point.\n\nResearch firm Canalysis predicting that PC sales will climb by 5% in Q4 and 8% in 2024,. That phenomenon would certainly improve HP’s financial performance. What’s more, the AI revolution is widely expected to cause PC sales to surge, as PCs with localized AI capabilities become popular.\n\nDespite these significant, positive drivers, HPQ stock, which has a meaningful dividend yield of 3.65%, has a very low forward price-earnings ratio of 8.65 times. If you plan on investing in undervalued Warren Buffett stocks, start here.\n\nOn the date of publication, Larry Ramer did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nLarry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been PLUG, XOM and solar stocks. You can reach him on Stocktwits at @larryramer.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post The 3 Most Undervalued Warren Buffett Stocks to Buy in December appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-most-undervalued-warren-buffett-192147955.html", "symbols": ["7HP.F", "7HP.STU", "7HP.XETRA", "BAC.US", "HPQ.MX", "HPQ.US", "MSC.US", "NU.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.019, "neu": 0.857, "pos": 0.124}}, {"date": "2023-12-14T19:04:31+00:00", "title": "The Fed took 'the lid off' market concerns, fueling stock market rally", "content": "The Federal Reserve laid out an ideal scenario for investors on Wednesday.\n\nInflation is falling faster than initially thought. More interest rate cuts than previously expected are on the horizon. And the economy, while cooling from its too-hot pace, is still growing.\n\nIn other words, a soft landing is in sight, and investors have taken that to mean it's time to go fishing in stocks that had previously been hammered by fears of higher interest rates.\n\nThe interest rate sensitive Real Estate sector is leading the market action on Thursday, rising more than 2.5%. The Russell 2000 (^RUT), which had reversed all of its post-pandemic gains earlier this year over fears of higher rates, is now up more than 11% in the last month alone.\n\nThe S&P regional bank index (KRE) has risen more than 20% over the past the month, including a nearly 5% gain on Thursday. Cathie Wood's flagship Ark Innovation ETF (ARKK) is up north of 3% on Thursday alone.\n\nMany of those areas of the market have already surged through November amid stocks' best month since 2022, but now as the path to rate cuts has become even more clear, they're keeping momentum into December too.\n\nPowell's comments on Wednesday \"took the lid off the market's concerns,\" CFRA's chief investment strategist Sam Stovall told Yahoo Finance Live. And now, Stovall says, the market \"has further to run.\"\n\nThe moves have brought the major averages near record highs. The Dow Jones Industrial Average (^DJI) gained nearly 500 points on Wednesday, breaching 37,000 for the first time. The S&P 500 (^GSPC) is back above 4,700 and closing in on its January 2022 record high of 4,796.\n\nAnd within the indexes, single-stock moves have stood out for companies that have struggled throughout 2023. Shares of Bank of America (BAC) and Goldman Sachs (GS) had both been down double digits this year at the end of October. Now they're in the green for 2023 as shares in both major banks popped about 5% on Thursday alone.\n\nStory continues\n\n\"Not surprisingly, Financials and Real Estate have been on the top because those are the ones that had been pressured the most because of the higher rates,\" Stovall said.\n\nThe moves fall in line with what some of Wall Street's most bullish strategists had flagged over the past month in 2024 outlooks.\n\nBMO's Brian Belski placed Financials as an Overweight amid his call for the S&P 500 to hit 5,100 in 2024.\n\n\"There is no denying that most institutional and global investors are very underexposed and have been overemphasizing the negative 'what-ifs,'\" Belski wrote.\n\nThe \"what-ifs\" include things like credit blowups, real estate meltdowns, expansive loan losses, and unmanageable consumer debt, but Belski said that they all seem \"well telegraphed and well-managed by companies\" and that the \"sector is well-positioned and is poised to outperform and thrive.\" A man sits on the Wall street bull near the New York Stock Exchange (NYSE) on Nov. 24, 2020, in New York City. (Spencer Platt/Getty Images) (Spencer Platt via Getty Images)\n\nThursday's market action has spanned beyond standard sector action too.\n\nA quick look at Yahoo Finance's trending tickers page shows some of the most popular names on the website amid the current market rally are 2021 favorites like Carvana (CVNA), Plug Power (PLUG), and Lucid (LCID).\n\nAll of those stocks are well off their 2021 highs. But amid the Fed euphoria, they're catching a bid on Thursday.\n\nJosh Schafer is a reporter for Yahoo Finance.\n\nClick here for the latest economic news and indicators to help inform your investing decisions.\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/the-fed-took-the-lid-off-market-concerns-fueling-stock-market-rally-190431047.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "CV0.F", "CVNA.US", "DJI.INDX", "GOS.F", "GOS.XETRA", "GS-PA.US", "GS-PC.US", "GS-PD.US", "GS-PK.US", "GS.MX", "GS.US"], "tags": [], "sentiment": {"polarity": 0.978, "neg": 0.064, "neu": 0.832, "pos": 0.103}}, {"date": "2023-12-14T17:06:45+00:00", "title": "13 Penny Stocks that Captured the Attention of Billionaires", "content": "In this article, we will take a detailed look at the13 Penny Stocks that Captured the Attention of Billionaires. For a quick overview of such stocks, read our article5Penny Stocks that Captured the Attention of Billionaires.\n\nInvestors are jubilant after the Fed’s clear signal that it would begin cutting interest rates in 2024. Markets have remained under pressure due to uncertainty caused by higher interest rates. While many believe we are still not out of the woods, the Fed’s acknowledgement that its efforts against inflation are working and its readiness to take a dovish stance is enough to soothe investors’ nerves in the short term.\n\nBut will stocks keep rebounding in 2024? Will socks rise after the Fed actually starts to cut interest rates? An interesting report from LPL Research takes a look at the behavior of equities during interest rate cuts. The report said that while assessing or predicting stock movements driven by interest rate cuts, it’s extremely important to pay attention to where we actually are in the business cycle. For example, the report said that when the Fed began to cut rates after series of hikes in January 2001 and September 2007, the economy entered recessions. However, rate cuts of 1984, 1987, 1989, 1995, and 1998 saw the S&P 500 significantly rise over the next six to 12 months.\n\nA report by Meeder Investment Management takes an interesting look at the effect of rate cuts on stocks and whether it makes sense to be overly bullish on stocks on expectations of rate cuts next year.\n\n\"One common perception among investors is that the stock market will perform well once the Fed starts cutting interest rates. History tells us this is not necessarily always the case. In fact, over the past nine initial interest rate cuts, more than half of the Fed’s first cuts were followed by declines in the S&P 500 Index ranging from -22.6% to -55.5%. The Technology bubble in the early 2000s and the Great Financial Crisis proved to be the worst scenarios, with the Fed cutting interest rates at two different times during the secular bear market of 2000–2009. On the other hand, four of the nine occurrences were followed by minimal weakness and achieved strong 6-month returns. On balance, over the past nine initial interest rate cuts, the S&P 500 Index had an average decline of -20.5% and an average 6-month return of 3.4%. So while the market has experienced both bull markets and bear markets following the first rate cut, history does not indicate that the Fed’s accommodative policy will simply carry the market higher. Valuations matter too. When the market had a decline of at least -20% after the Fed’s first cut, the average S&P 500 trailing PE ratio was 18. On the other hand, when the S&P 500 had a decline of less than -10%, the average PE ratio was 11.4. The current P/E ratio of 22 could be another reason to be more cautious once the Fed makes its first cut.\"\n\nStory continues\n\nRisky stocks were ruthlessly shunned by investors when the inflation storm forced the Fed to take a hawkish stance. The market was more gravitated towards safe stocks like Coca-Cola Co (NYSE:KO), Bank of America Corp (NYSE:BAC) and Kroger Co (NYSE:KR). But as investors begin to look towards the era of rate cuts and monetary ease, small companies might see a rebound in investor interest in the coming weeks and months. In this environment, it makes sense to see which penny stocks are bought by smart money investors. Best Penny Stocks According to Billionaires\n\nPhoto by Kaleidico on UnsplashMethodology\n\nFor this article we scanned Insider Monkey's database of billionaire-owed stocks and picked 13 penny stocks (trading under $5) with the highest number of billionaire investors. These penny stocks are popular among smart money investors and thus deserve investor attention.\n\n13. Banco Bradesco SA (NYSE:BBD)\n\nNumber of Billionaire Investors: 9\n\nBrazilian financial services company Banco Bradesco SA (NYSE:BBD) ranks 13th in our list of the best penny stocks to buy now according to billionaire investors.\n\nA total of 9 billionaires tracked by Insider Monkey had stakes in Banco Bradesco SA (NYSE:BBD) as of the end of September this year. Some notable shareholders of Banco Bradesco SA (NYSE:BBD) included hedge funds of Ken Fisher, Howard S. Marks, Israel Englander and Ken Griffin.\n\n12. Medical Properties Trust Inc (NYSE:MPW)\n\nNumber of Billionaire Investors: 9\n\nMedical Properties Trust Inc (NYSE:MPW) is a REIT focused on healthcare facilities. The stock is down by over 50% year to date through December 12. The stock has a dividend yield of over 12%. In November, Stifel downgraded the stock to Hold from Buy amid concerns that Medical Properties Trust Inc’s (NYSE:MPW) problems would increase in a high interest rate environment.\n\n\"The higher for longer interest rate environment and the overall difficulty in getting credit is increasing the likelihood of additional tenant credit issues,\" Stifel analyst Stephen Manaker wrote in a note.\n\nAs of the end of the third quarter of 2023, some notable billionaires having stakes in Medical Properties Trust Inc (NYSE:MPW) are Philippe Laffont, Israel Englander and Cliff Asness. Unlike Coca-Cola Co (NYSE:KO), Bank of America Corp (NYSE:BAC) and Kroger Co (NYSE:KR), Medical Properties is a small company with some risks involved.\n\nMiller Value Income Strategy made the following comment about Medical Properties Trust, Inc. (NYSE:MPW) in its Q3 2023 investor letter:\n\n“Medical Properties Trust, Inc. (NYSE:MPW) was the top detractor during the quarter. The health care real estate investment trust (REIT) reported 2Q23 revenue of $337.4MM, -15.7% Y/Y, below consensus of $351.3M, and Normalized Funds from Operations (FFO) per share of $0.48, +4.3% Y/Y, ahead of consensus of $0.38. The company ended the quarter with total debt of $10.3B and an Adjusted Net Debt to Adjusted Annualized Earnings Before Interest, Taxes, Depreciation, and Amortization for Real Estate (EBITDAre) ratio of 6.8x, compared to 6.3x at the end of 2Q22. The company announced an updated capital allocation strategy going forward, which includes: i) a ~48% quarterly dividend cut to $0.15/share (11.0% annualized yield), ii) the pursuit of refinancing, asset sales, and joint[1]venture opportunities that bolster liquidity and enable the repayment of debt, and iii) a reduction in discretionary operating expenses and other costs for better alignment with the expected decrease in the company’s asset base and near-term acquisition activities. Management also continues to target a long-term Net Debt to Adjusted EBITDAre leverage ratio of 5-6x. Management revised FY23 guidance for normalized FFO/share of $1.55 (vs. prior guidance of $1.58), or a P/FFO of 3.5x.”\n\n11. Opendoor Technologies Inc (NASDAQ:OPEN)\n\nNumber of Billionaire Investors: 9\n\nOnline real estate platform company Opendoor Technologies Inc (NASDAQ:OPEN) ranks 11th in our list of the penny stocks that captured the attention of billionaires this year. As of the end of the third quarter of 2023, 9 billionaire-led hedge funds reported having stakes in Opendoor Technologies Inc (NASDAQ:OPEN). The biggest stakeholder of Opendoor Technologies Inc (NASDAQ:OPEN) was Daniel Patrick Gibson’s Sylebra Capital Management which owns a $69 million stake in Opendoor Technologies Inc (NASDAQ:OPEN).\n\nOpendoor Technologies Inc (NASDAQ:OPEN) is one of the best-performing stocks in 2023, having gained about 226% year to date.\n\n10. Dish Network Corp (NASDAQ:DISH)\n\nNumber of Billionaire Investors: 10\n\nDish Network Corp (NASDAQ:DISH) fell in November after weak Q3 results and its CEO’s departure. Dish Network Corp (NASDAQ:DISH) recently said it appointed Hamid Akhavan as president and CEO in addition to his current role as CEO and president of EchoStar.\n\n9. Lufax Holding Ltd - ADR (NYSE:LU)\n\nNumber of Billionaire Investors: 10\n\nChinese personal finance services company Lufax Holding Ltd - ADR (NYSE:LU) was in 10 billionaire-led hedge fund portfolios as of the end of the third quarter of 2023.\n\n8. Compass Inc (NYSE:COMP)\n\nNumber of Billionaire Investors: 10\n\nResidential real estate brokerage company Compass Inc (NYSE:COMP) ranks 8th in our list of the penny stocks that remained on billionaires’ radar this year. A total of 10 billionaires tracked by Insider Monkey had stakes in Compass Inc (NYSE:COMP).\n\nThe company during Q3 earnings call talked about how it's using AI to optimize its business:\n\nRecently, we’ve further enhanced that offering by integrating the ChatGPT API into Compass AI, which has already proved to be a game changer for our agents. For those of you who have used AI, you know this technology has seemingly unlimited potential. But it is only as good as the data and you want to context from which it draws.\n\nCompass As is custom built to support real estate agents and over time will be supercharged by a vast amount of proprietary Compass data drawn from our hundreds of thousands of transactions, which is a major competitive advantages over other brokerages. Right now, Compass AI is already augmented with smart, real estate-specific system prompts, as well as contacts taking directly from her proprietary platform data set. And in the future, Compass AI is poised to become a personalized solution trained to a proprietary data and customizable by our agent users. This is a significant advantage for Compass agents compared to agents at other brokerages who typically use general purpose solutions or otherwise search public databases for best practices.\n\nRead the entire earnings call transcript here.\n\n7. Altice USA Inc (NYSE:ATUS)\n\nNumber of Billionaire Investors: 10\n\nAltice USA Inc (NYSE:ATUS) got hammered this year, losing about 50%. The stock was spotted in 10 billionaire-led hedge fund portfolios. Cliff Asness and Israel Englander were notable billionaires with stakes in Altice USA Inc (NYSE:ATUS) as of the end of the third quarter of 2023. However, the biggest stakeholder of Altice USA Inc (NYSE:ATUS) was Jonathan Kolatch’s Redwood Capital Management which had a $52 million stake in Altice USA Inc (NYSE:ATUS).\n\n6. Petco Health and Wellness Company Inc (NASDAQ:WOOF)\n\nNumber of Billionaire Investors: 10\n\nPetco Health and Wellness Company Inc (NASDAQ:WOOF) sells pet food and services. The stock ranks 6th in our list of the penny stocks that captured the attention of billionaires. Recently, Goldman Sachs in its Equity Research report issued a list of out of favor stocks it believes could rebound early next year. Petco Health and Wellness Company Inc (NASDAQ:WOOF) was one of these stocks.\n\nAs of the end of the September quarter of 2023, 10 billionaire-led hedge funds reported owning stakes in Petco Health and Wellness Company Inc (NASDAQ:WOOF). Unlike Coca-Cola Co (NYSE:KO), Bank of America Corp (NYSE:BAC) and Kroger Co (NYSE:KR), Petco is a risky stock with growth catalysts.\n\nClick to continue reading and see 5 Penny Stocks that Captured the Attention of Billionaires.\n\nSuggested Articles:\n\n16 Best Penny Stocks To Buy For 2024 13 Hot Penny Stocks To Buy According to Hedge Funds 10 Best Debt Free Penny Stocks To Buy Now\n\nDisclosure. None.13 Penny Stocks that Captured the Attention of Billionaireswas initially published on Insider Monkey.", "link": "https://finance.yahoo.com/news/13-penny-stocks-captured-attention-170145567.html", "symbols": ["15PA.F", "ATUS.US", "BAC.US", "BBD.BA", "BBD.US", "BBDC3.SA", "BBDC4.SA", "BBDO.US", "BRE.F", "BREC.F", "CCC3.F", "CCC3.XETRA", "COCA34.SA", "COMP.US", "DISH.US", "EOT.F", "GSPC.INDX"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.043, "neu": 0.838, "pos": 0.119}}, {"date": "2023-12-14T16:20:56+00:00", "title": "Wall Street Giants Reclaim Top Equities League Table Rankings", "content": "(Bloomberg) -- Wall Street reclaimed the top spots in the global equity underwriting league tables from Chinese banks as initial public offerings slowed on the mainland, leaving US firms to make the most of an anemic share sale market elsewhere.\n\nMost Read from Bloomberg\n\nWall Street Traders Go All-In on Great Monetary Pivot of 2024 Range Rovers Become Thief-Magnets, Causing Prices to Tumble Citigroup Offers Partial Early Bonuses to Encourage Staff Departures Owner of the Philippines’ Largest Malls Says China Feud May Hurt Businesses Elon Musk Is Planning a New University in Austin\n\nGoldman Sachs Group Inc. rose to the top of rank for equity and equity-linked underwriting as it dished out shares in many of the biggest new offerings, according to league table data compiled by Bloomberg. Bank of America Corp. and JPMorgan Chase & Co. also returned to the top three as Chinese state-backed brokerage Citic Securities Co. ceded its number one ranking, though it retained its leading position in global IPO underwriting.\n\nDespite equity capital markets around the world being dogged by interest rate hikes, two wars and debate over a potential recession, roughly $516 billion was raised across IPOs, secondaries and the red-hot convertible bond market, data compiled by Bloomberg show. Goldman Sachs was credited with an 8.3% market share, underwriting about $41 billion in offerings globally.\n\nRead More: PG&E’s $2 Billion Convertible Bond Shows Revival in Full Swing\n\nGoldman comes in ahead of Wall Street rivals Bank of America — credited with $38.9 billion — and JPMorgan with $36 billion. The ranking consists of underwriting for equities and equity-linked instruments issued globally, such as share placements and convertible bonds.\n\nAfter topping the global equity league tables in 2022, Chinese banks’ deal activity slumped starting in late August when regulators moved to support ailing markets with measures including slowing IPO approvals. Citic Securities fell in this year’s league table to the sixth spot, while previously fifth-ranked China International Capital Corp. dropped to eighth.\n\nStory continues\n\nRead More: Chinese Banks Drop Out of Top Five Global Equity Underwriters\n\nThe restrictions resulted in active IPO applications to plunge to 353 on Nov. 13 from close to 800 just two months earlier, opening the door for international firms like JPMorgan and others to take global underwriting market share from Chinese brokers, said Sharnie Wong, an analyst with Bloomberg Intelligence in Hong Kong.\n\n“China could see its IPO pipeline squeezed further amid regulatory caution on vetting new listings in order to bolster secondary-market activity,” according to Wong.\n\nGoldman Sachs was an underwriter on several of the year’s biggest equities deals. In addition to helping lead IPOs for Arm Holdings Plc and Kenvue Inc., it helped offload billions in secondary sales including those for Japan Post Bank Co Ltd. and AerCap Holdings NV.\n\nOverall, equity linked products like convertible bonds saw issuance top $108 billion in 2023, a roughly 20% rise versus the previous year, according to data compiled by Bloomberg. Bank of America led the global equity-linked league table and is credited with more than a 10% table share, working on deals from household names like PG&E Corp., Uber Technologies Inc., and Duke Energy Corp.\n\nEven as global equity markets rallied, just $25.4 billion was raised in US IPOs this year, a modest bump from last year’s tepid volume but a 92% plunge from 2021’s boom, data compiled by Bloomberg show. JPMorgan played a role in the five largest US IPOs, making it the highest ranking player in the global IPO league table among non-Chinese firms.\n\nIn Europe, the Middle East and Africa, first-time share sale volumes are set to end the year at their lowest level since 2012, data compiled by Bloomberg show, despite a burgeoning Middle Eastern IPO market. Bank of America led the equity, equity-linked and rights offerings league table for the region with $10.3 billion worth of deals, the data show.\n\nRead More: Dubai’s Latest IPO Record Shows Investor Appetite Is Unwavering\n\nChinese IPO activity held up better than in most regions despite the regulatory clampdown, with $55 billion raised on mainland exchanges. Citic Securities, China Securities and CICC constituted the top three members of the global IPO ranking for the second year running, with China Securities pulling ahead of CICC to claim second place.\n\nThe three firms capitalized on dozens of offerings during the summer when activity elsewhere was tame. More impressively, they held onto their top rankings despite the sharp decline in IPOs in the final four months of the year when new issuance in China plunged.\n\n--With assistance from Filipe Pacheco and Pei Li.\n\nMost Read from Bloomberg Businessweek\n\nSBF’s Lawyer Says His Client Was the ‘Worst’ Ever Under Cross Examination Vanguard Is Closer Than Ever to Ending BlackRock’s ETF Reign Elon Musk May Have Met His Match in Sweden How Lab-Grown Chicken Became Another Expensive Silicon Valley Mess Romanian Sweater Maker Bucks Fashion Trends to Go It Alone\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/wall-street-giants-reclaim-top-162056931.html", "symbols": ["3908.HK", "600030.SHG", "6030.HK", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "CI9.F", "CIIHF.US", "CIIHY.US", "CIM.F", "CNICF.US", "GOS.F", "GOS.XETRA", "GS-PA.US", "GS-PD.US"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.022, "neu": 0.885, "pos": 0.093}}, {"date": "2023-12-14T12:39:39+00:00", "title": "Why SoFi Technologies, Bank of America, and Fifth Third Bancorp Stocks Rallied on Wednesday", "content": "Old bank sign engraved in stone or concrete above the door of financial building\n\nShares of several bank stocks rallied on Wednesday after U.S. Federal Reserve officials signaled an end to the central bank's rate hikes. When all was said and done on Wednesday, SoFi Technologies(NASDAQ: SOFI) was up 12.5%, Bank of America(NYSE: BAC) had risen 4.2%, and Fifth Third Bancorp(NASDAQ: FITB) closed up 6% for the session. Several other major bank stocks followed suit with more conservative pops amid a broader market rally; both the S&P 500 and Nasdaq Composite indexes jumped more than 1.3% on Wednesday.\n\nIn the U.S. Federal Reserve's final meeting of 2023, Fed officials opted to leave the central bank's benchmark interest rate flat at a targeted range of between 5.25% and 5.5%. This was the third straight monthly decision in which rates were left unchanged -- albeit following an unprecedented cycle of 11 rate hikes since the Fed began raising rates in March 2022.\n\nWhat's more, policymakers on the Federal Open Market Committee signaled on Wednesday there will be at least three rate cuts in 2024, likely in quarter-percentage-point increments.\n\nWhy lower rates are a mixed bag for bank stocks\n\nSo why, then, are bank stocks rallying in response? After all, higher interest rates are widely viewed as a positive catalyst for banks. The country's leading banks can generally increase profits by taking advantage of greater spreads between the interest paid to customers and the money they can make by investing those customers' funds.\n\nAt the same time, with the fed funds rate now hovering at its highest level in over 22 years, the Federal Reserve's decision to increase interest rates at an unprecedented pace was aimed at easing runaway inflation, which has dampened consumer spending, borrowing activity, and broader economic growth. While banks can undoubtedly leverage higher rates to some extent, investors are right to celebrate the prospect of spurring greater economic activity as the rate-hike cycle begins to reverse course.\n\nStory continues\n\nNot every bank will win as rates come down\n\nWednesday's broader market rally undoubtedly helped fuel gains for several beaten-down bank stocks. But make no mistake: Not all banks are created equal. That could be a big reason SoFi Technologies, in particular, is enjoying outsize gains right now.\n\nIndeed, I singled out SoFi back in July given its cutting-edge technological foundations and notable lack of physical branches. SoFi is a vertically integrated, digital-first fintech stock that not only obtained a national bank charter in early 2022, but also recently launched banking-as-a-service platform Cyberbank Digital in late 2022.\n\nGiven its digital-first, mobile-centric approach, SoFi has been able to attract hundreds of thousands of new customers and multiple billions of dollars in new deposits for each of the past several quarters; SoFi added 717,000 new members last quarter alone, bringing its total to over 6.9 million, while deposits at SoFi Bank grew by $2.9 billion, up 23% sequentially between the second and third quarters to $15.7 billion. This swelling deposit base provides SoFi with a lower-cost funding source for its fast-growing loan business, while simultaneously allowing it to maximize net interest margin by holding loans on the balance sheet longer than it could before receiving its bank charter.\n\nMeanwhile, Bank of America's deposit base remained relatively flat sequentially last quarter, albeit at a much larger base of roughly $1.88 trillion. Fifth Third Bank's deposits rose a modest 2% sequentially in Q3, to $165.6 billion.\n\nBut SoFi's true strength could become even more evident as the Fed begins to reduce rates in 2024. During an earnings conference call earlier this year, SoFi CEO Anthony Noto asserted that as rates inevitably begin to decline, his company should \"be able to hold rates much longer and higher than our competitors and really gain even more market share.\"\n\nThe Federal Reserve's latest move to hold rates steady while signaling multiple rate reductions in 2024 is undoubtedly a net positive for bank stocks right now. But rather than spreading my investments across multiple banks' shares, I'm personally content concentrating my capital on up-and-coming bank stocks like SoFi that are poised to enjoy relative outperformance as the Fed's new rate cycle takes hold.\n\nShould you invest $1,000 in SoFi Technologies right now?\n\nBefore you buy stock in SoFi Technologies, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and SoFi Technologies wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of December 11, 2023\n\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Steve Symington has positions in SoFi Technologies and has the following options: long January 2024 $15 calls on SoFi Technologies. The Motley Fool has positions in and recommends Bank of America. The Motley Fool has a disclosure policy.\n\nWhy SoFi Technologies, Bank of America, and Fifth Third Bancorp Stocks Rallied on Wednesday was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/why-sofi-technologies-bank-america-123939080.html", "symbols": ["BAC.US", "FITB.US", "SOFI.US"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.036, "neu": 0.866, "pos": 0.099}}, {"date": "2023-12-14T00:00:00+00:00", "title": "The 3 Most Undervalued Warren Buffett Stocks to Buy in December", "content": "Buffett excels at finding quality names that pay dividends and appreciate in value. Here are three very undervalued Warren Buffett stocks. ", "link": "https://investorplace.com/2023/12/the-3-most-undervalued-warren-buffett-stocks-to-buy-in-december/", "symbols": ["BAC.US", "HPQ.US"], "tags": [], "sentiment": {"polarity": 0.802, "neg": 0.052, "neu": 0.63, "pos": 0.319}}, {"date": "2023-12-14T00:00:00+00:00", "title": "Why Are Bank Stocks Up Today?", "content": "Bank stocks are up today and investors wonder why have come to the right place as we have a detailed explanation for the rally!", "link": "https://investorplace.com/2023/12/why-are-bank-stocks-up-today/", "symbols": ["BAC.US", "C.US", "FITB.US", "JPM.US", "WFC.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-12-13T20:44:35+00:00", "title": "3 Lithium Stocks to Turn $5,000 Into $1 Million: December 2023", "content": "Supply issues crushed lithium stocks. However, as I noted on Dec. 5, “the fear is creating a massive opportunity for patient investors.” I also said, “I’d use the temporary, excessive fear as an opportunity.” That’s because the pullback was ridiculously overdone. Sure, supply issues still exist. But down the line, we won’t have enough supply to meet growing demand.\n\nRemember, as noted by Morningstar, “rising electric vehicle adoption and the increasing buildout of energy storage systems will keep lithium demand growing to surpass 1 million metric tons in 2024, from 800,000 in 2022, eventually hitting 2.5 million metric tons by 2030. While we see rising supply, we think enough projects will face delays to maintain a market deficit as demand grows.”\n\nPlus, the biggest lithium producers in the world are still bullish on lithium. In fact, as noted by Reuters, “In calls with investors and analysts in recent days, lithium producers said they saw the market volatility as short term, adding that they expect electrification to keep growing.”\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThat said, I’d still buy lithium stocks on weakness.\n\nAlbemarle (ALB) Albemarle (ALB) logo on a mobile phone screen\n\nSource: IgorGolovniov/Shutterstock.com\n\nThe last time I mentioned Albemarle (NYSE:ALB), the industry’s 800 lb. gorilla had plunged to a low of $123.38 on Nov. 29. It was also trading at six times earnings at the time, I noted, and at less than half of growth. None of which was sustainable.\n\nSince then, ALB bounced back to about $128 and could refill its bearish gap around $170. Helping, Bank of America (NYSE:BAC) just upgraded ALB to a Neutral rating, noting the stock is undervalued. I’m not sure what took them so long, but it’s good to see they’re waking up. I also expect other firms to start jumping on the bullish ALB bandwagon again shortly.\n\nBetter, while we wait for ALB to recover lost ground, we can collect its 1.2% yield.\n\nLivent (LTHM) Livent Corporation logo on a phone screen. LTHM stock.\n\nSource: Ralf Liebhold / Shutterstock\n\nStory continues\n\nI also mentioned Livent (NYSE:LTHM) on Nov. 29, noting, “it’s wildly over-extended on relative strength (RSI), MACD and Williams’ %R. [Plus], according to the company, it still expects to see ‘significantly improved performance versus 2022.’”\n\nAt the time, LTHM just slipped to $13.54. It’s now up to $14.69. From here, I’d like to see it initially retest prior resistance around $19.\n\nWhile JPMorgan (NYSE:JPM) and Piper Sandler lowered their ratings on the LTHM stock in recent days, that’s a bad call, in my opinion. With the lithium price pullback being a temporary event, investors should take full advantage of the weakness here and with other beaten-down lithium stocks. We also have to consider LTHM trades at 20% growth at the moment, too.\n\nAmerican Lithium (AMLI) a lithium mine, ATLX stock\n\nSource: Shutterstock\n\nThere’s also American Lithium (NASDAQ:AMLI), which plunged to a low of $1. Now up to $1.10, I still believe there’s good potential here. For one, it recently submitted an environmental impact assessment study for its Falchani lithium project in Peru, hoping for near-term approval.\n\nEven better, AMLI “raised its estimates for the Falchani project by 476% from 2019, saying it could hold 5.53M metric tons of lithium carbonate equivalent, which would make it one of the world’s largest hard-rock lithium projects,” as noted by Seeking Alpha.\n\nWhile its chart is nothing to write home about, this potentially lucrative Peru project could provide a massive upside catalyst.\n\nOn the date of publication, Ian Cooper did not hold (either directly or indirectly) any positions in the securities mentioned. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nIan Cooper, a contributor to InvestorPlace.com, has been analyzing stocks and options for web-based advisories since 1999.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The #1 AI Investment Might Be This Company You’ve Never Heard Of The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 3 Lithium Stocks to Turn $5,000 Into $1 Million: December 2023 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-lithium-stocks-turn-5-204435694.html", "symbols": ["8LV.F", "ALB.US", "AMC.F", "AMLI.US", "BAC.US", "JPM.US", "LTHM.US"], "tags": [], "sentiment": {"polarity": 0.985, "neg": 0.047, "neu": 0.869, "pos": 0.083}}, {"date": "2023-12-13T10:06:00+00:00", "title": "Warren Buffett Is Raking In Nearly $3.5 Billion in Annual Dividend Income From Just 4 Stocks", "content": "Buffett13 TMF\n\nIt's safe to say that Berkshire Hathaway(NYSE: BRK.A)(NYSE: BRK.B) CEO Warren Buffett knows a thing or two about investing. In his 58 years at the helm, he's overseen a greater than 4,300,000% aggregate gain in Berkshire's Class A shares (BRK.A), as well as doubled up the annualized total return, including dividends, of the widely followed S&P 500.\n\nLengthy books have been written on the core philosophies the Oracle of Omaha lives by, which includes thinking long-term and buying into great businesses with sustained catalysts at a fair price. Berkshire Hathaway CEO Warren Buffett. Image source: The Motley Fool.\n\nBut what doesn't receive nearly enough credit for Buffett's nearly six decades of investment success is his penchant for buying dividend stocks. Companies that pay a regular dividend to their shareholders are usually profitable and time-tested. What's more, income stocks have a history of running circles around public companies that don't offer a payout in the return department.\n\nA majority of the stocks currently held by Berkshire Hathaway pay a dividend, with Buffett's company set to collect close to $6 billion in income over the coming 12 months.\n\nBut what's truly surprising is how much of this income will derive from a small number of holdings. Warren Buffett and his team are set to rake in nearly $3.5 billion in annual dividend income from just four stocks over the next year.\n\nBank of America: $991,537,926 in annual dividend income\n\nBerkshire Hathaway's No. 2 holding by market value, Bank of America(NYSE: BAC), will be doing the heaviest lifting of all when it comes to providing dividend income. The more than 1.03 billion shares Buffett's company owns of BofA will translate into almost $992 million in dividend income over the next 12 months.\n\nThe lure of bank stocks for Buffett has always been their cyclical ties and the recurring need for financial services. Though banks are cyclical, and will therefore contend with higher delinquency rates and loan losses during recessions, periods of economic expansion last considerably longer than downturns. Rather than foolishly trying to time when these downturns will occur, Buffett has wisely positioned Berkshire Hathaway in high-quality financial stocks, like BofA, to take advantage of long-winded expansions.\n\nStory continues\n\nBut there's more to Berkshire's No. 2 holding than just macroeconomic factors. Bank of America is also the most interest rate-sensitive of America's largest banks by assets. When interest rates change, no bank is more impacted than BofA.\n\nSince March 2022, the nation's central bank has increased the federal funds rate by 525 basis points, which is the fastest pace of rate hikes in more than four decades. Every rate hike is leading to billions of dollars in added net interest income each quarter.\n\nAs I've previously pointed out, BofA has done an admirable job of digitizing its platform. Online and mobile-based transactions are considerably cheaper than in-person interactions. As more of its customers utilize digital transactions, Bank of America will be able to consolidate some of its physical branches and lower its expenses.\n\nApple: $878,937,967 in annual dividend income\n\nPerhaps it comes as no surprise that tech stockApple(NASDAQ: AAPL) plays a key role in Berkshire Hathaway's dividend income collection. Apple accounted for 49% of the company's nearly $366 billion of invested assets as of the closing bell on Dec. 8, 2023, making it the biggest holding by a considerable amount in Buffett's portfolio.\n\nThe $15 billion Apple is doling out in dividends annually is a reflection of its top-notch branding, as well as its cutting-edge innovation.\n\nAccording to Kantar's 2023 BrandZ Rankings, Apple is the world's most valuable brand. It has an exceptionally loyal customer base, along with phenomenal pricing power. Meanwhile, Interbrand has listed Apple as the world's \"best brand\" for 11 consecutive years.\n\nBeyond brand value, Apple is riding high thanks to its innovation. It's been a leading provider of smartphones for more than a decade, and it's led the way with tablets via the iPad. Moreover, CEO Tim Cook is overseeing the steady transition of Apple into a platforms-focused company. A subscription-driven model will further enhance customer loyalty and meaningfully improve the company's operating margin over the long term.\n\nI'd be remiss if I didn't also mention Apple's unsurpassed capital-return program. In addition to its massive nominal-dollar dividend, Apple has repurchased in excess of $600 billion worth of its common stock since the start of 2013. Buffett has always appreciated a rock-solid share-buyback program. Image source: Getty Images.\n\nOccidental Petroleum: $843,396,739 in annual dividend income (including preferred stock dividends)\n\nBuffett and his team will be raking in a boatload of dividend income from energy stockOccidental Petroleum(NYSE: OXY) over the next 12 months, with this income coming from two separate channels.\n\nBerkshire Hathaway is expected to receive $164.2 million in dividend income from the nearly 228.1 million shares of Occidental common stock it owns. Every single share of common stock has been purchased since the start of 2022.\n\nBuffett's company also holds $8.49 billion of preferred stock in Occidental yielding 8% that'll generate around $679.2 million in annual income. Berkshire originally held $10 billion in preferred stock tied to a 2019 deal that helped Occidental acquire Anadarko. However, Occidental has redeemed $1.51 billion of this preferred position, through Nov. 7.\n\nWhat makes Occidental such an attractive investment to Buffett and his team is the expectation that the spot price of crude oil will remain above its historic average. Supporting this thesis is Russia's war with Ukraine, along with three years of capital underinvestment by energy companies caused by the COVID-19 pandemic. As long as crude oil supply remains tight, there's a good likelihood that the spot price of crude oil will stay elevated.\n\nA higher spot price for crude oil is especially important for Occidental Petroleum. Although it's an integrated energy company, it generates the lion's share of its revenue from its drilling operations. This is to say that if the spot price of crude oil increases, Occidental's operating cash flow will benefit more than most other integrated oil and gas operators. Just keep in mind that the reciprocal would also be true -- a declining spot price for crude oil will disproportionately hurt Occidental's operating cash flow.\n\nCoca-Cola: $736,000,000 in annual dividend income\n\nThe fourth stock that, collectively with Bank of America, Apple, and Occidental Petroleum, allows Buffett to rake in nearly $3.5 billion in annual dividend income is beverage stock Coca-Cola(NYSE: KO). Coca-Cola has raised its base annual payout for 61 consecutive years, and it's Berkshire's longest continuous holding (since 1988).\n\nOne reason Coke is such a phenomenal income producer is that it's a consumer staples stock. Regardless of how well or poorly the U.S. and global economy perform, consumers are going to need food and beverages. This creates a predictable demand floor for Coca-Cola each year.\n\nBranding is another catalyst for Coca-Cola and its rock-solid payout. Coca-Cola has topped the annually released \"Brand Footprint\" report from Kantar as the most chosen brand for 10 years running, as of 2022. Coke has a well-recognized logo and its top-notch marketing efforts have helped it connect with young and mature audiences alike for decades.\n\nEqually important, Coca-Cola brings virtually unmatched geographic diversity to the table. With the exception of North Korea, Cuba, and Russia (the latter of which is due to its aforementioned ongoing war with Ukraine), Coke is operating in every other country around the globe. It has 26 brands generating at least $1 billion in annual sales, and it's able to rely on emerging markets for a proverbial shot in the arm of organic growth.\n\nBerkshire Hathaway's cost basis for its Coca-Cola shares is just $3.2475. Based on its $1.84-per-share annual payout, Buffett's company is netting almost a 57% yield on cost. Put another way, Coca-Cola's dividend income alone is more than doubling Berkshire's initial investment in the company every two years.\n\nShould you invest $1,000 in Bank of America right now?\n\nBefore you buy stock in Bank of America, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Bank of America wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of December 7, 2023\n\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Sean Williams has positions in Bank of America. The Motley Fool has positions in and recommends Apple, Bank of America, and Berkshire Hathaway. The Motley Fool recommends Occidental Petroleum and recommends the following options: long January 2024 $47.50 calls on Coca-Cola. The Motley Fool has a disclosure policy.\n\nWarren Buffett Is Raking In Nearly $3.5 Billion in Annual Dividend Income From Just 4 Stocks was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/warren-buffett-raking-nearly-3-100600997.html", "symbols": ["AAPL.US", "BAC.US", "BRK-A.US", "BRK-B.US", "KO.US", "OXY.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.049, "neu": 0.849, "pos": 0.101}}]