[{"date": "2024-04-16T16:47:42+00:00", "title": "Big banks led by Citi continue to trim staff to cut costs", "content": "By Niket Nishant and Manya Saini\n\n(Reuters) - U.S. banking giants continued to shed employees in the first quarter, with Citigroup seeing the biggest drop.\n\nHeadcount at Citi declined by 2,000 employees after the third-largest U.S. lender completed a sweeping reorganization aimed at improving profits and reducing management layers.\n\nBank of America, Wells Fargo and PNC Financial together cut more than 2,000 jobs in the three months ended March 31 compared with the previous quarter.\n\nBanks are under pressure to control costs due to the uncertain economic outlook. While investors are still expecting the Federal Reserve to tame inflation while avoiding a major economic slowdown, expectations remain in a flux about the potential for interest-rate cuts later this year.\n\nCiti's reductions were part of a total 7,000 job cuts that will be reported in upcoming quarterly earnings as employees complete their notice periods, its Chief Financial Officer Mark Mason told reporters on Friday.\n\nThe layoffs were part of a broader goal to reduce Citi's staffing by 20,000 over the next two years.\n\nIndustry executives acknowledged the challenges in navigating the changing rate environment. Analysts said higher funding costs, contracting net interest margins and uneven trading results were likely to keep banks cautious.\n\n\"We managed headcount,\" Bank of America CEO Brian Moynihan told analysts on Tuesday. \"We noted the expectation in January of last year that our headcount will be down throughout the year.\"\n\nBofA's headcount has fallen by more than 4,700 from the first quarter of 2023.\n\nAcross Wall Street, investment banks brought in higher revenue, fueled by a revival in capital markets. Executives have become more optimistic that a surge in equity offerings will lift sentiment and spur mergers and acquisitions.\n\nThat would bolster the outlook for Goldman Sachs and Morgan Stanley, where headcount shrank by 900 and 396, respectively. Morgan Stanley's finance chief Sharon Yeshaya told analysts on Tuesday the investment bank was still making \"opportunistic hires.\"\n\nIn 2023, rival Goldman Sachs undertook its biggest round of layoffs since the global financial crisis of 2008.\n\nJPMorgan Chase, however, went against the trend. The largest U.S. bank continued to bolster its ranks, adding nearly 2,000 employees in the first quarter to a total of 311,921.\n\n(Reporting by Manya Saini and Niket Nishant in Bengaluru; Editing by Lananh Nguyen and Arun Koyyur)\n\nView comments", "link": "https://finance.yahoo.com/news/big-banks-led-citi-continue-164742612.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "C.MX", "C.US", "CITI.NEO", "CTGP34.SA", "MSC.US", "NCB.BE", "NCB.F", "NCB.HM"], "tags": [], "sentiment": {"polarity": -0.674, "neg": 0.061, "neu": 0.896, "pos": 0.043}}, {"date": "2024-04-16T16:12:00+00:00", "title": "Bank of America Earnings Drop, Under Pressure From Higher Rates; Stock Falls", "content": "Bank of America reported a 18% drop in first-quarter profit, the latest big lender to feel the squeeze of higher interest rates. BofA's shares were recently down more than 3%, outpacing a decline in an index of big bank shares. Here’s a rundown of the bank's results, out this morning: + BofA took a special charge of $700 million to pay the Federal Deposit Insurance Corp. over last year’s bank failures, on top of the $2.1 billion charge it booked last quarter.\n\nContinue reading\n\nView comments", "link": "https://finance.yahoo.com/m/a9deb69d-8d6d-36a1-9fb3-ca8914a5d48a/bank-of-america-earnings.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "NCB.BE", "NCB.F", "NCB.HM", "NCB.STU", "NCB.XETRA", "NCB0.F"], "tags": [], "sentiment": {"polarity": 0.807, "neg": 0.07, "neu": 0.772, "pos": 0.159}}, {"date": "2024-04-16T15:34:00+00:00", "title": "Bank of America Losses on Bond Portfolio Hit $109 Billion in First Quarter as Rates Rose", "content": "Bank of America adjusted earnings topped expectations in the first quarter, but one part of the company’s financial results worsened: the big paper losses on a key portion of its enormous bond portfolio. Bank of America shares, however, were down 2.3% to $35.03 in early trading Tuesday. The bank said that its unrealized losses on a $587 billion portfolio of bonds that are classified as held to maturity for accounting purposes widened by $11 billion to $109 billion on March 31 from $98 billion at year-end 2023.\n\nContinue reading\n\nView comments", "link": "https://finance.yahoo.com/m/035c0bf0-6b4d-3f5d-bed4-136feae10999/bank-of-america-losses-on.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "MSC.US", "NCB.BE", "NCB.F", "NCB.HM", "NCB.STU", "NCB.XETRA", "NCB0.F"], "tags": [], "sentiment": {"polarity": -0.846, "neg": 0.111, "neu": 0.861, "pos": 0.028}}, {"date": "2024-04-16T15:12:36+00:00", "title": "BofA’s mortgage production falls in Q1", "content": "Bank of America BofA logo on a laptop screen\n\nBank of America (BofA) reported another quarterly decline in mortgage and home equity production in the first quarter of 2024.\n\nOn Tuesday morning, the top-20 U.S. mortgage lender stated it produced a volume of $3.4 billion in first mortgages from January to March, down 12.5% from the $3.9 billion in the previous quarter and the same quarter of 2023.\n\nLoan production in the home equity arena was $1.8 billion in Q1 2024, a decline of 16% from $2.2 billion in the previous quarter and down 27% compared to $2.5 billion in the same period of 2023.\n\nBofA’s sequential quarterly production decline follows that of Wells Fargo and JPMorgan Chase, which also showed volumes under pressure in the first quarter of 2024. Their combined quarterly origination reached $10 billion – and, if this path is maintained, they will be well below the $60 billion originated in 2023, according to Eric Hagen, analyst at BTIG.\n\n“Expect independent mortgage banks to continue taking share from the large commercial depositaries, which are still shrinking their footprints in lending and servicing,” Hagen said in a report on Tuesday.\n\nNonbanks Rocket Mortgage, United Wholesale Mortgage, loanDepot, Pennymac, Rithm Capitaland Mr. Cooper are expected to report their earnings in the coming weeks.\n\nBofA’s mortgage assets\n\nBank of America had $227.7 billion in outstanding residential mortgages on its books through March 31, 2024, down from $228.9 billion in Q4 2023 and $229.3 billion in the first quarter of 2023.\n\nThe home equity portfolio was $25.5 billion at the end of the first quarter, relatively flat compared to $25.7 billion from the previous quarter — and a decline from $26.5 billion a year prior.\n\nBank of America’s total mortgage-backed securities reached a $49.8 billion fair value as of March 31, 2024, compared to $51.1 billion as of December 31, 2023.\n\nOverall, the bank posted a net income of $6.7 billion from January to March, down from $8.2 billion in the same period last year. Provisions increased to $1.3 billion in Q1 2024, compared to $1.1 billion the previous quarter and $931 million in the first quarter of 2023.\n\nAccording to its filing with the Securities and Exchange Commission (SEC), the consumer banking division posted a net income of $2.65 billion in Q1 2024, down from $2.76 billion in the prior quarter.\n\nChair and CEO Brian Moynihan said in a statement that the bank’s businesses “performed well,” reaching “36.9 million consumer checking accounts, with 21 consecutive quarters of net checking account growth.”\n\nView comments", "link": "https://finance.yahoo.com/news/bofa-mortgage-production-falls-q1-151236895.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "MSC.US", "NCB.BE", "NCB.F", "NCB.HM", "NCB.STU", "NCB.XETRA", "NCB0.F"], "tags": [], "sentiment": {"polarity": 0.96, "neg": 0.005, "neu": 0.933, "pos": 0.062}}, {"date": "2024-04-16T14:53:00+00:00", "title": "Investment Banking Bounceback Powers Big U.S. Lenders", "content": "Top U.S. banks, including Bank of America, JPMorgan and Goldman, posted better-than-expected earnings thanks to strong consumer spending and a flurry of Wall Street activity.\n\nContinue reading\n\nView comments", "link": "https://finance.yahoo.com/m/e689ac5e-f3c2-3ee7-bcac-86ced225a0b7/investment-banking-bounceback.html", "symbols": ["0Q16.LSE", "0QYU.LSE", "0R01.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "C.MX", "C.US", "CITI.NEO", "CMC.BE", "CMC.DU"], "tags": [], "sentiment": {"polarity": 0.791, "neg": 0, "neu": 0.758, "pos": 0.242}}, {"date": "2024-04-16T14:46:00+00:00", "title": "Bank of America Posts Strong Adjusted Profit and Net Interest Income, but the Stock Drops", "content": "Bank of America’s adjusted earnings in the first quarter were 83 cents a share, beating analysts’ estimates of 76 cents.\n\nContinue reading\n\nView comments", "link": "https://finance.yahoo.com/m/3ca9e470-a410-3375-a380-d4e146b63ff4/bank-of-america-posts-strong.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "MSC.US", "NCB.BE", "NCB.F", "NCB.HM", "NCB.STU", "NCB.XETRA", "NCB0.F"], "tags": [], "sentiment": {"polarity": -0.202, "neg": 0.115, "neu": 0.802, "pos": 0.084}}, {"date": "2024-04-16T14:39:49+00:00", "title": "BofA Shares Drop as Charge-Offs for Soured Loans Top Estimates", "content": "(Bloomberg) -- Bank of America Corp. reported elevated expenses and charge-offs for soured loans that were higher than analysts expected, failing to satisfy investors with a gain in its trading business.\n\nMost Read from Bloomberg\n\nBeyond the Ivies: Surprise Winners in the List of Colleges With the Highest ROI China Tells Iran Cooperation Will Last After Attack on Israel US Two-Year Yield Eyes 5% Before Powell’s Remarks: Markets Wrap Microsoft Invests $1.5 Billion in UAE’s G42 in Pivot From China Iran’s Conflict With Israel Puts US Ally Jordan on Edge\n\nCharge-offs totaled $1.5 billion, up 26% from the last three months of 2023, Bank of America said in a statement Tuesday. That was more than the $1.26 billion analysts had estimated. An increase in charge-offs on credit cards is largely a hangover from the previous quarter and is flattening out, Chief Financial Officer Alastair Borthwick said.\n\nShares of Charlotte, North Carolina-based Bank of America slumped as much as 5% to $34.15 Tuesday morning, their biggest drop in intraday trading in more than a year. They’re up 2.2% this year.\n\nBank of America’s non-interest expenses climbed 6.2% from a year earlier to $17.2 billion, driven by a $700 million special assessment from the Federal Deposit Insurance Corp. tied to last year’s regional-bank failures. Charges and costs have been a focal point for investors, with persistent inflation putting pressure on spending. Analysts had expected a 2.6% increase to $16.7 billion. Without the FDIC charge, expenses would have totaled $16.5 billion, or up 2%.\n\nStill, the company’s traders notched one of their best first quarters on record as the company also reaped the benefits of elevated borrowing costs that pushed net interest income above analysts’ estimates.\n\nRevenue from equities trading jumped 15% to $1.87 billion in the first three months of the year as clients grappled with a period of continued high interest rates and geopolitical tensions. That helped Bank of America top analysts’ net-income estimates, with the bank making $6.67 billion in the quarter.\n\n“Bank of America’s sales and trading businesses continued their strong 2023 momentum this quarter, reporting the best first quarter in over a decade,” Chief Executive Officer Brian Moynihan said in the statement.\n\nThe second-largest US bank said that net interest income, a key source of revenue for the bank, fell 2.9% to $14 billion in the first quarter of this year. Analysts had expected a 4% drop for NII, the revenue collected from loan payments minus what depositors are paid.\n\nLast week, JPMorgan Chase & Co. and Wells Fargo & Co. both reported NII that missed analysts’ estimates, with executives pointing to increased funding costs.\n\nStory continues\n\nRead More: Bull Case Fizzles for Big US Banks to Earn Ever-More on Lending\n\nIn the second quarter, Bank of America’s NII is likely to approach $14 billion, which is expected to be the “low point” for the year, with growth coming in the second half of 2024, Borthwick said on a call with analysts. If rates remain high, that will benefit future NII results, he said.\n\nBank of America’s results offer another look at how US consumers and businesses are faring as the Federal Reserve leaves borrowing costs higher for longer. Lenders’ balance sheets overall have remained resilient amid elevated interest rates, though uncertainties remain, including inflationary pressures and attacks in the Middle East.\n\nIn a sign of companies returning to capital markets and dealmaking, investment-banking fees rose 35% to $1.6 billion in the first quarter, driven by strength in equity and debt underwriting.\n\n“Investment banking saw a nice rebound in this quarter,” Moynihan said on the analyst call. “Our results reflect the benefits of investments made in our middle-market investment-banking teams and dual-coverage teams.”\n\nRevenue in Bank of America’s wealth business also climbed, gaining 5.2% to $5.59 billion. It was a record quarter for the division, driven by “higher asset-management flows,” Borthwick said on a conference call with reporters.\n\nThe company’s loan balances rose to $1.05 trillion at the end of the first quarter, up 0.3% from a year earlier and less than analysts’ estimates of $1.06 trillion. Lending — a key focus for investors, with high interest rates making borrowing costlier — has remained “sluggish,” Borthwick said on the media call.\n\nDeposits, another closely watched measure since the collapse of Silicon Valley Bank a year ago made the flight of funds more common, have remained stable at Bank of America. Total deposits rose to $1.95 trillion in the first quarter, up 1.2% from the previous three months.\n\n--With assistance from Keith Gerstein.\n\nMost Read from Bloomberg Businessweek\n\nA Resilient Global Economy Masks Growing Debt and Inequality Top Takeaways From Businessweek’s Investigation of Teenage Sextortion Cities Use AI to Help Ambulances and Firetrucks Arrive Faster The Shadow Swiftie Economy Booms With Bootleg Bracelets and $1,150 Bodysuits How a Pioneering Blackjack Master Beats the Odds of Aging\n\n©2024 Bloomberg L.P.\n\nView comments", "link": "https://finance.yahoo.com/news/bofa-shares-drop-charge-offs-143949377.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "MSC.US", "NCB.BE", "NCB.F", "NCB.HM", "NCB.STU", "NCB.XETRA", "NCB0.F"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.047, "neu": 0.852, "pos": 0.101}}, {"date": "2024-04-16T14:26:00+00:00", "title": "Housing Numbers Shrink as Q1 Earnings Heat Up: BAC, JNJ, UNH", "content": "Tuesday, April 16th, 2024\r\n\r\nNew housing data has hit the tape this morning. Housing Starts for March came in -14.7% to 1.3 million seasonally adjusted, annualized units. The previous month’s tally has been downwardly revised to 1.45 million from 1.52 million initially reported. Both single-family and multi-family units were lower than expected: 1.1 million and 299K, respectively.\n\nOnly the West posted a positive number: +7.1%, compared with the -36% result in the Northeast and -23% in the Midwest. Mortgage rates all around the country — still up near 7% — are keeping a real damper on the new housing market.\r\n\r\nBuilding Permits — a proxy for future Starts — also fell, though not as precipitously. Coming in -4.3% from estimates, permits reached 1.46 million, below the 1.51 million anticipated and the lowest monthly figure since July. The last year and a half has brought some real flatlining to these numbers: the trailing 12-month high came in August of last year, 1.54 million, and the low came from April ’23: 1.42 million.\r\n\r\nPre-market futures took a positive message from this. Futures ahead of the print were +185 points on the Dow, +2 on the S&P 500 and the Nasdaq +5; immediately afterward they were +215 Dow, +8 S&P and +30 Nasdaq. A cooling housing market is part of what the Fed needs to see before pulling the trigger on lowering interest rate levels.\n\nBy the same token, lowering rates in the near term may constitute a heating up in housing, which would increase inflation. While generational homeownership trends look to have hit a snag — not only from high mortgage rates, but “work from home” culture as well — in the near-term it’s probably a “good problem” to have.\r\n\r\nBank of America BAC posted Q1 earnings results ahead of today’s opening bell. The banking major outperformed the Zacks consensus by 6 cents to 83 cents per share, though was still down from the 94 cents reported in the year-ago quarter. Revenues of $25.82 billion outpaced estimates by +2.4%. Unsurprisingly, interest rate income came in hotter for the quarter, as did its investment banking business. Shares were up +2% on the news in early trading. For more on BAC’s earnings, click here.\r\n\r\nJohnson & Johnson JNJ also released Q1 earnings this morning. The diversified pharma and medical devices giant beat expectations on its bottom line — $2.71 per share versus $2.64 consensus, for a +2.65% positive surprise — on revenues which came in a smidge light of estimates, -0.09% to $21.38 billion. Shares have sold off another -1% from the -7% year to date. Shares are close to near-term lows from late October last year. The company brought a Zacks Rank #3 into the earnings release. For more on JNJ’s earnings, click here.\r\n\r\nUnitedHealthcare UNH, on the other hand, is +7% on its Q1 report. Earnings of $6.91 per share sped past the $6.63 anticipated, for a +4.22% positive surprise, on $99.8 billion in quarterly sales, which narrowly beat consensus by +0.55%. Shares had taken a hit on news reports about a cyber hack having hit a recently acquired outpost — Change Healthcare, acquired in 2022 by UNH unit Optum — but shares have blossomed +7.5% in pre-market activity on the strong earnings report. For more on UNH’s earnings, click here.\r\n\r\nQuestions or comments about this article and/or author? Click here>>\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBank of America Corporation (BAC) : Free Stock Analysis Report\n\nUnitedHealth Group Incorporated (UNH) : Free Stock Analysis Report\n\nJohnson & Johnson (JNJ) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments", "link": "https://finance.yahoo.com/news/housing-numbers-shrink-q1-earnings-142600307.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "JNJ.BA", "JNJ.BE", "JNJ.DU", "JNJ.F", "JNJ.HM", "JNJ.MU", "JNJ.MX", "JNJ.STU"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.015, "neu": 0.856, "pos": 0.129}}, {"date": "2024-04-16T13:30:09+00:00", "title": "Bank of America (BAC) Reports Q1 Earnings: What Key Metrics Have to Say", "content": "Bank of America (BAC) reported $25.82 billion in revenue for the quarter ended March 2024, representing a year-over-year decline of 1.7%. EPS of $0.83 for the same period compares to $0.94 a year ago.\n\nThe reported revenue compares to the Zacks Consensus Estimate of $25.28 billion, representing a surprise of +2.14%. The company delivered an EPS surprise of +7.79%, with the consensus EPS estimate being $0.77.\n\nWhile investors closely watch year-over-year changes in headline numbers -- revenue and earnings -- and how they compare to Wall Street expectations to determine their next course of action, some key metrics always provide a better insight into a company's underlying performance.\n\nAs these metrics influence top- and bottom-line performance, comparing them to the year-ago numbers and what analysts estimated helps investors project a stock's price performance more accurately.\n\nHere is how Bank of America performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\n\nEfficiency Ratio (FTE basis): 66.4% compared to the 64.8% average estimate based on seven analysts. Net interest income/yield on earning assets - Yield/rate: 2% compared to the 2% average estimate based on seven analysts. Total earning assets - Average balance: $2,860.58 billion versus the seven-analyst average estimate of $2,836.49 billion. Net charge-off / Average Loans: 0.6% compared to the 0.5% average estimate based on six analysts. Total nonperforming loans, leases and foreclosed properties: $6.03 billion compared to the $5.97 billion average estimate based on five analysts. Tier 1 Capital Ratio: 13.6% versus 13.6% estimated by four analysts on average. Total Non-Performing Loans: $5.88 billion versus the four-analyst average estimate of $5.94 billion. Tier 1 Leverage Ratio: 7.1% versus 7.1% estimated by three analysts on average. Total Noninterest Income: $11.79 billion versus the seven-analyst average estimate of $11.44 billion. Net Interest Income- Fully taxable-equivalent basis: $14.19 billion compared to the $13.98 billion average estimate based on seven analysts. Investment and brokerage services: $4.19 billion versus $4.04 billion estimated by six analysts on average. Investment banking fees: $1.57 billion versus the six-analyst average estimate of $1.37 billion.\n\nView all Key Company Metrics for Bank of America here>>>\r\n\r\nShares of Bank of America have returned -0.2% over the past month versus the Zacks S&P 500 composite's -0.9% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBank of America Corporation (BAC) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments", "link": "https://finance.yahoo.com/news/bank-america-bac-reports-q1-133009955.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "MSC.US", "NCB.BE", "NCB.F", "NCB.HM", "NCB.STU", "NCB.XETRA", "NCB0.F"], "tags": [], "sentiment": {"polarity": 0.983, "neg": 0, "neu": 0.925, "pos": 0.075}}, {"date": "2024-04-16T13:16:19+00:00", "title": "Bank Of America Rebound Hinges On Today's Action; Morgan Stanley Surges On Earnings", "content": "Bank of America could be a buy or a sell on post-earnings action. Morgan Stanley reports first EPS gain in eight quarters.\n\nContinue reading\n\nView comments", "link": "https://finance.yahoo.com/m/ba19402c-16d3-3dc8-9c7a-3e433bc63213/bank-of-america-rebound.html", "symbols": ["0KEF.LSE", "0QYU.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "DWD.BE", "DWD.DU", "DWD.F", "DWD.HM", "DWD.MU", "DWD.STU"], "tags": [], "sentiment": {"polarity": 0.527, "neg": 0, "neu": 0.871, "pos": 0.129}}, {"date": "2024-04-16T13:00:00+00:00", "title": "BofA (BAC) Q1 Earnings Beat on Strength in IB and Trading", "content": "Bank of America’s BAC first-quarter 2024 adjusted earnings of 83 cents per share outpaced the Zacks Consensus Estimate of 77 cents. The bottom line compared unfavorably with the 94 cents earned in the prior-year quarter.\r\n\r\nAfter considering the FDIC special assessment charge of $700 million, earnings per share was 76 cents.\r\n\r\nDespite modest loan growth (loan balances rose 0.3% from the prior-year period) and high interest rates, BofA recorded a decline in net interest income (NII) because of higher deposit costs.\r\n\r\nNevertheless, BofA witnessed a 1.9% increase in total deposit balances at the end of the quarter.\r\n\r\nAlso, total IB fees (in the Global Banking division) of $850 million increased 27.2% year over year, driven primarily by growth in underwriting income (up more than 50% year over year). Advisory services revenues witnessed a decent increase in the quarter.\r\n\r\nSimilar to the second, third and fourth quarters of 2023, BofA recorded an improvement in trading numbers in first-quarter 2024. Sales and trading revenues (excluding net DVA) were up 2.5% from the prior-year quarter to $5.18 billion. Fixed-income trading fees declined 3.6%, while equity trading income jumped 15.1%.\r\n\r\nOverall, the company’s net income applicable to common shareholders plunged 19.8% from the prior-year quarter to $6.14 billion. Our estimate for the same was $6.15 billion and did not take into account non-recurring items reported in the quarter.\n\nRevenues Decline, Expenses Rise\n\nNet revenues were $25.82 billion, which beat the Zacks Consensus Estimate of $25.28 billion. However, the top line declined 1.7% from the prior-year quarter.\r\n\r\nNII (fully taxable-equivalent basis) fell 2.7% year over year to $14.19 billion. Our estimate for NII was $14.09 billion.\r\n\r\nNet interest yield contracted 21 basis points (bps) to 1.99%.\r\n\r\nNon-interest income decreased marginally from the prior-year quarter to $11.79 billion. The decline was mainly due to a fall in fees from market-making and similar activities. We had projected non-interest income of $11.22 billion.\r\n\r\nNon-interest expenses were $17.24 billion, up 6.2% year over year. Our estimate for non-interest expenses was $16.40 billion.\r\n\r\nThe efficiency ratio was 66.77%, up from 61.84% in the year-ago quarter. An increase in the efficiency ratio indicates a deterioration in profitability.\n\nCredit Quality Worsens\n\nProvision for credit losses was $1.32 billion, up 41.7% from the prior-year quarter.\r\n\r\nNet charge-offs jumped 86% year over year to $1.50 billion. As of Mar 31, 2024, non-performing loans and leases as a percentage of total loans were 0.56%, up 18 bps year over year.\n\nStory continues\n\nCapital Position Strong\n\nBook value per share as of Mar 31, 2024, was $33.71 compared with $31.58 a year ago. Tangible book value per share as of the first-quarter end was $24.79, up from $22.78.\r\n\r\nAt the end of March 2023, the common equity tier 1 capital ratio (advanced approach) was 13.4%, up from 12.9% as of Mar 31, 2023.\n\nCapital Distribution Update\n\nIn the reported quarter, the company returned $4.4 billion to shareholders in dividends and share repurchases.\n\nOur Take\n\nBofA’s focus on digitizing and expanding operations, decent loan growth, and high interest rates are likely to keep aiding growth. However, elevated expenses, rising funding costs and near-term macroeconomic factors pose major headwinds.\n\nBank of America Corporation Price, Consensus and EPS Surprise Bank of America Corporation Price, Consensus and EPS Surprise\n\nBank of America Corporation price-consensus-eps-surprise-chart | Bank of America Corporation Quote\n\nCurrently, BAC carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nPerformance of Other Major Banks\n\nWells Fargo & Company’s WFC first-quarter 2024 adjusted earnings per share of $1.26 surpassed the Zacks Consensus Estimate of $1.10. The adjusted figure excludes the impacts of expenses from the FDIC special assessment. In the prior-year quarter, the company reported earnings per share of $1.23.\r\n\r\nWFC’s results benefited from higher non-interest income. An improvement in capital ratios and a decline in provisions were other positives. However, a decrease in NII and loan balances and an increase in expenses were the undermining factors for WFC.\r\n\r\nCitigroup Inc.’s C first-quarter 2024 net income from continuing operations per share of $1.58 surpassed the Zacks Consensus Estimate of $1.13. However, the metric declined 28% from the year-ago quarter.\r\n\r\nHowever, C witnessed declines in total loans and deposits in the quarter. Also, a dip in revenues and deteriorating credit quality were worrisome.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBank of America Corporation (BAC) : Free Stock Analysis Report\n\nWells Fargo & Company (WFC) : Free Stock Analysis Report\n\nCitigroup Inc. (C) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments", "link": "https://finance.yahoo.com/news/bofa-bac-q1-earnings-beat-130000709.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "MSC.US", "NCB.BE", "NCB.F", "NCB.HM", "NCB.STU", "NCB.XETRA", "NCB0.F"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.015, "neu": 0.851, "pos": 0.134}}, {"date": "2024-04-16T12:45:23+00:00", "title": "Bank of America's 1Q profits fall 18% on higher expenses, charge-offs", "content": "NEW YORK (AP) — Bank of America said its first-quarter profits fell 18%, as the bank dealt with rising expenses due to the impact of higher interest rates. But the results beat analysts' estimates.\n\nThe Charlotte, North Carolina-based bank posted a profit of $6.67 billion, or 76 cents per share, compared with $8.2 billion, or 94 cents a share, in the same period a year earlier. BofA had to make a one-time $700 million payment to the Federal Deposit Insurance Corp. to help the agency replenish the deposit insurance fund.\n\nExcluding that one-time charge, the bank earned 83 cents per share.\n\nBank of America has been dealing with the effects of higher interest rates on its loan and investment portfolio for the past year. The bank bought a sizable number of bonds during the pandemic when rates were low, and those bonds have lost value as interest rates have risen.\n\nThe bank is also paying more on deposits, which has caused its profits to be squeezed slightly. The bank's net interest yield, which is a measure of how much the bank is earning on the loans it has versus the interest it needs to pay out to depositors, dropped from 2.20% in 2023 to 1.99% in 2024.\n\nIn BofA's consumer banking division, its largest by revenue and profits, revenue fell by 5% to $10.2 billion. While the bank said it saw consumers open more accounts and spend more on their credit and debit cards, the bank had to set aside more funds to cover potential loans and charged off credit cards.\n\nInvestment banking revenues were mostly flat, but the bank saw modest growth in investment banking fees and trading revenues in the quarter.\n\nView comments", "link": "https://finance.yahoo.com/news/bank-americas-1q-profits-fall-124523123.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "MSC.US", "NCB.BE", "NCB.F", "NCB.HM", "NCB.STU", "NCB.XETRA", "NCB0.F"], "tags": [], "sentiment": {"polarity": 0.967, "neg": 0.02, "neu": 0.865, "pos": 0.116}}, {"date": "2024-04-16T11:22:00+00:00", "title": "Bank of America Reports First-Quarter 2024 Financial Results", "content": "CHARLOTTE, N.C., April 16, 2024 /PRNewswire/ -- Bank of America reported its first-quarter 2024 financial results today. The news release, supplemental filing and investor presentation can be accessed at Bank of America's Investor Relations website at https://investor.bankofamerica.com/quarterly-earnings.\n\nInvestor Conference Call information: Chief Executive Officer Brian Moynihan and Chief Financial Officer Alastair Borthwick will discuss the financial results in a conference call at 8:30 a.m. ET today. For a listen-only connection to the conference call, dial 1.877.200.4456 (U.S.) or 1.785.424.1732 (international), and the conference ID is 79795.  Please dial in 10 minutes prior to the start of the call.\n\nInvestors can also listen to live audio of the conference call and view the presentation slides by visiting the Events and Presentations section of the company's Investor Relations website.\n\nReplay information for Investor Conference Call: Investors can access replays of the conference call by visiting the Investor Relations website or by calling 1.800.934.4850 (U.S.) or 1.402.220.1178 (international) from noon on April 16 through 11:59 p.m. ET on April 26.\n\nBank of America Bank of America is one of the world's leading financial institutions, serving individual consumers, small and middle-market businesses and large corporations with a full range of banking, investing, asset management and other financial and risk management products and services. The company provides unmatched convenience in the United States, serving approximately 69 million consumer and small business clients with approximately 3,800 retail financial centers, approximately 15,000 ATMs (automated teller machines) and award-winning digital banking with approximately 57 million verified digital users. Bank of America is a global leader in wealth management, corporate and investment banking and trading across a broad range of asset classes, serving corporations, governments, institutions and individuals around the world. Bank of America offers industry-leading support to approximately 4 million small business households through a suite of innovative, easy-to-use online products and services. The company serves clients through operations across the United States, its territories and more than 35 countries. Bank of America Corporation stock is listed on the New York Stock Exchange (NYSE: BAC).\n\nFor more Bank of America news, including dividend announcements and other important information, visit the Bank of America newsroom.  Click here to register for news email alerts.\n\nStory continues\n\nwww.bankofamerica.com\n\nInvestors May Contact:\n\nLee McEntire, Bank of America\r\nPhone:  1.980.388.6780\r\nlee.mcentire@bofa.com\n\nJonathan G. Blum, Bank of America (Fixed Income)\r\nPhone: 1.212.449.3112\r\njonathan.blum@bofa.com\n\nReporters May Contact:\n\nBill Halldin, Bank of America\r\nPhone: 1.916.724.0093\r\nwilliam.halldin@bofa.com\n\nSOURCE Bank of America Corporation\n\nView comments", "link": "https://finance.yahoo.com/news/bank-america-reports-first-quarter-112200575.html", "symbols": ["0Q16.LSE", "BAC.US"], "tags": [], "sentiment": {"polarity": 0.959, "neg": 0.008, "neu": 0.935, "pos": 0.057}}, {"date": "2024-04-16T04:03:35+00:00", "title": "Japan's Yen Hits a Fresh Three-Decade Low of 154", "content": "(Bloomberg) -- Japan’s finance minister warned that he’s ready to take all available measures in the foreign exchange market if needed after the yen surged to a new 34-year low against the dollar overnight.\n\nMost Read from Bloomberg\n\nIran’s Attack on Israel Sparks Race to Avert a Full-Blown War S&P 500 Breaks Below 5,100 as Big Tech Sells Off: Markets Wrap Beyond the Ivies: Surprise Winners in the List of Colleges With the Highest ROI Israel Versus Iran — What All-Out War Could Look Like Apple Faces Worst iPhone Slump Since Covid as Rivals Rise\n\n“We are closely monitoring the latest developments,” Finance Minister Shunichi Suzuki said Tuesday before he departs to Washington for annual International Monetary Fund events and meetings of finance chiefs of the Group of Seven and Group of Twenty nations. “We are prepared to take all possible measures to respond to the situation if it is necessary.”\n\nSuzuki stopped short of saying he was ready to take “bold” action, the most direct hint of possible intervention in currency markets.\n\nThe finance minister’s comments come after the currency set a fresh 34-year low against the dollar of 154.45 following stronger than expected US retail sales figures. The latest data feed into a picture of economic resilience in the US that again pushes back against expectations the Federal Reserve will cut rates in the coming months.\n\nThe difference in US and Japanese interest rates and yields is a key factor behind the weakness in the yen.\n\nSuzuki said he would refrain from commenting on whether moves in the market have been rapid or excessive.\n\n“Regarding movements in the foreign exchange market, my position is the same as what I’ve said so far, and I would like to refrain from repeating that,” he said.\n\nMost Read from Bloomberg Businessweek\n\nA Resilient Global Economy Masks Growing Debt and Inequality How a Pioneering Blackjack Master Beats the Odds of Aging Top Takeaways From Businessweek’s Investigation of Teenage Sextortion Race for AI Supremacy in Middle East Is Measured in Data Centers Cocoa’s Surge Is Drawing Africa’s Farmers Back to the Bean\n\n©2024 Bloomberg L.P.\n\nView comments", "link": "https://finance.yahoo.com/news/japan-finance-minister-warns-yen-003314142.html", "symbols": ["0Q16.LSE", "8316.TSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "CMC.BE", "CMC.DU", "CMC.F", "CMC.MU", "CMC.STU", "CMC.XETRA"], "tags": [], "sentiment": {"polarity": -0.681, "neg": 0.084, "neu": 0.838, "pos": 0.078}}, {"date": "2024-04-16T01:36:50+00:00", "title": "20 Worst Places to Retire in Canada", "content": "This article takes a look at the 20 worst places to retire in Canada. If you wish to skip our detailed analysis on retiring to Canada, you may go to 5 Worst Places to Retire in Canada.\n\nRetirement Realities: Surprises, Worries, and Canadian Dreams\n\nAccording to NBC News, 2023 was expected to be hit with a recession. Instead, it surprised everyone when it curbed inflation instead, and even delivered economic growth that was “better than expected”. Of course, the investors are happy. However, they aren’t the only group of people that are. Retirement account holders are another group of people that have been gaining from favorable markets, as noted by the results revealed by a Bank of America Corporation (NYSE:BAC) survey. Bank of America Corporation (NYSE:BAC)'s Retirement and Personal Wealth Solutions, along with its Bank of America Institute, have revealed their fourth quarter 2023 Participant Pulse. The report indicates that average 401(k) account balances rose 15% to $86,280 in 2023, up from $75,045 at the end of 2022. While participants have been contributing more to their plans, the value of investments has also increased, thereby increasing balances.\n\n“We were encouraged to see more plan participants taking positive actions in their accounts in the fourth quarter. These insights offer signs that people are prioritizing their retirement savings, with more employees increasing their contribution rates and fewer taking hardship distributions”.\n\n- Lorna Sabbia, Head of Retirement and Personal Wealth Solutions at Bank of America Corporation (NYSE:BAC).\n\nWhile average account balances may be up, they are nowhere near what the average retiree needs saved for a comfortable retirement here in the US. According to a survey from The Charles Schwab Corporation (NYSE:SCHW), Americans believe they need at least $1.8 million to retire comfortably. Meanwhile, the 2022 Survey of Consumer Finances reveals that the average retirement savings for all families is a mere $333,940. For reasons like these, F&G Annuities & Life, Inc. (NYSE:FG) notes that 50% of pre-retirees and retirement Americans are considering delaying, or even coming out of, retirement.\n\nFinancial worries are the top reason Americans are thinking of doing so, notes F&G Annuities & Life, Inc. (NYSE:FG). Those nearing retirement believe they don't have enough saved. Yet many others are worried about how inflation is going to shake things up in the future, and there's also the dreaded depletion of the Social Security trust fund, expected to happen in the year 2033.\n\nStory continues\n\n\"Amid inflation, changing workforce dynamics post-COVID, and overall generational shifts, Americans are rethinking retirement and extending their time working or, for some retirees, unretiring altogether”.\n\n-Chris Blunt, President & CEO of F&G Annuities & Life, Inc. (NYSE:FG).\n\nEven though Americans may not have enough to retire comfortably here in the US or any other dream destination, that doesn't mean they don't have the heart to. One such destination for many retirees is Canada. According to a study by Bank of Montreal (NYSE: BMO) Financial Group, Canadians think they need $1.7 million to retire, up from $1.4 million in 2020. The numbers aren't much different from what Americans believe they need for retirement in the US, which is why retiring to this part of the world isn't quite impossible.\n\nNevertheless, both Americans and Canadians have similar hopes and fears when it comes to retirement savings. The Retirement Study by Bank of Montreal (NYSE: BMO) reveals how Canadians are concerned about inflation and rising prices, and also how it’s going to impact their financial situation and their retirement goals.\n\n\"While the anticipated headwinds in 2023 will understandably prompt concerns about how inflation and interest rates will affect our finances, Canadians remain resilient and are taking proactive measures to protect and invest in their retirement nest egg”.\n\n-Nicole Ow, Head, Retail Investments, Bank of Montreal (NYSE: BMO).\n\nFinancials aside, many prospective retirees often wonder if it is worth retiring in Canada. The answer is a resounding yes. Thanks to its universal healthcare, good quality of life, and diverse culture, retirees are probably going to enjoy their time in the country. However, one thing they need to make sure is that they consider relocating to some of the best places to retire in Canada. Some of these best places include Victoria and Vancouver in British Columbia, Quebec City in Quebec, and even Calgary in Alberta.\n\nWith that said, let’s check out all the worst places to retire in Canada to steer clear of: 20 Worst Places to Retire in Canada\n\nCopyright: blaze986 / 123RF Stock Photo\n\nMethodology\n\nTo compile the list of worst places to retire in Canada, we used several sources and expat forums such as Money Sense, Daily Hive, and Savvy New Canadians, amongst others. A consensus approach was used to select the worst places, with one point awarded to a place each time it was recommended by a source. Scores were summed up and places were ranked according to our \"Insider Monkey Score\" in ascending order from the lowest to the highest scores.\n\nBy the way, Insider Monkey is an investing website that tracks the movements of corporate insiders and hedge funds. By using a similar consensus approach, we identify the best stock picks of more than 900 hedge funds investing in US stocks. The top 10 consensus stock picks of hedge funds outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). Whether you are a beginner investor or a professional one looking for the best stocks to buy, you can benefit from the wisdom of hedge funds and corporate insiders.\n\nHere are the worst places to retire in Canada:\n\n20. Sarnia, Ontario\n\nInsider Monkey Score: 3\n\nHome to many industrial complexes, Sarnia lands on our list of worst places to retire in Canada because of its poor air quality. Global News shared a news report last year that revealed how living in certain parts of Sarnia is bad because it poses an increased risk of cancer, particularly leukemia, due to exposure to air pollution.\n\n19. Thompson, Manitoba\n\nInsider Monkey Score: 4\n\nThompson may be a diverse place to live, but it’s also one of the most dangerous ones. This city in north-central Manitoba, Canada lands up as a worst retirement destination because of its violence.\n\n18. Winnipeg, Manitoba\n\nInsider Monkey Score: 5\n\nNext up on our list of worst places to retire in Canada is Winnipeg. If you ask the residents, they’d say it is because of the poor healthcare. A poll conducted by Angus Reid Institute reveals how 77% of Manitobans state that the healthcare in the province is poor. Staffing shortages and longer wait times are two reasons for the bad state of affairs.\n\n17. Thunder Bay, Ontario\n\nInsider Monkey Score: 6\n\nOne of the worst cities to retire in Ontario is Thunder Bay. Reporting an estimated 775.2 offenses per 100,000, the city is a bad choice, especially for seniors. Other reasons for avoiding Thunder Bay are its harsh weather and difficult job market, which means seniors may have a hard time finding work if they choose to.\n\n16. Prince Rupert, British Columbia\n\nInsider Monkey Score: 7\n\nSimilar to many other British Columbia communities, Prince Rupert isn’t ready to house a large senior population. It’s not the cleanest place on our list, there isn’t much to do here. Many residents are also thinking about leaving the community amidst growing health concerns, reports Nelson Star.\n\n15. Regina, Saskatchewan\n\nInsider Monkey Score: 8\n\nIf this was a list of places to retire on a fixed income, Regina would have made it to our list of the most affordable places to retire for seniors. However, the reason Regina makes it to our list of worst places is its weather.\n\n14. North Battleford, Saskatchewan\n\nInsider Monkey Score: 9\n\nRetirees may be attracted to North Battleford because of its affordability, but residents say it’s bad because of its crime problem. People there call it Crime City, which means seniors are better off relocating elsewhere.\n\n13. Lethbridge, Alberta\n\nInsider Monkey Score: 9\n\nLethbridge lands up on our list because the locals say there isn’t much to do here. Also, the wind tends to get pretty bad, so it’s less likely that you’re going to enjoy the outdoors. Lethbridge is also infamous for its crime.\n\n12. Hamilton, Ontario\n\nInsider Monkey Score: 10\n\nHamilton in Ontario faces a problem with air pollution, making it a bad place to live for seniors. According to CBC, breathing the air in parts of Hamilton is like smoking a cigarette a day.\n\n11. Moncton, New Brunswick\n\nInsider Monkey Score: 11\n\nMoncton is another place that has landed on our list of worst places to retire in Canada because of its notoriety for crime. The CCI reports 1,085.3 offences per 100,000 people.\n\n10. Saskatoon, Saskatchewan\n\nInsider Monkey Score: 13\n\nSimilar to Moncton, Saskatoon also has a bad reputation and is deemed a dangerous place for retirement.\n\n9. Kelowna, British Columbia\n\nInsider Monkey Score: 14\n\nWhile not an entirely bad place to live, Kelowna lands on our list of worst places to retire in Canada because it’s becoming unaffordable for seniors. Property values and living costs are on the rise here, which means seniors on fixed incomes should steer clear of such areas. According to Houseful, the median price of a home in Kelowna is $854,230. The crime is pretty bad, too.\n\n8. Abbotsford-Mission, British Columbia\n\nInsider Monkey Score: 15\n\nNext our list of worst places to retire in Canada is Abbotsford-Mission, BC. According to the CCI, this district has recorded 818.4 offenses per 100,000 people.\n\n7. Timmins, Ontario\n\nInsider Monkey Score: 16\n\nBoasting much to do, one might be wondering why Timmins is one of the worst places to retire in Canada. The major reason for Timmins's bad reputation is because it is one of the most dangerous places one can choose to retire to.\n\n6. Campbell River, British Columbia\n\nInsider Monkey Score: 17\n\nDowntown, the homelessness situation has been getting worse than ever. You can’t go out for walks, and it’s better to stick to the main roads during the day. Considering the social situation here, it’s better to avoid living here altogether.\n\nClick to continue reading and see the 5 Worst Places to Retire in Canada. Suggested Articles:\n\n15 Best Places to Retire in Maine 15 Best Places to Retire in Oklahoma 15 Best Places in Minnesota For A Couple To Live On Only Social Security\n\nDisclosure: none. 20 Worst Places to Retire in Canada is originally published on Insider Monkey.\n\nView comments", "link": "https://finance.yahoo.com/news/20-worst-places-retire-canada-013650256.html", "symbols": ["BAC.US", "BMO.US", "FG.US", "SCHW.US"], "tags": [], "sentiment": {"polarity": -0.998, "neg": 0.115, "neu": 0.803, "pos": 0.082}}, {"date": "2024-04-16T00:00:00+00:00", "title": "BAC Stock Earnings: Bank of America Beats EPS, Beats Revenue for Q1 2024", "content": "BAC stock results show that Bank of America beat analyst estimates for earnings per share and beat on revenue for the first quarter of 2024.", "link": "https://investorplace.com/earning-results/2024/04/bac-stock-earnings-bank-of-america-for-q1-of-2024/", "symbols": ["BAC.US"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.916, "pos": 0.084}}, {"date": "2024-04-15T22:29:00+00:00", "title": "Bank of America Set to Report Earnings as High Interest Rates Cut Both Ways", "content": "Analysts polled by FactSet expected the bank to report earnings of $0.76 per share on revenue of $25.5 billion.\n\nContinue reading\n\nView comments", "link": "https://finance.yahoo.com/m/3ca9e470-a410-3375-a380-d4e146b63ff4/bank-of-america-set-to-report.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "MSC.US", "NCB.BE", "NCB.F", "NCB.HM", "NCB.STU", "NCB.XETRA", "NCB0.F"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.909, "pos": 0.091}}, {"date": "2024-04-15T16:35:32+00:00", "title": "Warren Buffett Collects $2.1 Billion in Dividends Every Year From These 3 Stocks", "content": "It’s no secret Warren Buffett loves companies that pay dividends. While he refuses to allow Berkshire Hathaway (NYSE:BRK-A)(NYSE:BRK-B) to pay any to shareholders, he enjoys collecting those checks from the businesses he owns.\n\nBuffett believes he can deliver superior returns for his shareholders if he allows them to make decisions for themselves. He’s probably right. Since becoming chairman of Berkshire Hathaway in 1964, he has generated overall returns of 4,384,748% by the end of 2023. In contrast, the S&P 500 achieved over 31,000% returns. That means Buffett’s compounded annual growth rate (CAGR) of 19.8% beat the benchmark index by nearly two-to-one. Most investors will have a tough time doing that in one year. Buffett’s done it for 60 years!\n\nThe Oracle of Omaha collected around $6 billion in dividends last year. That’s without doing anything but holding onto the shares of companies he already owns. But that’s only from his publicly traded stocks. In Buffett’s 2020 Berkshire Hathaway shareholder letter, he revealed that his wholly owned railroad, BNSF, paid him $41.8 billion in dividends since it was acquired in 2010.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nSo, which are Buffett’s best dividend stocks? Based on the amount collected, Bank of America (NYSE:BAC) will generate nearly $1 billion in dividends this year. Apple (NASDAQ:AAPL) will deliver another $860 million. Yet I’m looking for the top stocks, so I wanted dividends that yielded at least twice the average yield of the S&P 500’s 1.4% yield. BAC stock just missed the cut at 2.7%, while AAPL pays a miserly 0.5%.\n\nThe following three Warren Buffett dividend stocks yield over 3% each and, in return, will mail Oracle $2.1 billion in checks this year.\n\nKraft Heinz (KHC) A magnifying glass zooms in on the Kraft Heinz (KHC) website.\n\nSource: Casimiro PT / Shutterstock.com\n\nPackaged food stock Kraft Heinz (NYSE:KHC) is the seventh largest holding in Berkshire Hathaway. Buffett owns 325.6 million shares worth $11.8 billion. With a yield of 4.4%, it is the highest-yielding stock in the portfolio, which is set to deliver $520.5 million in dividends.\n\nThat’s not too shabby for a stock Buffett to consider a mistake. His holdings are the result of Buffett helping private equity firm 3G Capital Management to take control of H.J. Heinz in 2013 and then helping engineer the ketchup maker’s acquisition of Kraft Foods two years later. While Buffett believes the Heinz deal was good, he feels he “overpaid” for Kraft.\n\nSince acquiring Heinz, Buffett’s total return on the stock has been less than 18% compared to a 344% return by the S&P 500. The company owns a portfolio of top name brands like Kraft and Heinz and Jell-O, Kool-Aid and Maxwell House coffee. Half a million dollars a year in dividends can soften the blow of paltry returns and Buffett says he will never sell KHC stock.\n\nStory continues\n\nCoca-Cola (KO) ko stock coca cola life\n\nSource: Coca-Cola\n\nIt’s likely no surprise Coca-Cola (NYSE:KO) is on the list since it’s been known for years as a cash-producing machine. Buffett famously bought the beverage giant’s stock after Coca-Cola sent him a can of Cherry Coke in the 1980s. He ended up selling out of his Pepsico (NASDAQ:PEP) holdings and today owns 400 million shares of Coke worth $23.5 billion. That’s a 9.3% share of the company, accounting for over 6% of Berkshire Hathaway.\n\nKO stock yields 3.3%, so Buffett will receive dividend checks this year amounting to $775.6 million from the soda king. Of course, Coca-Cola is much more than just a soda jerk today; it has a broad swath of the beverage market, including water, tea, juices and energy drinks.\n\nAlthough Buffett doesn’t really buy and sell the company’s shares anymore, preferring to just hold for the long term, Coke tends to be an all-weather stock. Cans of soda and other beverages are indulgences consumers will enjoy regardless of economic conditions. This is why it continues to thrive, and Buffett will likely never sell his holdings.\n\nChevron (CVX) Here's Why Investors Should be Bullish on Chevron Stock at Current Levels\n\nSource: Roman Tiraspolsky / Shutterstock.com\n\nThe brightest dividend star in Berkshire Hathaway has to be oil and gas giant Chevron (NYSE:CVX). Buffett owns over 126 million shares valued at $20.5 billion. That puts the oil stock fifth in the portfolio.\n\nBuffett was selling shares of the energy company last year as he scooped up more shares of Occidental Petroleum (NYSE:OXY) because of its position in the Permian basin. But in last year’s fourth quarter, he became a buyer again. Chevron is also a giant in the oil-rich Permian and its pending acquisition of Hess (NYSE:HES) will give it access to the lucrative Guyana market (that is, if Exxon Mobil (NYSE:XOM) doesn’t muck it up).\n\nWith CVX stock yielding 4% a year, Buffett stands to receive $822 million in dividends this year. This will be an income stream that goes on for years and years as fossil fuel demand continues to grow.\n\nOn the date of publication, Rich Duprey held a LONG position in KO, XOM and CVX stock. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nRich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post Warren Buffett Collects $2.1 Billion in Dividends Every Year From These 3 Stocks appeared first on InvestorPlace.\n\nView comments", "link": "https://finance.yahoo.com/news/warren-buffett-collects-2-1-163532484.html", "symbols": ["AAPL.US", "BAC.US", "BERK34.SA", "BRH.BE", "BRH.DU", "BRH.F", "BRH.HM", "BRHF.F", "BRK-A.US", "BRK-B.US", "BRK.NEO", "BRKB.MX", "BRYN.F", "BRYN.XETRA", "CVX.US", "HES.US", "KHC.US", "KHCB34.SA", "KHNZ.STU"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.027, "neu": 0.883, "pos": 0.09}}, {"date": "2024-04-15T14:48:00+00:00", "title": "Is a Surprise Coming for Bank of America (BAC) This Earnings Season?", "content": "Investors are always looking for stocks that are poised to beat at earnings season and Bank of America Corporation BAC may be one such company. The firm has earnings coming up pretty soon, and events are shaping up quite nicely for their report.\n\nThat is because Bank of America is seeing favorable earnings estimate revision activity as of late, which is generally a precursor to an earnings beat. After all, analysts raising estimates right before earnings — with the most up-to-date information possible — is a pretty good indicator of some favorable trends underneath the surface for BAC in this report.\n\nIn fact, the Most Accurate Estimate for the current quarter is currently higher than the broader Zacks Consensus Estimate of 77 cents per share. This suggests that analysts have very recently bumped up their estimates for BAC, giving the stock a Zacks Earnings ESP of +0.72% heading into earnings season.\n\nBank of America Corporation Price and EPS Surprise Bank of America Corporation Price and EPS Surprise\n\nBank of America Corporation price-eps-surprise | Bank of America Corporation Quote\n\nWhy is this Important?\n\nA positive reading for the Zacks Earnings ESP has proven to be very powerful in producing both positive surprises, and outperforming the market. Our recent 10-year backtest shows that stocks that have a positive Earnings ESP and a Zacks Rank #3 (Hold) or better show a positive surprise nearly 70% of the time, and have returned over 28% on average in annual returns (see more Top Earnings ESP stocks here).\n\nGiven that BAC has a Zacks Rank #3 and an ESP in positive territory, investors might want to consider this stock ahead of earnings. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nClearly, recent earnings estimate revisions suggest that good things are ahead for Bank of America, and that a beat might be in the cards for the upcoming report.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBank of America Corporation (BAC) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research\n\nView comments", "link": "https://finance.yahoo.com/news/surprise-coming-bank-america-bac-144800579.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "MSC.US", "NCB.BE", "NCB.F", "NCB.HM", "NCB.STU", "NCB.XETRA", "NCB0.F"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0, "neu": 0.821, "pos": 0.179}}, {"date": "2024-04-15T11:52:00+00:00", "title": "7 Stocks Analysts Are Loving Right Now (And You Should Too): April 2024", "content": "Many investors have one or more preferred fundamental or technical indicator. These help to cut through the noise surrounding a stock. And, in some cases, the opinion of analysts is one of those indicators. Analyst-backed stocks have a high correlation with future stock price growth.\n\nAnalysts have access to information, and corporate insiders, that individual investors like you and me do not. They also generally follow many stocks within a sector, giving them the ability to spot emerging bullish or bearish trends. When analysts upgrade a stock or maintain a rating of Buy (or one of its equivalents such as Overweight or Outperform), it tells you that analysts have a strong belief that the stock will move higher.\n\nThat kind of information brings clarity. And that clarity is essential in times when economic indicators are sending conflicting signals. Here are seven analyst-backed stocks with several analyst upgrades in the 30 days ending April 10, 2024.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nAnalyst-Backed Stocks: Micron Technology (MU) An outside image of a Micron Technology, Inc. headquarters. MU stock. momentum stocks to buy soon\n\nSource: Charles Knowles / Shutterstock.com\n\nMicron Technology (NASDAQ:MU) leads this group of analyst-backed stocks with 22 upgrades. Many of the upgrades are above the stock’s consensus price target of $121.35.\n\nThe company is one of the leading providers of memory chips that are becoming essential as companies add artificial intelligence (AI) functionality. AI models require a tremendous amount of data, which then requires high bandwidth memory (HBM). And Micron continues to be a leader in the HBM sector. As evidence of that, the company’s newest solution, the HBM3E will be embedded into the new Nvidia (NASDAQ:NVDA) H200 graphic processing unit (GPU).\n\nMU stock is up 92% in the last year which may explain why short interest is up more than 9% in the last month. But with bullish analyst sentiment acting as a tailwind, any pullback can set the stage for the next move higher.\n\nThe next catalyst for Micron is likely to come from their earnings report in June. That makes this a good time to take a position as the stock is giving you a small pullback.\n\nSentinelOne (S) The logo for SentinelOne (S) is seen on on an office building.\n\nSource: Tada Images / Shutterstock.com\n\nSentinelOne (NASDAQ:S) is another of the top analyst-backed stocks with eight recent upgrades. Cybersecurity will continue to be one of the top sectors for investors in 2024. Much of that demand is being driven by AI. So, it stands to reason that SentinelOne’s AI-driven cybersecurity solutions will be in demand.\n\nThat’s certainly the sentiment of analysts from Bank of America (NYSE:BAC) that upgraded SentinelOne from a Neutral to a Buy with a $35 price target in February in support of the company’s competitive positioning, which has to do with its leadership in AI-based cybersecurity.\n\nStory continues\n\nSentinelOne is not turning a profit, yet. And at a time when investors have less of an appetite for the risk that comes with those stocks, the company closed that gap significantly last year and expects to close it even more in 2024.\n\nLike many tech stocks, S stock has had a sharp pullback in the last 30 days. But with analysts giving the stock a consensus price target of $29.96, investors have the potential for 32% upside. And 19 out of 32 analysts give SentinelOne either a Strong Buy or Buy rating.\n\nAnalyst-Backed Stocks: Williams-Sonoma (WSM) Williams-Sonoma (WSM) store in a shopping mall\n\nSource: designs by Jack / Shutterstock.com\n\nI recently put Williams-Sonoma (NYSE:WSM) on a list of stocks to buy based on bullish analyst calls, and it’s worth repeating my bullish call here. Although analysts put a consensus Hold on WSM stock, the company has received 12 upgrades in the 30 days ending on April 10, 2024.\n\nOn the one hand, market bears can say that, even with 12 upgrades, WSM is still a Hold. On the other hand, the company beat on earnings every quarter in 2023 even though the earnings were lower year-over-year. And that speaks to the idea that Williams-Sonoma can still command the 20.1% operating margin that it reported in its March earnings report.\n\nWSM stock has pulled back about 5% the week of April 8. That’s likely some profit taking as investors come to grips with any rate cuts moving further down the calendar in 2024, if they arrive at all. But this is a company with a more affluent target market that is more able to manage through inflation.\n\nOccidental Petroleum (OXY) Person holding cellphone with logo of American company Occidental Petroleum Corp. (OXY) on screen in front of website. Focus on phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nAs you might expect, several energy stocks – and specifically oil and gas stocks – have been getting upgrades. Occidental Petroleum (NYSE:OXY) is one of the stocks that should be on investors’ radars with six analyst upgrades.\n\nOccidental is a favorite of Warren Buffett who continues to invest heavily in OXY stock. At the end of 2023, Buffett owns over 25% of the company’s stock. The legendary investor believes in the company’s turnaround story and in how Occidental is well positioned to deliver value to shareholders. That value is becoming clear in the company’s dividend. After cutting the dividend in 2020, the company has raised its quarterly dividend from a penny per share in 2022 to its current amount of 22 cents per share.\n\nIt’s fair to point out that Buffett likes OXY for its sustainability initiatives as well as its assets in the Permian basin. But the latter certainly doesn’t hurt. Especially as oil prices are now over $85 a barrel and likely headed higher in the next 12 months.\n\nAnalyst-Backed Stocks: Netflix (NFLX) Netflix (NFLX) stock index is seen on a smartphone screen. It is an American subscription streaming service and production company\n\nSource: TY Lim / Shutterstock.com\n\nNetflix (NASDAQ:NFLX) is another one of the heavily analyst-backed stocks with 10 recent upgrades. That’s despite an 83% gain in NFLX stock in the last year. Netflix has silenced many naysayers (full disclosure, yours truly among them) by not only retaining subscribers but growing its base.\n\nThe streaming giant has leaned into its ad-supported tier and is seeing minimal pushback as it cracks down on passwords. The cherry on top is that the company has managed to increase the rate for its premium, ad-free, tier. And it’s done so without seeing much consumer attrition.\n\nOh, and the company also signed a multi-year contract with the WWE that is the company’s first foray into the coveted live sports market. While the company says it has no long-term plans for the space, it may turn out to be too lucrative to pass up.\n\nIn fairness, since late March, NFLX stock has found firm resistance at its 52-week high. However, the company reports earnings on April 18, 2024, which could very well be the next catalyst to send the stock soaring higher.\n\nDollar General (DG) The front of a Dollar General (DG Stock) store on a sunny day.\n\nSource: Jonathan Weiss / Shutterstock.com\n\nThe latest readings on inflation show that it’s moving higher. But consumers have known that, especially those that do the shopping for their household. That’s why it was surprising that the discount retailer, Dollar General (NYSE:DG) was down 29% in the last 12 months.\n\nThe key story for the company is location more than pricing. Despite its name it may not have the lowest price on items you might buy at a store like Walmart (NYSE:WMT). But the company’s business model places its stores in rural areas or in areas that are otherwise not being served by big-box retailers. That means consumers are saving money on gas as well as their purchases, which can tip the scale in favor of Dollar General.\n\nThe company has been disappointing on the earnings front as inflation hits discount retailers particularly hard. However, DG stock has 10 recent upgrades and is one of the top analyst-backed stocks. the stock is also up about 12% in 2024 which signals that sentiment could be turning around for DG stock.\n\nFor that turnaround to fully take shape may take an interest rate cut. That would be inflationary for consumers, but it may help Dollar General with its margins.\n\nMadrigal Pharmaceuticals (MDGL) OLK Stock. Modern Medical Research Laboratory: Two Scientists Wearing Face Masks use Microscope, Analyse Sample in Petri Dish, Talk. Advanced Scientific Lab for Medicine, Biotechnology. Blue Color. KZR stock. RSLS stock. Best Biotech Stocks to Buy\n\nSource: Gorodenkoff / Shutterstock.com\n\nFor investors who follow the biotech sector, Madrigal Pharmaceuticals (NASDAQ:MDGL) has been a big winner. In March 2024, Madrigal received accelerated approval for Reziffra, the company’s treatment for adults with noncirrhotic nonalcoholic steatohepatitis (NASH) that includes moderate to advanced liver fibrosis. The drug must be used as part of a program that includes diet and exercise.\n\nThere are an estimated 6 to 8 million adults with NASH in the U.S. alone. And this is the first treatment for those patients.\n\nAt this time, Reziffra is only approved for NASH. But it’s important to note that a key component of Reziffra is a thyroid hormone receptor agonist, Resmetirom. Since thyroid hormones impact metabolism, if that hormone activity increases, as it will with Reziffra, patients may experience increased fat burning and weight loss. There is a high correlation between excess weight and liver disease. Resmetirom also positively influences heart-related lipids and LDL cholesterol.\n\nWill these be future indications? It’s too early to tell, but the price action in MDGL stock suggests that it may not be too early for analysts to speculate.\n\nOn the date of publication, Chris Markoch did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nChris Markoch is a freelance financial copywriter who has been covering the market for over five years. He has been writing for InvestorPlace since 2019.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 7 Stocks Analysts Are Loving Right Now (And You Should Too): April 2024 appeared first on InvestorPlace.\n\nView comments", "link": "https://finance.yahoo.com/news/7-stocks-analysts-loving-now-115200762.html", "symbols": ["0KAK.LSE", "0LXC.LSE", "BAC.US", "DG.US", "MDGL.US", "MU.US", "NFLX.US", "NVDA.US", "OPC.BE", "OPC.DU", "OPC.F", "OPC.STU", "OPC.XETRA", "OXY.US", "OXYP34.SA", "S.US", "WM1.F", "WM1.MU"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.018, "neu": 0.896, "pos": 0.086}}, {"date": "2024-04-15T11:29:40+00:00", "title": "Profits surge at Goldman Sachs on Wall Street revival", "content": "Profits at Goldman Sachs (GS) rose 28% in the first quarter as investment banking revenues surged, giving CEO David Solomon some needed momentum at the start of 2024.\n\nNet income was $4.1 billion, beating analyst expectations. Its revenues of $14.2 billion were also up from a year ago thanks in part to a 32% rise in investment banking fees. Asset and wealth management revenues rose, as did trading.\n\nGoldman's stock rose 3% in premarket trading Monday.\n\nThe improved results follow a year that was the most challenging for Solomon since 2019, his first full year in charge.\n\nDealmaking slowed across Wall Street and he grappled with a costly exit from consumer banking and a series of high-profile departures from the firm. Goldman CEO David Solomon. REUTERS/Lucy Nicholson (REUTERS / Reuters)\n\nThe pressure on Solomon hasn’t let up in 2024. Two prominent proxy advisory firms are advising stockholders to cast votes this month that would limit the power of Solomon, with results due to be tallied at the company’s annual meeting on April 24.\n\nThe proposal that garnered a stamp of approval from Institutional Shareholder Services (ISS) and Glass, Lewis & Co. would split the CEO and chairman roles, both currently occupied by Solomon. A similar proposal last year did not pass, winning only 16% of votes.\n\nGlass Lewis is separately suggesting that stockholders also vote against Goldman’s executive pay plan due to a \"significant disconnect between pay and performance.\" ISS provided \"cautionary support\" for the executive pay plan.\n\nSolomon’s 2023 compensation rose 24% — to $31 million — despite a profit decline of the same amount.\n\nNot only is that up from the $25 million he was awarded in 2022, it is more than his rivals Brian Moynihan, Charles Scharf, and Jane Fraser made at Bank of America (BAC) and Wells Fargo (WFC), and Citigroup (C).\n\nOnly JPMorgan Chase (JPM) CEO Jamie Dimon and outgoing Morgan Stanley (MS) CEO James Gorman were awarded more for their 2023 performance.\n\nA lot is in flux at Goldman as key executives depart, raising new questions about the race to eventually succeed Solomon.\n\nOne surprise exit in 2024 is Jim Esposito, who had been co-head of Goldman’s global banking and markets division and is leaving after nearly three decades. Esposito had been viewed on Wall Street as among the possible successors to Solomon.\n\nAnother recent departure in March was Stephanie Cohen, global head of its platform solutions division.\n\nEven the board of Goldman is changing. This year, ex-Goldman CFO David Viniar was appointed as the board’s lead director to replace Adebayo Ogunlesi, who announced he would step down after selling his infrastructure investment company to BlackRock.\n\nStory continues\n\nThe first quarter results could help Solomon as he prepares to face shareholders later this month. The surge in investment banking included a 24% rise in advisory fees, a 38% jump in debt underwriting and a 45% increase in equity underwriting fees.\n\nTrading revenues from fixed income and equities were also both up 10% from a year ago.\n\n\"Our first quarter results reflect the strength of our world-class and interconnected franchises and the earnings power of Goldman Sachs,\" Solomon said in a press release.\n\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\n\nRead the latest financial and business news from Yahoo Finance\n\nView comments", "link": "https://finance.yahoo.com/news/profits-surge-at-goldman-sachs-on-wall-street-revival-112940260.html", "symbols": ["0Q16.LSE", "0QYU.LSE", "0R01.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PG.US", "BML-PH.US", "BML-PJ.US", "BML-PL.US", "BOAC34.SA", "BOFA.NEO", "C.MX", "C.US", "CITI.NEO", "CMC.BE", "CMC.DU"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0.029, "neu": 0.876, "pos": 0.096}}, {"date": "2024-04-14T16:52:21+00:00", "title": "10 Buy-Rated Stocks with Latest Insider Purchases", "content": "In this article, we will take a detailed look at the 10 Buy-Rated Stocks with Latest Insider Purchases. For a quick overview of such stocks, read our article5 Buy-Rated Stocks with Latest Insider Purchases.\n\nInsider trading and its relationship with stock returns is a topic that has interested researchers for a long time. When insiders buy their own company shares, does that mean they know something outsiders don’t and they are piling into their company shares to profit in the long term? Many research papers would answer this question with a “yes” albeit with many ifs and buts. For example a research paper entitled “Insider Trading Patterns” tries to find out why and when insiders buy their own company names. The research, conducted by Lee Biggerstaff, David Cicerob and M. Babajide Wintoki, says that duration is very important while analyzing insider trades. When insiders buy or sell a stock for a long period of time, they may have a “longer-lived” informational advantage. The research said when controlled for duration, insider buying and selling transactions can predict “sizable abnormal returns on average.”\n\nInsiders Preserve Their \"Informational Advantage\"\n\nThe research paper also concludes that insiders tend to “preserve” their informational advantage by disclosing their trades usually after the market closes. They also trade in a sequence of trades and trade more shares because of this disclosure pattern.\n\nWhat does “sequence” of trades mean? The research paper says when an insider has an informational advantage of significant importance, they will try to avoid “conspicuously” large trades and instead try to spread their trades over a long period of time leading up to the key event about which they might be aware of. For example, if an executive is aware that his company is about to lose a key business relationship in the future, or an important R&D project is progressing positively towards its goal, they would begin to initiate insider trades with by careful sequencing instead of immediately buying or selling company shares in hefty amounts.\n\nStory continues\n\n“Prior research has shown that larger trades tend to move prices and trade prices convey information about firm values to the market (Meulbroek, 1992; Gloston and Milgrom, 1985). Optimal trading strategies based on private information therefore involve sequences of trades to avoid sending strong signals (Kyle, 1985). In addition, according to a 2000 internal S.E.C. memorandum discussing the investigation of insider trading, one of the most relevant factors is the size of a trade, so those trading on private information have an incentive to avoid conspicuously large trades (Foster, 2000). Sequences of trades spread over longer horizons may therefore be motivated by private information that takes longer to be incorporated into prices. The alternative null hypothesis is that insiders spread their trades over longer periods of time when they are trading for liquidity or diversification purposes. There may be less immediacy to these trades if insiders are not trying to exploit a temporary informational advantage. Insiders may spread these trades out over time because they still face the reality that the market has limited depth and larger trades tend to move prices, which could cause them to realize less favorable average trading prices. Consistent with this expectation, Lebedeva, Maug, and Schneider (2012) demonstrate that insiders spread their trades out over time when they face liquidity constraints.” Buy-Rated Stocks with Latest Insider Purchases\n\nPhoto by Ruben Sukatendel on Unsplash\n\nWhich Industries are Seeing Insider Buying in 2024?\n\nAre insiders buying or selling in 2024? According to an interesting analysis conducted by CDT Capital Management, a long-only hedge fund that keenly tracks insider activity, insiders started piling into the market in March after a two-month “hiatus.” CDT Insider Sentiment Ratio was 2.14 in March, which shows a strong insider sentiment.  Among the most active sectors seeing insider activity in March 2024 included Software, Restaurants and Banks.\n\nCDT said that insiders are apparently late to the party and it’s puzzling why insiders, who are usually contrarians, started buying during the Q1 rally. Many believe the market rally led by AI is spreading to other stocks and CDT also thinks this explains the latest insider buying activity:\n\n“Our conclusion is that we suspect the market rally that we observed in Q1 has and will likely continue to broaden out to other sectors of the market. With more and more insiders raising their hand to proclaim untapped value, we expect the sectors of the market that have not received their fair share of attention will likely get some of the limelight in the near to medium term.”\n\nInsider Monkey’s monthly newsletter and portfolio that focuses on activist hedge funds, insider trading and stock picks from hedge fund investor newsletters and conferences returned 199.2% between March 2017 and March 12, 2024 and outperformed the S&P 500 ETFs’ 144.9% gain by more than 54 percentage points. Some of the top stocks popular among hedge funds include Bank Of America Corp (NYSE:BAC), Coca-Cola Co (NYSE:KO) and Occidental Petroleum Corp (NYSE:OXY).\n\nMethodology\n\nFor this article we first used a stock screener to identify stocks that saw insider buying activity over the past few days. We then narrowed down to the companies with Buy or better ratings from Wall Street analysts. We then calculated upside potential of these stocks based on average analyst price estimates for these companies and chose 10 of these stocks with the highest upside potential.\n\n10. CNX Resources Corp (NYSE:CNX)\n\nAverage Analyst Price Target: $94\n\nUpside Potential: 60%\n\nCustomer engagement and business performance solutions company CNX Resources Corp (NYSE:CNX) is one of the buy-rated stocks with recent insider purchases. On April 3, 2024, Jane Fogarty, the Executive Vice President of Legal at Concentrix, bought 400 shares of CNX Resources Corp (NYSE:CNX) at $61.04 apiece. Since this transaction the stock has gained about 2%.\n\nLongleaf Partners Small-Cap Fund made the following comment about CNX Resources Corporation (NYSE:CNX) in its Q3 2023 investor letter:\n\n“CNX Resources Corporation (NYSE:CNX) – Natural gas company CNX Resources was the top performer in the quarter. The company benefited from rising energy prices, as well as strong operational execution. CNX remains highly discounted, as the market does not give the company credit for its longer-term undrilled assets or its “new technology investments,” which include methods to reduce carbon on a net basis. Management expects this to be a material business for CNX over the longer term, but for now it is a high-quality hidden asset. CNX has taken advantage of the price disconnect through meaningful share repurchase.”\n\n9. HilleVax Inc (NASDAQ:HLVX)\n\nAverage Analyst Price Target: $29.25\n\nUpside Potential:100%\n\nBoston, Massachusetts-based biotechnology company HilleVax Inc (NASDAQ:HLVX) saw insider buying activity in March when its Chief Operating Officer Sean McLoughlin piled into 1,250 shares of HilleVax Inc (NASDAQ:HLVX) at $16.98 per share. The transaction took place on March 28. Since then the stock has lost about 12% in value.\n\nAs of the end of the fourth quarter of 2023, 11 hedge funds tracked by Insider Monkey had stakes in HilleVax Inc (NASDAQ:HLVX).\n\n8. Annexon, Inc. (NASDAQ:ANNX)\n\nAverage Analyst Price Target: $15\n\nUpside Potential:153.3%\n\nWells Fargo recently published a list of  high-conviction, catalyst-driven stock opportunities for the second quarter. Annexon, Inc. (NASDAQ:ANNX) was part of the list.  Wells Fargo said that the stock only trades at “$400MM enterprise value, we think the risk/reward (+130%/-50%) is skewed to the upside on the upcoming Phase 3 GBS data.\"\n\nOn April 8, William H. Carson, a director at Annexon, Inc. (NASDAQ:ANNX), bought 3,200 shares at $6.07 each. Since then the stock is down 2%.\n\nUnlike Bank Of America Corp (NYSE:BAC), Coca-Cola Co (NYSE:KO) and Occidental Petroleum Corp (NYSE:OXY), which are highly popular among hedge funds, ANNX is a small company with low hedge fund sentiment.\n\n7. Pagaya Technologies Ltd (NASDAQ:PGY)\n\nAverage Analyst Price Target: $27.92\n\nUpside Potential:157%\n\nPagaya Technologies Ltd (NASDAQ:PGY) is one of the stocks both Wall Street analysts and insiders like. On April 5, Pagaya Technologies Ltd's (NASDAQ:PGY) President Sanjiv Das bought over 22,000 shares of Pagaya Technologies Ltd (NASDAQ:PGY) at $10.57. Since then the stock is up 0.6%. Pagaya Technologies Ltd's (NASDAQ:PGY) Chief People Officer  Tami Rosen also bought 10,000 shares of Pagaya Technologies Ltd (NASDAQ:PGY) at $10.47 per share.\n\nUnlike mature companies like Bank Of America Corp (NYSE:BAC), Coca-Cola Co (NYSE:KO) and Occidental Petroleum Corp (NYSE:OXY), Pagaya is a small company with strong upside potential.\n\n6. Surrozen Inc (NASDAQ:SRZN)\n\nAverage Analyst Price Target: $33\n\nUpside Potential:225%\n\nCalifornia-based biotechnology company Surrozen Inc (NASDAQ:SRZN) ranks sixth in our list of the stocks Wall Street analysts and corporate insiders like. Tim Kutzkey, a director and 10% owner at Surrozen Inc (NASDAQ:SRZN), bought 193,548 shares at $15.50 per share on April 4. Since then the stock has lost about 9% in value. The company's management talked about important business updates and future opportunities during an earnings call last month:\n\n\"We’re excited with the multiple opportunities that lie ahead of Surrozen in 2023 and 2024. We’ve shared some of our key milestones and catalysts through 2024 on this slide. We shared our thoughts on cash runway into the second half of ’24 as we think about our key upcoming milestones and catalysts, and I’ll briefly highlight a few of these.\n\nFirst, for SZN-043, as Craig mentioned, we’ve enrolled the first patient for chronic liver disease and expect to have data by the end of the year, and plan to initiate a Phase Ib clinical trial in 2024 with potential proof-of-concept data in the second half of 2024. As it relates to 1326, we’ve opened enrollment for the Phase I in healthy volunteers, and we expect to be able to have data by the end of the year, and we’ll initiate a Phase Ib trial in 2024 in UC patients and expect to have proof-of-concept data in the second half of ’24. As I’ve already mentioned, with SZN-413, which is partnered with Boehringer Ingelheim, we expect by the end of the year for them to nominate a candidate which will trigger a $10 million milestone payment, and as it relates to our research programs, we expect to nominate an additional program and/or partner that potential program.\"\n\nRead the full earnings call transcript here.\n\nClick to continue reading and see 5 Buy-Rated Stocks with Latest Insider Purchases.\n\nSuggested Articles:\n\nInsiders Are Buying These 11 Penny Stocks 10 Underperforming Stocks Insiders are Buying 10 Very High Yield Dividend Stocks Billionaires Are Piling Into\n\nDisclosure.None. 10 Buy-Rated Stocks with Latest Insider Purchaseswas initially published on Insider Monkey.", "link": "https://finance.yahoo.com/news/10-buy-rated-stocks-latest-165221147.html", "symbols": ["0KAK.LSE", "ANNX.US", "BAC.US", "CCC3.BE", "CCC3.DU", "CCC3.F", "CCC3.HA", "CCC3.HM", "CCC3.MU", "CCC3.STU", "CCC3.XETRA", "CGD.BE", "CGD.DU", "CGD.F", "CGD.STU", "CNX.US", "COCA34.SA", "COLA.NEO", "HLVX.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.011, "neu": 0.888, "pos": 0.101}}]