[{"date": "2024-01-16T22:48:12+00:00", "title": "3 Top-Rated Dividend Stocks Wall Street Analysts Are Loving Now: January 2024", "content": "Many investors continue to prioritize dividends when buying stocks, relying on the payments for income, particularly in retirement. To many investors, dividends provide a more reliable and consistent return than stock price appreciation, which is prone to market fluctuations. These investors look for companies that make their dividend payouts a priority and steadily increase the amount paid to shareholders. Continuous growth in a dividend is also a sign of financial health and maturity at a company. Furthermore, it isn’t just retail investors and retirees that are on the hunt for the top-rated dividend stocks.\n\nEven major investors such as Warren Buffett prioritize dividends. Consider that Buffett collects more than $700 million a year from his holding in Coca-Cola (NYSE:KO) stock, and you can understand why he publicly complained when another of his holdings, Paramount Global (NASDAQ:PARA), cut their dividend to shareholders. Here are three top-rated dividend stocks Wall Street analysts are loving now: January 2024.\n\nTop-Rated Dividend Stocks: Lennar (LEN) Lennar (LEN) website homepage. Lennar logo visible on the phone screen\n\nSource: madamF via Shutterstock\n\nHome builder Lennar (NYSE:LEN) just announced that it is increasing its dividend payment to shareholders by 33% to 50 cents per share, effective on Feb. 7. Previously, Lennar had paid shareholders a quarterly dividend of 37.5 cents a share. While the dividend yield on LEN stock is still comparatively low at 1%, the company is being praised for hiking its payout to shareholders. The dividend increase comes after Lennar reported strong financial results right before Christmas.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLennar issued fiscal fourth quarter results that handily beat Wall Street forecasts amid a resilient housing market. The company announced earnings per share (EPS) of $4.82 and revenue of $11 billion. Analysts had been calling for earnings of $4.59 and $10.20 billion in sales. For its full fiscal year, Lennar reported EPS of $13.73 on $34.20 billion in revenue, also ahead of expectations. Lennar said it received 17,366 new home orders in fiscal Q4, up 32% from a year earlier and beating estimates of 16,816.\n\nStory continues\n\nLEN stock has gained 54% in the last 12 months.\n\nBroadcom (AVGO) broadcom (AVGO) logo outside office building\n\nSource: Sasima / Shutterstock.com\n\nOwing to its high share price, semiconductor Broadcom (NASDAQ:AVGO) pays a chunky quarterly dividend of $5.26 per share, giving it a yield of nearly 2%. Furthermore, Broadcom announced this past December that it was increasing its quarterly dividend payment by 14%, raising it from $4.60 a share previously. Broadcom announced the dividend hike as it too reported strong financial results that exceed expectations on Wall Street.\n\nThe company reported EPS of $11.06 for what was also its fiscal fourth quarter, topping consensus estimates of $10.96. Revenue came in at $9.3 billion, matching forecasts. In terms of forward guidance, Broadcom said that for its fiscal 2024 year, it expects to generate revenue of $50 billion, including its acquisition of VMware that was finalized last November. Wall Street had forecast full-year revenue of $39.2 billion for the company. AVGO stock has gained 91% over the last 12 months. This is easily one of the top-rated dividend stocks on the market.\n\nBank of America (BAC) A photo of the Bank of America (BAC) logo in neon red and blue on a tan wall.\n\nSource: Tero Vesalainen / Shutterstock.com\n\nBank of America (NYSE:BAC) continues to prioritize its quarterly dividend payment despite encountering difficulties with its earnings and share price. Last November, the lender announced that it was raising its dividend by 9% to 24 cents a share, giving BAC stock a healthy yield of right around 3%. The dividend has grown from an annual total of 4 cents per share in 2013 to an annual payment of 96 cents today. That’s a yearly growth rate of 37% over the past decade.\n\nGrowth in the dividend comes despite Bank of America encountering choppy waters. The lender just reported its fourth-quarter 2023 financial results, and they did not impress Wall Street. The second biggest bank in the U.S. reported a Q4 profit of 35 cents per share, which was below forecasts of 53 cents a share. The lender’s earnings were down 59% from 85 cents a share in the year earlier period. Revenue totaled $21.96 billion, below forecasts of $23.7 billion. Sales were down 10% year-over-year.\n\nThe bank’s management team blamed the poor results on regulatory charges it has been forced to pay since last summer, including a $250 million fine related to junk fees. BAC stock has fallen 5% over the last 12 months. If you are looking for the top-rated dividend stocks on the market, start here.\n\nOn the date of publication, Joel Baglole did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\n\nThe post 3 Top-Rated Dividend Stocks Wall Street Analysts Are Loving Now: January 2024 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-top-rated-dividend-stocks-224812922.html", "symbols": ["0JU0.LSE", "AVGO.US", "AVGO34.SA", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "KO.US", "L1EN34.SA", "LEN-B.US", "LEN.MX", "LEN.US", "LNN.BE"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.031, "neu": 0.876, "pos": 0.093}}, {"date": "2024-01-16T22:19:06+00:00", "title": "Odeon Analyst Bove Backtracks on Bank of America, Says Upgrade Was ‘A Mistake’", "content": "(Bloomberg) -- Swaps traders aren’t the only ones on Wall Street rethinking their aggressive bets on interest rate cuts. Barely a month after upgrading Bank of America Corp. to a buy, Odeon Capital analyst Dick Bove is reversing course.\n\nMost Read from Bloomberg\n\nBonds Slide as Fed’s Waller Downplays Need to Rush: Markets Wrap Musk Pressures Tesla’s Board for Another Massive Stock Award Apple to Allow Outside Payments for Apps After US Decision Iowa Latest: Haley Unveils New Ad, Looking to New Hampshire A Wary World Braces for Trump’s Return to the White House\n\n“The theory was that interest rates would decline increasing the bank’s real book value. This implied a higher stock price,” Bove wrote in a note to clients, cutting his rating on Bank of America to a hold Tuesday. “I now think that the rating adjustment was a mistake.”\n\nThe downgrade comes just a few days after Bank of America reported earnings that fell short of Wall Street expectations on the heels of a hotter-than-anticipated inflation report. Even when adjusted for “one-time events,” the results were disappointing and the outlook isn’t good, Bove wrote. It’s unlikely that Bank of America’s earnings will return to 2023 levels until 2026, he added.\n\nRead more: BofA, Wells Among Five Banks Boosted by Odeon’s Bove on Fed Path\n\nBove now sees rate cuts possibly delayed until autumn in the US as the Federal Reserve keeps policy tight in its quest to reduce inflation. Derivatives traders were also reining in their bets on a March rate-cut Tuesday after cautious comments from Fed Governor Christopher Waller.\n\n“The economy could be under stress for most of the year as labor markets weaken, loan losses rise, and corporations lose pricing power,” Bove wrote.\n\nMost Read from Bloomberg Businessweek\n\nChinese Tycoon on the Rebound After $10 Billion Debt Deal There’s a Toxic Employee—and the CEO Is Ignoring the Issue Japan’s Market Roars Back to Life—With Old-Timers Leading the Way Elon Moves Further Right; Hertz Ditches Tesla Patti LaBelle Moves From Stage to Stove With a Recipe for Success\n\n©2024 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/odeon-analyst-bove-backtracks-bank-221906098.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": -0.767, "neg": 0.097, "neu": 0.835, "pos": 0.068}}, {"date": "2024-01-16T21:22:33+00:00", "title": "Despite Disappointing Bank Results, Corporate Uncertainty Has Never Been Lower", "content": "More bad news for doves last week who are hoping for interest rate cuts sooner rather than later. The Consumer Price Index (CPI) for December came in above expectations, showing sticky inflation is still in play and adding to the reasons that the U.S. Federal Reserve (along with robust jobs numbers) may hold off on interest rate cuts in Q1.[1] Expectations for a Jan. 31 rate reduction are dwindling, with the CME Group's FedWatch tool now showing only a 4.7% chance that there will be a rate cut.[2]\n\nWarning! GuruFocus has detected 5 Warning Signs with MS.\n\nHigher interest rates (as well as potentially lower interest rates later this year) were one headwind highlighted in many of the Q4 bank reports out last week. Despite missing earnings expectations due to a $2.9B fee from regional bank rescues, JPMorgan Chase (NYSE:JPM) was still able to show revenue growth of 12% during the quarter, leading investors to take the stock higher after the report. However, Jamie Dimon continued to strike a somewhat cautious tone on the US economy. On the one hand he remarked that \"The U.S. economy continues to be resilient, with consumers still spending, and markets currently expect a soft landing,\" but government deficit spending and restructuring of the global supply chain \"may lead inflation to be stickier and rates to be higher than markets expect.\"[3]\n\nSentiment from other reporting banks, Citigroup (NYSE:C) and Bank of America (NYSE:BAC), hit a similar tone, and results were also impacted by large fees tied to last year's regional banking crisis. Citigroup saw earnings-per-share (EPS) fall 24% year-over-year (YoY) due to several large charges, and revenues declined 3% over the same period. Due to poor results and an embattled stock price, CEO Jane Fraser announced a 10% workforce reduction.[4]\n\nBank of America reported revenue of $22.1B that missed expectations of $23.74B. The Charlotte, North Carolina-based bank was also hit with a $2.1B fee tied to regional bank failures. Q4 EPS and revenues saw YoY declines of 18% and 10%, respectively.[5]\n\nStory continues\n\nWhile banks benefit from the bigger interest fees that higher rates bring, it's been at the expense of other areas such as loans and investment banking. Wells Fargo (NYSE:WFC) noted this double-edged sword in their Q4 results. While lower interest rates could mean net interest income falls by 7-9% YoY in 2024, higher interest rates have been problematic for deposits as consumers look for higher yielding instruments. \"As we look forward, our business performance remains sensitive to interest rates and the health of the U.S. economy, but we are confident that the actions we are taking will drive stronger returns over the cycle,\" said CEO Charlie Scharf.[6]\n\nAccording to FactSet, with this early round of disappointing results, blended S&P 500? EPS growth has turned negative, now expected to come in at -0.1%.[7]\n\nCorporate Uncertainty Eases to the Lowest Level on Record\n\nDespite the tone from some banking executives last week, our proprietary gauge of corporate uncertainty just clocked its lowest reading on record. Just as the Q4 earnings season gets underway, the most recent reading of the Late Earnings Report Index (LERI) shows that fewer companies are delaying earnings reports than advancing them.\n\nThe LERI tracks outlier earnings date changes among publicly traded companies with market capitalizations of $250M and higher. The LERI has a baseline reading of 100, anything above that indicates companies are feeling uncertain about their current and short-term prospects. A LERI reading under 100 suggests companies feel they have a pretty good crystal ball for the near-term.\n\nThe official pre-peak season LERI reading for Q4 (data collected in Q1) stands at 60, the lowest reading in the metric's 9-year history. As of January 12, there were 37 late outliers and 56 early outliers. This is in stark contrast to the LERI readings from the Q2 and Q3 earnings seasons which showed CEOs at their most uncertain since the COVID-19 pandemic. Despite Disappointing Bank Results, Corporate Uncertainty Has Never Been Lower\n\nSource: Wall Street Horizon\n\nOn Deck this Week\n\nFinancials continue to report this week, with big bank results wrapping up on Tuesday with Morgan Stanley (NYSE:MS) and Goldman Sachs (NYSE:GS). We also will get a read on semiconductors when Taiwan Semiconductor Manufacturing (NYSE:TSM) reports on Thursday, Jan. 18, and on how a recent IPO is faring when Birkenstock (NYSE:BIRK) releases results on that same day. Despite Disappointing Bank Results, Corporate Uncertainty Has Never Been Lower\n\nSource: Wall Street Horizon\n\nQ4 Earnings Wave\n\nThis season peak weeks will fall between Jan. 29 and March 1, with each week expected to see over 1,000 reports. Currently Feb. 22 is predicted to be the most active day with 599 companies anticipated to report. Thus far only 39% of companies have confirmed their earnings date (out of our universe of 10,000+ global names), so this is subject to change. The remaining dates are estimated based on historical reporting data. Keep in mind the Q4 reporting season is always a bit more prolonged, typically stretching over four or five peak weeks rather than the usual three peak weeks seen in Q1 - Q3. Despite Disappointing Bank Results, Corporate Uncertainty Has Never Been Lower\n\nSource: Wall Street Horizon\n\n1 Consumer Price Index Summary, U.S. Bureau of Labor Statistics, January 11, 2024, https://www.bls.gov2 CME FedWatch Tool, CME Group, January 12, 2024, https://www.cmegroup.com3 FOURTH-QUARTER 2023 RESULTS, JPMorgan Chase & Co., January 12, 2024, https://www.jpmorganchase.com4 Fourth Quarter and Full Year 2023 Results and Key Metrics, Citi, January 12, 2024, https://www.citigroup.com5 Bank of America Reports Q4-23 Net Income of $3.1 Billion, EPS of $0.35 Full-Year 2023 Net Income of $26.5 Billion, EPS of $3.08, Bank of America, January 12, 2024, https://d1io3yog0oux5.cloudfront.net6 Wells Fargo Reports Fourth Quarter 2023 Net Income of $3.4 billion, or $0.86 per Diluted Share, Wells Fargo, January 12, 2024, https://www08.wellsfargomedia.com7 Earnings Insight, FactSet, John Butters, January 12, 2024, https://advantage.factset.com\n\nCopyright 2024 Wall Street Horizon, Inc. All rights reserved. Do not copy, distribute, sell or modify this document without Wall Street Horizon's prior written consent. This information is provided for information purposes only. Neither TMX Group Limited nor any of its affiliated companies guarantees the completeness of the information contained in this publication, and we are not responsible for any errors or omissions in or your use of, or reliance on, the information. This publication is not intended to provide legal, accounting, tax, investment, financial or other advice and should not be relied upon for such advice. The information provided is not an invitation to purchase securities, including any listed on Toronto Stock Exchange and/or TSX Venture Exchange. TMX Group and its affiliated companies do not endorse or recommend any securities referenced in this publication. TMX, the TMX design, TMX Group, Toronto Stock Exchange, TSX, and TSX Venture Exchange are the trademarks of TSX Inc. and are used under license. Wall Street Horizon is the trademark of Wall Street Horizon, Inc. All other trademarks used in this publication are the property of their respective owners.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/despite-disappointing-bank-results-corporate-212233797.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BIRK.US", "BML-PL.US", "BOAC34.SA", "C.US", "GS.US", "GSPC.INDX", "JPM.US", "MS.US", "MSC.US", "NCB.XETRA", "TSM.US", "WFC.US"], "tags": [], "sentiment": {"polarity": 0.937, "neg": 0.072, "neu": 0.839, "pos": 0.089}}, {"date": "2024-01-16T21:13:36+00:00", "title": "Fed Can Cut Rates This Year Absent Inflation Rebound, Waller Says", "content": "(Bloomberg) -- Federal Reserve Governor Christopher Waller said the US central bank should take a cautious and systematic approach when it begins cutting interest rates, a process that can start this year absent a rebound in inflation.\n\nMost Read from Bloomberg\n\nBonds Slide as Fed’s Waller Downplays Need to Rush: Markets Wrap Iowa Latest: Haley Unveils New Ad, Looking to New Hampshire Trump Scores Easy Win in Iowa With DeSantis a Distant Second Musk Pressures Tesla’s Board for Another Massive Stock Award What Is Disease X? How Scientists Are Preparing for the Next Pandemic\n\n“As long as inflation doesn’t rebound and stay elevated, I believe the FOMC will be able to lower the target range for the federal funds rate this year,” Waller said at a virtual event hosted by the Brookings Institution on Tuesday.\n\n“When the time is right to begin lowering rates, I believe it can and should be lowered methodically and carefully,” he added.\n\nThe Fed governor offered some of the most detailed remarks to date around the Fed’s intentions to ease policy this year. While Waller showed an openness to cutting rates, his comments also appeared to push back against market expectations for as many as six rate cuts this year.\n\n“With economic activity and labor markets in good shape and inflation coming down gradually to 2%, I see no reason to move as quickly or cut as rapidly as in the past,” he said, pointing to previous economic shocks that have precipitated rapid rate cuts.\n\nTreasury yields jumped in the wake of Waller’s comments. Traders pared back the probability of a rate cut as soon as March as well as the degree of total policy rate declines seen for the full year.\n\nHe said the timing of cuts and the actual number “will depend on the incoming data.”\n\nWaller’s remarks highlighted his intention to balance risks to both sides of the Fed’s mandate and avoid staying restrictive for too long, while also not beginning to reduce rates before their 2% inflation goal was secure. He noted that he needs to see a moderation in consumption and hiring as well as continued low readings on monthly inflation data to bolster the case for a cut.\n\nStory continues\n\nWhile Waller said he’s becoming more confident that policymakers are “within striking distance” of reaching their 2% inflation target, “I will need more information in the coming months confirming or (conceivably) challenging the notion that inflation is moving down sustainably toward our inflation goal.”\n\nIf policymakers see a continuation in the trends seen in the real data and inflation data, “we can slowly calibrate the real rate cut down,” he said. “If we think we need to move it faster, we can move it faster depending on what the data says. But the key is we have the flexibility that we can be methodical and careful.”\n\nHe added that once the Fed is relatively convinced that inflation is sustainably near the central bank’s 2% target, policymakers can “start thinking how fast we want to cut, or how long, what the pace is, or how big.”\n\nAs for the central bank’s balance sheet, Waller said it would be reasonable to start thinking about slowing the pace of asset runoff “some time this year.”\n\nEconomists’ Reaction\n\nWhile Waller’s language suggested he favors starting rate cuts sooner rather than later, his comments also weren’t “a ringing endorsement” for a March cut, Bank of America’s Michael Gapen wrote. Instead, he said, the key takeaway of Waller’s speech related to the pace of easing.\n\nEconomists at Goldman Sachs also noted that Waller’s remarks “raise the risk that the first cut could come slightly later than our forecast of March and that the pace of cuts could be quarterly from the outset.”\n\nWaller said the surprising strength in the December jobs report was “largely noise” against a trend of ongoing moderation. He noted a number of 2023 jobs reports have been revised lower, and “there is a good chance December will be revised down.” The Fed governor also said he will be closely watching scheduled CPI revisions due next month.\n\nGovernment figures out this month showed employers added 216,000 jobs in December — exceeding expectations — while inflation picked up. The consumer price index increased 3.4% in the year through December, the most in three months, fueled by stubborn services costs and a pause in a months-long decline in goods prices.\n\nWaller described current financial conditions as restrictive and said “the setting of policy needs to proceed with more caution to avoid over-tightening.”\n\n“I believe policy is set properly,” he said. “It is restrictive and should continue to put downward pressure on demand to allow us to continue to see moderate inflation readings.”\n\nWaller last spoke on the economy on Nov. 28, two weeks before the Fed’s December meeting. At the time, he said, “I am increasingly confident that policy is currently well positioned to slow the economy and get inflation back to 2%.”\n\n--With assistance from Liz Capo McCormick.\n\n(Adds reaction from economists.)\n\nMost Read from Bloomberg Businessweek\n\nChinese Tycoon on the Rebound After $10 Billion Debt Deal There’s a Toxic Employee—and the CEO Is Ignoring the Issue Patti LaBelle Moves From Stage to Stove With a Recipe for Success How AI Replaced the Metaverse as Zuckerberg’s Top Priority Trumponomics 2.0: What to Expect If Trump Wins the 2024 Election\n\n©2024 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/fed-cut-rates-absent-inflation-161723769.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "GOS.F", "GOS.XETRA", "GS-PA.US", "GS-PC.US", "GS-PD.US", "GS-PK.US", "GS.MX", "GS.US", "GSGI34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0.954, "neg": 0.07, "neu": 0.844, "pos": 0.085}}, {"date": "2024-01-16T21:05:28+00:00", "title": "Investors give new Morgan Stanley CEO Ted Pick a rough reception as stock falls 4%", "content": "Investors gave Morgan Stanley's new boss a rough reception Tuesday, pushing down the firm’s stock more than 4% on the day of Ted Pick's earnings debut.\n\nThe Wall Street giant announced Tuesday that its profits fell 32% in the fourth quarter when compared with the same year-ago period. The decline was largely due to charges associated with a Justice Department settlement and a special assessment paid to the FDIC.\n\nRevenue from wealth management was roughly flat from a year earlier, while revenues from investment banking and trading were up. Morgan Stanley's new CEO Ted Pick. (Jeenah Moon/REUTERS) (Reuters / Reuters)\n\nWhat apparently concerned investors was a disclosure that lower margins in Morgan Stanley's wealth management business may stay that way for the near future.\n\nPick said that division will eventually be able to hit pre-tax margins of 30%. But for all of 2023 the margin was 24.9%, despite the firm adding $282.3 billion in net new assets. In the fourth quarter the margin was 21.5%, despite adding $47.5 billion in net new assets.\n\n\"Given some of the recent macro headwinds in our continued investments for growth, it's reasonable to expect reported margins to consolidate in the mid-20s range over the near term,\" Pick told analysts.\n\nMorgan Stanley's stock drop Tuesday was its sharpest single-day decline since Oct. 18. It is down roughly 8% since Pick started as CEO on Jan. 1.\n\nPick made it clear Tuesday that he intends to build upon a structure already established by his predecessor, James Gorman, instead of remaking it.\n\n\"There is not a change in strategy,\" he said. Former Morgan Stanley CEO James Gorman. (Evelyn Hockstein/REUTERS) (REUTERS / Reuters)\n\nThe target of a 30% margin in the firm's wealth management business — which when combined with investment management is now a bigger contributor to Morgan Stanley’s overall revenue than its investment bank — is one of four goals set by Gorman that Pick reinforced during his Tuesday call with analysts.\n\nThe other three were: $10 trillion in assets for wealth and investment management, a 70% firm-wide efficiency ratio, and a 20% return on tangible equity.\n\nStory continues\n\nAs of the end of the fourth quarter, the firm had $6.6 trillion in client assets between its wealth and investment management divisions, an 84% efficiency ratio, and 8.4% return on tangible equity.\n\n\"We will hit them,\" he said of the targets, but also added that it would \"take time.\"\n\nWhen asked by one analyst to compare his style with Gorman’s, Pick said he and his predecessor are \"more similar than not.\" He lauded Gorman’s positive mindset and how he infused consistency, rigor, and durability into Morgan Stanley’s operations.\n\nGorman took over in 2010 as the firm faced questions about its survival in the aftermath of the 2008 financial crisis.\n\nHe then made an aggressive push into wealth management as a way of smoothing out the volatility from trading and investment banking.\n\nPick was also there in 2008 and Tuesday he referenced that time, calling it \"our moment before the abyss.\"\n\n\"We are determined not to revisit anything that feels like those days,\" he added\n\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\n\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/investors-give-new-morgan-stanley-ceo-ted-pick-a-rough-reception-as-stock-falls-4-210528226.html", "symbols": ["0Q16.LSE", "0R01.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CMC.F", "CMC.XETRA", "CTGP34.SA", "DWD.F", "DWD.XETRA", "GOS.F", "GOS.XETRA"], "tags": [], "sentiment": {"polarity": 0.976, "neg": 0.021, "neu": 0.902, "pos": 0.077}}, {"date": "2024-01-16T20:14:13+00:00", "title": "Economic expectations for 2024: Davos Highlights", "content": "Yahoo Finance's exclusive coverage from the World Economic Forum in Davos, Switzerland continues as Yahoo Finance sat down with top leaders to discuss the economic outlook for 2024. Here are some of the highlights.\n\nBank of America CEO Brian Moynihan (00:00:03)\n\nBank of America CEO Brian Moynihan (BAC) explains why he thinks we will see a soft landing. “What a soft landing is, you don’t go negative in GDP growth on a quarterly basis… So now [our team’s] basic view is we drop from the growth rate in the third quarter 4 plus, down to 1 percent annualized GDP growth for the first three quarters. That is a soft landing. It didn’t go negative, but it landed and got near zero… That’s the prediction… And that’s largely due to the consumer,” Moynihan says.\n\nGuggenheim Partners Investment Management CIO & Managing Partner Anne Walsh (00:00:43)\n\nGuggenheim Partners Investment Management CIO and Managing Partner Anne Walsh discusses why she believes we will see “a mild recession.” “We’ve seen the yield curve being inverted for 300 plus days is a precursor to recession historically. And our view is, is that we are going to see a mild recession… just a good old-fashioned slowdown in business,” Walsh explains. “We’re just a little bit more concerned that the economy will slow down more than that soft landing view.”\n\nWalsh adds that she thinks of “the economy as almost two economies now.” “There’s the big companies, the big market participants, they all seem to be doing pretty well. They’re coming into this slowdown cycle with a tailwind... However, the small and midsize businesses in the U.S.,” Walsh explains, “that’s a different story. They’re going to be having to refinance as a refinancing wall in coming with commercial industrial loans, particularly in small and midsize banks.”\n\nStifel Financial CEO Ron Kruszewski (00:02:02)\n\nStifel Financial CEO Ron Kruszewski (SF) discusses expectations for rate cuts from the Federal Reserve in 2024. “The Fed will cut less than the market thinks and not as soon as the market thinks,” Kruszewski notes. “The definition of a soft landing would be that the Fed could cut while the economy’s strong. But the reason I tapped those expectations down a little bit, is that the Fed really was concerned about inflation… And I don’t see the Fed just saying ‘oh we’ve solved the problem’ by March.” Kruszewski adds that “a hard landing starts with a soft landing.”\n\nStory continues\n\nHarvard University Professor of Economics Kenneth Rogoff (00:02:47)\n\nKenneth Rogoff, Maurits C. Boas Chair of International Economics at Harvard University, explains why “the Fed just doesn’t know what it’s looking for.” The Federal Reserve “wants to find a path of interests rates so that inflation’s stable. They don’t know what it is and they’re going to feel it out,” Rogoff says.\n\nVideo Transcript\n\n[MUSIC PLAYING]\n\nBRIAN MOYNIHAN: What a soft landing is, you don't go negative in GDP growth on a quarterly basis. And so our team-- if we were talking last year, we did talk last year, they basically said, we're going to have a recession later in 23, early 24, and as the year went on, they pushed that out. And so now their basic view is, we drop from the growth rate in the third quarter 4-plus down to 1% annualized GDP growth for the first three quarters.\n\nThat is a soft landing. It didn't go negative, but it landed and got near zero, and so that's the prediction. The team does a great job, and that's why they've come out, and that's largely due to the consumer and the consumer strength and the resiliency and the spending and the capitalism and the entrepreneurism and innovation, US. That's what's-- the US is different.\n\nANNE WALSH: We've seen the yield curve being inverted for 300-plus days, is a precursor to recession, historically. And our view is that we are going to see a mild recession. We're not going to see the big pandemic or global financial crisis kind of recession, just a good old-fashioned slowdown in business. We're just a little bit more concerned that the economy will slow down more than that soft-landing view. I think of the economy as almost two economies now. It's very bifurcated.\n\nThere's the big companies, the big market participants. They all seem to be doing pretty well. They're coming into this slowdown cycle with a tailwind, and the tailwind is they've been able to pass along their higher costs. Their margins have been protected, and they have access to capital. However, the small and mid-sized businesses in the US, which make up about 50% of the GDP, I think that's a different story.\n\nThey're going to be having to refinance as a refinancing wall is coming with a commercial and industrial loans, particularly in small and mid-sized banks, and they're going to be refinancing at much higher rates, particularly relative to what the big participants can borrow at. They're still borrowing at prime 8.5% to 10% or more for those small and mid-sized businesses if they can access the capital at all. Otherwise, particularly for small businesses, they may be forced into credit card borrowing.\n\nRON KRUSZEWSKI: The Fed will cut less than the market thinks, and not as soon as the market thinks. The definition of a soft landing would be that the Fed could cut while the economy is strong, but the reason I tapped those expectations down a little bit is that the Fed really was concerned about inflation, witness the 500-basis-point increase.\n\nIt was every other month they're raising rates. And I don't see the Fed just saying, Oh, we solved the problem by March. Hard landing starts with a soft landing. So you can think about that, and the answer is that, yes, everything is set up. But there are so many variables that we don't know and mostly, geopolitical that can unveil the best laid plans of mice and men.\n\nKENNETH ROGOFF: If you look at the forecast, probably a recession is more likely than a boom. So maybe that's partly built in to what those predictions are. I think we have a soft landing. Maybe we'll get three cuts, something like that. I think the Fed just doesn't know what it's looking for. It wants to find a path of interest rates so that inflation is stable. They don't know what it is, and they're going to feel it out.\n\n[MUSIC PLAYING]", "link": "https://finance.yahoo.com/video/economic-expectations-2024-davos-highlights-201413035.html", "symbols": ["0Q16.LSE", "2SI.F", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "NCB.XETRA", "SF-PB.US", "SF.US"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.057, "neu": 0.849, "pos": 0.093}}, {"date": "2024-01-16T17:49:00+00:00", "title": "Wall Street’s Cloudy Quarter Has Some Rays of Sunshine", "content": "Wall Street hardly ended last year with a bang. Across the five biggest Wall Street megabanks, investment-banking fees in the fourth quarter—from issuance of stocks and bonds, plus advising on mergers and acquisitions—were up about 3% year-over-year. The “green shoots” that were talked up after third-quarter results remain scarce, as the market enters a year of uncertainty for politics, interest rates and economic growth.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4f623cd7-54bc-3099-bdf2-c30a7c967587/wall-street%E2%80%99s-cloudy-quarter.html", "symbols": ["0Q16.LSE", "0R01.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CMC.F", "CMC.XETRA", "CTGP34.SA", "DWD.F", "DWD.XETRA", "GOS.F", "GOS.XETRA"], "tags": [], "sentiment": {"polarity": 0.494, "neg": 0.035, "neu": 0.884, "pos": 0.081}}, {"date": "2024-01-16T17:32:37+00:00", "title": "How many times the Fed will cut interest rates is a hot topic in Davos", "content": "Climate change, deadly wars, and the proliferation of potentially job-ruining artificial intelligence are several of the biggest topics being chatted about at this year's World Economic Forum (WEF) in Davos, Switzerland.\n\nBut they aren't necessarily the hottest — that could be reserved for what the Federal Reserve may or may not do with interest rates in 2024. Why, you ask?\n\nThe stock prices of many of the large companies attending Davos are trading at or near records in part due to expectations of several rate cuts this year. With lower interest rates — as goes the logic — comes the potential for higher return on investment amid lower financing costs.\n\n\"Our team has four [rate] cuts next year and four cuts in 2025,\" Bank of America (BAC) CEO Brian Moynihan said on Yahoo Finance Live at WEF on Tuesday. \"And so that gets you down in the 3 to 3.25% range — so that will feel quick.\" Bank of America CEO Brian Moynihan speaks at the Reuters Next Newsmaker event in New York City, Nov. 8, 2023. (Brendan McDermid/REUTERS) (REUTERS / Reuters)\n\nAt its final policy meeting in late December 2023, the Federal Reserve held its key interest rate steady for the third consecutive time at 5.25% to 5.50%. Committee members jotted down at least three rate cuts this year in quarter point increments.\n\nIn typical form, investors read into the Fed's comments as more than three rate cuts — justifying higher stock prices.\n\nFor her part, Guggenheim Investment Management chief investment officer Anne Walsh told Yahoo Finance Live that she sees six rate cuts in the cards this year. The reason: an economic growth slowdown that weighs on inflation further, possibly leading to a mild recession.\n\n\"We're just a little bit more concerned that the economy will slow down more than that soft landing view,\" Walsh says.\n\nBut since the last Fed meeting, US economic data and Fed commentary hasn't supported the view of aggressive rate cuts and bullish stock bets.\n\nDecember's Consumer Price Index (CPI) rose 3.4% year over year, a quicker pace than the 3.1% increase in the prior month.\n\nStory continues\n\nVarious Fed members such as Christopher Waller have tamped down rate cut talk.\n\nAnd JP Morgan (JPM) CEO Jamie Dimon warned on his latest earnings report that inflation may prove stickier than market participants expect.\n\nThe outcome on rates, in the end, remains wildly unknown. To be sure, the answer to the question won't be solved at Davos.\n\nExperts on the ground tell Yahoo Finance that more caution on markets could be warranted in the near-term, pending more rate clarity.\n\nGuggenheim's Walsh thinks allocating more cash to fixed income makes sense right now.\n\n\"Fixed income has historically done very well when the Fed has paused and begins their easing cycle, which is exactly where we find ourselves. And so if we're going in that direction, fixed income, particularly investment-grade fixed income, is going to perform very well in that environment,\" notes Walsh. Davos 2024\n\nBrian Sozzi is Yahoo Finance's Executive Editor. Follow Sozzi on Twitter/X @BrianSozzi and on LinkedIn. Tips on deals, mergers, activist situations, or anything else? Email brian.sozzi@yahoofinance.com.\n\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/how-many-times-the-fed-will-cut-interest-rates-is-a-hot-topic-in-davos-173237714.html", "symbols": ["0Q16.LSE", "2SI.F", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "CMC.F", "CMC.XETRA", "JPM-PC.US", "JPM-PD.US", "JPM.MX", "JPM.US", "JPMC34.SA", "NCB.XETRA", "SF-PB.US", "SF.US"], "tags": [], "sentiment": {"polarity": -0.479, "neg": 0.063, "neu": 0.888, "pos": 0.049}}, {"date": "2024-01-16T13:08:13+00:00", "title": "Bank of America Corporation (NYSE:BAC) Q4 2023 Earnings Call Transcript", "content": "Bank of America Corporation (NYSE:BAC) Q4 2023 Earnings Call Transcript January 12, 2024\n\nBank of America Corporation beats earnings expectations. Reported EPS is $0.7, expectations were $0.69.\n\nOperator: Good day, everyone, and welcome to Bank of America's Earnings Announcement. At this time, all participants are in a listen-only mode. Later, you'll have the opportunity to ask questions during the question-and-answer session. [Operator Instructions] Please note this call may be recorded. I'll be standing by if you should need any assistance. It is now my pleasure to turn the conference over to Lee McEntire.\n\nLee McEntire: Good morning. Welcome, and thank you for joining the call to review our fourth quarter and full year results. We know it's a busy day for all of you. As usual, our earnings release documents are available on the Investor Relations section of bankofamerica.com website, and they include the earnings presentation that we will be referring to during this call. I trust everybody's had a chance to review the documents. I'll first turn the call over to our CEO, Brian Moynihan, for some opening comments before, Alastair Borthwick, our CFO, discusses the details of the quarter. Let me just remind you that we may make forward-looking statements and refer to non-GAAP financial measures during the call. Forward-looking statements are based on management's current expectations and assumptions that are subject to risks and uncertainties.\n\nFactors that may cause our actual results to materially differ from those expectations are detailed and our earnings materials and the SEC filings that are available on our website. Information about our non-GAAP financial measures, including reconciliations to US GAAP can also be found in our earnings materials and our website. So with that, I'll turn the call over to you, Brian. Thank you very much.\n\nBrian Moynihan: Thank you, and Happy New Year to everyone. Good morning. Thank you for joining us. I'm starting on Slide 2 of the earnings presentation. Here at Bank of America, our teammates finished 2023 with a solid fourth quarter. Reported EPS was $0.35, but that included two notable items that Alastair will describe in more detail. Adjusted for those two items, net income was $5.9 billion after tax or $0.70 per share. Before Alastair covers quarter four results, I want to take a moment and briefly review the 2023 full year results. Our team at Bank of America delivered strong profits for shareholders across a challenging year, navigating a slowing economy, geopolitical tensions, bank failures, and the impact of a rate hike of historic speed.\n\nStory continues\n\nWe began the year with a pretentious aura as economists predicted a mild recession within the year. Instead, 2023 showcased economic resilience led by US consumers despite higher interest rates. We ended 2023 with economists projecting the Fed has successfully steered the US economy to a soft landing. In regards to the economy, during 2023, we consistently made a few points regarding what we were seeing in our customer data here at Bank of America. First, the year-over-year growth rate in spending from the beginning of '23 started declining. And it went from, in the early part of '23 over the early part of '22 from a 9% to 10% growth rate to this quarter's 4% to 5% growth rate and that's where it stands here early in 2024. You can see that on Page -- Slide 29 in the appendix.\n\nThat growth rate, 4% to 5%, is more consistent with a 2% GDP environment and a lower inflation environment. Second, the point we've made is that our consumer deposit balances at Bank of America remained 30% higher than pre-pandemic. We saw the deposit balance of consumer accounts move lower this quarter, but are now seeing more differentiation in behavior. In the lower average balance size accounts, the balances in there still remain at multiples of pre-pandemic levels, nearly three years past last stimulus. They are modestly declining. The deposit outflows you've seen in consumer have largely been driven by the higher-balance accounts who've moved their excess balances into the markets to seek higher yields. We capture those with our leading wealth platform.\n\nThird, the consumers of Bank of America have had access to credit and are borrowing responsibly. The balance sheets are generally in good shape. And while impacted by higher rates, remember, many of them have fixed-rate mortgages and remain employed. So they've shown great resilience. Let's move to discussion of full year 2023 earnings. We reported net income of $26.5 billion after tax, which includes $2.8 billion after tax for notable quarter four items. Adjusted for those items, adjusted net income was $29.3 billion after tax. Earnings per share were $3.42 and that grew 7% over 2022. On that adjusted basis, we generated a 90 basis point return on assets and a 15% return on tangible common equity. The year 2023 was characterized by a record organic customer activity, record digital customer engagement levels and satisfaction scores, strong but slowing NII during the course of the year, strong sales and trading up 7% year-over-year, operating leverage reflected good expense discipline, solid asset quality and a strong capital and liquidity position.\n\nAll this was helped by the years of Bank of America's assiduous dedication to responsible growth. This helped us bring our headcount and expense down every quarter during 2023, in line with what we told you to expect early this year -- early last year. Adjusted full year revenue grew 5% on the back of 9% NII improvement and strong asset management fees and sales and trading results. We achieved 170 basis points of operating leverage in 2023 as heightened quarterly expense levels were driven lower throughout the year even as the investments in growth continued. Net charge-offs moved higher through the year off the historic lows, but they still compare very favorably against historic averages. One last point worth noting is the level of deposits.\n\nIf you think back as we ended 2022 and entered 2023, the great debate was how much the pandemic surge in deposits would dissipate. But looking today, we ended 2023 with $1.924 trillion of deposits, only $7 billion less than we had at year-end '22 and 4% higher than the trough in May of this year. The total deposits -- the total average deposits in the fourth quarter remained 35% higher than they did in the quarter four of 2019. This has been tremendous works by our teams to drive our industry-leading market share, actually outperforming the industry across the four-year period, and again this year. While the economy appears to continue to normalize and rates continue to have some volatility, one thing that remains important is driving that organic growth.\n\nThis client activity sticks to the ribs is what we want to spend a moment as I wrap up. On Slide 3, we highlight some of the successes in organic activity in our results for the year. Bank of America team is a powerful engine that's fueling results across all our businesses. I would note a couple of examples to try and connect the importance to our financials. It's easy to use the consumer business as an example. In consumer, we added 600,000 net new checking accounts during the year 2023. The fourth quarter of 2023 represents the 20th straight quarter of net addition of head -- of checking accounts. The quality is what drives the checking account balances. On average, 67% of the deposit balances have been with us for customers who have been with us for more than 10 years.\n\n92% of the consumer checking accounts are primary, meaning they're the core client household account. 60% of our checking accounts use their debit card. They average 400 transactions per account each year, showing how engaged they are. They have traditionally opened savings accounts 20% to 25% of the time within a few months of opening their checking accounts. Thinking about those new accounts, at opening those new checking accounts opened last year, bring in about $4,000 of balances. Then they deepen over the next subsequent months to two times that amount. New saving accounts come with those accounts, starting with about $8,000 and doubling over time. From the total new checking accounts we opened just in 2023, those customers have opened nearly 0.5 million credit card accounts with us so far in 2023.\n\nHistorically, we've seen on average these customers more than doubled those card balances within a year. Those card accounts on average have spent about $7,000 per year, of which a portion will carry a balance. Now, there's always additional opportunity to further serve our clients and to continue to meet them where they are. In addition to the industry-leading digital platforms that we have, we have opened 50 new financial centers in 2023. More than half of those were in our expansion markets. We've expanded our presence during 2023 to 10 markets, including our latest opening in Omaha. In our global wealth management team, we added more than 40,000 net new relationships across Merrill and the Private Bank. Our advisors opened 150,000 new banking accounts for wealth management clients, showing the completeness of the relationship approach.\n\nThe average Merrill account is over $1 million at opening. The average private bank account is multiples of that. As you can see on the slide, we now manage $5.4 trillion of client balances across loans, deposits, investments of our consumer clients, both consumer and GWIM. We saw $84 billion of flows into those accounts last year. As we switch to Global Banking on the lower-left-hand side of the slide, we added clients to increase the number of products per relationship. Just like in consumer, we have seen good growth in customers seeking the benefits of our physical and digital capabilities, but most importantly, our talent relationship managers who provide financing solutions, treasury services, strategic advice for clients with local and global needs.\n\nWe added roughly 2,500 new commercial and business banking clients this year. That is more than twice what we added in 2022. We look forward to continue to drive with those -- grow with those clients in '24 and add even more. This capitalized on a multi-year build of our relationship management team in the Global Banking businesses, especially in product expansion also, especially in the global transaction services area and mid-market investment bank. As we think about global markets, we continue to see strong performance from our team with 7% year-over-year revenue growth, the strongest we've had in many years. We see digital tools our customers have access to across the board, helping us enable this activity at lower costs. Our normal digital banking slides are once again included for your reference on Pages 21, 24 and 26.\n\nIn summary, this was a good quarter. We delivered our third quarter of expense declines. We saw NII outperform what we expected when we talked to you on the last earnings call. We continue to manage well through the transition and the rate structure. We saw deposits grow this quarter. And we look forward with a strong capital base, strong liquidity and growing loans and deposits to a greet 2024. I want to thank my teammates for what they did for us in 2023, and we all know we're off to a nice start for '24. With that, I'll turn it over to Alastair.\n\nAlastair Borthwick: Thank you, Brian. And I'm going to start on Slide 4 of the earnings presentation to provide just a little more context on the summary income statement and the highlights. For the fourth quarter, as Brian noted, we reported $3.1 billion in net income or $0.35 per diluted share. That GAAP net income number included two notable items. First, we recorded $2.1 billion of pretax expense, that's $0.20 after-tax earnings per share for the special assessment by the FDIC to recover losses from the failures of Silicon Valley and Signature Bank. Second, on November 15th 2023, Bloomberg announced that they would discontinue publishing the Bloomberg Short-Term Bank Yield Index rate after November 15th 2024 and many commercial loans in the industry had BSBY as a reference rate prior to SOFR becoming industry-standard.\n\nAs noted in an 8-K we filed earlier this week, we came to conclusion in early January that BSBY cessation would not get the same accounting treatment allowed under LIBOR cessation. And therefore cash-flow hedges of BSBY indexed products related to BSBY cash flows, forecast to occur after November 15th 2024, we need to be moved out of OCI into earnings in the fourth quarter of '23 financials. So as a result of the accounting interpretation, we recorded a negative pretax impact to our market making revenue of approximately $1.6 billion. I just want to reinforce that's an accounting impact. It's not an economic change to the contracts and we'll see an offset to this over time through higher NII mostly occurring in 2025 and 2026 after BSBY ceases in November 2024.\n\nThe accounting lowered CET1 by 8 basis points during the quarter and we will recapture that in the next two or three years. Adjusted for the FDIC assessment and the BSBY cessation related impact, Q4 net income was $5.9 billion, or $0.70 per share. On Slide 5, we show the highlights of the quarter and we reported revenue of $22.1 billion on an FTE basis. And excluding the BSBY cessation impact, adjusted revenue was $23.7 billion and declined 4%, driven by net interest income. Fourth quarter revenue is a tough year-over-year comparison as NII peaked in the fourth quarter of '22 at $14.8 billion, before slowly moving lower over 2023. Outside of NII, we saw good growth in treasury service fees and wealth management fees and those were offset by higher tax-advantaged investment deal activity, creating higher operating losses and the more tax credits associated with them and recognized across periods.\n\nExpense for the quarter of $17.7 billion included the $2.1 billion FDIC charge. So excluding that charge, adjusted expense was $15.6 billion and consistent with our prior guidance. That allowed us to invest for growth, as well as use good expense discipline to eliminate work and reduce headcount. And on an adjusted basis, this then is the third quarter of sequential expense decline this year. Provision expense for the quarter was $1.1 billion, that consisted of $1.2 billion in net charge-offs and a modest reserve release, reflecting the improved macroeconomic outlook. Net charge-offs reflect the continued trend in consumer and commercial charge-offs towards more normalized levels as well as higher commercial real-estate office losses. Lastly, our income tax expense this quarter was a modest benefit as credits from tax-advantaged investment deals offset the tax expense on the lower earnings in Q4 driven by the notable charges.\n\nSo let's review the balance sheet on Slide 6, and you'll see we ended the quarter at $3.2 trillion of total assets, up $27 billion from the third quarter. I'd highlight here, both the $39 billion growth in deposits and a decline in cash on balance sheet of $19 billion. Overall, you'll note the debt securities increased $92 billion. And that included a $9 billion decline in hold-to-maturity securities, and $100 billion increase in available-for-sale securities reflecting short term investment of liquidity from all of these activities. We continue to put money into very short-term T-bills and hedged treasury notes this quarter and those are essentially earning the same rate as cash. And you can see our absolute cash levels remain quite high. As Brian noted, liquidity remained strong with $897 billion of global excess liquidity sources. A professional banker providing consultation to a customer in the security of his office.\n\nThat was up $38 billion from the third quarter of '23 and it remained $321 billion above our pre-pandemic level in the fourth quarter of '19. Shareholders' equity increased $5 billion from the third quarter as earnings and AOCI improvement were only partially offset by capital distributed to shareholders. The AOCI improved $4 billion, reflecting both the previously mentioned BSBY-related reclassification into fourth quarter earnings and other AOCI improvements. This included some improvements in other cash-flow hedges, which don't impact regulatory capital, driven by a decline in long-end rates. During the quarter, we paid out $1.9 billion in common dividends and we bought back $800 million in shares, which more than offset our employee awards.\n\nTangible book value per share is up 3% linked-quarter and 12% year-over-year. Turning to the regulatory capital, our CET1 level improved to $195 billion from September 30th, while the CET1 ratio declined 9 basis points to 11.8% and remains well above our current 10% requirement as of January 1st '24. We also remained well-positioned against the proposed capital rules, as our current CET1 level matches our 10% minimum against anticipated RWA inflation from the proposed rules. Risk-weighted assets increased $19 billion on loan growth and growth in global markets, RWA, and our supplemental leverage ratio was 6.1% versus the minimum requirement of 5%, which leaves plenty of capacity for balance sheet growth and our TLAC ratio remains comfortably above requirements.\n\nSo let's focus on loans by looking at the average balances on Slide 7. And you can see loan growth improved this quarter as we saw improvement in both credit card and commercial borrowing, offset by declines in commercial real estate and securities-based lending. The commercial growth reflects good demand overall and was muted only at quarter-end by companies paying down commercial balances as they finalized their year-end financial positions. Lastly, on a positive note, we've seen loan spreads continue to widen, given some of the capital pressures from proposed rules on the banking industry, and this combined with investments in relationship managers we've added over the past few years, has positioned us to take market-share and improved spreads.\n\nMoving to deposits, I'll stay focused on averages on Slide 8, and the trends of ending balances saw growth in Global Banking and wealth management and declines in consumer. Relative to the pre-pandemic fourth quarter '19 period, average deposits are still up 35%. Every line of business remains well above their pre-pandemic levels. Consumer is up 33%, with checking up 40% driven by the net-new checking accounts added that Brian noted earlier. On a more recent performance basis, deposits grew $29 billion or 6% from Q3 on an annualized basis. The only business that saw a decline in deposits linked-quarter was consumer. And here we saw a decline of $21 billion. This linked-quarter decline slowed from the third quarter change. And in total, we have $959 billion in high-quality consumer deposits, which remains $239 billion above pre-pandemic levels.\n\nThe total rate paid on consumer deposits in the quarter was 47 basis points and this remains very low, driven by the high mix of quality transactional accounts. Most of this quarter's rate increase remains concentrated in CDs and consumer investment deposits, which together only represent 15% of the consumer deposits. Turning to wealth management, balances on an end-of-period basis improved modestly, and we continued to experience a slowing in the trend of clients moving money from lower-yielding sweep accounts into higher-yielding preferred deposits and off-balance sheet. Our sweep balances were down $4 billion and were replaced by new account generation and deepening. Global Banking deposits grew $23 billion, moving nicely above the $500 billion level that we've experienced over the course of the past six quarters.\n\nThese deposits are generally transactional deposits of our commercial customers. They are the ones that used to manage their cash flows. And noninterest-bearing deposits were about 33% of deposits at the end of that quarter. So when we turn to excess deposit levels on Slide 9, you can see deposit growth exceeded loan growth this quarter. And that expanded our excess of deposits above loans, from Q3 to about $0.9 trillion, which is well above the $0.5 trillion we had pre-pandemic. You can see that in the upper-left of Slide 9, which is where we've used and shown you how we think about managing excess liquidity. We continue to have a balanced mix of cash available-for-sale securities and held-to-maturity securities. And this quarter, the combination of the cash and the AFS securities now represent 51% of the total $1.2 trillion noted on this page.\n\nYou'll also notice the change in mix of the shorter-term portfolio as we began to lower cash and increase available-for-sale securities buying mostly short-dated T-Bills with similar yields. You can note also the hold-to-maturity book continued to decline from paydowns and maturities pulling to PAR. In total, the hold-to-maturity book moved below $600 billion this quarter. It's now down $89 billion from its peak and it consists of about $122 billion in treasuries and about $465 billion in mortgage-backed securities along with a few billion others. Also note that the blended cash and securities yield continued to rise and remained about 170 basis points above the rate we pay for deposits. The replacement of these lower earning assets into higher yielding assets continues to provide an ongoing benefit and support to NII.\n\nFrom a valuation perspective, given the reduced balance and the longer-term interest-rate reductions we've seen in the fourth quarter, we experienced an improvement of more than $30 billion in the valuation of the hold-to-maturity securities. So, let's turn our focus to NII performance using Slide 10. And a strong finish to the year helped us report $57.5 billion in NII on a fully tax-equivalent basis for the full year of 2023. That's up 9% compared to 2022. On an FTE basis, we reported $14.1 billion in NII, which was modestly better than we told you to expect last quarter driven by modestly better deposit growth. The $14.1 billion was a decline of $400 million from the third quarter, driven by the unfavorable impacts of deposits and related pricing and lower global markets NII, partially offset by higher rates benefiting asset yields.\n\nAnd as we look forward, given that we've got one less day of interest in the first quarter and that's worth about $125 million to $150 million, and given the rate curve shift, we believe the first quarter will be somewhere between $100 million and $200 million lower than the fourth quarter. It could move a touch lower in Q2 and then we believe it should begin to grow sequentially in the second half of 2024. So very consistent with our prior guidance. With regard to the forward view I just provided, let me note a few other caveats. It would include an assumption that interest rates in the forward curve materialize. And the forward curve today has six cuts compared to last quarter when we had three cuts in the 2024 curve. So it's bouncing around a little and shifted in the past quarter.\n\nForward view also includes our expectation of low to mid-single-digit loan growth and some moderate growth in deposits as we move into the back half of 2024. Given our recent deposit and loan performance, we continue to feel good about these assumptions. Before moving away, it's worth noting our net interest yield declined 14 basis points to 197 basis points. And that's driven by the decline in NII, as well as higher average earning assets, reflecting prior period builds of cash and cash-like securities. Turning to asset sensitivity and focusing on a forward yield curve basis, the plus 100 basis point parallel shift at December 31st was $3.5 billion of expected NII over the next 12 months, coming from our banking book. And that assumes no expected change in balance sheet levels or mix relative to our baseline forecast, and 93% of that sensitivity is driven by short rates.\n\nThe 100 basis point down scenario is $3.1 billion. Let's turn to expense and we'll use Slide 11 for the discussion. And we reported $15.6 billion in adjusted expense this quarter, which excludes the FDIC assessment. This was in line with our projection from last quarter and down $199 million from the third quarter, driven by reductions in headcount earlier in the year and seasonally lower revenue-related expense. These reductions outpace the continued investments that we're making to drive growth. Our average headcount was down from the third quarter to 213,000 people, and that's good work after peaking at 218,000 last January. We lowered our headcount through the year by 5,000 and did so without taking an outsized severance charge as we used attrition to lower our headcount along the way.\n\nOne more point to acknowledge the good work of our teams on expense, Q4 '23 adjusted expense of $15.6 billion is only $94 million higher than the fourth quarter of '22. And just remember, we began 2023 with a $125 million lift in quarterly FDIC expense. So through some good operational excellence work and otherwise, we've managed through all of the additional costs of investments in new tech initiatives and merit and financial center openings, as well as some stronger revenue and higher marketing costs. As we look forward to next quarter, we expect to see the more typical Q1 seasonal elevation in expense of $700 million to $800 million compared to Q4. So we believe expense will be around $16.4 billion in the first quarter. That includes elevated payroll tax expense and the expected costs of higher revenue in both sales and trading and wealth management, as well as merit cost increases.\n\nAnd as we move through 2024, we expect the quarterly expense to decline from Q1, reflecting a drop in the elevated payroll tax expense and revenue changes, as well as some additional operational excellence initiative work. Continued digital transformation and adoption is also going to help us as we go through the year. Now turn to credit, and I'll use Slide 12 for that. Provision expense was $1.1 billion in the fourth quarter and it included an $88 million reserve release due to a modestly improved macroeconomic environment. On a weighted basis, we're reserved for an unemployment rate of nearly 5% by the end of 2024 compared to the most recent 3.7% rate reported. Net charge-offs of $1.2 billion increased $261 million from the third quarter, and the net charge-off ratio was 45 basis points, a 10 basis point increase from the third quarter.\n\nOn Slide 13, we highlight the credit quality metrics for both our consumer and commercial portfolios, and the overall increase in net charge-offs was driven by three things. First, $104 million of the increase was driven by credit card losses, which continued to normalize as higher late-stage delinquencies flowed through to charge-offs. Second, $65 million of the increase was driven by a broad range of smaller commercial and industrial losses, which were mostly previously reserved and monitored for the past couple of quarters. And lastly, $76 million of the increase was driven by commercial real estate losses, primarily due to office, also mostly reserved. In the appendix, we've included a current view of our commercial real estate and office portfolio stats provided last quarter, and we've also included the historical perspective of our loan book de-risking and long term trend of our consumer and commercial net charge-offs, and you can see those on slides 30 to 33.\n\nLet's move on to the various lines of business and their results and I'll start on Slide 14 with Consumer Banking. For the quarter, consumer earned $2.8 billion on continued good organic growth and despite their good client activity, it's difficult to outrun the earnings impact of higher rates on deposit costs while the credit is also normalizing. The reported earnings declined 23% year-over-year as top line revenue declined 4% while expense rose 3% and the credit costs rose. Customer activity showed another strong quarter of net new checking growth, another strong period of card opening and investment balances for consumer clients which climbed $105 billion over the past year to a record $424 billion. Our full year flows were $49 billion as accounts grew 10% in the past 12 months.\n\nLoan growth was led by credit card and that broke above $100 billion this quarter. Deposit decline slowed in the quarter with continued strong discipline around pricing. And our expense reflects continued business investments for growth. And as you can also see on the appendix page 21, digital engagement continued to improve and showed good year-over-year improvement as customers enjoy the continuation of enhanced capabilities. Moving to Wealth Management on Slide 15. We produced good results, earning a little more than $1 billion after adding 40,000 net new relationships in Merrill and the private bank this year. These results were down from last year as a decline in NII from higher deposit costs still catching up from the interest rate hikes, more than offset higher fees from asset management, driven by higher market levels and assets under management flows.\n\nAs Brian noted earlier, both Merrill and the private bank continued to see strong organic growth and produced solid assets under management flows of $52 billion since the fourth quarter of '22, which reflects a good mix of new client money as well as existing clients putting their money to the work. Expenses reflect continued investments in the business and revenue related costs. On Slide 16, you see the global banking results. The business produced strong results with earnings of $2.5 billion as a decline from peak levels of NII was offset by lower provision expense, leaving earnings down 3% year-over-year. Revenue declined 8%, driven by the NII. Our global treasury services business remained robust with strong business from existing clients as well as good new client generation.\n\nIn addition, we continued to see a steady volume of solar and wind investment projects this quarter and our investment banking business continued to perform well in a sluggish environment. Year-over-year revenue growth also benefited from lower marks on leveraged loan positions. The company's overall investment banking fees were $1.1 billion in Q4. That grew 7% over the prior year despite a fee pool that was down 8%. And for the year we held on to the number three position overall, given that performance. In the component parts, we ended the year number one in investment grade, number two in leverage finance, number four in equity capital markets, and number four in mergers and acquisition. The diversification of the revenue across products and regions reflects the growing strength of our platform, and a good example of that is our focus on the equity capital markets blocks business, where we finished number one in the United States for the first time since 1998.\n\nAnd in EMEA, we were also number one for blocks. Provision expense reflected a reserve release of $399 million and that comes from an improved macroeconomic outlook as well as realized charge-offs better, as noted before. Expense decreased 2% year-over-year as continued investments in the business were more than offset by reductions in other operating costs. Switching to Global Markets on Slide 17, the team had another strong quarter, with earnings growing 13% year-over-year to $736 million, driven by revenue growth of 4% and we refer to results excluding DVA as we normally do. Good results in sales and trading and comparatively low remarks on leverage loan positions drove the year-over-year performance and focusing on the sales and trading ex-DVA, revenue improved 1% year-over-year to $3.8 billion, which is a new fourth quarter record for the firm.\n\nFICC was down 6% from a record quarter, while equities increased 12% compared to the fourth quarter of '22. And the FICC revenues were down versus that record fourth quarter level with higher revenues in mortgages and municipal trading. Equities was driven by improved trading performance in derivatives. And our expense was up 3% on continued investment in the business. Finally, on Slide 18, all other shows a loss of $3.8 billion, as the two notable items highlighted earlier negatively impacted net income by $2.8 billion in that segment. Revenue adjusted for the $1.6 billion BSBY cessation was flat year-over-year, and expense adjusted for the $2.1 billion FDIC assessment was down a couple hundred million, driven by lower litigation and lower unemployment processing costs.\n\nI noted earlier we reported a modest tax benefit this quarter. The tax credits from tax advantaged investment deals throughout the year, including their benefits in the fourth quarter, exceeded taxes on reported earnings because we had the two notable items that lowered results this quarter. For the full year, our tax rate was a little more than 6%. And excluding the impacts of BSBY cessation and FDIC and the other discrete tax benefits, that rate was 10%. And further excluding our investment tax credits, our tax rate would have been 25%. So thank you. And with that, we'll launch into the Q&A, please.\n\nSee also 30 Cheapest Places Across America Where You Will Want to Retire and 12 Countries with Best Intelligence Agencies.\n\nTo continue reading the Q&A session, please click here.", "link": "https://finance.yahoo.com/news/bank-america-corporation-nyse-bac-130813885.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.027, "neu": 0.825, "pos": 0.147}}, {"date": "2024-01-16T12:45:47+00:00", "title": "Goldman posts 51% gain in last quarter of David Solomon's most challenging year as CEO", "content": "Goldman Sachs (GS) in 2023 recorded the lowest profit since David Solomon’s first year as CEO but posted a sizable gain in the fourth quarter as equities trading and wealth management rose.\n\nGoldman reported Tuesday that its full-year net income of $8.52 billion for 2023 was down 24% as dealmaking slowed across the industry and the firm absorbed costs associated with an exit from consumer lending.\n\nThat was the worst mark for Goldman since it earned $8.46 billion in 2019, Solomon's first full year in charge. He became CEO at the end of 2018.\n\nThe 2023 drop is also the second-largest among the big banks for 2023, trailing only Citigroup’s 38% profit plunge. David Solomon, CEO of Goldman Sachs (Tom Williams/CQ-Roll Call, Inc via Getty Images) (Tom Williams via Getty Images)\n\nBut it did benefit in the fourth quarter from a trading turnaround. Its earnings of $2 billion rose by 51% from the year-ago quarter, helped by a surge in equities trading and higher asset and wealth management revenues.\n\nIts investment banking revenues, however, were still down 12% from a year ago but up 6% from the third quarter of 2023.\n\nThe 24% drop in profit during 2023 coincided with a challenging year across much of Wall Street as dealmaking slowed, thousands of jobs were cut and bonuses were slashed.\n\nBy one measure, it was the worst in a decade for the industry. Revenue from investment banking was the lowest of any year since 2013, according to data from Dealogic.\n\nNo firm was under a bigger spotlight than Goldman and its CEO. Solomon spent much of the year attempting a tricky retrenchment from consumer lending while focusing the firm on its core strengths of investment banking, trading, and asset management.\n\nAn expansion into consumer banking has cost the firm $4 billion since 2020. Over the course of 2023 it has taken several steps to exit that business.\n\nGoldman in late August announced it found a buyer for a personal finance unit catering to the mass affluent. Then in early October, it announced the sale of specialty lender GreenSky to Sixth Street Partners and a consortium of other firms.\n\nStory continues\n\nCredit card partnerships with General Motors (GM) and Apple may also be coming to an end.\n\nThe slump weighing down much of Wall Street is two years in the making. It started in 2022, following a boom in 2021 when Goldman earned more than $21 billion.\n\nClients turned cautious about everything from the direction of interest rates to relations with China to the larger US economy, dampening the optimism needed to go public, buy companies, or take on more debt.\n\nLast year was supposed to be when things turned around, fueled by a series of public offerings that would finally break open an IPO logjam. Several companies did go public in the third quarter — including ARM Holdings (ARM), Instacart (CART), and Klavyio (KVYO) — but some fell in price after their market debuts.\n\nThat mixed performance raised questions about whether other companies considering an IPO would follow. Those doubts intensified amid higher borrowing costs, concerns about an extended period of high interest rates, volatility from geopolitical tensions, and new worries about the possibility of a recession.\n\nMany executives that had been touting signs of \"green shoots\" warned it would now likely take longer for any sustained gains to show up.\n\nMany on Wall Street predict this coming year will be better, with more mergers and initial public offerings returning after a long drought.\n\nBut many things have to go right for that to happen. Not only does the economy have to take off, but leaders of companies need to become a lot more certain about the future.\n\nWall Street is betting the spark will be the end of the Federal Reserve’s aggressive monetary tightening campaign and that interest rate cuts could start as early as March.\n\nOne danger is that the Fed doesn’t act on that same timetable, or that inflation surges again, forcing the central bank to hold rates higher for longer.\n\nAnother is that rates come down because a recession is raging.\n\nDavid Hollerith is a senior reporter for Yahoo Finance covering banking, crypto, and other areas in finance.\n\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/goldman-posts-51-gain-in-last-quarter-of-david-solomons-most-challenging-year-as-ceo-124547674.html", "symbols": ["0Q16.LSE", "0R01.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CMC.F", "CMC.XETRA", "CTGP34.SA", "DWD.F", "DWD.XETRA", "GOS.F", "GOS.XETRA"], "tags": [], "sentiment": {"polarity": 0.813, "neg": 0.089, "neu": 0.817, "pos": 0.093}}, {"date": "2024-01-16T12:43:54+00:00", "title": "30 Cheapest Places Across America Where You Will Want to Retire", "content": "This article takes a look at the 30 cheapest places across America where you will want to retire. If you wish to skip our detailed analysis on retirement savings in the US, you may go to 10 Cheapest Places Across America Where You Will Want to Retire.\n\nRetirement Savings in the US\n\nRansacking your retirement nest egg? You're not the only one. According to a Bank of America Corporation (NYSE:BAC) survey, many clients have been taking hardship withdrawals from their retirement plans, up 13% in Q3, 2023 compared to Q2, 2023. Tracking approximately 4 million clients' employee benefits programs, Bank of America Corporation (NYSE:BAC) notes that more than 18,000 plan participants have been leveraging this quick cash scheme, a financial move that isn’t without its significant share of repercussions.\n\n“While there could be several factors at play, the economic environment, following a year of high inflation and the rising cost of living, could be influencing this ongoing trend.\"\n\n-Lisa Margeson, Retirement Research and Insights Group at Bank of America Corporation (NYSE:BAC)\n\nFinancial service companies such as Morgan Stanley (NYSE:MS) strongly advise against tapping into 401(k) accounts because they come at a price. For instance, those who tap into these funds before the plan's normal retirement age incur an additional income tax of 10%, according to the Internal Revenue Service. Moreover, such withdrawals inhibit the potential compounding of investment returns, a consequence that hampers retirement savings in the long run.\n\nUnfortunately, many individuals don’t have an option but to tap into these savings. Besides Bank of America Corporation (NYSE:BAC), reports from sources such as Fidelity and Empower are also demonstrating similar trends. For example, Fidelity has found that hardship withdrawals jumped by a whopping 25% from 2022 to 2023. Meanwhile, Empower, another financial services company, noted a 46% jump in hardship withdrawals in the year 2023.\n\nStory continues\n\n“Once you take that money out you lose the savings but you also lose any ability to make more money off that in the future.”\n\n-NewsNation business contributor Gary Smith.\n\nIn such a case, it is better for potential retirees as well as those who have already entered their retirement phase to make necessary lifestyle adjustments that can help them avoid tapping into retirement savings before time, or more than required. Retirees can also make smart moves that can help them stretch their retirement savings. For instance, moving to states with the lowest cost of living can help retirees save further. Examples of such states include West Virginia, Mississippi, Alabama, and Kansas, to name a few.\n\nWithin such states, retirees can find some of the cheapest places to retire where the cost of living is $2,500 or even less. Examples include Springfield, Illinois; Mobile, Alabama; and Akron, Ohio; to name a few. Retirees are relocating across states to many of these areas, and Florida remains a top contender for many retirees, notes AARP. According to a new study compiled by the US Census Bureau, 11% of retiree relocations in 2023 were to Florida, while South Carolina was a close second, drawing 10% of all retiree moves. Moreover, a spokesperson from Hire a Helper notes that more and more of these individuals are looking for a place that is \"warm\" yet \"not as expensive\".\n\nWhile California and New York are losing out on retirees due to the obvious cost-of-living highs, other states have been marking gains such as New Jersey and Texas. Even though New Jersey isn’t exactly a cheap state to retire to, it still makes sense for retirees coming in from states such as New York. No matter what state, city, or town one chooses to retire to, one must make sure that they have access to factors such as healthcare and other necessary amenities that can help them live a comfortable retirement.\n\nTo help retirees move to cheap yet desirable locations, we have compiled a list of places across America that they can choose. 30 Cheapest Places Across America Where You Will Want to Retire\n\nMethodology\n\nTo compile the list of cheapest places across America where you will want to retire, we used a consensus approach to draft a list of all potential cheap destinations that individuals can retire to. Sources include US News Real Estate, CNBC, The Travel, and forums such as Reddit and Quora, amongst others.\n\nNext, we ranked them on their cost of living indices sourced from Best Places, as well as livability scores from Area Vibes. An average ranking was calculated that was deemed as our Insider Monkey Score. Places were ranked in ascending order from the lowest to the highest scores.\n\nThe cost of living for all the selected places is 99 or below, implying a cost of living that is 1% or more below the national average. Livability scores are 60 and above, implying an above-average score. It must be noted here that there are both good and bad areas within a particular city or town. The key to choosing the best area for living is to do the necessary homework, talk to neighbors, decide which amenities are important when living in an area, and then make a final decision.\n\nBy the way, Insider Monkey is an investing website that tracks the movements of corporate insiders and hedge funds. By using a similar consensus approach, we identify the best stock picks of more than 900 hedge funds investing in US stocks. The top 10 consensus stock picks of hedge funds outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). Whether you are a beginner investor or professional one looking for the best stocks to buy, you can benefit from the wisdom of hedge funds and corporate insiders.\n\nHere are the cheapest places across America where you will want to retire:\n\n30. Fargo, North Dakota\n\nInsider Monkey Score: 4\n\nCost of Living: 90.6\n\nLivability Score: 85\n\nFargo has been an ideal retirement destination for numerous sources such as Forbes for quite some time now. Revered especially for its affordability, the city offers seniors a cost of living that is 9.4% lower than the national average, whereas there are plenty of amenities for the elderly as well.\n\n29. Huntsville, Alabama\n\nInsider Monkey Score: 4.5\n\nCost of Living: 94.2\n\nLivability Score: 81\n\nOne of the cheapest places across America where you will want to retire is Huntsville, Alabama. According to Redfin Corporation (NASDAQ:RDFN), the median home value in the city hovers around an affordable $314,000 while the average rent for a one-bedroom apartment is under $1,000.\n\n28. Des Moines, Iowa\n\nInsider Monkey Score: 9.5\n\nCost of Living: 86.6\n\nLivability Score: 81\n\nFrom abundant healthcare facilities to museums, art venues, and other big-city amenities, Des Moines is one of the cheapest places to retire with good healthcare in the USA. Homes in the area are selling for a median price of $205,000, and rents are affordable as well.\n\n27. Milwaukee, Wisconsin\n\nInsider Monkey Score: 10.5\n\nCost of Living: 88\n\nLivability Score: 78\n\nThis budget-friendly Midwest city is one of the cheapest places to retire in the USA. Seniors love this bustling city for its amazing array of restaurants and shops, museums, and good access to healthcare. The cost of living is 12% lower than the national average, and the place also boasts a good livability score.\n\n26. Rochester, New York\n\nInsider Monkey Score: 12\n\nCost of Living: 88.6\n\nLivability Score: 75\n\nThe flower city of Rochester is revered for its affordability despite being located in the expensive state of New York. Its bustling arts scene, vibrant downtown, and affordable housing make it one of the cheapest places across America to retire.\n\n25. Greensboro, North Carolina\n\nInsider Monkey Score: 12.5\n\nCost of Living: 84.2\n\nLivability Score: 82\n\nOne of the best places to retire in North Carolina is Greensboro. Besides the abundant healthcare facilities, the city offers seniors many parks, recreational areas, as well as a diverse culinary scene.\n\n24. Oklahoma City, Oklahoma\n\nInsider Monkey Score: 13.5\n\nCost of Living: 85.5\n\nLivability Score: 79\n\nSeveral sources such as Forbes have claimed that Oklahoma City is one of the best places to retire in the US, citing reasons such as affordable housing, low cost of living, and abundant restaurants and nightlife options. The cost of living in the city is 14.5% lower than the national average, and the livability score is well above average too.\n\n23. Columbia, South Carolina\n\nInsider Monkey Score: 13.5\n\nCost of Living: 87.4\n\nLivability Score: 76\n\nAccording to Zillow, the median price of a home in Columbia is $219,579. Rent prices are affordable too, with the median rent price for all property types being a reasonable $1,400 only. The capital city is home to a myriad of shopping and dining options, art, and culture.\n\n22. Knoxville, Tennessee\n\nInsider Monkey Score: 14.5\n\nCost of Living: 91.8\n\nLivability Score: 72\n\nOne of the most affordable places to retire in Tennessee is Knoxville. Besides its low cost of living, the city is known for its beautiful nature, mild climate, and plentiful recreational activities.\n\n21. Fort Wayne, Indiana\n\nInsider Monkey Score: 15\n\nCost of Living: 82\n\nLivability Score: 84\n\nFrom affordable housing to excellent healthcare, Fort Wayne is another one of the cheapest places across America where you will want to retire. Not only is the cost of living 18% lower than the national average, but the livability score is quite good as well.\n\n20. Indianapolis, Indiana\n\nInsider Monkey Score: 15.5\n\nCost of Living: 85.7\n\nLivability Score: 77\n\nAnother Midwest city making it to our list of cheapest places to retire in the USA is Indianapolis. Known for its peaceful vibe, the city offers seniors the best of culture, nature, and sports.\n\n19. Corpus Christi, Texas\n\nInsider Monkey Score: 16.5\n\nCost of Living: 83.5\n\nLivability Score: 78\n\nFor seniors looking to retire near the beach, Corpus Christi can be one of their best bets. Being one of the cheapest beach towns to retire in the US, seniors can enjoy the warm weather, beautiful beaches, as well a thriving culture scene.\n\n18. El Paso, Texas\n\nInsider Monkey Score: 18.5\n\nCost of Living: 81.9\n\nLivability Score: 81\n\nEl Paso is one of the best places to retire in Texas owing to its warm climate, abundant parks, and open spaces, as well as good quality of life. The cost of living in this city is 17.9% lower than the national average, and the livability score is well above average.\n\n17. Tulsa, Oklahoma\n\nInsider Monkey Score: 19\n\nCost of Living: 85.3\n\nLivability Score: 74\n\nAge-friendly, affordable, and beautiful, Tulsa is another nice option to consider for those looking for cheap retirement destinations. Redfin Corporation (NASDAQ:RDFN) notes that the median price of a home in Tulsa is $219,000; while the average rent for a one-bedroom apartment is $828 per month.\n\n16. Akron, Ohio\n\nInsider Monkey Score: 19.5\n\nCost of Living: 80.8\n\nLivability Score: 81\n\nAnother location for retirees who want to live on a budget is Akron, Ohio. The cost of living in the city is 19.2% lower than the national average, while the median home price is $120,000.\n\n15. Saint Louis, Missouri\n\nInsider Monkey Score: 20.5\n\nCost of Living: 84.1\n\nLivability Score: 74\n\nSt. Louis in Missouri is praised for its walkability, excellent healthcare, and low cost of living. The median price of a home is $199,000, which is considered quite affordable.\n\n14. Memphis, Tennessee\n\nInsider Monkey Score: 21\n\nCost of Living: 85.8\n\nLivability Score: 69\n\nSeniors who love the big-city life yet want to retire on a budget can choose Memphis, one of the largest cities in Tennessee. An average-sized home can easily be bought for under $300k, and seniors can enjoy a cost of living that is 14.2% lower than the national average.\n\n13. Lincoln, Nebraska\n\nInsider Monkey Score: 22.5\n\nCost of Living: 92.6\n\nLivability Score: 78\n\nScoring high on livability, Lincoln is another one of the cheapest places across America to retire to. Seniors love this city because of its abundant museums, restaurants, and cultural events. The University of Nebraska offers opportunities to engage in lifelong learning.\n\n12. Birmingham, Alabama\n\nInsider Monkey Score: 23\n\nCost of Living: 87\n\nLivability Score: 65\n\nThe Magic City of Birmingham in Alabama is brimming with amenities, natural attractions, and plentiful entertainment. According to Redfin Corporation (NASDAQ:RDFN), the median price of a home in the city is $185,000, and the overall cost of living is 13% lower than the national average.\n\n11. Winston-Salem, North Carolina\n\nInsider Monkey Score: 24.5\n\nCost of Living: 84.3\n\nLivability Score: 66\n\nOne of the safer cities in North Carolina and an affordable place to retire on the East Coast is Winston-Salem. The city offers a sub-urban community vibe, and there are plenty of restaurants, parks, and coffee shops to enjoy in the city.\n\nClick to continue reading and see the 10 Cheapest Places Across America Where You Will Want to Retire. Suggested Articles:\n\n25 Drunkest Countries in Asia 25 Cities with Highest Female to Male Ratio in the World 15 Best Growth Stocks to Buy Under $25\n\nDisclosure: none. 30 Cheapest Places Across America Where You Will Want to Retire is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/30-cheapest-places-across-america-124354042.html", "symbols": ["BAC.US", "MS.US", "R6G.F", "RDFN.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.03, "neu": 0.836, "pos": 0.134}}, {"date": "2024-01-16T12:40:10+00:00", "title": "Goldman Sachs, Morgan Stanley report, Yahoo Finance live from Davos", "content": "It's another busy earnings week on Wall Street. This morning investors heard from big banks including Goldman Sachs (GS) and Morgan Stanley (MS). This comes amid a busy few days for the sector after other top names including JPMorgan (JPM), Bank of America (BAC), and Wells Fargo (WFC) reported Friday. The world of business and politics has descended on Switzerland this week for the World Economic Forum in Davos. Yahoo Finance's Brian Sozzi and Julie Hyman are on live the ground where they are speaking with top names including Microsoft Founder Bill Gates, Bank of America CEO Brian Moynihan, and PepsiCo CEO Ramon Laguarta. You don't want to miss our coverage all week long.\r\nYahoo Finance trending tickers include Tesla (TSLA), Apple (AAPL), and Microsoft (MSFT). \r\n\r\nKey guests include:\r\n9 a.m. ET - Hans Vestberg, Verizon Chairman & CEO\r\n10 a.m. ET - Julie Sweet, Accenture CEO\r\n10:15 a.m. ET - Ron Kruszewski, Stifel CEO\r\n10:30 a.m. ET - Anne Walsh, Guggenheim Partners Managing Partner\r\n11:30 a.m. ET - Kenneth Rogoff, Harvard University Maurits C. Boas Chair of International Economics, Fmr. IMF Chief Economist", "link": "https://finance.yahoo.com/video/goldman-sachs-morgan-stanley-report-124010989.html", "symbols": ["0Q16.LSE", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "CMC.F", "CMC.XETRA", "GS-PC.US", "JPM-PC.US", "JPM-PD.US", "JPM.MX"], "tags": [], "sentiment": {"polarity": 0.771, "neg": 0.006, "neu": 0.94, "pos": 0.054}}, {"date": "2024-01-16T12:00:35+00:00", "title": "Bank of America CEO on the potential of a soft landing: Yahoo Finance at Davos", "content": "With the Federal Reserve's continued higher for longer interest rates, the economy has slowed to a pace at which it may reach its target inflation goal of 2%, without triggering a recession. Many on Wall Street are now all but sure that this will allow for a soft landing, but is there more at play?\n\nBank of America CEO Brian Moynihan (BAC) sits down with Yahoo Finance Anchors Brian Sozzi and Julie Hyman from the World Economic Forum in Davos, Switzerland to discuss the potential for a soft landing, factoring in the labor market, the housing market, and more.\n\nIt's all part of Yahoo Finance's exclusive coverage from the World Economic Forum in Davos, Switzerland, where our team will speak to top decision-makers as well as preeminent leaders in business, finance, and politics about the world’s most pressing issues and priorities for the coming year.\n\nEditor's note: This article was written by Nicholas Jacobino\n\nVideo Transcript\n\nBRIAN SOZZI: The market has priced in a soft landing for the economy. And a lot of folks here at Davos for the World Economic Forum also looking for a soft landing. Let's talk to Bank of America CEO Brian Moynihan. Brian, great to get some time with you, as always. Soft landing. What does that mean to you, actually, and do you see it playing out?\n\nBRIAN MOYNIHAN: Well, it's great to be here. And what a soft landing is-- you don't go negative and GDP growth on a quarterly basis. And so our team, if we were talking last year, and we did talk last year, they basically said we were going to have a recession later in '23, early '24. And as the year went on, they pushed that out.\n\nAnd so now their basic view is we drop from the growth rate in the third quarter for plus down to 1% annualized GDP growth for the first three quarters. That is a soft landing. It didn't go negative. But it landed and got near zero. And so that's the prediction. The team does a great job. And that's why they come out. And that's largely due to the consumer and the consumer strength and the resiliency and the spending and the capitalism and the entrepreneurialism and innovation US. The US is different.\n\nStory continues\n\nBRIAN SOZZI: Are rates going to fall as fast as they rose?\n\nBRIAN MOYNIHAN: Our team has four cuts next year and four cuts in '25. And so that gets you down into 3, 3 and 1/4, 3%, 3.5% range. So that will feel quick. But it's less the pace. It's where it stops out. And what would be good for the US is they could actually get to a normal rate curve, which for 15 years we haven't had. For a moment we had it and in '18-'19. And then they started cutting rates people. Forget it in '19 they had to cut rates to push the economy.\n\nSo we have that eight cuts over two years. Inflation gets down to the target for the Fed at the end of '25. So it takes some time. And people say it's higher. But in the grand scheme of history, that's not higher. It's just higher since the financial crisis. On a global basis, rates fell. And now they're coming back up to be a little lower.\n\nJULIE HYMAN: So there's what the sort of official forecast from your researchers say. And then there's what people say. And you talk to an enormous number of people. You talking to a lot of people here in Davos. You talk to a lot of business leaders in the US. What's the vibe like? Maybe there's going to be a soft landing. But how are people feeling?\n\nBRIAN MOYNIHAN: Well, if you think about over the course of last year, this Davos, last Davos, this Davos, everybody last year was recession coming and inflation is high and the Fed and the central banks around the world-- if you think about all that, that creates a pretty pessimistic air for people to operate in. So what happened during the course of the year is confidence came down by consumers. They slowed down their spending from a 10% year-over-year growth rate to 4% to 5%, which is more normal.\n\nAnd so that all affects people. Small and medium sized-business in the US, we have 12 million small business customers we have tens of thousands of mid-market customers, their line usage flattened back out. So pre-pandemic, they'd use 40% of their line of credit availability on a given day. During the pandemic, it dropped to 30 because things slowed down. Rose back up to 36. Then has been bouncing around 35, 36. It didn't keep going back up to the level it was. That's a conservatism built in.\n\nAnd so that's what's kind of going through. That's what you read about. And inflation attacks people's ability to provide for their families and stuff. And so that's the pessimism. The reality, though, is look at what they do. They're still spending at 4% to 5% more in the first part of '24 versus the first part of '23. They are still going out. Restaurant spending is still very strong. Entertainment spending is still very strong.\n\nSo if you really, really, really worried about your day-to-day thing, you wouldn't do that. So what's happening is people are getting more conservative. They're making the choices in the median income households. They're making choices about what to buy, what not to buy. But the rate structure slow down, car purchases, house purchases. But fixed-rate mortgages give people an anchor against windward.\n\nBut their spending hasn't changed as much as their emotions have. And now you're seeing they're coming a little bit more in line as you see confidence bit. Views of inflation's stayed in check. And that's kind of interesting right now.\n\nBRIAN SOZZI: Brian, every time we talked to you in 2023, the consumer always seemed to be surprising to the upside, to your point. Spending more on services, spending maybe a little more than some people thought on hard goods. But as we near the election in this country, there's been a real, I think, a lot of concern amongst leaders have been talking to about how that election might turn out. Do consumers finally pull back because they fear an outcome?\n\nBRIAN MOYNIHAN: I don't think so because election goes on consistently. The dialogue's out there that all you and your colleagues put out there. So not like people didn't know the '24 election was coming. And by the way, there was a congressional election the half year. So there's always something going on in state and local level.\n\nSo the real-- you have the geopolitical risk out there. You have the fact that governments have to slow down their rate of spending growth. They a lot of fiscal stimulus. They have to bring that back in. The United States has to get its budget more in line. Whoever's in office understands that. That's not a mystery. That's why you have the debates in Congress among the whole Congress. How do we start to balance the decision?\n\nSo that that's got to go on. By the way, that's universal around the world. And so the idea of getting government spending and local governments and state governments, US, same things getting that. So those are drags and possibilities. But meanwhile, just follow what the consumer does versus what they say, which is the first two weeks in January they spent 4.5% more than they spent last year or two weeks in January. And so they're continuing to participate in the economy. Why? Because they're employed. Why? Because the wage growth has been strong. Flattening out, but stronger.\n\nAnd so if you're employed and you have money, you're going to make the choices. And so I think the election will affect that. But they've sorted through a lot of elections in our country's history and all the other countries. So I don't worry about the elections doing it. There'll be a lot of talk about the impact. But I think the reality is the US economy is driven by the private sector and consumers and things that really are affected by elections, but not deterred by elections.\n\nJULIE HYMAN: I mean, all of that said, it seems a rather unusual election in some ways, right? You've got one of the candidates who is under indictment on multiple fronts. You've got the other who there's concerns about his age. It's a lot more to it than that. Does it affect business decisions, I mean, on the part of Bank of America, for example? I mean, how do you even begin to gain some of that out?\n\nBRIAN MOYNIHAN: Well, one of your colleagues asked me, do you have a draw for candidates X or candidate Y? I said that'd be a lot of draws because think about the changes in the UK, prime ministers, the changing in the French prime minister. We're affected by that. So when you run a company, as my colleagues do at Bank of America, the teammates that run it, and the companies around the world, you have to be ready for any scenario.\n\nAnd so our job is not to predict elections. Our job is to be able to go no matter what the circumstances are in our country's elections, US elections or not. And I tell people, our company started in 1784, the earliest part. There's been a lot of elections. And so you have to have a way to operate the company for profits and purpose. You have to have a way to operate the company for the benefit of our customers, our teammates, and our shareholders, and society. Those are principles.\n\nAnd so the elections will come and go. We try to help every administration on both parties with our best thinking. And some take it. Some don't take it. Some take it a little bit. And our job as the business community and as Bank of America is to help governments be successful because if they're successful, we're going to be successful.\n\nBRIAN SOZZI: Another big bet you're making is on AI. You seem to be spending a large sum of money this year in modernizing the bank. How will AI change banking?\n\nBRIAN MOYNIHAN: Well we have this capability called Erica. And so Erica was started about seven years ago. And it is effectively AI. It's a natural language processing engine. It's very straightforward compared to the autonomous language.\n\nBut it was same thing we had to go to somebody and get produce a language. We had to produce an environment on it, use our data. And it has 18 million consumers using, 170 million interfaces last quarter. So it's not like may this happen. It's happening. Each one of those would have bee a phone call, email, a text, or walk into the branch. And so it saves money. So that's just an example of how we're using it. So we completely believe that this will have a big impact.\n\nThe question is you've got to have your data right. And we have spent billions of dollars to get our data consistency throughout our organization. And we're not perfect. Then you have to have the ability to convert processes to the technique through algorithm models and language models and learning models. The trick in that is we have to have accountability. You have to be able to say if we made a decision to turn down a loan, well, how did we do it? Why did we do it? What were the factors? Because that's the law. Otherwise, it could be discriminatory.\n\nAnd so in regulated industries, it's going to be a trickier application. Now, to help somebody do their work, which then they take it and do something, fine. It's much easier. Programming. We're already using in programming. It's saving money. Again, you got to have a psychological change. Your programmers have to learn how to use it and what they're going to do next versus what they did before. Great possibilities for us. I still think in early stages in terms of adoption, our company is. A lot of hype about it, a lot of discussion. You could go to 14 sessions here at Davos today on AI, I guarantee you on some topic.\n\nBut those of us that actually-- we put $3.8 billion in technology out. We have hundreds of hundreds of algorithm models have been operating in our company for years, years, and years. And so this is like a natural movement along a path. And we're already doing it. And we think it has great hope. But you've got to make sure you're moving right with the customer, right with the integrity of the operating systems and right with the regulatory framework.\n\nJULIE HYMAN: And finally, I want to ask you about DEI a little bit because, as you know, there's been a backlash against diversity and inclusion programs. You're the council chair for global diversity and inclusion at Bank of America. So obviously you think it's important. So what do you make of the backlash? And how do you do it in the right way?\n\nBRIAN MOYNIHAN: Well, these things ebb and flow. And they get talked about in ways that are not really about some of the topics that are involved. And so you get a lot about social policies and stuff like that. Look, we listen to our team. We have 200,000-plus teammates. We have 180,000-- we're in affinity groups. We have a strong D&I council that represents the company. We have subcouncils underneath it. And they just give us insight as to what they need.\n\nAnd so we are continuously trying to improve our company to provide opportunity that anybody can come to our company, be who they are, and be as successful as they want to be. So last night, I was talking to a group around the military with honor, a group that Rye Barcott runs. And so we hired 17,000 veterans over the last few years. Yesterday, our teammate Eric Schimpf celebrated his 10th anniversary of the company.\n\n10 years ago, he started with a company out of the military. West Point. Military. Came back. Leaves military on a Friday. Starts on a Monday. He's a receptionist for a day. 10 years later, he's running Merrill Lynch. And that's because he had talent. And he did. But he had never worked in the private sector. So whether it's teammates coming to the military, whether it's teammates coming from a Title I high schools into our operating platforms, call centers-- that's why we start at $23 an hour. So they can invest in their career. Whether it's the teammates who have worked with for 50, 60 years, we're providing opportunity.\n\nAnd so D&I is core to how do we do that. So we will do what we do. And we're mindful of the atmosphere around us. But we are committed to having a place where everybody can be successful. Male, female, all different ethnicities. And then we have to help our teammates through tough times. And that's like with Hamas' attack on Israel, we had a lot of Jewish teammates that we had to go in and support. We had teammates affected by the Ukraine situation. We have teammates affected by all things going on.\n\nAnd so we're against hate speech. We've been supporting the foundation combating anti-Semitism, which has a broader purview now and trying to help-- we're trying to educate teammates on how to have the dialogue in the company. But it's what our teammates want. It's what's good for the company. It's part of who we are. And we continue to do it. And at the fringes, we'll get advice from a lot of people about what's right and wrong. But we run the company the way we run the company.\n\nBRIAN SOZZI: We have to leave it there. Bank of America CEO Brian Moynihan, thanks for always giving us time here. A very cold-- no jacket again for the second time this year.\n\nBRIAN MOYNIHAN: It's balmy out today. It must be--\n\nBRIAN SOZZI: Yeah. Balmy. All right. Brian, so good to see you. We'll talk to you soon.\n\nBRIAN MOYNIHAN: Thank you.", "link": "https://finance.yahoo.com/video/bank-america-ceo-potential-soft-120035092.html", "symbols": ["0Q16.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.034, "neu": 0.853, "pos": 0.113}}, {"date": "2024-01-16T08:53:00+00:00", "title": "Bank Earnings Season: What We've Learned So Far", "content": "Ahead of results from Goldman Sachs and Morgan Stanley this morning, here's a look at how other big banks are faring. The U.S.'s four largest banks —JPMorgan, Wells Fargo, Bank of America and Citigroup— kicked off fourth-quarter earnings Friday.\n\nContinue reading", "link": "https://finance.yahoo.com/m/3122c061-1baf-316d-ba45-a7d052521efa/bank-earnings-season%3A-what.html", "symbols": ["0Q16.LSE", "0R01.LSE", "0R2F.IL", "0R2F.LSE", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CMC.F", "CMC.XETRA", "CTGP34.SA", "JPM-PC.US", "JPM-PD.US"], "tags": [], "sentiment": {"polarity": 0.25, "neg": 0, "neu": 0.951, "pos": 0.049}}, {"date": "2024-01-16T00:00:00+00:00", "title": "3 Top-Rated Dividend Stocks Wall Street Analysts Are Loving Now: January 2024", "content": "Investors who want to earn regular income from their investments should consider a stake in one of these top-rated dividend stocks.", "link": "https://investorplace.com/2024/01/3-top-rated-dividend-stocks-wall-street-analysts-are-loving-now-january-2024/", "symbols": ["AVGO.US", "BAC.US", "LEN.US"], "tags": [], "sentiment": {"polarity": 0.077, "neg": 0, "neu": 0.936, "pos": 0.064}}, {"date": "2024-01-15T10:06:00+00:00", "title": "Warren Buffett Is Raking in $4.65 Billion in Annual Dividend Income From These 6 Stocks", "content": "Berkshire Hathaway(NYSE: BRK.A)(NYSE: BRK.B) CEO Warren Buffett has a way of captivating the attention of Wall Street and investors, and you don't have to look any further than his investment track record to figure out why. Since taking over as CEO in the mid-1960s, the Oracle of Omaha, as he's come to be known, has overseen a nearly 4,500,000% aggregate gain in his company's Class A shares (BRK.A).\n\nBuffett's \"recipe\" for success is well documented. It includes buying stakes in profitable companies for the long-term, as well as focusing on businesses with sustainable competitive advantages and trusted management teams.\n\nHowever, one of the \"ingredients\" to Berkshire Hathaway's success that doesn't receive enough credit is Buffett's love for dividend stocks. Companies that pay a regular dividend to their shareholders tend to be recurringly profitable, time-tested, and are capable of providing transparent long-term growth outlooks. Berkshire Hathaway CEO Warren Buffett. Image source: The Motley Fool.\n\nMost importantly, income stocks have a lengthy track record of outperformance. A recent study from the Hartford Funds, in collaboration with Ned Davis Research, found that dividend stocks delivered an annualized return of 9.18% over the past half century (1973-2022). This was more than double the annualized return for non-payers (3.95%) over the same timeline.\n\nIn 2024, Buffett's company is set to collect around $6 billion in dividend income (including preferred dividends). Interestingly enough, $4.65 billion of this total will be raked in from just six core holdings.\n\n1. Bank of America: $991,537,926 in annual dividend income\n\nAmong the nearly 50 stocks currently held in Berkshire Hathaway's portfolio (not all of which pay dividends), Bank of America(NYSE: BAC) stands out as the top dog for Warren Buffett and his team when it comes to dividend income. The more than 1.03 billion shares of BofA stock held by Buffett's company will generate almost $992 million in annual income.\n\nStory continues\n\nThe Oracle of Omaha and his team really appreciate cyclical businesses, and bank stocks certainly fit the mold. Even though recessions are a perfectly normal part of the economic cycle, they're relatively short-lived. Instead of trying to time when recessions will occur, Buffett has packed his company's portfolio with time-tested winners like Bank of America that he knows can benefit from long-winded periods of expansion.\n\nWhat's been particularly helpful for Bank of America of late is the Federal Reserve's hawkish monetary policy. Since March 2022, the Fed has increased its federal funds rate by 525 basis points. The steepest rate-hiking cycle in four decades is music to the ears of BofA, which is the most interest-sensitive of America's money-center banks. Higher interest rates have added billions of dollars in net interest income each quarter.\n\n2. Apple: $878,937,967 in annual dividend income\n\nPerhaps it's no surprise that Berkshire Hathaway's largest holding by a longshot -- Apple(NASDAQ: AAPL) accounted for 47% of Berkshire's $361 billion portfolio, as of Jan. 9 -- is one of its top dividend stocks. Apple's $0.96-per-share payout translates into nearly $879 million in annual income for Buffett's company.\n\nDuring Berkshire's 2023 annual shareholder meeting, Buffett described Apple as \"a better business than any we own.\" This statement reflects Apple's exceptionally strong branding, highly loyal customer base, and its ability to out-innovate its competition. More than 15 years after its introduction, the iPhone still accounts for more than half of all smartphone market share in the U.S.\n\nHowever, Apple's innovation goes well beyond the physical products that made it famous (iPhone, Mac, and iPad). CEO Tim Cook is overseeing the ongoing evolution of Apple into a platforms' company. Focusing on subscription services should encourage consumers to stay within Apple's ecosystem of products and services, while also helping to soften the revenue fluctuations that are commonly observed during major iPhone replacement cycles. WTI Crude Oil Spot Price Chart\n\n3. Occidental Petroleum: $854,675,379 in annual dividend income (including preferred stock dividends)\n\nThe energy sector is often known for doling out robust dividends. Buffett is overseeing the collection of nearly $175.5 million in annual income from the 243.7 million shares of Occidental Petroleum(NYSE: OXY) common stock held, as well as $679.2 million from $8.49 billion in Occidental preferred stock that's yielding 8% on an annual basis.\n\nThe roughly $14 billion Warren Buffett and his team currently have invested in Occidental is a clear bet on the spot price for crude oil remaining elevated or moving higher. Even though Occidental is an integrated oil and gas company -- in addition to drilling, it operates chemical plants -- it generates the lion's share of its revenue from drilling. If the spot price of oil climbs, it'll enjoy an outsized benefit.\n\nOn the other hand, Occidental Petroleum's balance sheet is somewhat of an anomaly compared to most of Buffett's investments. This is to say that the Oracle of Omaha often avoids heavily indebted businesses. Despite Occidental slashing its net debt by nearly half since completing its acquisition of Anadarko, it's still lugging around $18.6 billion in net debt, as of Sept. 30. It'll need the spot price of crude oil to remain elevated to further improve its financial flexibility. Image source: Coca-Cola.\n\n4. Coca-Cola: $736,000,000 in annual dividend income\n\nAnother foundational dividend stock in Warren Buffett's portfolio at Berkshire Hathaway is beverage behemoth Coca-Cola(NYSE: KO). Based on Berkshire's ultralow cost basis of $3.2475 per share for Coca-Cola, the Oracle of Omaha's company is netting a 57% annual yield (Coca-Cola's base annual dividend is $1.84 per share), relative to cost.\n\nThe most-valuable thing Coca-Cola brings to the table for investors is predictability. With the exception of Cuba, North Korea, and Russia, it has ongoing operations in every other country. This leads to predictable operating cash flow in developed markets, and can provide the company with a steady organic growth boost from emerging markets. All told, Coca-Cola has more than two dozen brands generating at least $1 billion in annual sales.\n\nBranding and marketing are two identifiable keys to its success. According to Kantar's annual \"Brand Footprint\" report, Coke products have been chosen by consumers more than any other brand on the planet for 10 consecutive years (as of 2022). Aside from having a well-known brand, this is also a reflection of the company's top-tier marketing. Coke is utilizing digital channels and artificial intelligence (AI) to cater ads to younger audiences, while leaning on well-known brand ambassadors to remain connected with mature consumers.\n\n5. Chevron: $665,899,666 in annual dividend income\n\nHave I mentioned that energy stocks are known for potentially juicy dividends? Last year, Chevron(NYSE: CVX) increased its base annual payout for a 36th consecutive year, with its board also authorizing a share repurchase program of up to $75 billion. The more than 110 million shares of Chevron held by Berkshire entitle Buffett's company to almost $666 million in annual income.\n\nAlthough the investment thesis with Chevron somewhat mirrors Occidental Petroleum, there are two distinct differences between these integrated energy companies. To start with, Chevron generates a sizable percentage of its sales from its downstream segment, which includes chemical plants and refineries. Being less reliant on drilling for revenue means Chevron is better hedged than Occidental in the event that the spot price of crude oil declines.\n\nThe other big difference between these two integrated operators is their balance sheets. Whereas Occidental is quite levered, Chevron has a net debt ratio of just 8.1%, as of Sept. 30. Among the major global energy companies, an argument can be made that Chevron's balance sheet offers the most financial flexibility.\n\n6. Kraft Heinz: $521,015,709 in annual dividend income\n\nThe final Buffett stock that's generating more than $500 million in annual dividend income for Berkshire Hathaway is packaged foods and condiments company Kraft Heinz(NASDAQ: KHC). Despite reducing its quarterly payout by 36% in 2019, Kraft Heinz is still doling out around $521 million each year to the Oracle of Omaha's company.\n\nThe beauty of consumer staples stocks like Kraft Heinz is that they provide a basic need good. Though consumers might reduce their discretionary spending during recessions, food isn't something people can live without. Further, Kraft Heinz's assortment of well-known brands affords the company exceptional pricing power.\n\nHowever, consumers are becoming more cost-conscious following a period of historically high inflation. Kraft Heinz has reported multiple quarters of declining volume/mix, which suggests consumers are trading down to cheaper store-branded goods as prices climb. Considering that the company has quite a bit of debt on its balance sheet, reigniting consumer interest in its brands could prove challenging.\n\nShould you invest $1,000 in Bank of America right now?\n\nBefore you buy stock in Bank of America, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Bank of America wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of January 8, 2024\n\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Sean Williams has positions in Bank of America. The Motley Fool has positions in and recommends Apple, Bank of America, and Berkshire Hathaway. The Motley Fool recommends Chevron, Kraft Heinz, and Occidental Petroleum and recommends the following options: long January 2024 $47.50 calls on Coca-Cola. The Motley Fool has a disclosure policy.\n\nWarren Buffett Is Raking in $4.65 Billion in Annual Dividend Income From These 6 Stocks was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/warren-buffett-raking-4-65-100600303.html", "symbols": ["AAPL.US", "BAC.US", "BRK-A.US", "BRK-B.US", "CVX.US", "KHC.US", "KO.US", "OXY.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.033, "neu": 0.851, "pos": 0.116}}, {"date": "2024-01-15T09:57:00+00:00", "title": "Zacks Investment Ideas feature highlights: JP Morgan Chase, Wells Fargo, Citigroup and Bank of America", "content": "For Immediate Release\n\nChicago, IL – January 15, 2024 – Today, Zacks Investment Ideas feature highlights JP Morgan Chase & Co. JPM, Wells Fargo & Company WFC, Citigroup C and Bank of America BAC.\n\nThe Big Banks Reported Earnings, and This Is the Clear Leader\n\nA slew of bank earnings from the largest financial institutions in the world were released this morning, providing insight into their Q4 and 2023 performance.\n\nAlthough the financial sector underperformed the broad market during 2023, returning just 12% vs the S&P’s 24%, XLF managed to outperform in the fourth quarter. As markets began pricing in the coming interest rate cuts, banks, which hold large fixed income portfolios benefited significantly.\n\nEarnings Results\n\nJP Morgan Chase & Co. clearly came out on top, and although it missed quarterly earnings estimates, recorded its most profitable year on record. The country’s largest bank booked $49.6 billion in profits for the year, a 32% increase from 2022.\n\nJPM CEO Jamie Dimon had some rather grim remarks about the state of the economy sharing that he thinks rampant deficit spending risks another inflationary spike and that he remains cautious about expectations this year.\n\nLooking back a few quarters, while large swaths of the industry were in panic during the Silicon Valley Bank crisis, JP Morgan Chase & Co. sat comfortably, drawing in new depositors, and buying up distressed firms on the cheap.\n\nPart of what limited the Q4 profits were charges to cover special government fees related to the failures of Silicon Valley Bank and Signature Bank. The $3 billion charge will refill a government FDIC fund.\n\nJPM reported Q4 EPS of $3.04 below estimates of $3.35. However, before the one-time fee, earnings were $3.97 per share.\n\nJP Morgan Chase & Co. is the best performing large bank stock of the group over the last 1, 5 and 10-year periods.\n\nWells Fargo & Company had a commendable Q4 performance as well, beating analysts’ expectations on both the top and bottom line. Q4 EPS of $1.29 came in above estimates of $1.09 and sales of $20.48 billion were just above estimates of $20.4 billion.\n\nStory continues\n\nWells Fargo & Company currently has a forward earnings multiple of 10.1x, which is just below the industry average and below its 10-year median of 12.5x. The company also pays a dividend yield of 2.85%.\n\nCitigroup, the bank stock with the highest Zacks rank, posted mixed earnings this morning. The company currently has a Zacks Rank #2 (Buy) rating, but reported a major earnings miss. However, like the other big banks was largely affected by the FDIC charges related to last year's banking crisis. Before the charges, Citigroup had earnings of $0.84 per share vs. expectations of $0.81.\n\nRevenue also came up short, reporting $17.44 billion, below estimates of $18.74 billion.\n\nCitibank CEO Jane Fraser stated that the company’s performance was disappointing and announced plans for a sweeping reorganization. She said that the company plans to cut up to 20,000 employees over the next two years.\n\nBank of America also posted rather dismal earnings after the one-time FDIC charge. Net income fell some 50% YoY and the stock is down (-5%) over the last 12 months.\n\nSales for the nation’s second-largest bank missed analysts’ estimates for the first time in two years and were down 10% from the year ago quarter.\n\nBank of America CEO Brian Moynihan was upbeat nonetheless, saying that the company has achieved record client activity and that disciplined budgeting and a strong capital base should allow the company to deliver strong growth in the year ahead.\n\nWhy Haven’t You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBank of America Corporation (BAC) : Free Stock Analysis Report\n\nWells Fargo & Company (WFC) : Free Stock Analysis Report\n\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\n\nCitigroup Inc. (C) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-095700235.html", "symbols": ["BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "C-PJ.US", "C.MX", "C.US", "CMC.F", "CMC.XETRA", "CTGP34.SA", "JPM-PC.US", "JPM-PD.US", "JPM.MX", "JPM.US", "JPMC34.SA", "MSC.US"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.064, "neu": 0.811, "pos": 0.124}}, {"date": "2024-01-14T13:35:00+00:00", "title": "Warren Buffett's Biggest Bets: 56.6% of Berkshire Hathaway's $359 Billion Portfolio Is Invested in These 2 Passive-Income-Generating Blue Chip Dividend Stocks", "content": "Instead of paying cash directly to shareholders in the form of dividends, Berkshire Hathaway(NYSE: BRK.A)(NYSE: BRK.B) CEO Warren Buffett has preferred to buy back his company's stock and invest in other businesses. But there can be no doubt that the Oracle of Omaha loves dividends.\n\nEach of the 10 largest holdings in the Berkshire Hathaway stock portfolio pays a dividend, and the company's largest stock positions generate an impressive amount of passive income each year. Over the next year, Buffett's company is expected to receive more than $6 billion in dividend payments just for sitting on its current stock holdings.\n\nLet's take a closer look at two of Berkshire's largest stock investments -- dividend-paying, blue-chip companies that account for roughly 56.6% of the holding company's portfolio. Based on current investments these two stocks will likely serve up approximately $1.9 billion in payments to Berkshire over the next year.\n\n1. Apple\n\nAs of its last filing, Berkshire owned roughly 915.6 million shares of Apple(NASDAQ: AAPL) stock. Valued at roughly $168.8 billion, the stock holdings account for roughly 47% of Berkshire's total public stock portfolio.\n\nApple has boosted its payout by roughly 120% over the last decade, but its stock gains of more than 907% across the stretch have far outstripped its dividend hikes. As a result, the company's dividend yield has been pushed down despite the solid payout growth and shares currently sport a yield of roughly 0.5%.\n\nDespite the stock offering a relatively small yield for today's prices, Berkshire's massive investment stake means that its holdings in Apple are one of its biggest passive income generators.\n\nWith Apple's stock currently paying an annual forward distribution of $0.96 per share, Berkshire is on track to generate roughly $879 million in dividend income from its position over the next year. Given that the tech giant will most likely deliver another payout increase this year, there's a good chance that Buffett's company will see dividend payments at least slightly above that level.\n\nStory continues\n\n2. Bank of America\n\nBank of America(NYSE: BAC) stands as Berkshire's second-largest stock position, trailing behind only Apple in terms of overall portfolio weight. As of its most recent filing, Buffett's company owned more than 1.03 billion shares of the bank's stock -- a position valued at roughly $34.5 billion. Berkshire's BofA holdings account for roughly 9.6% of its total stock portfolio.\n\nToday, Bank of America's stock boasts a solid yield of 2.9% -- but Buffett's company is getting a much better yield on its position. After initially closing out its position in BofA at the end of 2010, Berkshire made a deal to invest in the company again. The move wound up being one of the Oracle of Omaha's best-ever plays.\n\nWhen Bank of America was facing macroeconomic pressures and potential liquidity issues in 2011, Buffett approached the company's CEO with a financial lifeline. Berkshire wound up buying $5 billion worth of the company's preferred shares. Berkshire also secured stock warrants that would give it the right to purchase 700 million shares of the bank's common stock at a price of $7.14 per share.\n\nIn June 2017, Buffett's company cashed in those warrants. At the time, Bank of America stock was trading at $24.32 per share. Berkshire scored paper gains of roughly 240% with the move. But the long-term impact of this incredible investment has been even more significant. BAC Chart\n\nNot only has Bank of America stock continued to climb since Buffett moved to exercise the stock warrants, but the financial giant has also delivered big hikes for its dividend.\n\nWith its current annual dividend of $0.96 per share, Berkshire is enjoying an annual yield of 13.4% on the 700 million shares it bought at $7.14 per share in the stock warrant deal. That's an astounding yield to be banking on an investment in a company as solid as present-day BofA.\n\nBuffett's company is on track to receive roughly $990 million in dividend income from its Bank of America holdings over the next year. Given the likelihood that the bank will once again raise its payout this year, Berkshire's haul should be even higher.\n\nShould you invest $1,000 in Apple right now?\n\nBefore you buy stock in Apple, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now... and Apple wasn't one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of January 8, 2024\n\nBank of America is an advertising partner of The Ascent, a Motley Fool company. Keith Noonan has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Apple, Bank of America, and Berkshire Hathaway. The Motley Fool has a disclosure policy.\n\nWarren Buffett's Biggest Bets: 56.6% of Berkshire Hathaway's $359 Billion Portfolio Is Invested in These 2 Passive-Income-Generating Blue Chip Dividend Stocks was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/warren-buffetts-biggest-bets-56-133500117.html", "symbols": ["AAPL.US", "BAC.US", "BRK-A.US", "BRK-B.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.034, "neu": 0.856, "pos": 0.11}}, {"date": "2024-01-14T04:39:50+00:00", "title": "3 Precious Metals Stocks That Will Shine in 2024", "content": "Bank of America (NYSE:BAC) estimates that there will be 152 rate cuts by central banks around the world this year. This is reason enough to be bullish on a potential bull market for precious metals. This column discusses three undervalued precious metal stocks that are poised to deliver healthy total returns within the next 12 months.\n\nBesides potential expansionary monetary policies, geopolitical tensions are a reason to be bullish on precious metals. It’s worth noting that central banks globally continue to buy gold as a part of the reserve diversification.\n\nAs a part of precious metal holding, I personally prefer to hold some physical gold and silver. At the same time, exposure to quality precious metal miners makes sense. As realized prices trend higher, these miners are positioned to increase dividends on the back of higher free cash flows.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLet’s discuss three precious metal stocks that trade at a valuation gap and are poised for a rally.\n\nNewmont Corporation (NEM) Newmont logo on a mobile phone screen\n\nSource: Piotr Swat/Shutterstock\n\nNewmont Corporation (NYSE:NEM) is possibly the best name among precious metal stocks to buy. In the last 12 months, NEM stock has trended lower by 28% and I see this as a golden buying opportunity. The blue-chip stock has an attractive dividend yield of 4.25% and with a quality asset base, there is clear cash flow visibility.\n\nIt’s worth noting that Newmont has an investment-grade balance sheet that provides flexibility for organic and acquisition-driven growth. In November, Newmont completed the acquisition of Newcrest Mining (OTCMKTS:NCMGF) to “create the world’s leading gold company with robust copper production.”\n\nAnother point to note is that Newmont generated $1 billion in operating cash flow in Q3 2023. With a higher realized gold price and the acquisition, the annual OCF potential is likely to be more than $5 billion. This will translate into aggressive investments coupled with healthy dividend growth.\n\nStory continues\n\nKinross Gold (KGC) Cellphone with business logo of Canadian mining company Kinross Gold Corp. on screen in front of webpage.\n\nSource: T. Schneider / Shutterstock.com\n\nKinross Gold (NYSE:KGC) stock has trended higher by 27% in the last 12 months. However, the gold miner looks undervalued at a forward price-earnings ratio of 14. Further, KGC stock offers a dividend yield of 2% and I expect healthy dividend growth this year.\n\nOne reason for depressed valuations is that Kinross expects stable gold production through 2025. It’s the factor of higher realized gold price that’s likely to translate into revenue and cash flow growth. However, it’s worth noting that Kinross had to sell Russian assets in 2022 due to geopolitical factors and that impacted production growth visibility.\n\nKinross reported a liquidity buffer of $2 billion as of Q3 2023. Based on Q3 operating cash flows, the annual OCF visibility is more than $1.6 billion. Therefore, the Company has high financial flexibility to pursue acquisition-driven growth. Once production visibility changes, KGC stock is likely to skyrocket.\n\nHecla Mining (HL) Mining cart in a silver, copper, and gold mine representing VOXR Stock.\n\nSource: TTstudio / Shutterstock\n\nHecla Mining (NYSE:HL) is among the precious metal penny stocks to buy at undervalued levels. Hecla is the largest silver miner in the U.S. and the Company also has exposure to gold assets.\n\nFor 2023, Hecla reported silver production of 14.3 million ounces, which was almost flat on a year-on-year basis. This is one reason for HL stock being depressed. However, it’s important to note that the flat production was on account of Lucky Friday mine operations being suspended.\n\nThe good news is that Lucky Friday has resumed production with ramp-up expected in Q1 2024. Further, Keno Hill produced 1.5 million ounces in 2023 and is likely to be a major growth contributor this year.\n\nBy 2025, Hecla is targeting annual production of 20 million ounces of silver. Therefore, production upside visibility is robust and if realized prices are attractive, revenue growth is likely to be stellar. Given these positives, I expect a strong comeback for HL stock this year.\n\nOn the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nFaisal Humayun is a senior research analyst with 12 years of industry experience in the field of credit research, equity research and financial modeling. Faisal has authored over 1,500 stock specific articles with focus on the technology, energy and commodities sector.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\n\nThe post 3 Precious Metals Stocks That Will Shine in 2024 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-precious-metals-stocks-shine-043950187.html", "symbols": ["0R0A.LSE", "BAC.US", "HCL.BE", "HCL.DU", "HCL.F", "HCL.MU", "HCL.STU", "HL-PB.US", "HL.US", "K.TO", "KGC.US", "KIN2.BE", "KIN2.DU", "KIN2.F", "KIN2.MU", "KIN2.STU", "KIN2.XETRA", "N1EM34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.021, "neu": 0.824, "pos": 0.155}}]