[{"date": "2023-06-22T20:45:36+00:00", "title": "Dow Jones Today: Index Flat as Investors Mull Global Rate Decisions", "content": "The Dow Jones Industrial Average closed down 0.01%, or 4 points, spending most of the day in the red as investors digested the latest moves by central banks around the world.", "link": "https://finance.yahoo.com/m/d13dfdfe-dc57-3756-9ac1-bcb4fb0bc950/dow-jones-today%3A-index-flat.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "W8A.F", "WBA.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-06-22T17:30:02+00:00", "title": "How Boeing’s CEO moved the company forward in the face of multiple crises", "content": "On this week’s episode of Fortune‘s Leadership Next podcast, co-hosts Alan Murray and Michal Lev-Ram talk with Boeing CEO Dave Calhoun about leading Boeing through extraordinarily challenging times, transforming company culture, and how leadership has changed over the last two decades.\n\nListen to the episode or read the full transcript below.\n\nTranscript\n\nAlan Murray:Leadership Next is powered by the folks at Deloitte, who, like me, are exploring the changing rules of business leadership and how CEOs are navigating this change.\n\nWelcome to Leadership Next, the podcast about the changing rules of business leadership. I’m Alan Murray.\n\nMichal Lev-Ram: And I’m Michal Lev-Ram. Alan in the last month we've had quite a few CEOs on Leadership Next who have led their companies through some pretty extraordinary challenges. One was Ed Bastian of Delta, who was at the helm of the major airline during the pandemic, during the bankruptcy, even 9/11. Another being Emma Walmsley, who led GSK through a de-merger, sounds like a lot of fun, while some investors and activists were calling for her resignation. And then of course, we had Brian Cornell on just recently, who joined Target at a really low point for the retailer and he's turned it around. So we've got yet another turnaround CEO on the show today, one who you've written about yourself.\n\nMurray: Yeah, that's right, Michal. Today's interview is with Dave Calhoun, who took over as CEO of Boeing in January of 2020, when the aircraft manufacturer was really in crisis. I mean, this is before the pandemic hit, but they had had two planes that had crashed the, the 737 Max catastrophes, and a real contentious back-and-forth with the public and the press over why they crashed. It was a very ugly moment for Boeing.\n\nLev-Ram: I thought he was such a straight shooter about it all. I'm sure it wasn't easy dealing with the press back then. And vice versa, obviously. But it was really interesting hearing his approach, not only overhauling the internal culture of Boeing, but also the company's entire safety protocol, which clearly needed to happen. And this was literally a life or death ask.\n\nMurray: One of our writers asked him, \"Is this the toughest job in America?\" I think at that moment in time it might have been, but Dave has done a lot to right the company, and it hasn't been easy. He's had some pretty serious supply chain problems to deal with, which are still plaguing the company and still causing delays in delivery of airplanes that people have ordered.\n\nLev-Ram: Yeah, I think he semi-jokingly says that he just wants things to be boring again, like that's probably the goal for you know, this industry.\n\nMurray: Go boring.\n\nLev-Ram: Yeah, go boring, we want more boring. But, you know, he got into how the company has changed over the past few years. I think it's important also, at the same time, you know, as we're talking about this turnaround, to point out just how big Boeing is, because that obviously makes steering and righting the ship even harder. So alongside their competitor, Airbus, they make up a duopoly, as we all know, on the aircraft manufacturer market, and Boeing has both a commercial and a military arm. As of late 2022 it was the third largest defense contractor.\n\nMurray: Yeah, the other thing that's interesting about Dave Calhoun is that he was one of a string of corporate leaders who were protégée of the of the late Jack Welch, when he was CEO of General Electric, which is now more than two decades ago. And I always think, looking back at Jack Welch, how dramatically corporate leadership has changed in the two decades since he left the scene. We talk about that with Dave in this podcast.\n\nLev-Ram: Yeah, loved your question about that. It was a really fascinating conversation about leadership, about the industry, in particular transforming company culture. And we are excited to bring it all to you. So here's Dave Calhoun, CEO of Boeing.\n\n[Music. Interview begins.]\n\nLev-Ram: Dave, thanks so much for joining us. I know you've seen some challenges in a short amount of time. But let's get started with perhaps the biggest challenge that you faced when you became CEO of Boeing, back in January 2020. And I know there was another one coming down the pipeline very, very quickly. We'll get to that. But there was a complete reevaluation of the safety of Boeing's aircrafts after the fatal crashes of the two Boeing 737 Maxes, and we want to start with that. I know it's a it's a big topic. But what has changed since, in the past three years? And what due to those challenges were some of the toughest decisions that you had to make right off the bat as CEO?\n\nDave Calhoun: Well, it was the toughest moment course I've ever seen in my career, and even with a long history and background in aerospace by virtue of my GE days. Yeah, this was a sort of a situation that was as tough as it gets. I might as well start from my perspective as a board member. Living through the period of time post the second crash where we had already grounded the fleet. So that on one hand, we knew there would be no forward safety concerns. It would give us time to evaluate the leadership and management system that oversaw all of this without taking additional safety risk. On the other hand, we also knew we had to be incredibly decisive. Otherwise, the population that we employ everywhere in the world and our customers would lose faith. So we knew there was a clock running. We had a plan with respect to decisive action, if we needed to do it, I was that plan. We had sort of three successive moments post the second crash where the leadership team had discerned the issue with respect to those particular accidents, and had worked with the FAA to recertify that airplane so that we could again get back into the business of delivering airplanes. And they kept predicting every three months that the cert would be in hand and then we missed on our third. And that is when the board decided it had to move and move quickly. In moving quickly, everybody knows when you have to make a leadership change, sometimes that in and of itself, especially if you don't know who's coming, is going to take time. In our case, this took us about three weeks. So I knew that I would have to close up shop at my existing employer, which I loved, and get into this and get into it quickly. With respect to what I found. You know, the, the issue with respect to the Max, our relationship with the FAA, the most important two elements of that were going to be stop predicting when the FAA would ultimately discover for themselves when the airplane would be recertified because that is their right and we should not try to jump ahead of them in any way, shape, or form. And then secondly, be transparent with literally everything, no matter how uncomfortable the data is or the conversation is, you have to tell everybody, everything, including the media, and you're gonna get whacked along the way and that's life. But for us to regain trust, number one with our own people, and then two the flying public, they were going to have to believe that that was us and that was the culture we were going to carry forward.\n\nMurray: Dave, at some point, we should do a separate podcast on why in March of 2019, you said yes. Because this was one hell of a big challenge that you were taking on. But let me ask you, I mean, I feel like cultural problems are the biggest, most difficult problems that a CEO has to deal with. So let me ask you, first of all, do you buy the critique that Boeing had a fundamental culture problem in March of 2019, that it was prioritizing quarterly profits over safety? And if not, what was the culture problem?\n\nCalhoun: You know, Alan, we had a, we had a culture problem. I'll characterize it quite a bit differently then the media liked to characterize it. The idea that anybody, any human being makes a trade of quarterly profits over safety is just a that's a flawed notion. Like who can do that? Who can look in a mirror and say, Hey, let's compromise safety today? Right? It's just not what happens. What I do think I found was an organization and a company, a culture that was having a hard time being honest with one another, about where programs stood, how much time was required, what things still needed to get completed. And as a result, you know, leadership became disconnected with the ground troops. And that can never happen. It can never happen. As you know, I've seen big companies, I know how that can break up. But the role of leadership in that particular aspect to me is paramount. And we had lost that. We had lost that. I think the symptom, the notion that we could every three months predict we'd have a success cert with an FAA regulator who is looking at everything all the time, and our own people submitting documents and suffering inquiry, without talking to them, that's how you get that's how you create these problems. Every three months, we're gonna get it. Why? Because some, somebody mastermind has a critical path? No, that's not that's not what it takes. The culture has to be willing to talk about what it's facing and the difficulties it's facing. Getting back to that transparent relationship across the company to me was the biggest cultural upside that I could bring.\n\nLev-Ram: Rebuilding that trust internally and externally, and the role that transparency plays, I wonder if you can talk a little bit more about that, and just where that comes for you? I know we'll get into your years at GE a little bit later. But I think it's just fascinating, the difficulty that even leaders in very top positions have with difficult conversations. And you know, you said you knew you'd get whacked along the way but that this was the the best approach. So is that something that you developed over time? Is that something that you're developing in other leaders at Boeing? And how do you do that?\n\nCalhoun: You know, in the world of and particularly in public governance and public companies and the quarterly focus and the desire to always have good news about everything, CEOs are particularly impacted by that. They have to be. Because they always want to present a way forward for everybody. Investors are paramount, but also their employees, etc. So if you let that get carried away and it stops you from reconciling what are more difficult circumstances on the ground with what you would like to project and then you compromise that delicate balance, that's what gets you in trouble. You know, I, I worked for a guy, Alan, you remember him well, Jack Welsh. The one thing you could count on from Jack was pure reality and pure clarity every step of the way. He told you everything he thought about you, about your business, what he heard from the people he visited with at Crotonville the day before, he just went at it. He happened to be sharp and good and he kept us ahead of that game. I grew up in that situation and it just became really important to me. I carried that into my Nielsen life. That whole idea around transparency, how people's confidence grows, when they're confident they can be transparent. And then that hit me right between the eyeballs when I got to Boeing in the CEO role. And yes, I talk about it. There's not a day goes by I don't use the word. I talk about it at the top. I talk about it at the bottom of the organization. I create expectations in the media and with investors that they're not going to like what they hear in many cases. We talk about every little problem that occurs inside our production facility. It creates issues for our regulator. It creates issues with our investor. Our customers appreciate it. They really appreciate it. And we're on that journey.\n\n[Music starts]\n\nMurray: Jason Girzadas, the CEO of Deloitte US is the sponsor of this podcast and joins me today. Welcome, Jason.\n\nJason Girzadas: Thank you, Alan. It's great to be here.\n\nMurray: Jason, everyone in business is talking about A.I. It clearly has the potential to dramatically disrupt almost every industry, but a lot of companies are struggling. What are some of the barriers that companies are facing in creating business value with A.I.?\n\nGirzadas: Yeah, Alan, I think A.I. is on every client’s agenda. I think every CEO and board interaction and conversation that I’m a part of proves the fact that the promise of A.I. is widely held, and the hope is far and deep that it creates business value. But there’s challenges to be sure. What we’ve seen is that the probability of success increases dramatically with strong executive sponsorship and leadership. There has to be a portfolio of investments around A.I., as well as to link the business ownership with technology leadership to see the value of A.I.-related investments. Over time, we’re optimistic and confident that the value will result, but it will be a portfolio where either short-term opportunities for automation improvements around productivity and cost takeout and then longer-term, medium-term opportunities for business model innovation that are truly transformational. So this is a classic case where it won’t be a single approach that realizes value for A.I.\n\nMurray: It sounds like you take it a step at a time.\n\nGirzadas: I think it’s definitely time, and also a portfolio recognizing that some investments will have short-term benefit where you can see immediate use cases creating financial and business impact, but longer-term opportunities to really invent different customer experiences, different business models, and ultimately create a longer-term benefit that we can’t even fully appreciate at this point in time.\n\nMurray: Jason, thanks for your perspective. And thanks for sponsoring Leadership Next.\n\nGirzadas: Thank you.\n\n[Music ends]\n\nMurray: You took on Boeing in March of 2019, when you had a serious problem with the 737 Max crashes. And then in March of 2020, on top of that, you had a global pandemic and serious supply chain challenges that have really held the company back for the last few years, just getting the parts in place. And you know, you said, some of your customers, you talk turkey with your customers, you tell them exactly what's going on. But they're not terribly happy about it. They don't like the delays. They don't like the fact that they can't get their new planes in place, particularly when when travel is is booming. Have you gotten beyond the supply chain challenges? Where are you in that part of the journey?\n\nCalhoun: No, no, we haven't gotten by them. Our industry has not gotten by them. Maybe to reflect on the immediacy with which COVID came on top of our Max issue. I mean, both of them ended up being existential in their own right. But largely because they were dependent on each other. So we couldn't supply and now all of a sudden nobody wanted them. So we're sort of faced with, Oh, my gosh. The supply chain issues in aerospace, and I use that term to define the industry, I think really relate to the demographic issue the industry has had for quite some time. Our demographics have been working against us for quite a while. We have a lot of incredibly experienced engineers at every level of the value chain. So yes, Boeing at the design and assembly level, but also every single one of our supply chain participants, many of which are sole source, because remember, we only make what, a couple 1000 of these things a year? So you can't have two or three sources for every part that goes on two or 3000 airplanes. So it is a highly fragmented supply chain. With that demographic issue who had to face into cutbacks during the COVID moments and now is in the process of rebuilding. It's rarely now a story of can I get the people? It's can I train the people? Can I get them up to speed where all my experienced engineers who may have decided to retire, can I get them up to speed fast enough? They're not, I don't typically run into, we don't typically run into physical capacity constraints. It's technical constraints amongst the leading and best engineers in that supply chain. And it's impacting both manufacturers. So that, yeah, maybe you can relax for a minute that it's not just you. On the other hand, it means our industry is likely to be supply constrained for quite some time.\n\nLev-Ram: Well, so what does that timeline look like do you think if it's if it's more of a training issue? That sounds like that could take a while.\n\nCalhoun: My view is it takes roughly two years, starting at the beginning of this year, to get through our supply chains' capability capacity to then meet the demands of myself and the other player. It will then take, based on the demand that we see now, probably three more years for us to get to real rates that satisfy reasonably current demand, maybe three years worth of demand. Right now, we're out there selling 567 years from now.\n\nLev-Ram: So, and a follow up question there, because Boeing, of course, has both commercial and military businesses, but I'm assuming the supply chain issues impact both and there's, you know, yes, people need to get to Paris and wherever they want to go for vacation, but I'm assuming the military implications of a backlog there, there is slightly higher stakes, right?\n\nCalhoun: Higher stakes, but it's exactly the same issue that we face, many common shared suppliers. And I think if you survey my counterparts across the defense side, you get exactly the same response.\n\nMurray: You know, one of the problems in this industry is that the your customers are dependent on either you or Airbus. They really only have two choices. I think we saw some news this morning that the Chinese are trying to give them a third choice. Are you worried that this delay will give a big leg up to your competition?\n\nCalhoun: No, I'm not. I do believe patience is virtue in this industry, and it always has been. And a long term outlook is a big advantage if you can keep it. So we have two guys, and you're right, we've been at it for quite a long time. Relative parity, we enjoy some advantages in wide bodies, they enjoy some advantages in the narrow body. But basically parity from my point of view. New airplanes get introduced about every 10 years, and I think about 10 years from now we'll see new airplanes come to the market. The 919 as you mentioned, Alan, was introduced this morning. It's going to be a capable airplane. I don't think it can compete in the West yet with with Airbus and Boeing. But do I discount that they will eventually? No, they will. And then I ask myself the question: In 2050, if all the regulators in the world move in their direction for all the right reasons, and they're able to ramp up production at rates commensurate with what maybe Airbus or Boeing had done in their heydays, where would we be in 2050? And the answer is not the most devastating answer in the world. It's a growing market. It will continue to grow from now until 2050. There'll be three players instead of two. Two will have reasonably dominant chairs, and one will probably have 10% to 15% if everything goes right. And I look at my peers in industry, and as you know, coming from GE with so many different industrial interests, three competitors and a growing global market of this size and scale should not intimidate anyone.\n\nMurray: Yeah, yeah. So if this were a drinking game, and we had to take a drink every time you mentioned GE or Jack Welch, we would all be getting a little tipsy by now. So let me, Michal, if I can let me dive into...\n\nLev-Ram: It's not even noon in California, so I'm not there quite yet.\n\nMurray: So let me dive into that one and ask you about Jack Welch. And remember that at Fortune, we were all in. I mean, we named the man manager of the century for the 20th century. And certainly candor and transparency was one of his hallmarks straight from the gut, as his book was called. But there are other parts of the Jack Welch legacy that have not aged as well. The smoothing of quarterly earnings. The kind of rank and yank, not Jack's term, but the rank and yank method of, you know, hiring people at the bottom of the ratings distribution. The notion that there is no such thing as a work-life balance. It feels like the world of management has changed dramatically in the 20 years or 23 years since he stepped down, and I wonder how you feel about that?\n\nCalhoun: Again, it's a different time and a different context. Leaders have to change and adapt to the circumstances that we're faced with and we do. But then I ask the question, do I think Jack would have adapted and lead in those changing circumstances as well as he did back then? I think the answer is yes. Because one of the things he did really, really well is keep a pulse on what was going on around him and he always found a way to stay ahead of the game. Did I like quarterly gotta make it, period? No, I never did. I still don't. I have never used it in my subsequent career. And by the way, he knew that. It's just, uh, you know, for me, I don't like managing around edges and I didn't think it was necessary even at GE. I think there were moments when we may have had breakout opportunity. So I just do it a little differently. But do I disrespect and or fault him as that some major, you know, shortcoming? Answer is no. That was the way he coped with managing a incredibly diverse set of businesses and simplify the communication with his investors.\n\nLev-Ram: Before we let you go, Dave, I wanted to end on a, I guess, another culture question really. And just going back to the the crises that you stepped into, multiple crises, and given the competition that is out there and the supply chain issues and everything that you're up against, how do you kind of get things back to boring, in a way, to just working? To making sure that you know, manufacturing, that, that all of these things are ticking along as as they should be, and especially in this industry, while at the same time making sure that you're driving your employees to innovate, to compete? So many different technologies out there. Sustainability obviously is a big issue these days. So how do you strike that balance and make sure that you're setting the right tone culture-wise going forward?\n\nCalhoun: Yeah, I try to divide the world into two things. One is how we deliver and service the airplanes that we know how to build. That's all things supply chain. And I use the word stability and predictability all the time. That's our goal, stability and predictability. It may sound boring, but right now, every customer in a global aviation world would celebrate that moment. So that's the way we talk about it. And then the other dimension of our company, that we are heavily invested in, is development. How do we develop the technologies and capabilities that will then create that next new airplane? We have to sustain the investment, we have to keep our people motivated. And I always say, if you just want to inventory the landscape, we have three major commercial airplanes in development as we speak yet to be certified. Two in the Max family, one in the 777 family, all of which incredibly competitive, incredibly strong. We have a defense portfolio that has two autonomous players. One that is a refueling tanker for the Navy, the other one is a teamer and both of those airplanes fly today, autonomously. And if you could see the tasks that they take on, it would blow your mind. And I can't even talk about the classified programs we've been involved with. For all of these years, throughout every minute of these downturns and existential moments, we never stopped investing, we didn't shortchange any of them. And all of them have incredible promises we move forward. So we just talk about it in those ways. And I have to admit, until we got recertified on the Max, until we restarted our 87 production line, and started prancing our way back or marching our way back to that stability and predictability, it was hard to talk about development. But I'm incredibly proud of all the things that we've done to sustain that throughout this period. And so I would suggest everyone maybe ask our competitor what they're doing on this, and match it up against this.\n\nMurray: We will do that. One more quick question. One more quick question: How long is it going to be before you can produce an airplane that doesn't contribute to carbon pollution?\n\nCalhoun: Well, I think as an industry, the goal of 2050 will be challenged. But we can make so much progress against that with technologies we know we can get. Almost all of it is built around sustainable aviation fuels. As you may know, most of the engines today that get delivered on new airplanes are capable of running on sustainable fuels. We have a lot of formulations of sustainable fuels. And what it's going to boil down to are the feedstocks, feedstocks that support those fuels. And can aviation, we only represent 2% of global emissions, in carbon, 2%, will it be prioritized over other uses of those feedstocks? That's really where the battle is. We need policymakers to help us. But I do like our chances. I really do. Whether we get all the way to net zero at 2050 I'm not sure. Hydrogen will not be ready. Hydrogen might contribute significantly in the second half of the century. Won't be this one. Electric will help us at the low end. It will replace loud, noisy, inefficient high-emission helicopters. But it won't make a big dent in the overall carbon emission numbers.\n\nLev-Ram: Well, Dave, we appreciate the real talk. I personally find it very refreshing. I don't know about you, Alan.\n\nMurray: No, no, it's straight from the gut. I like it. Thank you for your candor.\n\nCalhoun: Well, Michal, I enjoyed it. Thank you. Nice to meet you. Alan, I'm not sure who refers to Jack more—you or me.\n\nMurray: Thank you.\n\nMurray: Leadership Next is edited and produced by Alexis Haut. Our theme is by Jason Snell. Our executive producer is Megan Arnold. Leadership Next is a product of Fortune Media.\n\nLeadership Next episodes are produced by Fortune‘s editorial team. The views and opinions expressed by podcast speakers and guests are solely their own and do not reflect the opinions of Deloitte or its personnel. Nor does Deloitte advocate or endorse any individuals or entities featured on the episodes.\n\nThis story was originally featured on Fortune.com\n\nMore from Fortune: \r\n5 side hustles where you may earn over $20,000 per year—all while working from home\r\nLooking to make extra cash? This CD has a 5.15% APY right now\r\nBuying a house? Here's how much to save\r\nThis is how much money you need to earn annually to comfortably buy a $600,000 home", "link": "https://finance.yahoo.com/news/boeing-ceo-moved-company-forward-173002592.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.048, "neu": 0.827, "pos": 0.124}}, {"date": "2023-06-22T16:08:04+00:00", "title": "Stock market today: Dow ends flat; S&amp;P and Nasdaq break 3-day losing streak", "content": "Investing.com -- U.S. stocks were lifted by the technology sector, trying to pull the Dow into green territory but falling just short of the mark.\n\nAt 16:02 ET (20:02 GMT), the Dow Jones Industrial Average was down 4 points or flat, while the S&P 500 was up 0.4% and the NASDAQ Composite was up 0.9%.\n\nThe S&P and Nasdaq ended a three day losing streak after Federal Reserve Chairman Jerome Powell wrapped up two days of testimony on Capitol Hill. Powell, as he said Wednesday, repeated his view that the Fed would likely raise rates again this year as it continues to combat inflation.\n\nThe Bank of England raised interest rates by a half of a percentage point on Thursday, its 13th consecutive raise as inflation there continues to run higher than expected.\n\nOn Wednesday, Powell told lawmakers in the House that the Fed wasn’t done raising interest rates to cool inflation, even though the central bank paused on more rate hikes last week. He appeared as part of his semi-annual testimony to Congress about the economy.\n\nPowell told the Senate today that working families suffer most directly from high inflation.\n\nPowell’s remarks suggested that more rate increases are \"a pretty good guess\" of what the Fed has planned assuming the economy continues on its current path. Futures traders see a 74% probability of rates rising a quarter of a percentage point at the Fed’s July meeting.\n\nGuided by data\n\nThe Fed’s next move will be guided by data, Powell said. Recent inflation data has shown signs that the economy is cooling, while the labor market is holding steady. Initial jobless claims on Thursday were 264,000, the same as the prior week and slightly above expectations.\n\nTech stocks were lifting the Nasdaq, led by shares of Amazon.com Inc (NASDAQ:AMZN), which rose 4.3%.\n\nShares of Boeing (NYSE:BA) parts supplier Spirit AeroSystems Holdings (NYSE:SPR) fell 9.4% after it said it would suspend production at a plant in Kansas, where workers announced a strike starting this weekend. Boeing shares fell 3%.\n\nDarden Restaurants, Inc. (NYSE:DRI) shares fell 2.6% after the parent of Olive Garden gave annual revenue guidance that was above estimates.\n\nRelated Articles\n\n3M surges after it resolves claims by public water suppliers in a $10.3 billion deal\n\nNew York lawyers sanctioned for using fake ChatGPT cases in legal brief", "link": "https://finance.yahoo.com/news/stock-market-today-dow-ends-160804419.html", "symbols": ["AMZN.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "DRI.US", "GSPC.INDX", "IXIC.INDX", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.921, "neg": 0.053, "neu": 0.861, "pos": 0.087}}, {"date": "2023-06-22T16:03:31+00:00", "title": "Boeing supplier Spirit AeroSystems halts work at Wichita plant after strike vote", "content": "Shares of Boeing and Spirit AeroSystems tumbled in early trading. The stocks are falling because Spirit suspended factory operations at a Wichita plant after union workers voted to strike. Yahoo Finance Live breaks down the stocks' reaction.", "link": "https://finance.yahoo.com/video/boeing-supplier-spirit-aerosystems-halts-160331232.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.153, "neg": 0.148, "neu": 0.718, "pos": 0.134}}, {"date": "2023-06-22T15:30:16+00:00", "title": "Intel Voices Plans To Restructure Manufacturing Business, Bumble's BFF App, Spirit AeroSystems To Stop Work At Kansas Plant Amid Workers Strike: Today's Top Stories", "content": "Reuters\n\nIntel's Manufacturing Overhaul: Aims for Second Largest Foundry Spot with Projected Revenue Over $20B\n\nIntel Corp (NASDAQ: INTC) has had an eventful week so far, enlightening investors with significant turnaround updates. On Wednesday, the company voiced plans to restructure its manufacturing business, likely to work like a separate unit and begin to generate a margin. The chipmaker neither disclosed any timeline for the restructuring nor named a new external customer for the business as part of its foundry services.\n\nAirbus Eyes Controlling A220 Jet Costs Amid Pricing Pressure From Suppliers\n\nAirbus SE (OTC: EADSY) reportedly plans to control the costs of its loss-making A220 jet while supporting its supply chain. The company is trying to reduce the production costs of its smallest jet but is grappling with pricing pressure from suppliers in the broader industry. The latest news follows Boeing Co (NYSE: BA) CEO Dave Calhoun's recent statement at the Bernstein conference, where he reportedly said that the company's progress on resolving supply chain problems has been \"frustratingly slow.\"\n\nEuropean Drug Authority Raises Thyroid Cancer Safety Signal For Novo Nordisk Drugs, Including Hyped Semaglutide\n\nThe EU's drugs watchdog, the European Medicines Agency, recently raised a thyroid cancer safety signal for Novo Nordisk A/S (NYSE: NVO) drugs, including the much talked semaglutide used in Ozempic and Wegovy for weight loss. The safety signal indicates the EMA's monitoring of potential adverse events related to approved drugs but does not establish causation between the medicine and reported adverse events.\n\nBenzinga\n\nSpirit AeroSystems To Stop Work At Kansas Plant As Workers Vote To Strike\n\nIn response to the strike decision by Spirit AeroSystems employees represented by the International Association of Machinists and Aerospace (IAM) Workers, factory production will be suspended before the contract expires. Spirit AeroSystems Inc is a subsidiary of Spirit AeroSystems Holdings Inc (NYSE: SPR). The plant produces 70% of Boeing Co's (NYSE: BA) narrow-body aircraft and defense and business jet structures.\n\nAccenture Shares Fall After Reporting Underwhelming Q3 Earnings\n\nAccenture Plc (NYSE: ACN) shares are trading lower Thursday after it reported third-quarter results. The company reported third-quarter FY23 revenue growth of 3% year-over-year to $16.57 billion, marginally beating the consensus of $16.56 billion. New bookings increased by 2% Y/Y to $17.2 billion. Consulting revenues decreased by 4% Y/Y to $8.69 billion, and Managed Services revenues increased by 10% Y/Y to $7.87 billion. Adjusted EPS of $3.19 beat the consensus of $3.04. Adjusted operating margin was 16.3%, an expansion of 20 bps. The gross margin expanded by 50 bps to 33.4%.\n\nLordstown Motors Founder Relinquishes His Remaining Stake\n\nLordstown Motors Corp (NASDAQ: RIDE) shares are trading higher after founder Steve Burns relinquished his remaining stake in the company. The former CEO offloaded 581,000 shares on May 23 for an average price of 27 cents apiece, just before the startup executed a reverse stock split. He sold another 200,000 shares for $3.74 each on May 24 and his remaining 591,752 shares for $4.99 on June 16. Burns, who resigned as CEO in 2021 after the board found proof of inaccurate preorder statements, has sold about $66 million of stock through mid-June.\n\nRSV Vaccines from Pfizer and GSK Gain CDC Advisory Committee's Favor for Older Adults\n\nThe US Centers for Disease Control and Prevention's (CDC) Advisory Committee on Immunization Practices voted in favor of recommending the use of RSV vaccines from Pfizer Inc (NYSE: PFE) and GSK plc (NYSE: GSK) for older adults. The panel didn't go so far as to recommend it for everyone in the age group, citing that patients should first talk to their doctor, partly because the studies didn't enroll many people at the highest risk for severe disease.\n\nWall Street Journal\n\nActivist Investor Pressures NRG Energy To Change CEO\n\nNRG Energy Inc (NYSE: NRG) is facing pressure from the activist investor Elliott Investment Management for expelling its Chief Executive Officer (CEO), Mauricio Gutierrez. Elliott is reportedly talking to potential candidates for replacing NRG CEO and other top executives. Last month, Elliott acquired a 13% economic interest (around $1 billion) in the company and stated its motive to restructure the board and initiate cost-saving measures and a strategic review of Vivint, the home services unit of the company.\n\nSCMP\n\nAlibaba's Post-Reshuffle Strategy - Emphasizing the Role of Small Businesses Amid Economic Slowdown\n\nA day after its major management overhaul, Alibaba Group Holding Limited (NYSE: BABA) President Chen Long emphasized the growing importance of small businesses and merchants. He advocated a strategic business pivot formed by its founder Jack Ma. Long reminded Alibaba's continued focus on small business as the backbone of its platform amid China's consumption slowdown on the sidelines of the Luohan Academy digital economy conference.\n\nBloomberg\n\nFollowing Roomba Acquisition, Amazon Eyes London's Ocado for Next Major Tech Investment\n\nAmazon.Com Inc (NASDAQ: AMZN) and several other techs \"heavyweights\" weighed a bid worth 800p per share for Ocado Group PLC (OTC: OCDDY) (OTC: OCDGF). Ocado builds robots and software that help deliver groceries online. \"A deeper consideration of the strategic logic and the actual likelihood of an official takeover approach will have to wait for more details,\" Bloomberg cites Jefferies analyst Giles Thorne. Jefferies has had a hold recommendation on Ocado since at least December 2021.\n\nJPMorgan Chase Appoints Teresa Heitsenrether to Lead New AI-Driven Data and Analytics Unit\n\nJP Morgan Chase & Co (NYSE: JPM) anointed Teresa Heitsenrether as head of a new data and analytics unit under its critical artificial intelligence push. The appointment is effective immediately, Bloomberg cites an internal memo Wednesday from CEO Jamie Dimon and President Daniel Pinto. Heitsenrether, who has been at JPMorgan for over 30 years, will continue to report to Pinto.\n\nWashinton Post\n\nApple Patches Security Glitches in iPhones and iPads: Protection Against Russian Hacking Attacks\n\nOn Wednesday, Apple Inc (NASDAQ: AAPL) said it had fixed two new security faults in its iPhones and iPads that helped compromise thousands of devices in Russia. Apple credited researchers from Russian security software maker Kaspersky Lab for discovering the glitches. Apple said the fixes would protect iPhones running iOS 15.7 or earlier versions, which became outdated in September. More recent operating system versions had other improvements that made them impervious to the attacks.\n\nTechCrunch\n\nSwipe Right for Friendship! Bumble Tests Standalone App for Pal-Seekers\n\nDating app Bumble Inc (NASDAQ: BMBL) said it is testing a separate BFF app in select markets aimed at people \"looking for friend finding without being on a dating app.\" It plans to release this app in the U.S. in 2023. Separate reports suggested Bumble trialing a new app in select geographies. The free app has premium subscriptions for a week, three months, six months, and a lifetime.\n\nPhoto via Wikimedia Commons\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Intel Voices Plans To Restructure Manufacturing Business, Bumble's BFF App, Spirit AeroSystems To Stop Work At Kansas Plant Amid Workers Strike: Today's Top Stories originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/intel-voices-plans-restructure-manufacturing-153016692.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ACN.US", "AMZN.US", "APC.F", "APC.XETRA", "BA.MX", "BA.US", "BABA.US", "BCO.F", "BCO.XETRA", "BMBL.US", "BOEI34.SA", "GSK.US", "INL.F", "INL.XETRA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.07, "neu": 0.793, "pos": 0.137}}, {"date": "2023-06-22T15:26:50+00:00", "title": "SPR Stock: Boeing Supplier Spirit Sinks As Worker Strike Hits Production Lines", "content": "Key supplier Spirit AeroSystems supplies various Boeing and Airbus jets including the top-selling 737 Max. SPR stock dived.", "link": "https://finance.yahoo.com/m/ba6006b2-8189-3cf4-a152-2cb215a2bb2d/spr-stock%3A-boeing-supplier.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0, "neu": 0.909, "pos": 0.091}}, {"date": "2023-06-22T15:26:35+00:00", "title": "Spirit AeroSystems Shares Slide as Production Shuts Down Ahead of Strike", "content": "Shares of Spirit AeroSystems tumbled as the airplane parts manufacturer suspended factory operations ahead of a strike by its union employees.", "link": "https://finance.yahoo.com/m/9fd24b4c-8fb0-3ec4-ba41-b0a4fbda4d42/spirit-aerosystems-shares.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.178, "neg": 0.188, "neu": 0.653, "pos": 0.159}}, {"date": "2023-06-22T15:25:56+00:00", "title": "New orders and supply chain progress as Paris Airshow grapples with pandemic aftermath", "content": "By Tim Hepher, Valerie Insinna, Joanna Plucinska and Allison Lampert\n\nPARIS, June 22 (Reuters) - The first Paris Airshow in four years has clocked up billions of dollars in commercial jet orders and offered some respite for suppliers as air travel springs back sharply from the pandemic.\n\nThe industry returned to Le Bourget with high expectations of commercial orders and low expectations regarding the supply chain, but generated a more balanced picture on both fronts.\n\nAnnounced orders reached near-record levels but were heavily dominated by two airlines leading the charge in India, the world's fastest growing market: IndiGo and Air India.\n\nAirbus and Boeing collectively unveiled orders or commitments for some 1,100 jets, with Airbus at around 830 jets, led by a 500-plane deal with IndiGo.\n\nBut these fell short of some market forecasts of 2,000 orders, to the relief of some analysts who noted a less brash and more business-like tone than previous shows, from an industry scarred by its near-collapse during COVID-19.\n\nIndia's economic growth and growing middle class have made it the latest frontier for aviation deals worth tens of billions of dollars, though exact prices were not disclosed.\n\n\"That market is going to feed a lot of players in our industry, and we'd like to be the first one there for a long time, barring unforeseen events,\" Airbus Chief Commercial Officer Christian Scherer said.\n\nFINANCING METHOD\n\nA total of 970 orders from two Indian carriers showed airlines willing to lock in positions for the next decade and manufacturers building a foundation for rising output rates.\n\nThe IndiGo deal also highlighted the growing importance of the so-called sale-and-leaseback model, a popular aircraft financing method that requires a constant flow of new jets.\n\nUnder such deals, freshly delivered jets are sold by airlines to leasing companies, rented back and then operated for six years or more before being moved on to another operator.\n\nFor passengers, it means the fleet is kept young. For airlines it can mean a key source of extra profit on the sale.\n\nSuch financing now makes up 34% of all aircraft financing, Airbus said in a presentation to investors on Wednesday.\n\nIndia's leasing market is facing some pressure, however, after the bankruptcy of carrier GoFirst sparked a dispute over lessors' rights. IndiGo Chief Executive Pieter Elbers said he was not concerned about an impact on the wider market.\n\nThe latest deals, coming after a number of mainly Boeing orders before the show, left the largest planemakers mostly sold out until the latter part of the decade.\n\nA key focus of the show was how those planes will be produced after the pandemic disrupted supply chains. Another was hiring more workers: to be tackled in a special event on Friday.\n\nAs their biennial jamboree wound up under pouring rain on Thursday, delegates also had to absorb news of a strike at a Spirit Aero Systems factory that makes Boeing 737 fuselages. A lengthy stoppage would impact suppliers worldwide.\n\nSeveral major companies said they had built up more buffer stocks and were seeing signs of improvement in supply chains.\n\nThe conflict in Ukraine brought a raft of air defence order announcements and a growing focus on Europe's patchy growth in defence spending after years of budgets constraints.\n\nFor many, the show diverted attention from the plush chalets where planemakers keep count of orders to the crowded supplier halls where more of the industry's risk now resides.\n\n\"It was the most interesting European air show for a decade,\" Agency Partners analyst Sash Tusa said.\n\n\"The newsflow was much more balanced between defence and civil - and no longer just a counting competition.\" (Reporting by Tim Hepher Editing by Mark Potter)", "link": "https://finance.yahoo.com/news/orders-supply-chain-progress-paris-152556833.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0.028, "neu": 0.879, "pos": 0.093}}, {"date": "2023-06-22T13:47:03+00:00", "title": "Midday movers: Spirit Aerosystems, Overstock, Amazon.com and more", "content": "Investing.com -- Stocks are mixed after Federal Reserve Chair Jerome Powell repeated his call that interest rates would likely rise again this year. Here are the market movers for June 22.\n\nSpirit Aerosystems Holdings Inc (NYSE:SPR) shares fell 8.6% after the Boeing supplier said it was suspending factory production at a plant in Kansas because union workers were preparing to strike this weekend. Shares of  Boeing Co  (NYSE:BA) fell 2.4%. Overstockcom Inc (NASDAQ:OSTK) shares rose 17% after the online retailer won the bidding for Bed Bath & Beyond's (OTC:BBBYQ) intellectual property assets for $21.5 million. Buybuy Baby, which is Bed Bath's baby-focused retail division, is being sold separately. Amazon.com Inc (NASDAQ:AMZN) shares rose 3% while iRobot Corporation (NASDAQ:IRBT) shares fell 8.2% after a report that the $1.7 billion deal by Amazon to buy the the maker of Roomba vacuums was possibly facing an antitrust investigation in the EU. Darden Restaurants Inc (NYSE:DRI) shares were down 3% after the parent of Olive Garden restaurants said same-store sales for the Italian food chain fell short of expectations. Same-store sales for LongHorn Steakhouse, however, were above expectations. Anheuser Busch Inbev (EBR:ABI)(NYSE:BUD) shares rose 1.9% after Deutsche Bank upgraded the stock to Buy from Hold. The shares are down 3.7% so far this year after calls for a boycott of its Bud Light brand.\n\nRelated Articles\n\nMidday movers: Spirit Aerosystems, Overstock, Amazon.com and more\n\nGeneral Motors hires former Google exec Lin-Hua Wu as CCO\n\nOverstock shares jump after winning auction for Bed Bath & Beyond assets", "link": "https://finance.yahoo.com/news/midday-movers-spirit-aerosystems-overstock-134703426.html", "symbols": ["1NBA.F", "1NBA.XETRA", "ABI.BR", "AMZN.MX", "AMZN.US", "ANH.JSE", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "BUD.US", "BUDFF.US", "DDN.F", "DRI.US", "IRBT.US", "ITKA.F"], "tags": [], "sentiment": {"polarity": 0.983, "neg": 0.014, "neu": 0.84, "pos": 0.146}}, {"date": "2023-06-22T13:24:50+00:00", "title": "Stocks are mixed as Powell appears in Senate; Tech stocks lift Nasdaq", "content": "Investing.com -- U.S. stocks were mixed as Federal Reserve Chair Jerome Powell repeated his comments about interest rates likely heading higher this year.\n\nAt 13:13 ET (17:13 GMT), the Dow Jones Industrial Average was down 91 points or 0.3%, while the S&P 500 was flat and the NASDAQ Composite was up 0.4%.\n\nThe Bank of England raised interest rates by a half of a percentage point on Thursday, its 13th consecutive raise as inflation there continues to run higher than expected.\n\nOn Wednesday, Powell told lawmakers in the House that the Fed wasn’t done raising interest rates to cool inflation, even though the central bank paused on more rate hikes last week. He is appearing as part of his semi-annual testimony to Congress about the economy.\n\nOn Thursday, Powell repeated his message to the Senate that it would be appropriate to raise rates again this year, possibly twice, if the economy performs as expected. He said working families suffer most directly from high inflation.\n\nPowell’s remarks suggested that more rate increases are \"a pretty good guess\" of what the Fed has planned assuming the economy continues on its current path. Futures traders see a 74% probability of rates rising a quarter of a percentage point at the Fed’s July meeting.\n\nGuided by data\n\nThe Fed’s next move will be guided by data, Powell said. Recent inflation data has shown signs that the economy is cooling, while the labor market is holding steady. Initial jobless claims on Thursday were 264,000, the same as the prior week and slightly above expectations.\n\nTech stocks were lifting the Nasdaq, led by shares of Amazon.com Inc (NASDAQ:AMZN), which are up 3.4%.\n\nShares of Boeing (NYSE:BA) parts supplier Spirit AeroSystems Holdings (NYSE:SPR) fell 8.6% after it said it would suspend production at a plant in Kansas, where workers announced a strike starting this weekend. Boeing shares fell 2.4%.\n\nDarden Restaurants, Inc. (NYSE:DRI) shares fell 3% after the parent of Olive Garden gave annual revenue guidance that was above estimates.\n\nRelated Articles\n\nStocks are mixed as Powell appears in Senate; Tech stocks lift Nasdaq\n\nBankrupt Vice Media plans sale to Fortress Investment-led group\n\nDollar, yields gain after Powell comments, Bank of England rate hike", "link": "https://finance.yahoo.com/news/stocks-mixed-powell-appears-senate-132450083.html", "symbols": ["AMZN.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "DRI.US", "IXIC.INDX", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.955, "neg": 0.028, "neu": 0.891, "pos": 0.081}}, {"date": "2023-06-22T11:50:00+00:00", "title": "Boeing Gets a New Headache.  Spirit Aero Stock Tanks as Workers Vote to Strike.", "content": "Key Boeing (ticker: BA) supplier Spirit AeroSystems (SPR) announced it was suspending factory operations after the International Association of Machinists and Aerospace Workers voted no to a new labor contract that included wage increases of almost 8% per year for the coming four years. Both Boeing and its rival Airbus (AIR.France) have been trying to boost production to meet rising demand. Just 753 jets were delivered in 2020, amid the pandemic and the worldwide grounding of the Boeing 737 MAX following two deadly crashes.", "link": "https://finance.yahoo.com/m/58d3729e-aff0-3901-a45b-c4682ed65038/boeing-gets-a-new-headache.-.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0.042, "neu": 0.907, "pos": 0.051}}, {"date": "2023-06-22T11:49:24+00:00", "title": "U.S. stocks are wobbling on prospect of more interest rate hikes", "content": "Investing.com -- U.S. stocks were wobbling as Federal Reserve Chair Jerome Powell headed back to Capitol Hill for his second day of testimony.\n\nAt 11:45 ET (15:45 GMT), the Dow Jones Industrial Average was down 13 points or flat, while the S&P 500 was up 0.2% and the NASDAQ Composite was up 0.7%\n\nOn Wednesday, Powell told lawmakers in the House that the Fed wasn’t done raising interest rates to cool inflation. He is appearing as part of his semi-annual testimony to Congress about the economy.\n\nOn Thursday, Powell repeated his message to the Senate that it would be appropriate to raise rates again this year, possibly twice, if the economy performs as expected. He said working families suffer most directly from high inflation.\n\nPowell’s remarks suggested that more rate increases are \"a pretty good guess\" of what the Fed has planned assuming the economy continues on its current path. Futures traders see a 74% probability of rates rising a quarter of a percentage point at the Fed’s July meeting.\n\nGuided by data\n\nThe Fed’s next move will be guided by data, Powell said. Recent inflation data has shown signs that the economy is cooling, while the labor market is holding steady. Initial jobless claims on Thursday were 264,000, the same as the prior week and slightly above expectations.\n\nShares of Boeing (NYSE:BA) parts supplier Spirit AeroSystems Holdings (NYSE:SPR) fell 9.7% after it said it would suspend production at a plant in Kansas, where workers announced a strike starting this weekend. Boeing shares fell 2.4%.\n\nDarden Restaurants, Inc. (NYSE:DRI) shares fell 1.6% after the parent of Olive Garden gave annual revenue guidance that was above estimates.\n\nRelated Articles\n\nU.S. stocks are wobbling on prospect of more interest rate hikes\n\nMidday movers: Spirit Aerosystems, Overstock, Amazon.com and more\n\nFracas in Vegas? Musk, Zuckerberg talk cage match in social media bluster", "link": "https://finance.yahoo.com/news/u-stocks-wobbling-prospect-more-114924176.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "DRI.US", "IXIC.INDX", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.946, "neg": 0.023, "neu": 0.895, "pos": 0.082}}, {"date": "2023-06-22T11:15:00+00:00", "title": "FedEx to shut down 29 more aircraft as demand shrinks", "content": "FedEx Express planes, including an Airbus A300-600 9 (foreground) at the company’s superhub at Memphis International Airport in Tennessee on June 4, 2017. (Photo: Shutterstock/John Gress Media Inc.)\n\nFedEx plans to remove 29 aircraft from its fleet this year through permanent retirement and temporary storage, fulfilling its new program to eliminate permanent costs and make its logistics network more flexible as global trade slows.\n\nCEO Raj Subramaniam said on Tuesday’s earnings briefing that the Express unit will park 20 aircraft in fiscal year 2024 and permanently retire nine additional MD-11 freighters. But the latest fleet statistics show the integrated logistics and parcel carrier’s mainline fleet will actually grow by 10 aircraft this year as Boeing planes ordered years ago are delivered.\n\nFedEx Express retired 18 aircraft in the just-completed fiscal year, including 12 MD-11s, four Boeing 757-200s and two Airbus A300-600s. FedEx wrote off the $70 million book value of the planes plus 34 related engines in its fourth-quarter results.\n\nFedEx (NYSE: FDX) began flying less in October as part of a corporate restructuring aimed at improving efficiency and reducing immediate costs as the downturn in shipping and e-commerce sales took hold.\n\nExpress revenues fell 13% in the fourth quarter, ended May 31, to $10.4 billion while operating income was halved at $430 million. Success in decreasing expenses and higher U.S. yields partially offset lower volumes and helped improve profits, which tumbled 64% for the full year. The company said Express package volumes declined 7%, an improvement from the third quarter.\n\nSince fall, the company’s in-house airline has slashed dozens of daily flights from its schedule, accelerated the retirement of aging aircraft and deactivated other aircraft until demand picks up. Management has also indicated it plans to rely more heavily on partner airlines in the future instead of purchasing capacity itself to improve cash flow and prioritizing owned aircraft for parcel shipments over heavy freight, which will be moved more by third parties.\n\nFedEx reduced global flight hours by 12%, year over year, during the fourth quarter. Domestic aircraft utilization is down even more, according to a recent analysis by Morgan Stanley.\n\n“We continue to make significant progress in taking cost out of our network, delivering a $2 billion year-over-year reduction in operating cost in the fourth quarter of FY ’23. This included more effectively matching flying with demand, marking the first quarter of this year where our flight hours declined more than the underlying volumes,” said Subramaniam.\n\nThe express delivery company decommissioned its few remaining MD-10-30 cargo jets in December. Those planes were taken off the accounting books at the end of fiscal year 2022 but were utilized a few months longer because FedEx was still anticipating continued strong demand midway through last year.\n\nOverall fleet size decreased during the fiscal year by 10 units, with retirements offset by the addition of 14 factory-built Boeing 767-300 freighters and two Boeing 777s. FedEx currently has 700 aircraft, including 407 mainline aircraft and 293 feeder aircraft — 14 more than the prior year.\n\nDecisions on aircraft acquisitions were made years ago, well before the current financial pressures forced FedEx to rebalance its network and consolidate Express and Ground operations to better utilize existing infrastructure and personnel. The fleet additions are mostly for fleet modernization as they will replace aircraft being retired.\n\nFedEx currently has 46 MD-11s, which will be phased out by fiscal 2028.\n\nDuring the next two years, FedEx plans to add 55 aircraft to its fleet, the majority of them small feeder aircraft operated by contractors. It will get rid of 18 MD-11s, while adding 24 767s and six 777s, 27 all-new Cessna 408 SkyCourier aircraft, and 16 ATR72-600s, barring production delays.\n\nThe Cessnas and ATRs are small turbo-prop planes. FedEx has committed to buying 41 SkyCouriers and 17 ATR72s.\n\nAfter fiscal year 2025, FedEx has no firm commitments for aircraft purchases. Capital expenditures for aircraft are expected to decrease to about $1 billion in fiscal 2026, the company’s CEO said.\n\nManagement recently agreed on a five-year contract with its pilots’ union. Pilots will vote next month on whether to ratify the deal.\n\nClick here for more FreightWaves stories by Eric Kulisch.\n\nRECOMMENDED READING:\n\nFewer FedEx flights raises red flag for fourth-quarter earnings\n\nFedEx to transfer LAX airport maintenance to Indianapolis\n\nFedEx says air network restructuring to save $700M annually\n\nFedEx readjusts air network again amid sharp volume declines\n\nFreighters flying fewer hours underscores market weakness in air cargo\n\nThe post FedEx to shut down 29 more aircraft as demand shrinks appeared first on FreightWaves.", "link": "https://finance.yahoo.com/news/fedex-shut-down-29-more-111500353.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "FDX.F", "FDX.MX", "FDX.US", "FDX.XETRA"], "tags": [], "sentiment": {"polarity": 0.973, "neg": 0.029, "neu": 0.908, "pos": 0.063}}, {"date": "2023-06-22T10:55:57+00:00", "title": "Analysis-Smaller aerospace suppliers scramble for titanium, workers in shadow of travel boom", "content": "By Allison Lampert and Aditi Shah\n\nPARIS/NEW DELHI (Reuters) - Standing at a small booth among a row of other Japanese aerospace suppliers at the Paris Airshow, Yoko Konno is excited at the prospect of new orders for her company, but frowns at long delays to get titanium and the rising cost of chemicals.\n\n\"It is challenging but it is a chance to get more business,\" said Konno, a section manager at Japan's Asahi Kinzoku Kogyo, Inc, which produces components and does chrome plating.\n\nFar from the fighter-jet displays and blockbuster plane orders that grabbed headlines at the world's largest air show this week, it's the small and medium-sized suppliers dotting the sprawling exhibition halls that are garnering big attention from senior aerospace officials.\n\nWhile bosses at Airbus and Raytheon Technologies see improvements, labor shortages and delays are expected to remain a key concern for planemakers and large suppliers for more than a year.\n\n\"There are issues and lack of capacity almost everywhere,\" said Anne Brachet, executive vice president of Air France-KLM's engineering and maintenance division.\n\nThe show is a test of the supply chain's resilience, with some small and medium suppliers both hurting from higher costs and seeing opportunities as large players look for more sources to make parts and components to reduce risk.\n\nOthers are wary of making investments in new production without assurances that clients will stick around.\n\n\"It's chaos, but everyone's in the same boat,\" said Liam Wiezak, business development manager at Britain's Sigma Aero about the supply chain.\n\nIt's raising concerns whether jetmakers Airbus and Boeing will be able to hit ambitious goals to ramp up output in order to meet delivery targets, particularly after the show saw orders for almost 1,000 jets from just two Indian carriers.\n\n\"Headlines may be dominated by news of record new orders but this is all but irrelevant in the short-medium term,\" said Louis Knight, analyst at research firm Third Bridge.\n\n\"The bottlenecks, lead times, sourcing challenges and labor shortages continue to plague the industry, so - regardless of order intake - deliveries remain in full focus.\"\n\nSigma Aero is seeing higher demand for the pipes, ducts and machines it produces for engines and airframes, but the time needed to buy certain raw materials has more than tripled, Wiezak said on the sidelines of the show.\n\nMATERIALS, LABOR\n\nFollowing the war in Ukraine, planemakers are trying to find alternatives to Russia's VSMPO-Avisma, a key titanium producer to the aerospace industry, which is pushing up demand and creating long waits to buy from other providers.\n\n\"Now all the people who used to buy from Russia are shopping in our store,\" said Nik Delic, president of New England Airfoil Products (NEAP) in Connecticut, which purchases U.S.-made titanium.\n\nVSMPO, for example, is the sole source of particular high-strength titanium landing gear, despite increasing production from American, Chinese and Japanese mills, Knight said.\n\n\"While its market share may be reduced, it is very hard for the likes of Airbus, Boeing, and (engine maker) Safran to remove the dependency.\"\n\nPurchasing new machines would increase capacity to meet higher demand for the company's airfoils used in engine compressors, but Delic wants a long-term commitment from buyers.\n\n\"I have 100 people whose livelihood depends on the success of the company.\"\n\nIn certain cases, it takes longer to get parts or materials due to some suppliers exiting aerospace during the pandemic.\n\nDCM Group in Canada's Quebec produces parts welded from sheet metal which mostly need protective coatings.\n\nBut that segment of the industry is under stress because some companies have closed their doors since COVID-19, said Guillaume Gasparri, executive vice president, business development, for DCM.\n\nLike parts and materials, a shortfall of labor is a key problem for suppliers who can't offer comparable salaries to the large planemakers.\n\nPatrice Arnoux, director of RecAero, said the manufacturer of parts and components had its own training program that takes just over a year to produce workers for the company and others in France's aerospace hub around Toulouse.\n\nMost of the 30 participants this year are unemployed.\n\n\"The needs are enormous,\" he said, adding RecAero was looking for 30 workers. \"If we are looking for 30 people, imagine Airbus and Safran.\"\n\nSome small and medium-sized suppliers in India see opportunities from the jet buying spree of their local airlines.\n\nAnkit Patel, founder and director of Ankit Fasteners with about 450 employees, was already looking to double capacity in the next three or four years.\n\n\"There is a euphoria around India,\" said Patel, whose company supplies fasteners like screws and bolts to Airbus and Boeing. \"Now's the time to capitalise, to say yes, we have capacity on the ground, Airbus and Boeing, look at us we can deliver.\"\n\n(Reporting by Allison Lampert in Paris and Aditi Shah in New Delhi; Editing by Mark Potter)", "link": "https://finance.yahoo.com/news/analysis-smaller-aerospace-suppliers-scramble-105557990.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.049, "neu": 0.867, "pos": 0.084}}, {"date": "2023-06-22T10:35:13+00:00", "title": "10 Least Competitive Industries in the World", "content": "In this piece, we will take a look at the ten least competitive industries in the world. If you want to skip our analysis of why competition is important, head on over to 5 Least Competitive Industries in the World.\n\nCompetition sits at the heart of the business world and the capitalist system. It forces firms to innovate and makes those with unprofitable business models or obsolete products either get their act together or go out of business.\n\nIn fact, competition is also a large reason why the Western world was eventually able to overcome the Communist system of Soviet Russia. The country had a centralized planned economy, which required steel making plants to meet their monthly quotas. The managers of these plants as a result were not eager to improve their cost efficiencies and instead would simply overhire labor and order excess raw materials to just meet the requirements set by the government. Over the long term, this introduced inefficiencies in the system, and would often lead to managers sometimes not even meeting their production targets if they were afraid that the targets would be increased next year. The end result of this ensured a lack of competition in the Soviet Union's factories and stunted innovation - which have led to key technologies such as semiconductors and optics being relatively underdeveloped even today.\n\nThe world has changed since the time of the Soviet Union and one of the biggest changes comes in the form of the Internet. The internet allows people to make money while sitting at home instead of toiling away in factories or in offices. And its proliferation across the globe means that there are a variety of niche markets that any seller can target. And some great niche markets for 2023 come from none other than the retailing platform Shopify Inc. (NYSE:SHOP). According to Shopify, great niche markets that can be interesting in 2023 include laptop accessories, desktop toys, reusable drinking straws, melatonin gummies, GPS pet trackers, and oil diffusers. And when it comes to finding high demand and low competition business ideas, it can pay to understand search algorithms to determine which products are in high demand, analyze competitor behavior, and see if any substitute products can attract similar demand to well selling ones.\n\nAdditionally, we don't need to take a look too far back in history to pick out which industries need competition. One of the biggest examples of an industry that lacked competition and was subsequently transformed due to an agile and intelligent entrant is aerospace. The aerospace industry has typically been funded by governments for state programs as its only other source of demand is satellites. And until 2015, the industry continued to rely on big and slow companies such as The Boeing Company (NYSE:BA) and Lockheed Martin Corporation (NYSE:LMT). However, Space Exploration Technologies Corporation's (SpaceX) entry into the fray has forever changed the way in which the astronautics industry operates. SpaceX's reusable rocket has dramatically reduced the cost of launch, taken market share from the largest company before it, and broken the United Launch Alliance's (ULA) decades old monopoly in the national security space launch (NSSL) market.\n\nAnother industry that has been begging for competition for decades is satellite internet. For years the only options consumers have had came from satellites placed high up in geostationary orbits resulting in slow speeds due to the vast distances involved. And for decades, the low Earth orbit (LEO) satellite internet industry needed competition.  Yet, only one firm made an attempt starting in the 1990s. And while Teledesic Corporation tried to break into the industry, eventually it had to go bankrupt. However, SpaceX is making its mark in the LEO internet market too, with its Starlink satellite service up and running and providing coverage globally. You can take a detailed look at the satellite industry by checking out 10 VLEO Technology Stocks and Startups to Watch.\n\nFurthermore, competition is not limited only to corporate players. It also extends itself to the job market, where thousands of candidates jostle to land a dream role. Yet, others also seek a relatively stress free life where they don't have to worry about competition in the job market. So what are some jobs that have low competition but pay remarkably well? Well, some roles are pediatricians, pharmacists, dentists, optometrists, and tax directors.\n\nFinally, one highly competitive industry that sees players cut prices aggressively to woo customers is telecommunications. On this front, the management of T-Mobile US, Inc. (NASDAQ:TMUS) shared details about its strategies during the firm's latest earnings call where it shared:\n\nSo we announced last week our latest Un-carrier move with Phone Freedom, a move aimed to free customers and other wireless providers locked into those three-year contracts, while they are subjected to relentless pricing changes and gadgets. We continue to make it easier for customers to come to T-Mobile and switch to T-Mobile for peace of mind, knowing that with price lock, we won’t raise their price for top text and data. And now with new one too are part of Phone Freedom, they will be upgrade-ready in two years, because three years is too long to force customers to wait.\n\nHere’s kind of a crazy sort of fact to get your head around, AT&T reported the lowest postpaid phone churn in the industry this quarter and yet quantitative research states that their customers have the highest self-reported likelihood of switching away. Their customers report being almost 50% more likely to switch than Verizon’s or T-Mobile’s customers. The lowest churn, but the highest apparent dissatisfaction. And to me, that means one thing. Their customers are trapped and we are here to solve it and that’s what our latest Un-carrier move is all about. That’s what Phone Freedom is all about. And it’s the way we have been designing our groundbreaking Un-carrier moves for a full decade now. And as you know, we hit another milestone this month, the three-year anniversary of our merger.\n\nWith these details in mind, let's take a look at some of the least competitive industries in the world. If you're interested to find out about companies that have remained in business despite being mostly the same, you can check out 10 Least Innovative Companies That Are Still In Business Today. 10 Least Competitive Industries in the World\n\nNiloo / Shutterstock.com\n\nOur Methodology\n\nTo compile our list of the least competitive industries in the world, we used Michael Porter's Five Forces as the backbone of our hunt. According to Porter, industries with a high buyer and supplier power, high threats of substitution and new entrants, and high competitive rivalry have low returns on investments (ROIs) since companies have little pricing power to squeeze out more margins. So, we used data from CSI Market to see which industries have the lowest ROI as a proxy for the least competitive industries.\n\n10 Least Competitive Industries in the World\n\n10. Capital Goods\n\nReturn on Investment (ROI) Estimate: 9.55%\n\nThe capital goods industry is typically involved with making and selling heavy duty industrial equipment. This covers a wide range of products such as steam turbines, land excavators, tractors, jet engines, and other machines. The sector requires significant capital expenditure and guaranteed orders for companies to take the risk of producing bulky and expensive goods. Some notable capital goods companies are General Electric Company (NYSE:GE), Caterpillar Inc. (NYSE:CAT), and Deere & Company (NYSE:DE).\n\n9. Consumer Non Cyclical\n\nReturn on Investment (ROI) Estimate: 8.49%\n\nThe consumer non cyclical industry takes its name from the idea of a business cycle. A business cycle, broadly speaking, describes the economy and the business environment as prospering in cycles of high and low growth. Consumer non cyclical companies are those that are relatively insulated against the changes in the business cycle as they are typically operating in stable sectors such as utilities, healthcare, and consumer staples - which are bound to see demand regardless of the state of the economy.\n\n8. Basic Materials\n\nReturn on Investment (ROI) Estimate: 8.01%\n\nThe basic materials industry is quite self explanatory really. It deals with the building blocks and raw materials for a variety of industries. One of the more popular basic materials segments these days is the lithium industry which is seeing sustained demand due to the global shift toward electric vehicles. Some well known basic materials companies are Rio Tinto Group (NYSE:RIO), BHP Group (NYSE:BHP), and Vale SA (NYSE:VALE).\n\n7. Conglomerates\n\nReturn on Investment (ROI) Estimate: 7.04%\n\nConglomerates, simply put, are firms that try to do it all. These companies often have a global presence and often operate in completely unrelated industries. One of the best examples of a conglomerate is the South Korean chaebol Samsung which makes smartphones, medicines, washing machines, chips, and other products.\n\n6. Transportation\n\nReturn on Investment (ROI) Estimate: 5.56%\n\nThe transportation industry is one of the more crucial ones for economic progress. Not only does it enable firms to transport raw materials and finished goods across territories, but it is also the backbone of the tourism industry. Transportation spans across several mediums, including land, air, water, and more recently, space.\n\nClick to continue reading and see 5 Least Competitive Industries in the World.\n\nSuggested Articles:\n\nTop 20 Largest Consumer Staples Companies in the World 10 Least Digitized Industries That Are Ripe for Digital Transformation 10 Best Industrial Machinery Stocks to Buy\n\nDisclosure: None. 10 Least Competitive Industries in the World is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/10-least-competitive-industries-world-103513760.html", "symbols": ["BA.US", "BHP.US", "CAT.US", "DE.US", "GE.MX", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "LMT.US", "RIO.US", "SHOP.US", "TM5.F", "TMUS.US", "VALE.US"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.052, "neu": 0.869, "pos": 0.079}}, {"date": "2023-06-22T09:24:43+00:00", "title": "Paris aviation deals signal recovery in face of supply challenges", "content": "A flurry of dealmaking at the Paris air show has confirmed that the aviation industry is back in business after the Covid pandemic — and that the world’s two dominant plane makers still face a challenge navigating a supply chain that retains the scars of the crisis. Airbus and Boeing had together announced orders for more than 1,200 aircraft by the end of the third day of the event, according to analysis by consultancy IBA. Most of the orders — 1,070 — were for single-aisle planes such as the Airbus A320 and Boeing 737 Max, which fly the short to medium-haul routes that have led the travel industry’s recovery.", "link": "https://finance.yahoo.com/m/57b6740f-02e1-3fbe-a1dc-f89b03c1d19a/paris-aviation-deals-signal.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": -0.586, "neg": 0.037, "neu": 0.951, "pos": 0.012}}, {"date": "2023-06-22T05:06:10+00:00", "title": "UPDATE 2-Spirit AeroSystems workers at Kansas plant to strike after rejecting deal", "content": "(Adds details from union statement in paragraph 5, background in paragraphs 7-10)\n\nJune 22 (Reuters) - Workers at Spirit AeroSystems' plant in Wichita, Kansas, which makes critical structures for Boeing jetliners, will go on strike on Saturday, after rejecting a proposed four-year deal on Wednesday night, the International Association of Machinists and Aerospace Workers (IAM) said.\n\nAbout 6,000 members of the IAM voted to reject Spirit's \"last best and final offer,\" with a strike scheduled to begin at 12:01 a.m. CDT (0501 GMT) on June 24, the union said.\n\n\"The IAM's dedicated and hardworking membership at Spirit AeroSystems has worked without fail during tumultuous times, including a pandemic that saw everything grind to a halt. Most of our members have concluded that the company's offer is unacceptable,\" IAM said in a statement.\n\nIAM and Spirit reached a tentative agreement last week that included additional health insurance and retirement benefits, made overtime on Sunday voluntary, and provided for up to a compounded 34% average pay increase over four years.\n\nThe union said it would regroup and begin planning \"the following steps to bring the company back to the table.\"\n\nSpirit AeroSystems and Boeing did not immediately respond to a request for comment.\n\nSpirit's Wichita production facility is responsible for manufacturing major subassemblies of most Boeing jetliners, including the entire fuselage of Boeing's lucrative 737 narrowbody aircraft and the forward fuselage of the widebody 787 Dreamliner.\n\nA stoppage would impede Boeing as it tries to recover from 737 and 787 production glitches. The company is trying to ramp up production to meet end-of-year objectives, bumping output from three to five 787s per month and 31 to 38 single-aisle 737s per month.\n\nEmployees and unions across industries, from United Parcel Service (UPS) to Delta Air Lines, have been fighting for better pay and work conditions for the past few months.\n\nLast month, Spirit said it expected to take a\n\n$31 million\n\nhit to its full-year gross profit from disruptions related to 737 MAX fuselages and took a $110 million loss in reach-forward charges on Airbus and Boeing jet production in the first-quarter.\n\n(Reporting by Valerie Insinna in Washington and Abinaya Vijayaraghavan, Shivansh Tiwary in Bengaluru; Editing by Tom Hogue and Gerry Doyle)", "link": "https://finance.yahoo.com/news/1-spirit-aerosystems-workers-kansas-050610875.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.892, "neg": 0.067, "neu": 0.837, "pos": 0.096}}, {"date": "2023-06-22T04:47:43+00:00", "title": "Spirit AeroSystems to halt Wichita plant as workers vote to strike", "content": "(Reuters) -Spirit AeroSystems on Thursday will suspend factory production at its plant in Wichita, Kansas, the company said, after workers rejected a proposed four-year deal and announced a strike to begin on June 24.\n\nSpirit will suspend factory production prior to the expiration of its contract with the International Association of Machinists and Aerospace Workers (IAM) which ends on June 24, it said.\n\n\"We are disappointed that our employees represented by the IAM rejected our four-year contract offer and voted to strike,\" Spirit said. \"Despite this setback, we are not distracted from the task at hand. We look forward to continued meetings with IAM leadership.\"\n\nStarting on June 22, all IAM-represented employees will not report for work but will receive pay for their regularly scheduled work hours, the company said. However, workers not represented by union should report to work on Thursday, it added.\n\nWorkers at the plant, which makes critical structures for Boeing jetliners, will go on strike on Saturday, after rejecting a proposed four-year deal on Wednesday night, the IAM said.\n\nAbout 6,000 members of the IAM voted to reject Spirit's \"last best and final offer,\" with a strike scheduled to begin at 12:01 a.m. CDT (0501 GMT) on June 24, the union said.\n\n\"The IAM's dedicated and hardworking membership at Spirit AeroSystems has worked without fail during tumultuous times, including a pandemic that saw everything grind to a halt. Most of our members have concluded that the company's offer is unacceptable,\" IAM said in a statement.\n\nIAM and Spirit reached a tentative agreement last week that included additional health insurance and retirement benefits, made overtime on Sunday voluntary, and provided for up to a compounded 34% average pay increase over four years.\n\nThe union said it would regroup and begin planning \"the following steps to bring the company back to the table.\"\n\nBoeing did not immediately respond to a request for comment.\n\nThe Wichita production facility manufactures major subassemblies of most Boeing jetliners, including the entire fuselage of Boeing's lucrative 737 narrowbody aircraft and the forward fuselage of the widebody 787 Dreamliner.\n\nLast month, Spirit said it expected to take a $31 million hit to its full-year gross profit from disruptions related to 737 MAX fuselages and took a $110 million loss in reach-forward charges on Airbus and Boeing jet production in the first-quarter.\n\n(Reporting by Valerie Insinna in Washington and Abinaya Vijayaraghavan, Shivansh Tiwary in Bengaluru; editing by Gerry Doyle and Jason Neely)", "link": "https://finance.yahoo.com/news/spirit-aerosystems-workers-kansas-plant-044743658.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.372, "neg": 0.092, "neu": 0.814, "pos": 0.093}}, {"date": "2023-06-21T22:47:11+00:00", "title": "UPDATE 1-Alaska Airlines CEO 'anxious' for Boeing 737 MAX 10 deliveries", "content": "(Adds prior Boeing comment, more details in paragraphs 4-7)\n\nBy David Shepardson\n\nWASHINGTON, June 21 (Reuters) - Alaska Airlines is \"anxious\" to begin taking deliveries of the larger Boeing 737 MAX 10 to help it carry more passengers once the plane is certified, the carrier's CEO Ben Minicucci said on Wednesday.\n\nBoeing must first win approval from the Federal Aviation Administration for its smaller MAX 7 before it can get approval for the MAX 10.\n\nBoth variants have faced major delays amid more intense regulatory scrutiny after criticism of the earlier certification process for the MAX 8, which suffered fatal crashes in 2018 and 2019.\n\n\"Basically we like bigger airplanes,\" Minicucci said in an interview of the preference for the MAX 10, which can carry 189 passengers, up from 178 on the MAX 9. \"For essentially the same trip costs I put 11 more passengers on.\"\n\nIn October, Alaska Airlines said it was exercising options to purchase 52 MAX aircraft for delivery between 2024 and 2027 and secured rights for 105 more planes through 2030. The company said on Wednesday it has 48 MAX 10s on order.\n\n\"We're anxious that it gets approved,\" Minicucci said. \"Of course it has to be safe and certified appropriately but we'll be a big fan of the -10 when it comes out.\"\n\nBoeing said on May 31 certification of the MAX 7 is taking a \"considerable amount of time\" due to new documentation requirements, but the planemaker still believes it can be approved by the end of the year.\n\nBoth the MAX 7 and MAX 10 are seen as critical for Boeing to compete against Airbus for orders at the smaller and larger ends of the narrowbody market.\n\nMinicucci said Alaska has a good relationship with Boeing, which builds the MAX near its Seattle headquarters and has been transparent about supply chain issues.\n\n\"They walked us through every production glitch that they've had,\" Minicucci said. \"We get briefings like every two weeks from these guys on where they are.\" (Reporting by David Shepardson; Editing by Chris Reese and Jamie Freed)", "link": "https://finance.yahoo.com/news/1-alaska-airlines-ceo-anxious-224711403.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.945, "neg": 0.03, "neu": 0.89, "pos": 0.08}}, {"date": "2023-06-21T21:50:24+00:00", "title": "Boeing (BA) Stock Moves -0.14%: What You Should Know", "content": "In the latest trading session, Boeing (BA) closed at $212.08, marking a -0.14% move from the previous day. This change was narrower than the S&P 500's 0.53% loss on the day.\n\nPrior to today's trading, shares of the airplane builder had gained 4.82% over the past month. This has outpaced the Aerospace sector's gain of 2.29% and lagged the S&P 500's gain of 4.86% in that time.\n\nBoeing will be looking to display strength as it nears its next earnings release. In that report, analysts expect Boeing to post earnings of -$0.72 per share. This would mark a year-over-year decline of 94.59%. Our most recent consensus estimate is calling for quarterly revenue of $18.2 billion, up 9.1% from the year-ago period.\n\nLooking at the full year, our Zacks Consensus Estimates suggest analysts are expecting earnings of -$1.03 per share and revenue of $78.77 billion. These totals would mark changes of +90.69% and +18.26%, respectively, from last year.\n\nAny recent changes to analyst estimates for Boeing should also be noted by investors. These revisions typically reflect the latest short-term business trends, which can change frequently. As such, positive estimate revisions reflect analyst optimism about the company's business and profitability.\n\nOur research shows that these estimate changes are directly correlated with near-term stock prices. We developed the Zacks Rank to capitalize on this phenomenon. Our system takes these estimate changes into account and delivers a clear, actionable rating model.\n\nThe Zacks Rank system ranges from #1 (Strong Buy) to #5 (Strong Sell). It has a remarkable, outside-audited track record of success, with #1 stocks delivering an average annual return of +25% since 1988. Over the past month, the Zacks Consensus EPS estimate has moved 10.52% higher. Boeing currently has a Zacks Rank of #3 (Hold).\n\nThe Aerospace - Defense industry is part of the Aerospace sector. This group has a Zacks Industry Rank of 161, putting it in the bottom 37% of all 250+ industries.\n\nThe Zacks Industry Rank includes is listed in order from best to worst in terms of the average Zacks Rank of the individual companies within each of these sectors. Our research shows that the top 50% rated industries outperform the bottom half by a factor of 2 to 1.\n\nYou can find more information on all of these metrics, and much more, on Zacks.com.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/boeing-ba-stock-moves-0-215024472.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.018, "neu": 0.858, "pos": 0.123}}, {"date": "2023-06-21T21:16:00+00:00", "title": "Paris Air Show Brings So-So News for Boeing. It’s Better for Airbus.", "content": "The aerospace supply chain is still under pressure. And the A320 neo family of jets is selling better than the MAX.", "link": "https://finance.yahoo.com/m/0e4cc692-dec9-31b8-b645-022448326411/paris-air-show-brings-so-so.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0.091, "neu": 0.788, "pos": 0.12}}, {"date": "2023-06-21T20:54:06+00:00", "title": "Alaska Airlines CEO 'anxious' for Boeing 737 MAX 10 deliveries", "content": "By David Shepardson\n\nWASHINGTON (Reuters) -Alaska Airlines is \"anxious\" to begin taking deliveries of the larger Boeing 737 MAX 10 to help it carry more passengers once the plane is certified, the carrier's CEO Ben Minicucci said on Wednesday.\n\nBoeing must first win approval from the Federal Aviation Administration for its smaller MAX 7 before it can get approval for the MAX 10.\n\nBoth variants have faced major delays amid more intense regulatory scrutiny after criticism of the earlier certification process for the MAX 8, which suffered fatal crashes in 2018 and 2019.\n\n\"Basically we like bigger airplanes,\" Minicucci said in an interview of the preference for the MAX 10, which can carry 189 passengers, up from 178 on the MAX 9. \"For essentially the same trip costs I put 11 more passengers on.\"\n\nIn October, Alaska Airlines said it was exercising options to purchase 52 MAX aircraft for delivery between 2024 and 2027 and secured rights for 105 more planes through 2030. The company said on Wednesday it has 48 MAX 10s on order.\n\n\"We're anxious that it gets approved,\" Minicucci said. \"Of course it has to be safe and certified appropriately but we'll be a big fan of the -10 when it comes out.\"\n\nBoeing said on May 31 certification of the MAX 7 is taking a \"considerable amount of time\" due to new documentation requirements, but the planemaker still believes it can be approved by the end of the year.\n\nBoth the MAX 7 and MAX 10 are seen as critical for Boeing to compete against Airbus for orders at the smaller and larger ends of the narrowbody market.\n\nMinicucci said Alaska has a good relationship with Boeing, which builds the MAX near its Seattle headquarters and has been transparent about supply chain issues.\n\n\"They walked us through every production glitch that they've had,\" Minicucci said. \"We get briefings like every two weeks from these guys on where they are.\"\n\n(Reporting by David Shepardson; Editing by Chris Reese and Jamie Freed)", "link": "https://ca.finance.yahoo.com/news/alaska-airlines-ceo-anxious-boeing-205406634.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.945, "neg": 0.031, "neu": 0.887, "pos": 0.083}}, {"date": "2023-06-21T20:47:51+00:00", "title": "Alaska Airlines CEO 'anxious' for Boeing 737 MAX 10", "content": "WASHINGTON, June 21 (Reuters) - Alaska Airlines CEO Ben Minicucci said on Wednesday the airline is “anxious” to begin taking deliveries of the larger Boeing 737 MAX 10 to help it carry more passengers once the plane is certified.\n\nBoeing must first win approval from the Federal Aviation Administration for its MAX 7 before it can get approval for the MAX 10.\n\n“Basically we like bigger airplanes,” Minicucci told Reuters in an interview Wednesday.\n\nIn October, Alaska Airlines said it was exercising options to purchase 52 Boeing 737 MAX aircraft for delivery between 2024 and 2027. The company said Thursday it has 48 MAX 10s on order. (Reporting by David Shepardson Editing by Chris Reese)", "link": "https://finance.yahoo.com/news/alaska-airlines-ceo-anxious-boeing-204751116.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.935, "neg": 0, "neu": 0.877, "pos": 0.123}}, {"date": "2023-06-21T18:59:34+00:00", "title": "What's Going on With Boeing Stock?", "content": "Fool.com contributor Parkev Tatevosian discusses the major challenges Boeing (NYSE: BA) currently faces. *Stock prices used were the afternoon prices of June 19, 2023. The video was published on June 21, 2023.", "link": "https://finance.yahoo.com/m/7b29fc27-0e2d-3958-81c4-d5efa1d91677/what%27s-going-on-with-boeing.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.077, "neg": 0, "neu": 0.96, "pos": 0.04}}, {"date": "2023-06-21T16:00:28+00:00", "title": "Boeing Stock: Big Orders At Paris Air Show For Planemakers. But 'Not Much New.'", "content": "Plane-makers and their jet-engine suppliers continue to tout a strong demand outlook. But Boeing fell after Airbus' big win.", "link": "https://finance.yahoo.com/m/53e4abba-bdd0-375d-8665-2d17c4ed4e50/boeing-stock%3A-big-orders-at.html", "symbols": ["5UR.F", "AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "GE.MX", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "RTX.US"], "tags": [], "sentiment": {"polarity": 0.727, "neg": 0.124, "neu": 0.581, "pos": 0.295}}, {"date": "2023-06-21T14:40:00+00:00", "title": "Honeywell (HON) Unveils HEM Upgrade for Boeing 737's APU", "content": "Honeywell International HON has introduced an upgrade for its 131-9B auxiliary power unit (APU) for Boeing 737 aircraft to reduce fuel consumption and carbon dioxide emissions.\r\n\r\nThe new High-Efficiency Mode (HEM) upgrade for Boeing 737 aircraft APU has an innovative diffuser controlled by software that autonomously regulates airflow to the APU compressor section. The upgrade is expected to provide fuel savings and lower carbon dioxide emissions by 1% to 2%, which is equivalent to a reduction of 0.5 to 0.6 gallons per APU hour. It is also anticipated to reduce fuel and maintenance costs by increasing time-on-wing by up to 1,500 APU flight hours.\r\n\r\nHoneywell’s new HEM upgrade will help airlines reduce their carbon footprint and move forward in their goal of achieving net-zero emissions. With this upgrade, an airline with a fleet of 50 Boeing 737 aircraft can generate $450,000 in annual fuel savings, while also reducing up to 1,100 metric tons of carbon dioxide emissions. An increased time-on-wing will help airlines decrease servicing visits, producing an average savings of $315,000 for each avoided service visit.\n\nHoneywell International Inc. Price Honeywell International Inc. Price\n\nHoneywell International Inc. price | Honeywell International Inc. Quote\n\nThe upgrade will be made available to all operators of Boeing 737-600, 737-700, 737-800, 737-900 and 737 MAX models with 131-9B APUs in the second half of this year. It can be installed during any regular scheduled maintenance event without any additional downtime to implement for newer 131-9B APUs (series 49 and above).\n\nZacks Rank & Key Picks\n\nHoneywell presently carries a Zacks Rank #3 (Hold).\r\n\r\nSome better-ranked industrial stocks are as follows:\r\n\r\nIngersoll Rand IR presently sports a Zacks Rank #1 (Strong Buy). The company delivered a trailing four-quarter earnings surprise of 12.6%, on average. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nIngersoll Rand has an estimated earnings growth rate of 14.8% for the current year. Shares of the company have jumped 53.5% in a year.\r\n\r\nGraco GGG currently flaunts a Zacks Rank #1. The company delivered a trailing four-quarter earnings surprise of 7.9%, on average.\r\n\r\nGraco has an estimated earnings growth rate of 16.4% for the current year. Shares of the company have rallied 44.5% in a year.\r\n\r\nFlowserve FLS currently carries a Zacks Rank #2 (Buy). The company pulled off a trailing four-quarter earnings surprise of 2.5%, on average.\r\n\r\nFlowserve has an estimated earnings growth rate of 64.5% for the current year. Shares of the company have gained 26.8% in a year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHoneywell International Inc. (HON) : Free Stock Analysis Report\n\nFlowserve Corporation (FLS) : Free Stock Analysis Report\n\nGraco Inc. (GGG) : Free Stock Analysis Report\n\nIngersoll Rand Inc. (IR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/honeywell-hon-unveils-hem-upgrade-144000567.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "FLS.US", "FWV.F", "GA8.F", "GGG.US", "HON.MX", "HON.US", "HONB34.SA"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.009, "neu": 0.886, "pos": 0.104}}, {"date": "2023-06-21T13:36:00+00:00", "title": "Boeing (BA) Clinches Significant Orders at Paris Air Show", "content": "The Boeing Company BA inks major order deals at the most prestigious aerospace event, Paris Air Show, with various airline companies worldwide. Boeing utilizes the platform to boost its order book, build on customer relationships and reaffirm its competitiveness in the industry.\n\nJet Orders for Boeing at the Paris Air Show\n\nAmid significant purchase agreements, the key order was from Boeing’s longstanding client, Air India, which confirmed to invest in 290 new Boeing jets, thus marking the biggest order from South Asia for Boeing.\n\nIn the report from SP’s airbuz, domestic and international traffic in India is likely to be in the range of 130-140 million and 55-60 million in 2023, per the Centre for Asia Pacific Aviation India estimates. The abounding growth prospects indicate that Boeing may witness lucrative deals from the region in the days ahead.\n\nThe aerospace giant also secured an order from Avolon for 40 737 MAX airplanes. Meanwhile, Air Algérie confirmed to purchase BA’s eight 737-9 jets and two 737-800 Boeing Converted Freighters.\n\nOrders Thrive\n\nThe robust order inflow for Boeing’s commercial jets at the Pars Air Show bears testimony to the rebound in the travel industry after COVID-19 induced a demand decline.  Per the latest report from the International Air Transport Association, domestic traffic returned to pre-pandemic levels, recording growth of 42.6% in April compared to a 2.9% increase in April 2019. Meanwhile, International traffic scaled up 48.0% compared to the April 2022 levels, with all markets contributing to the overall recovery.\n\nWith much room for growth, the aviation market holds opportunities for aircraft manufacturers like Boeing. In its Commercial Market Outlook 2023–2042, Boeing projected that the global fleet growth is likely to double-fold to reach more than 48,500 jets by 2042. This equates to growing 3.5% per year, signifying ample growth potential for aerospace forerunners in the industry.\n\nPeers in the Spotlight at the Paris Air Show\n\nThe Paris Air Show provides a platform for aircraft manufacturers to engage in strategic deals with potential customers. Other renowned jet manufacturers that secured lucrative deals at the show are as follows:\n\nAirbus EADSY: It inked a major order to supply 500 of its A320 family aircraft at the Paris Air Show 2023 to Indigo, thereby marking the biggest order in the commercial aviation history. The long-term (three to five years) earnings growth rate of Airbus is 12.4%. Shares of EADSY have soared 47.2% in the past year.\n\nEmbraer ERJ: The company grabbed an order from Binter for six E195-E2 jets at the Paris Air Show. Meanwhile, American Airlines booked seven Embraer E175.\n\nEmbraer’s long-term earnings growth rate is 17%. ERJ shares witnessed growth of a solid 75.2% in the past year.\n\nPrice Performance\n\nShares of Boeing have rallied 54.8% in the past year compared with the industry’s growth of 3.6%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nBoeing carries a Zacks Rank #3 (Hold). One better-ranked stock in the same industry is Spire SPIR, carrying a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nThe Zacks Consensus Estimate for Spire’s 2023 sales suggests a growth rate of 32.9% from the prior-year reported figure. The Zacks Consensus Estimate for Spire’s 2024 sales calls for a growth rate of 34.3% from the prior-year estimated figure.\n\nSPIR reported an earnings surprise of 16.67% in the last reported quarter. The four-quarter average earnings surprise for the company is 10.37%.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nSpire Global, Inc. (SPIR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/boeing-ba-clinches-significant-orders-133600296.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "EMBR3.SA", "EMY.F", "ERJ.US", "ERJN.MX"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.002, "neu": 0.868, "pos": 0.13}}, {"date": "2023-06-21T09:35:57+00:00", "title": "WRAPUP 1-Paris air show: 'Progress' in supply chain as jet orders rack up", "content": "By Allison Lampert and Valerie Insinna\n\nPARIS, June 21 (Reuters) - Jet engine maker Pratt & Whitney flagged \"solid progress\" in the aerospace supply chain on Wednesday, addressing a key area of concern for planemakers as they continue to rack up orders at the Paris Airshow.\n\nThe first two days of the world's biggest air show have seen bumper orders from Indian airlines looking to cash in on a rapid rebound in travel since the pandemic and forecasts for continued strong growth in the world's most populous country.\n\nBut the recovery from COVID-19 has been more problematic for suppliers, which are still grappling with rising costs, parts shortages and a scarcity of skilled labour.\n\nThat has raised concerns whether jetmakers Airbus and Boeing will be able to hit ambitious goals to ramp up output in order to meet delivery targets for customers.\n\nThis week's orders from India alone - for 500 Airbus narrowbody jets from budget carrier IndiGo and a 470-plane deal for both Airbus and Boeing jets finalised by Air India - add almost 1,000 planes to the industry backlog.\n\nPratt & Whitney, a unit of RTX - formerly known as Raytheon Technologies, has had a particularly tough time due in part to problems with its GTF engine that have led to the grounding of several planes.\n\nThe company said on Wednesday the groundings peaked at 10% of the GTF-powered fleet in the first half of this year, and that percentage would trend lower through the rest of the year.\n\nThe GTF is one of two engine options to power Airbus's top-selling A320neo narrowbody aircraft.\n\nPratt & Whitney President Shane Eddy, who has faced a backlash from airlines over durability problems and a shortage of spare engines, told the air show he was seeing \"solid progress\" in the supply chain.\n\nThe company has the capacity in place to support maintenance demand but faces shortages of materials, he added.\n\nMeanwhile, jetmakers continue to sign new deals.\n\nAircraft leasing company Avolon said on Wednesday it had signed a memorandum of understanding to order 20 widebody Airbus A330neo aircraft.\n\nAirbus is also seen close to a potentially large deal with Mexico's Viva Aerobus, although by Monday some sources were predicting the volume could be closer to 60 jets than the triple digits first reported, with no guarantee of a result this week.\n\n(Reporting by Tim Hepher, Joanna Plucinska, Allison Lampert, Valerie Insinna Editing by Mark Potter)", "link": "https://finance.yahoo.com/news/wrapup-1-paris-air-show-093557818.html", "symbols": ["5UR.F", "AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "RTX.US"], "tags": [], "sentiment": {"polarity": -0.068, "neg": 0.047, "neu": 0.911, "pos": 0.042}}, {"date": "2023-06-21T09:11:45+00:00", "title": "UPDATE 1-Indian budget carrier Akasa Air places order for four Boeing 737 Max jets", "content": "(Adds details, background)\n\nBy Valerie Insinna\n\nPARIS, June 21 (Reuters) - Indian budget carrier Akasa Air has placed an order for four Boeing 737 Max jets, both companies said on Wednesday, the latest in a spate of orders by the country's airlines.\n\nReuters reported the order, citing a source with direct knowledge, earlier on Wednesday.\n\nAkasa, the newest entrant in the world's fastest-growing aviation market, said in a statement that it was on course to announce another significant three-digit aircraft order by the end of 2023.\n\nAkasa Air CEO Vinay Dube\n\ntold Reuters earlier\n\nthis year that it would place a \"substantially\" large order for new narrowbody jets this year.\n\nEarlier on Wednesday, Luxembourg’s flag carrier Luxair said it had placed orders for four 737 MAX jets from Boeing, the first purchase of the MAX 7 model by a European airline.\n\nThe Paris airshow has\n\nbeen dominated by India\n\n, as two of its biggest airlines finalised huge orders on the first two days of the event.\n\nOn Tuesday, Air India finalised a huge order for 470 planes from Airbus and Boeing.\n\nThe agreement, when sketched out in February, was the largest ever plane deal by number of aircraft. But it was surpassed on day one of the Paris show by Indian rival IndiGo's order for 500 Airbus narrowbody jets.\n\n(Reporting by Valerie Insinna, writing by Shilpa Jamkhandikar, Editing by Louise Heavens)", "link": "https://finance.yahoo.com/news/1-indian-budget-carrier-akasa-091145212.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.836, "neg": 0, "neu": 0.952, "pos": 0.048}}, {"date": "2023-06-21T08:57:00+00:00", "title": "Akasa Air Orders Four 737-8s To Support International Growth Plans", "content": "- India's newest airline increases 737 order book to 76 jets, supporting its growth strategy\n\nLE BOURGET, France, June 21, 2023 /PRNewswire/ -- Boeing [NYSE:BA] and Akasa Air today announced an order for four additional 737-8 jets at the Paris Air Show. Akasa Air, which launched operations in 2022 with its first 737-8, has rapidly grown its market share and fleet to 19 airplanes across 16 destinations to support the fast-growing market in India. Akasa Air signing at Paris Air Show 2023 for four 737-8s. (Photo: Boeing)\n\nWith the order of four additional aircraft, the Indian carrier's order book comprises 76 jets, which include 23 737-8s and 53 high-capacity 737-8-200 airplanes.\n\n\"As the world's fastest growing airline, we are excited to add four more Boeing 737-8 airplanes into our fleet, taking our initial order of 72 aircraft up to 76 jets which will be delivered over the next four years. In addition to supporting our rapid domestic expansion, these airplanes allow us to take full advantage of the category leading 737-8 aircraft with its unparalleled range, as we prepare our foray into international routes,\" said Vinay Dube, Founder and CEO, Akasa Air. \"The fuel efficiency and lower carbon emissions of the 737-8 allows us to remain focused on sustainable operations, while also providing our environmentally conscious passengers with a more comfortable way to fly. Sustainability is at the core of our business, and we strive for more opportunities to reduce our impact to the environment.\"\n\nThe Indian carrier is operating 19 737-8s today with high-capacity 737-8-200 airplanes on order. As passenger traffic rises above pre-pandemic levels in India, the versatile 737-8 is supporting Akasa Air's growth strategy and domestic network and positions the airline for future regional expansion.\n\n\"This follow-on order by Akasa demonstrates the market-leading capabilities of the 737 MAX in the world's fastest-growing commercial aviation market,\" said Brad McMullen, Boeing senior vice president of Commercial Sales and Marketing. \"The efficiency and range of the 737-8 support Akasa Air's plan to expand domestic and regional networks.\"\n\nThe 737 MAX family provides Akasa Air with greater range and fuel efficiency, reducing fuel use and carbon emissions 20% compared to older-generation airplanes. In addition, the 737 MAX is a quieter airplane with a 50% smaller noise footprint.\n\nBoeing customers have placed more than 1,000 orders and commitments for the company's new commercial airplanes since July 2022. This includes over 750 737 MAX airplanes, reflecting the value of the family's versatility and commonality.\n\nAs a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity. Join our team and find your purpose at boeing.com/careers\n\nContact Kevin Yoo\r\nBoeing Communications\r\nTel: +1 206-249-6372\r\nKevin.k.yoo@boeing.com\n\nBoeing Media Relations\r\nMedia@boeing.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/akasa-air-orders-four-737-8s-to-support-international-growth-plans-301856480.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/akasa-air-orders-four-737-085700341.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.004, "neu": 0.852, "pos": 0.144}}, {"date": "2023-06-21T07:30:00+00:00", "title": "Boeing, Air Lease Corporation Announce Order for Two 787 Dreamliners", "content": "- Lessor adds two new 787-9s to its backlog as it continues to expand its 787 customer base for the industry's most utilized wide-body jet\n\n- Customers have placed more than 250 787 order and commitments this year\n\nLE BOURGET, France, June 21, 2023 /PRNewswire/ -- Boeing [NYSE: BA] and Air Lease Corporation (ALC) [NYSE: AL] today announced at the Paris Air Show 2023 that the leading global lessor will grow its world-class portfolio of airplanes with a purchase of two 787 Dreamliners. Boeing and Air Lease Corporation (ALC) today announced at the Paris Air Show 2023 that the leading global lessor will grow its world-class portfolio of airplanes with a purchase of two 787 Dreamliners. (Image: Boeing)\n\nALC has been a long-standing 787 customer, placing its first purchase for the 787-9 in 2010. Its airplane portfolio currently includes the 787-9 and 787-10.\n\nSince revenue service began in 2011, the 787 family has launched nearly 360 new nonstop routes around the world, more than 10 times as many new routes as other jets in the same category. The 787-9 can fly 296 passengers up to 7,565 nautical miles (14,010 km) in a typical two-class configuration.\n\n\"ALC is a key strategic leasing partner to Boeing, and we are delighted that it continues to see the value proposition of the 787 family for its customers,\" said Stan Deal, president and CEO of Boeing Commercial Airplanes. \"With its unparalleled fuel efficiency, the 787 Dreamliner family is playing a major role in pioneering new routes in the long-haul travel market while reducing fuel use and emissions, allowing airlines to meet their sustainability objectives.\"\n\nUsing 25% less fuel and creating 25% fewer emissions than the airplanes they replace, the 787 family has avoided more than 125 billion pounds of carbon emissions since entering service.\n\nThe 787 family is selling at the highest rate in its history, receiving more than 250 orders and commitments in the past six months.\n\nAbout ALC\n\nAir Lease Corporation is a leading global aircraft leasing company based in Los Angeles, California that has airline customers throughout the world. ALC and its team of dedicated and experienced professionals are principally engaged in purchasing new commercial aircraft and leasing them to its airline customers worldwide through customized aircraft leasing and financing solutions. The company routinely posts information that may be important to investors in the \"Investors\" section of its website at www.airleasecorp.com. Investors and potential investors are encouraged to consult Air Lease Corporation's website regularly for important information. The information contained on, or that may be accessed through, ALC's website is not incorporated by reference into, and is not a part of, this press release.\n\nAbout Boeing\n\nAs a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity. Join our team and find your purpose at boeing.com/careers.\n\nContact Boeing Media Relations \r\nmedia@boeing.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/boeing-air-lease-corporation-announce-order-for-two-787-dreamliners-301856391.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/boeing-air-lease-corporation-announce-073000921.html", "symbols": ["AL-PA.US", "AL.US", "AVLA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.004, "neu": 0.896, "pos": 0.1}}, {"date": "2023-06-21T07:00:00+00:00", "title": "Luxair Selects Boeing 737-7 To Grow Single-Aisle Fleet", "content": "LE BOURGET, France, June 21, 2023 /PRNewswire/ -- Luxair and Boeing [NYSE: BA] today announced at the Paris Air Show 2023 that the Luxembourgish airline has selected the 737-7 as it continues its single-aisle growth strategy. Luxair and Boeing today announced at the Paris Air Show 2023 that the Luxembourgish airline has selected the 737-7 as it continues its single-aisle growth strategy. (Image: Boeing)\n\nIn selecting the 737-7 Luxair will become the European launch customer for the airplane with an agreement to purchase four jets.\n\nSince March 2023, Luxair has placed orders for four 737-8. With today's announcement of the selection, the airline's commitment for four 737-7s will bring the airline's firm orders for the 737 to eight. Luxair will also initially lease two 737-8, due  summer 2023, before taking direct delivery of its first 737-8.\n\n\"We continue to invest in Luxair's growth and this agreement for four Boeing 737-7 is an extra step towards securing a long term future for our national airline. This type of aircraft is a perfect match for Luxair and will meet the requirements of the market. Seating 160 passengers, the 737-7 will offer flexibility across the Luxair destination network while significantly reducing fuel consumption. This will help us get even closer to our commitment to sustainable flights, while demonstrating once again our support to the promise of \"Net-Zero carbon emissions by 2050\" submitted by IATA,\" said Gilles Feith, Luxair CEO.\n\nBoeing's ongoing commitment to sustainability is reflected in the 737-7/8s advanced design. On average, each 737 of this new generation will save up to eight million pounds of CO2 emissions annually compared to the airplanes it replaces. Additionally, these aircraft are quieter, creating a 50 percent smaller noise footprint than the airplanes they replace.\n\n\"We are delighted that Luxair has chosen to build upon its 737-8 order by selecting the 737-7 and in doing so becoming the launch customer in Europe for the airplane type,\" said Brad McMullen, senior vice president of Global Sales and Marketing, Boeing Commercial Airplanes. \"The 737-7 is perfectly suited across Luxair's network, seamlessly integrating in to its existing fleet and adding capacity on to regional routes. By selecting the 737-7 Luxair will operate a common fleet allowing it to move aircraft around the network based, increasing and dropping capacity based on seasonality and demand, ensuring maximum profitability flying all year round.\"\n\nLuxair currently operates a fleet of 19 airplanes, including eight Next-Generation 737s.\n\nAbout Luxair:\n\nFounded in 1961, Luxair is a key player in the economy of the Grand Duchy of Luxembourg and the surrounding Greater Region. Passenger air transport is probably the most well-known activity of the general public. Luxair offers fast air service to most major cities, business centres and international hubs in Europe. The airline offers maximum flexibility to its business customers and quality travel to its leisure customers. Luxair's tour operator offers a wide range of packages and themed holidays through its tourism division. Luxair is also the provider of airport services at Luxembourg Airport and its air cargo division handles all kinds of goods with ease and efficiency.\n\nAbout Boeing:\n\nAs a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity.\n\nPress contacts:\n\nLuxair Corporate Communications, Media and Public relations\r\ncommunication.presse@luxairgroup.lu\n\nBoeing Keelan Morris (London)\r\n+44 (0) 7798 828 790\r\nkeelan.j.morris@boeing.com\n\nBoeing Media Relations\r\nmedia@boeing.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/luxair-selects-boeing-737-7-to-grow-single-aisle-fleet-301856371.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/luxair-selects-boeing-737-7-070000263.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.002, "neu": 0.862, "pos": 0.136}}, {"date": "2023-06-21T06:14:03+00:00", "title": "CEO Dave Calhoun is repairing Boeing’s reputation with radical transparency: ‘You’re going to get whacked along the way, and that’s life’", "content": "Good morning,\n\nDave Calhoun took on a near impossible job when he became CEO of Boeing in January 2020. Two deadly plane crashes of the Boeing 737 Max, which killed 346 passengers, had cratered the company’s reputation. And his predecessor had flubbed the response.\n\nSo how did he begin to pull the company back from the brink? (The job is not yet done.) That’s the question Michal Lev-Ram and I asked him on this week’s episode of our podcast Leadership Next. His answer is a lesson in leadership. But one piece, in particular, resonated with me:\n\n“You have to be transparent with literally everything, no matter how uncomfortable the data is or the conversation is. You have to tell everybody everything, including the media. And you’re going to get whacked along the way, and that’s life. But for us to regain trust, number one with our own people, and then with the flying public, they were going to have to believe us. And that was the culture we were going to carry forward.”\n\nThe general media critique was that Boeing had compromised safety for the sake of quarterly profits. But Calhoun sees it differently:\n\n“We had a culture problem. But I’ll characterize it quite a bit differently than the media liked to characterize it. The idea that any human being makes a trade of quarterly profits over safety is just a flawed notion…It’s just not what happened. What I do think I found was an organization and a company and a culture that was having a hard time being honest with one another, with where programs stood, how much time was required, what things still needed to be completed. As a result, leadership became disconnected from the ground troops.”\n\nI write a lot in this newsletter about how leadership has changed in recent decades. But while many things have changed, some haven’t. Calhoun says he learned the value of transparency from the iconic leader of the last century, former GE CEO Jack Welch.\n\n“The one thing you could count on from Jack was pure reality and pure clarity every step of the way. He told you everything he thought about your business, what he had heard from the people he visited with in Crotonville the day before. He just went at you … He kept you ahead of the game.”\n\nI pointed out there are other parts of the Welch management legacy that haven’t weathered as well. His response:\n\n“It was a different time and a different context. Leaders have to change and adapt to the circumstances we’re faced with. Do I think Jack would have adapted and led in these changed circumstances as well as he did back then? I think the answer is yes.”\n\nYou can listen to the full interview on Apple or Spotify. More news below. And be sure to read Shawn Tully’s fascinating analysis of the “Trillion Dollar Club” and the challenge it poses to today’s stock market investors.\n\nAlan Murray @alansmurray\r\nalan.murray@fortune.com\n\nThis story was originally featured on Fortune.com\n\nMore from Fortune: \r\n5 side hustles where you may earn over $20,000 per year—all while working from home\r\nLooking to make extra cash? This CD has a 5.15% APY right now\r\nBuying a house? Here's how much to save\r\nThis is how much money you need to earn annually to comfortably buy a $600,000 home", "link": "https://finance.yahoo.com/news/ceo-dave-calhoun-repairing-boeing-061403817.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.984, "neg": 0.025, "neu": 0.887, "pos": 0.088}}, {"date": "2023-06-20T21:42:57+00:00", "title": "Why Is Everyone Talking About Boeing Stock?", "content": "Fool.com contributor and finance professor Parkev Tatevosian discusses why investors are willing to pay premium valuations for Boeing (NYSE: BA) stock right now. *Stock prices used were the afternoon prices of June 18, 2023.", "link": "https://finance.yahoo.com/m/de181fff-ea83-3564-8d00-ed7cc62fd91d/why-is-everyone-talking-about.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.103, "neg": 0.041, "neu": 0.959, "pos": 0}}, {"date": "2023-06-20T20:16:00+00:00", "title": "These Stocks Moved the Most Today: Alibaba, Dice, Lemonade, Arcellx, Avis, and More", "content": "Alibaba said Daniel Zhang will be stepping down as chairman and chief executive, Dice Therapeutics announced it is being acquired by Eli Lilly for $2.4 billion, and Avis shares were upgraded.", "link": "https://finance.yahoo.com/m/49c13555-f62f-3bd8-9a59-b574ee831892/these-stocks-moved-the-most.html", "symbols": ["9988.HK", "AHLA.F", "AHLA.XETRA", "BA.MX", "BA.US", "BABA.US", "BABA34.SA", "BABAF.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "FDX.F", "FDX.MX", "FDX.US", "FDX.XETRA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.932, "pos": 0.068}}, {"date": "2023-06-20T18:24:01+00:00", "title": "Dow Jones Aerospace Giant Boeing, Chipotle, Roku Trade In Or Near Buy Zones", "content": "Dow Jones leader Boeing, along with Chipotle and Roku are among the best stocks to buy and watch in today's stock market.", "link": "https://finance.yahoo.com/m/1e63bf07-aafe-3a85-9b9e-ec3c57bcf335/dow-jones-aerospace-giant.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "C9F.F", "CMG.US", "DJI.INDX", "MCK.MX", "MCK.US"], "tags": [], "sentiment": {"polarity": 0.637, "neg": 0, "neu": 0.833, "pos": 0.167}}, {"date": "2023-06-20T18:00:28+00:00", "title": "Boeing Stock Falls, Airbus Rises Amid These Big Jet Orders From Paris Air Show", "content": "Plane-makers and their jet-engine suppliers continue to tout a strong demand outlook. But Boeing fell after Airbus' big win.", "link": "https://finance.yahoo.com/m/53e4abba-bdd0-375d-8665-2d17c4ed4e50/boeing-stock-falls%2C-airbus.html", "symbols": ["5UR.F", "AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "GE.MX", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "RTX.US"], "tags": [], "sentiment": {"polarity": 0.727, "neg": 0.124, "neu": 0.581, "pos": 0.295}}, {"date": "2023-06-20T17:10:51+00:00", "title": "Rolls-Royce boss hails recovery in long-haul jet demand", "content": "Rolls-Royce has sounded an upbeat note that the recovery in demand for large long-haul aircraft, its key market, is “coming back strongly”, echoing comments made by client and plane maker Airbus. Tufan Erginbilgic, who took the helm of the British aero-engine group six months ago, said demand had returned, with China’s recovery “stronger than we expected”. The company, which builds and maintains large engines for widebody aircraft including Airbus A350 jets and Boeing’s 787, said last month that engine flying hours were back at 83 per cent of pre-Covid 19 levels.", "link": "https://finance.yahoo.com/m/c2fd2aaa-0fcf-329d-8b2b-adf3e0cc74f0/rolls-royce-boss-hails.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "RLLCF.US", "RR.LSE", "RRU.F", "RYCEF.US", "RYCEY.US"], "tags": [], "sentiment": {"polarity": -0.25, "neg": 0.033, "neu": 0.967, "pos": 0}}, {"date": "2023-06-20T15:57:00+00:00", "title": "Boeing Racks Up Orders In Paris. The Stock Falls Anyway.", "content": "Airbus disclosed what one analyst described as a \"monster order,\" but shares of the company barely moved.", "link": "https://finance.yahoo.com/m/11af2f9d-cc45-3915-90fc-991cd994d663/boeing-racks-up-orders-in.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0, "neu": 0.843, "pos": 0.157}}, {"date": "2023-06-20T15:25:00+00:00", "title": "Kratos (KTOS) to Pair Valkyrie With AI in Alliance With Shield", "content": "Kratos Defense & Security Solutions, Inc. KTOS recently formed an alliance with Shield AI to merge artificial intelligence (“AI”)-based piloting systems with former’s unmanned aircraft XQ-58 Valkyrie. The alliance aims at promoting unmanned aircraft operations in the absence of GPS and communications.\n\nRationale Behind the Alliance\n\nThe integration of AI algorithms with unmanned vehicle will allow better management of complex task leading to overall operational efficiency and capability of unmanned vehicles. Also, the continuous monitoring of changing condition in a mission would provide more security for uncrewed jets.\n\nReal-time data analysis by the AI encourages trajectory optimization, reducing the operational cost of an unmanned vehicle. AI Pilots enabled jet to carry out tactical missions without GPS and communications interference, thus ensuing optimal safety of jets.\n\nWith that being said, the integration of Kratos’s Valkyrie XQ-58 with AI pilot would bring about a revolution in the unmanned aerial vehicle (UAV) segment of the defense landscape and would certainly meet the needs of changing dynamics of warfare capabilities. This would result in the steady flow of contracts for Kratos, thus boosting its revenue-generation prospects from the unmanned vehicle businesses.\n\nGrowth Prospects\n\nOngoing technology advancement needs in carrying out combat missions is fueling a rapid increase in defense spending by nations across the globe. In such a scenario, increased spending on autonomous capabilities like UAV has been witnessed and will likely gain more traction in the days ahead.\n\nPer the report from Markets and Markets, the UAV market is poised to witness a CAGR of 7.9% over 2022-2027 period. This reflects on expanding market opportunities for companies like KTOS that enjoy an established position in the UAV manufacturing.\n\nIn this context, it is imperative to mention that Kratos manufactures nearly 150 jet drones annually, thus entailing significant demand and order line up from United States Air Force, Navy, Army, Marine Corps and others. The pairing of AI pilot with its Valkyrie would unlock strategic benefits for KTOS by staying at the forefront of innovation. Other defense majors that may benefit from the increasing demand for UAV’s are:\n\nNorthrop Grumman NOC: It is a leader in autonomous systems and offers an impressive portfolio of UAVs. Some products include Global Hawk, MQ-4C Triton, Future Autonomous Air, etc\n\nNorthrop has a long-term earnings growth rate of 3.8%. Its investors have gained 3.4% in the past month.\n\nLockheed MartinLMT: It has been delivering advanced autonomous systems to the U.S. military and allies to the requirements of most demanding missions. Its UAV product range includes Indago 3, MATRIX Technology, Stalker, etc.\n\nLockheed Martin’s long-term earnings growth rate is 6.2%. Shares of LMT have returned 9.6% value to investors in the past year.\n\nBoeing (BA): Its full range of unmanned aerial systems offer intelligent, persistent and efficient solutions for a range of customers and missions worldwide. Its product include ScanEagle, Integrator, MQ-25.\n\nBoeing boasts a long-term earnings growth rate of 4%. Shares of BA have increased 60.8% in the past year.\n\nPrice Movement\n\nIn the past three months, shares of Kratos have increased 3.8% compared with the industry’s growth of 2.6%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nKratos currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nKratos Defense & Security Solutions, Inc. (KTOS) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/kratos-ktos-pair-valkyrie-ai-152500934.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "KTOS.US", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA", "NOC.US", "NTH.F", "WF5A.F"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.014, "neu": 0.775, "pos": 0.211}}, {"date": "2023-06-20T15:22:54+00:00", "title": "Air India firms up order with Airbus, Boeing for 470 planes", "content": "By Aditi Shah\n\nNEW DELHI (Reuters) - Air India has firmed up its order for 250 Airbus aircraft and 220 new Boeing jets worth $70 billion at list prices, the airline said in a statement on Tuesday, as it pursues a turnaround under its new owners.\n\nThe Tata-owned airline signed separate purchase agreements with the two planemakers at the Paris Airshow for the jets and some services, a day after domestic rival IndiGo agreed on Monday to buy 500 single-aisle planes from Airbus.\n\nThe confirmed orders come as Tata plans to plough billions of dollars in new investments to upgrade Air India's fleet, improve its service and expand its domestic and international network to regain lost market share.\n\n\"Our ambitious fleet renewal and expansion programme will see Air India operate the most advanced and fuel-efficient aircraft across our route network within five years,\" Air India Chief Executive Campbell Wilson said in the statement.\n\nAir India's firm orders include 70 widebody planes, comprising 34 A350-1000s and six A350-900s from Airbus, and 20 787 Dreamliners and 10 777Xs from Boeing. It also includes 140 Airbus A320neo, 70 Airbus A321neo and 190 Boeing 737 MAX narrowbody aircraft.\n\nThe airline has also signed options to buy an additional 70 planes from Boeing including 50 737 MAXs and 20 787 Dreamliners, the U.S. planemaker said in a separate statement, making this its biggest order in South Asia.\n\n(Reporting by Aditi Shah; Editing by Mark Potter)", "link": "https://sg.finance.yahoo.com/news/air-india-firms-order-airbus-152254849.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.927, "neg": 0.009, "neu": 0.914, "pos": 0.076}}, {"date": "2023-06-20T14:58:24+00:00", "title": "UPDATE 1-Air India firms up order with Airbus, Boeing for 470 planes", "content": "(Adds details, comments in paragraphs 3-6)\n\nBy Aditi Shah\n\nNEW DELHI, June 20 (Reuters) - Air India has firmed up its order for 250 Airbus aircraft and 220 new Boeing jets worth $70 billion at list prices, the airline said in a statement on Tuesday, as it pursues a turnaround under its new owners.\n\nThe Tata-owned airline signed separate purchase agreements with the two planemakers at the Paris Airshow for the jets and some services, a day after domestic rival IndiGo agreed on Monday to buy 500 single-aisle planes from Airbus.\n\nThe confirmed orders come as Tata plans to plough billions of dollars in new investments to upgrade Air India's fleet, improve its service and expand its domestic and international network to regain lost market share.\n\n\"Our ambitious fleet renewal and expansion programme will see Air India operate the most advanced and fuel-efficient aircraft across our route network within five years,\" Air India Chief Executive Campbell Wilson said in the statement.\n\nAir India's firm orders include 70 widebody planes, comprising 34 A350-1000s and six A350-900s from Airbus, and 20 787 Dreamliners and 10 777Xs from Boeing. It also includes 140 Airbus A320neo, 70 Airbus A321neo and 190 Boeing 737 MAX narrowbody aircraft.\n\nThe airline has also signed options to buy an additional 70 planes from Boeing including 50 737 MAXs and 20 787 Dreamliners, the U.S. planemaker said in a separate statement, making this its biggest order in South Asia. (Reporting by Aditi Shah Editing by Mark Potter)", "link": "https://finance.yahoo.com/news/1-air-india-firms-order-145824462.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.927, "neg": 0.009, "neu": 0.917, "pos": 0.074}}, {"date": "2023-06-20T14:52:00+00:00", "title": "Airbus (EADSY), Indigo Ink Historic Order for 500 A320 Jets", "content": "Airbus SE EADSY recently inked a major order to supply 500 of its A320 family aircraft at the Paris Air Show 2023 to Indigo, thereby marking the biggest order in the commercial aviation history. Indigo, a longstanding client of Airbus, has collective order of 1330 orders for Airbus, entailing strong revenue-generation prospects for Airbus in the days ahead. `\n\nGrowth Prospects of Airbus in India\n\nThe lucrative and one of the fastest growing Indian aviation market leverages commercial aircraft manufacturers’ positioning. The rising passenger market bears testimony to rising travel demand in the nation, which corresponds to an increasing demand for aircraft. Per the latest report from Directorate General of Civil Aviation, the number of passengers travelling through domestic carriers In India recorded a strong growth of 36.1% during January-May 2023 period.\n\nWith much room for further growth in the next decade, the Indian aviation market certainly holds opportunities for aircraft manufacturers like Airbus. Per the report from SP’s airbuzdomestic and international traffic is likely to be in the range of 130-140 million and 55-60 million in 2023, per the Centre for Asia Pacific Aviation (CAPA) India estimates.\n\nRapidly-expanding connectivity, growing population, increased investment on aviation market and its infrastructure, rise in disposable income and increased air travel demand are likely to stimulate growth of the Indian aviation market.\n\nThe factors mentioned above unfold immense potential in the Indian aviation market that could benefit industry forerunners in aircraft manufacturing like Airbus. The company’s already-established position in Indian aviation market, with its strong portfolio of jets, tend to provide competitive edge to the company and boost its growth trajectory.\n\nPeers To Benefit\n\nAnother recognized aerospace giant, apart from Airbus, that holds a solid foothold in the Indian aviation market and may further gain from the nation’s growth potential is:\n\nBoeing BA: The company has a large customer base in the growing Indian aviation market and its fleet are part of many major airlines in India. Recently, Air India announced its plans in February 2023 to invest in 190 737 MAX, 20 787 Dreamliner and 10 777X airplanes. The deal also entails potential orders for 50 additional 737 MAXs and 20 787-9s.\n\nThe long-term earnings growth rate of Boeing is pegged at 4%. Shares of Boeing have increased 60.8% in the past year.\n\nPrice Performance\n\nShares of Airbus have rallied 42.3% in the past year compared with the industry’s growth of 3.1%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank & Stocks to Consider\n\nAirbus currenlty carries a Zacks Rank #3 (Hold). Two better-ranked stocks in the same industry are Spire SPIR and Safran SAFRY, carrying a Zacks Rank #2 (Buy).  You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nThe Zacks Consensus Estimate for Spire’s 2023 sales suggests a growth rate of 32.9% from the prior-year reported figure. The Zacks Consensus Estimate for Spire’s 2024 sales calls for a growth rate of 34.3% from the prior-year estimated figure.\n\nSPIR reported an earnings surprise of 16.67% in the last reported quarter. The four-quarter average earnings surprise for the company stands at 10.37%.\n\nSafran boast a long-term earnings growth rate of 37.6%. The Zacks Consensus Estimate for its 2023 sales implies a growth rate of 36.7% from the prior-year reported figure.\n\nThe Zacks Consensus Estimate for SAFRY’s 2024 sales calls for a growth rate of 9.9% from the prior-year estimated figure.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nSafran SA (SAFRY) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nSpire Global, Inc. (SPIR) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/airbus-eadsy-indigo-ink-historic-145200663.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.007, "neu": 0.826, "pos": 0.168}}, {"date": "2023-06-20T14:48:49+00:00", "title": "Cargo aircraft missing from Paris Air Show dealmaking", "content": "An Air Algerie Boeing 737-800 jet departs Istanbul Ataturk Airport on March 27, 2019. (Photo: Shutterstock/Soos Jozcef)\n\nBoeing and Airbus have used the Paris Air Show this week to highlight customer orders for new aircraft, but there is little activity on the freighter front so far. On Tuesday, Boeing announced the first cargo-related deal with African carrier Air Algérie, although it involves aftermarket conversion of passenger aircraft and not production of new aircraft.\n\nThe flag carrier of Algeria placed a firm order with Boeing (NYSE: BA) for eight 737-9 MAX passenger jets and tentatively agreed to place two used 737-800 passenger jets in the freighter conversion program.\n\nThe converted freighters essentially represent the start of a dedicated cargo unit for Air Algérie, which operates 55 passenger aircraft and one Hercules L100-30 — the civilian variant of the Lockheed C-130 military transport, according to the company’s website.\n\nThe 737-800 is a standard-size aircraft and can carry more than 26 tons of payload once reconfigured for carrying containers on the main deck. Air Algérie’s passenger fleet includes 25 737-800s.\n\nThe dearth of orders for freighters at the Paris Air Show indicates that the 16-month downturn in air cargo demand is causing leasing companies and cargo airlines to slow down capital expenditures for new aircraft. During the prior three years there was an explosion in orders for converted freighters.\n\nBoeing on Tuesday also struck deals with China Airlines for eight 787-9 Dreamliners and with lessor Avolon for 40 737-8 MAX aircraft.\n\nAir Tanzania 767 freighter\n\nAfrica’s prospects for economic growth is driving regional carriers to beef up their freighter capacity. Air Tanzania this month took delivery of its first 767-300 production freighter from Boeing, marking the manufacturer’s first sale of a new-build freighter to an African carrier.\n\nThe medium-size widebody freighter, which provides Air Tanzania more cargo flexibility beyond its passenger fleet, is expected to carry imports and exports of perishable goods, pharmaceuticals and e-commerce products that require timely delivery.\n\nAir Tanzania currently operates commercial service across Africa and to destinations in Asia with a fleet that includes two 787-8 Dreamliners. The airline also has orders for an additional 787-8 and two 737 MAX jets.\n\nIn May, Boeing delivered three 777 Freighters: one each to China Airlines, China Southern Airlines and DHL Aviation. UPS received two 767-300 freighters and FedEx Express added one.\n\nAirbus takes early Paris lead\n\nAirbus has dominated the Paris show so far, led by a blockbuster order from India’s IndiGo for 500 A320 aircraft. Flynas, a low-cost Saudi Arabian airline, finalized an order for 30 A320 neos; Air Mauritius and Philippine Airlines made purchase commitments for three and nine A350 long-haul jets; and Qantas finalized an incremental order for nine A220 regional jets.\n\nAir India also finalized previously announced orders for 250 Airbus jets and 290 Boeing single-aisle and widebody aircraft.\n\nClick here for more FreightWaves stories by Eric Kulisch.\n\nRECOMMENDED READING:\n\nAir cargo’s busy season looking more like mole hill than mountain peak\n\nThe post Cargo aircraft missing from Paris Air Show dealmaking appeared first on FreightWaves.", "link": "https://finance.yahoo.com/news/cargo-aircraft-missing-paris-air-144849983.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.967, "neg": 0.022, "neu": 0.918, "pos": 0.06}}, {"date": "2023-06-20T14:32:51+00:00", "title": "Dow Jones Falls 375 Points After Key Housing Data; Alibaba Slides As CEO Steps Down", "content": "The Dow Jones Industrial Average dropped Tuesday after key housing data. Chinese e-commerce giant Alibaba slid after the CEO stepped down.", "link": "https://finance.yahoo.com/m/ba992954-992d-3c32-9943-9e1a2a9c7365/dow-jones-falls-375-points.html", "symbols": ["1FD.F", "9988.HK", "AHLA.F", "AHLA.XETRA", "BA.MX", "BA.US", "BABA.US", "BABA34.SA", "BABAF.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DC4.F", "DJI.INDX", "DXCM.US", "FND.US", "IXIC.INDX", "MSF.F", "MSF.XETRA", "MSFT.MX"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-06-20T14:03:38+00:00", "title": "How Put Options Protect Investments: An Example Using Boeing Stock", "content": "Owning a put option gives the owner the right to sell their stock at a certain price, no matter how low it goes.", "link": "https://finance.yahoo.com/m/6f2765a5-e1bd-312c-974d-c4438b023df5/how-put-options-protect.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.273, "neg": 0.176, "neu": 0.694, "pos": 0.131}}, {"date": "2023-06-20T14:01:00+00:00", "title": "Air India Finalizes Order for Up to 290 Boeing Single-Aisle and Widebody Jets", "content": "- Boeing's largest order in South Asia includes 190 737 MAXs, 20 787 Dreamliners and 10 777X jets; options for additional 50 737 MAX jets and 20 787 Dreamliners\n\nLE BOURGET, France, June 20, 2023 /PRNewswire/ -- Boeing [NYSE:BA] and Air India today announced they have finalized an order for up to 290 new Boeing jets and expanded services. At the 2023 Paris Air Show, the companies held a signing ceremony to celebrate the historic purchase of Boeing's market-leading single-aisle and widebody jets to renew and expand Air India's fleet. From left to right: Campbell Wilson, Chief Executive Officer & Managing Director Air India; Stan Deal, President and CEO of Boeing Commercial Airplanes; N. Chandrasekaran, Chairman, Tata Sons and Air India; Stephanie Pope, President and CEO of Boeing Global Services; Nipun Aggarwal, Commercial & Transformation Officer, Air India (Photo: Boeing)\n\nThe order, which includes 190 737 MAXs, 20 787 Dreamliners and 10 777X jets with options for 50 737 MAXs and 20 787 Dreamliners, is Boeing's largest order in South Asia and highlights its 90-year partnership with Air India. A comprehensive set of aviation services will also enable Air India to sustainably expand its operations in South Asia's rapidly growing aviation market. Over the next 20 years, South Asia is expected to more than triple its in-service fleet from 700 to 2,300 airplanes to meet passenger demand.\n\nThe companies announced in February that Air India had selected these Boeing models to serve its strategy for sustainable growth.\n\nAs a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity. Join our team and find your purpose at boeing.com/careers.\n\nContact \r\nKevin Yoo\r\nInternational Sales Communications\r\nBoeing Commercial Airplanes\r\n+1 206-249-6372\r\nkevin.k.yoo@boeing.com\n\nBoeing Media Relations\r\nmedia@boeing.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/air-india-finalizes-order-for-up-to-290-boeing-single-aisle-and-widebody-jets-301855448.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/air-india-finalizes-order-290-140100637.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.985, "neg": 0.004, "neu": 0.892, "pos": 0.104}}, {"date": "2023-06-20T13:38:00+00:00", "title": "Boeing Updates Long-Term Jet Market Outlook: Stocks to Gain", "content": "The Boeing Company BA recently revealed its long-term outlook for the global aircraft market, forecasting opportunities worth $8 trillion over the next two decades. This reflects a solid 11.1% improvement from the prior long-term outlook made by America’s largest jet maker in 2021.\n\nHighlights of the Outlook\n\nBoeing projects global demand for new commercial planes to reach 42,595 by 2042, indicating an improvement of 3.9% from 2022’s figure. Overall, the global fleet is projected to double to more than 48,500 in the next 20 years. In particular, new single-aisle airplanes will account for more than 75% of all new deliveries, totaling more than 32,000 airplanes, reflecting an increase of 3.2% from the 2022 outlook.\r\n\r\nMarket opportunities for commercial services are now projected to be worth $3.8 trillion over the next 20 years, which implies a solid 5.6% hike over the prior 20-year forecast.\n\nWhat Led to the Increased View?\n\nOvercoming the woes of pandemic, commercial air travel has been improving in the recent past, buoyed by increased economic activities. Moreover, the growth of low-cost carriers (LCC) has been driving down fares, thereby making travel more accessible.\n\nThis in turn has been bolstering the commercial aerospace along with the aftermarket aviation services market, which played the role of the key growth catalyst, boosting Boeing’s jet market outlook.\n\nNotably, global air traffic in February 2023 (measured in revenue passenger kilometers or RPKs) rose 55.5% compared with February 2022. Globally, traffic is now at 84.9% of the February 2019 levels. Looking ahead, passenger traffic is projected to return to 2019 levels over the course of the next 12-18 months. Such favorable projections must have encouraged Boeing to upgrade its 20-year commercial market outlook.\n\nStocks to Gain\n\nConsidering the aforementioned discussion, we may safely conclude that with the release of Boeing’s latest outlook, the spotlight is primarily on major commercial jet maker stocks. These include Boeing and Airbus, which constitute more than 50% of the global commercial jet market, along with a few more, which hold solid growth prospects and hence should find a place on investors’ watchlist.\n\nBoeing develops, produces, and markets commercial jets, along with providing related support services. The company is a leading producer of commercial aircraft and has a series of commercial jetliners like the 737 Next-Generation narrow-body model as well as the 747, 767, 777 and 787 wide-body models.\r\n\r\nThis Zacks Rank #3 (Hold) stock boasts a long-term earnings growth estimate of 4%. The Zacks Consensus Estimate for BA’s 2024 sales implies an improvement of 15.8% from the 2023 expected sales figure.\n\nAirbus’ EADSY diverse product line includes renowned passenger jetliners, which vary in size from 100-seat jetliners to the double-deck A380 that is capable of transporting more than 850 passengers. Its significant jetliners are A220, A320, A330, A350 and A380.\r\n\r\nThis Zacks Rank #3 stock has a long-term earnings growth estimate of 12.4%. The consensus estimate for EADSY’s 2024 sales suggests an improvement of 14.4% from the 2023 expected sales figure. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nTextron TXT is a renowned aircraft manufacturer of a variety of jets including business jets. Its Textron Aviation segment is home to the Beechcraft, Cessna and Hawker aircraft brands.\r\n\r\nThis Zacks Rank #3 stock company’s earnings are projected to grow 7.4% in the long term. The Zacks Consensus Estimate for EADSY’s 2024 sales implies an improvement of 5.9% from the 2023 expected sales figure.\n\nEmbraer ERJ designs and manufactures commercial as well as executive jets along with providing support services for aircraft, like modification, flight operation, and maintenance services. Its E-jets and E-jets E2 families of commercial aircraft are worth mentioning in this regard.\n\nThis Zacks Rank #3 company’s earnings are projected to grow 17% in the long term. The Zacks Consensus Estimate for ERJ’s 2024 sales indicates an improvement of 10.5% from the 2023 expected sales figure.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/boeing-updates-long-term-jet-133800799.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "TXT.F", "TXT.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.006, "neu": 0.846, "pos": 0.148}}, {"date": "2023-06-20T13:31:15+00:00", "title": "Midday movers: Rivian Automotive, PayPal, Airbus and more", "content": "Investing.com -- Stocks are falling after stronger-than-expected data on housing stoked fresh fears about interest rates. Here are the market movers for June 20.\n\nRivian Automotive Inc (NASDAQ:RIVN) shares are up 5% after the electric vehicle maker became the latest car company to adopt Tesla's technology standard for charging. Tesla Inc (NASDAQ:TSLA) shares were up 3.6%.  PayPal Holdings Inc (NASDAQ:PYPL) shares rose 3.8% after the payments company said private equity firm KKR would buy up to €40 billion (€1 = $1.0915) of its buy now pay later loans originated in Europe. Airbus Group (EPA:AIR) (OTC:EADSY) shares rose 0.4% after the company announced an order of 500 planes for India carrier IndiGo, while rival  Boeing Co  (NYSE:BA) shares fell 3.3%. Boeing has an order for eight 787 Dreamliners from China Airlines.  Alibaba Group Holdings Ltd ADR (NYSE:BABA) shares fell 4.7% after the Chinese e-commerce giant said Daniel Zhang would step down as CEO but remain on as head of its cloud intelligence group. Dice Therapeutics (NASDAQ:DICE) shares jumped 37% after Eli Lilly and Company (NYSE:LLY) said it was buying it for $2.4B as it builds its portfolio of treatments for immune diseases.\n\nRelated Articles\n\nMidday movers: Rivian Automotive, PayPal, Airbus and more\n\nEV maker Rivian to adopt Tesla's charging standard\n\nExclusive-Tesla standard: BTC Power joins move to add to EV chargers", "link": "https://finance.yahoo.com/news/midday-movers-rivian-automotive-paypal-133115676.html", "symbols": ["2PP.F", "2PP.XETRA", "9988.HK", "AHLA.F", "AHLA.XETRA", "AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BABA.US", "BABA34.SA", "BABAF.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.952, "neg": 0.019, "neu": 0.868, "pos": 0.113}}, {"date": "2023-06-20T12:35:51+00:00", "title": "Dow Jones Futures Fall After Key Housing Data; Alibaba Slides As CEO Steps Down", "content": "Dow Jones futures dropped Tuesday morning after key housing data. Chinese e-commerce giant Alibaba slid after the CEO stepped down.", "link": "https://finance.yahoo.com/m/ba992954-992d-3c32-9943-9e1a2a9c7365/dow-jones-futures-fall-after.html", "symbols": ["9988.HK", "AHLA.F", "AHLA.XETRA", "BA.MX", "BA.US", "BABA.US", "BABA34.SA", "BABAF.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "IXIC.INDX", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "TL0.F", "TL0.XETRA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-06-20T12:26:15+00:00", "title": "Embraer sees $650 bln of new aircraft demand over 20 years", "content": "SAO PAULO, June 20 (Reuters) - Brazilian planemaker Embraer on Tuesday published a new 20-year market outlook at the Paris Airshow, saying it expects a need for flexibility to drive demand in the up-to-150-seat segment in the period.\n\nEmbraer, the world's No.3 aircraft maker after Boeing and Airbus, said in a statement it expects global demand for new aircraft in the segment to reach 11,000 units in the period, including jets and turboprops.\n\nThose aircraft are seen valued at $650 billion, said Embraer, which also forecasts global passenger volume to grow 3.2% annually in the period. (Reporting by Gabriel Araujo Editing by Mark Potter)", "link": "https://finance.yahoo.com/news/embraer-sees-650-bln-aircraft-122615072.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EMBR3.SA", "EMY.F", "ERJ.US", "ERJN.MX"], "tags": [], "sentiment": {"polarity": 0.527, "neg": 0.029, "neu": 0.91, "pos": 0.061}}, {"date": "2023-06-20T12:02:24+00:00", "title": "Dow Jones Futures Fall Amid Signs Strong Market Due For Pullback; Watch AMD, Boeing, These Stocks", "content": "The market rally has shown bullish action, but be prepared for a pullback in the near term. AMD and Boeing are among stocks to watch.", "link": "https://finance.yahoo.com/m/302a5be1-0963-383b-8176-d99669ad4125/dow-jones-futures-fall-amid.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "C9F.F", "CMG.MX", "CMG.US", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "MCK.MX", "MCK.US", "NVD.F", "NVD.XETRA"], "tags": [], "sentiment": {"polarity": 0.329, "neg": 0, "neu": 0.907, "pos": 0.093}}, {"date": "2023-06-20T11:30:00+00:00", "title": "Boeing Launches SAF Dashboard to Track and Project Sustainable Aviation Fuel Production", "content": "- Dashboard tracks potential SAF availability, and underscores need to close gap between supply and demand\n\nLE BOURGET, France, June 20, 2023 /PRNewswire/ -- Boeing [NYSE: BA] today launched SAF Dashboard, a tool that tracks expected sustainable aviation fuel (SAF) capacity over the next decade. Based on data collected by BloombergNEF, the Dashboard aggregates total SAF capacity announcements by suppliers on a global scale and can filter anticipated supply by production pathway, location and other metrics. The tool is accessible on Boeing's new Sustainable Aerospace Together hub. Boeing today launched SAF Dashboard, a tool that tracks expected sustainable aviation fuel (SAF) capacity over the next decade. (Image: Boeing)\n\nBoeing released the tool at the 2023 Paris Air Show to support discussion and action among industry stakeholders regarding the existing SAF footprint as well as future production levels required to meet the commercial aviation industry's goal of net-zero emissions by 2050.\n\n\"SAF reduces CO2 emissions by up to 85% and possibly more over the fuel's life cycle, offering the greatest potential to decarbonize aviation over the next 30 years,\" said Boeing Chief Sustainability Officer Chris Raymond. \"SAF Dashboard portrays the data visually as our industry works together across sectors to increase SAF production for a more sustainable aerospace future.\"\n\nThe release of SAF Dashboard comes after Boeing in May launched the public version of the Boeing \"Cascade\" Climate Impact Model, a data modeling tool that identifies the effects of a range of sustainability solutions to reduce aviation's carbon emissions.\n\nCascade and SAF Dashboard provide access to necessary data to advance the conversation on aviation decarbonization. Visit Cascade and the SAF Dashboard at www.sustainabilitytogether.aero\n\nAs a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity. Join our team and find your purpose at boeing.com/careers.\n\nContact Boeing Media Relations\r\nmedia@boeing.com SAF Dashboard Navigation Guide Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/boeing-launches-saf-dashboard-to-track-and-project-sustainable-aviation-fuel-production-301855188.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/boeing-launches-saf-dashboard-track-113000301.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.984, "neg": 0.004, "neu": 0.894, "pos": 0.102}}, {"date": "2023-06-20T10:45:00+00:00", "title": "Boeing, Avolon Announce Order for 40 737 MAX Jets", "content": "- International lessor places first 737 MAX order since 2017, citing confidence in long-term demand for the fuel-efficient 737-8\n\nLE BOURGET, France, June 20, 2023 /PRNewswire/ -- Boeing [NYSE: BA] and Avolon, the international aircraft leasing company, today announced an order for 40 737 MAX airplanes at the Paris Air Show. Boeing and Avolon, the international aircraft leasing company, today announced an order for 40 737 MAX airplanes at the Paris Air Show. (Image: Boeing)\n\n\"Today's announcement reaffirms our long-standing partnership with Boeing and our support for their 737 MAX program. We are confident in the long-term demand from our customers for the 737 MAX, and this order extends our delivery pipeline out to 2030,\" said Andy Cronin, CEO, Avolon. \"The transitioning of the global fleet to more fuel-efficient new-technology aircraft is a priority for our industry, and we are looking to play a leading role by supporting airlines achieving their sustainability objectives.\"\n\nThe 737 MAX will provide Avolon's customers with greater flexibility across their network, while reducing fuel use and emissions by 20% compared to the airplanes they replace. On average each airplane will save up to 8 million pounds of CO2 annually compared to airplanes it replaces.\n\n\"This order demonstrates the popularity of the 737-8 among the leasing community and the demand they are seeing from their customers for this airplane model,\" said Stan Deal, president and CEO, Boeing Commercial Airplanes. \"Avolon has a long-standing relationship with the 737 MAX program and took delivery of the 1,000th 737 MAX last year. We look forward to building on this strong relationship with a key leasing partner as they grow their Boeing portfolio of airplanes.\"\n\nThis order was previously unidentified on the Boeing Orders & Deliveries website.\n\nThe 737-8 models, seating 162 to 210 passengers depending on configuration and with a range of 3,500 nautical miles, is the market's most versatile single-aisle airplane, capable of operating profitably on short and medium-haul routes.\n\nBoeing customers have placed more than 1,000 orders and commitments for the company's new commercial airplanes since July 2022. This includes over 750 737 MAX airplanes, reflecting the value of the family's versatility and commonality.\n\nAbout Avolon Headquartered in Ireland, with offices in the United States, Dubai, Singapore and Hong Kong, Avolon provides aircraft leasing and lease management services. Avolon is 70% owned by an indirect subsidiary of Bohai Leasing Co., Ltd., a public company listed on the Shenzhen Stock Exchange (SLE: 000415) and 30% owned by ORIX Aviation Systems Limited, a subsidiary of ORIX Corporation which is listed on the Tokyo and New York Stock Exchanges (TSE: 8591; NYSE: IX). Avolon is a global leader in aircraft leasing with an owned, managed and committed fleet, as of 31 March 2023 of 830 aircraft. www.avolon.aero\n\nAbout Boeing As a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity. Join our team and find your purpose at boeing.com/careers.\n\nContact Boeing Media Relations \r\nmedia@boeing.com\n\nDouglas Keatinge\r\nAvolon Head of Communications\r\ndkeatinge@avolon.aero\r\nT: +353 86 037 4163 Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/boeing-avolon-announce-order-for-40-737-max-jets-301854818.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/boeing-avolon-announce-order-40-104500529.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "IX.US", "OIX.F", "OIXA.F", "ORXCF.US"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.015, "neu": 0.878, "pos": 0.107}}, {"date": "2023-06-20T10:29:00+00:00", "title": "Housing Weathers Interest-Rate Storm. Why It’s a Problem for Fed’s Powell.", "content": "China moves to jolt post-Covid growth, what the Paris Air Show says about the aviation recovery, and other news to start your day.", "link": "https://finance.yahoo.com/m/d409e1cf-0abb-3d6b-89a2-5957d63791e6/housing-weathers.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "FDX.F", "FDX.MX", "FDX.US", "FDX.XETRA", "HSI.INDX"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0, "neu": 0.894, "pos": 0.106}}, {"date": "2023-06-20T09:53:33+00:00", "title": "Paris air show: India centre stage as another big jet deal lands", "content": "By Joanna Plucinska and Valerie Insinna\n\nPARIS (Reuters) - India dominated the Paris Airshow for a second day on Tuesday, as Air India finalised a huge order for 470 planes from Airbus and Boeing.\n\nThe agreement, when sketched out in February, was the largest ever plane deal by number of aircraft. But it was surpassed on day one of the Paris show by Indian rival IndiGo's order for 500 Airbus narrowbody jets.\n\nFinalising the deal puts it in the aerospace industry's order backlogs as firm orders. Until now, it was only a preliminary deal. Air India said it was worth $70 billion at list prices, though airlines typically get discounts on big orders worth at least half the headline price, analysts say.\n\nEfforts by Indian airlines to keep pace with the world's fastest-growing aviation market, serving the largest population, have sent industry records tumbling even though manufacturers are struggling to meet output goals due to supply chain snags.\n\nBut some analysts have expressed concern that airlines could be over-ordering jets in pursuit of the same passengers.\n\nAir India's deal includes 250 planes from Airbus and 220 from Boeing. The Airbus part comprises 210 A320neo and A321neo narrowbody jets and 40 A350 widebodies. Boeing's deal is for 190 narrowbody 737 MAXs, plus 20 787 Dreamliner and 10 777X widebodies.\n\n\"Our ambitious fleet renewal and expansion programme will see Air India operate the most advanced and fuel-efficient aircraft across our route network within five years,\" Air India Chief Executive Campbell Wilson said in a statement.\n\nThe buying spree by Indian airlines adds to signs of strong global demand for civilian aircraft as travel rebounds from the pandemic and airlines look to reduce their environmental impact with more fuel-efficient new models.\n\nDemand has been hottest for short and medium-haul narrowbody jets, but engine maker Rolls-Royce said on Tuesday the market for long-haul widebodies was also coming back strongly.\n\nHowever, planemakers and their suppliers remain concerned about their ability to meet bulging order books amid rising costs, parts shortages and a scarcity of skilled workers.\n\nLars Wagner, CEO of MTU Aero Engines, said on Tuesday labour shortages and problems with the production of castings were the biggest strains in the engine supply chain.\n\nINDIAN RIVALRY\n\nAir India, with its maharajah mascot, was once known for its lavishly decorated planes and stellar service, but its reputation declined in the mid-2000s as financial troubles mounted.\n\nIts renaissance under the Tata conglomerate aims to capitalise on India's growing base of fliers and large diaspora, currently mostly served by foreign rivals such as Emirates.\n\nThe mega-order will also put Air India on a stronger footing to compete with budget rival IndiGo, which has a majority share of the Indian market and a strong position in regional flights.\n\nElsewhere at the show on Tuesday, Ethiopian Airlines said it expected to announce an order for about 130 Airbus and Boeing planes shortly after the event.\n\nLeasing company Avolon finalised an order for 40 Boeing 737 MAX 8 planes, while Philippine Airlines firmed up an order for nine Airbus A350-1000 widebody jets and Qantas finalised a deal for nine Airbus A220-300s, confirming a Reuters report.\n\n(Reporting by Tim Hepher, Joanna Plucinska, Allison Lampert, Valerie Insinna and Aditi Shah; Editing by Mark Potter)", "link": "https://sg.finance.yahoo.com/news/india-centre-stage-paris-air-095333466.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.886, "neg": 0.033, "neu": 0.909, "pos": 0.057}}, {"date": "2023-06-20T09:53:33+00:00", "title": "India centre stage at Paris air show as another big jet deal looms", "content": "By Joanna Plucinska and Valerie Insinna\n\nPARIS (Reuters) - India was set to dominate the Paris Airshow for a second day on Tuesday, with Air India expected to finalise a whopping order for 470 planes from Airbus and Boeing, sources familiar with the matter said.\n\nThat deal, sketched out in February, was at the time the largest ever announced by number of planes. But it was surpassed on day one of the Paris show by Indian rival IndiGo's order for 500 Airbus narrowbody jets.\n\nEfforts by Indian airlines to keep pace with the world's fastest-growing aviation market, serving the largest population, have sent industry records tumbling even though manufacturers are struggling to meet output goals due to supple chain snags.\n\nIndian carriers now have the second-largest order book, with an over 6% share of the industry backlog, behind only the United States, according to a June 1 report by Barclays.\n\nBut some analysts have expressed concern that airlines could be over-ordering jets in pursuit of the same passengers.\n\nAir India's provisional deal included 250 planes from Airbus and 220 from Boeing. The Airbus part comprised 210 A320neo narrowbodies and 40 A350 widebodies, while the Boeing deal was for 190 737 MAX, 20 787 Dreamliners and 10 mini-jumbo 777X.\n\nTogether with another 25 Airbus jets to be leased, the overall acquisition reaches 495 jets, an Airbus executive said at the time.\n\nThe companies declined to comment on Tuesday.\n\nAir India, with its maharajah mascot, was once known for its lavishly decorated planes and stellar service, but its reputation declined in the mid-2000s as financial troubles mounted.\n\nIts renaissance under the Tata conglomerate aims to capitalise on India's growing base of fliers and large diaspora across the world, which is currently mostly served by foreign rivals such as Emirates.\n\nThe mega-order will also put Air India on a stronger footing to compete with budget rival IndiGo, which has a majority share of the Indian market and a strong position in regional flights.\n\nElsewhere at the show on Tuesday, Ethiopian Airlines said it expected to announce an order for about 130 Airbus and Boeing planes shortly after the event.\n\nPhilippine Airlines finalised an order for nine Airbus A350-1000 widebody jets, while Qantas firmed up a deal for nine Airbus A220-300s, confirming a Reuters report.\n\n(Reporting by Tim Hepher, Joanna Plucinska, Allison Lampert, Valerie Insinna and Aditi Shah; Editing by Mark Potter)", "link": "https://finance.yahoo.com/news/india-centre-stage-paris-air-095333206.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.854, "neg": 0.018, "neu": 0.934, "pos": 0.048}}, {"date": "2023-06-20T09:50:07+00:00", "title": "WRAPUP 1-India centre stage at Paris air show as another big jet deal looms", "content": "By Joanna Plucinska and Valerie Insinna\n\nPARIS, June 20 (Reuters) - India was set to dominate the Paris Airshow for a second day on Tuesday, with Air India expected to finalise a whopping order for 470 planes from Airbus and Boeing, sources familiar with the matter said.\n\nThat deal, sketched out in February, was at the time the largest ever announced by number of planes. But it was surpassed on day one of the Paris show by Indian rival IndiGo's order for 500 Airbus narrowbody jets.\n\nEfforts by Indian airlines to keep pace with the world's fastest-growing aviation market, serving the largest population, have sent industry records tumbling even though manufacturers are struggling to meet output goals due to supple chain snags.\n\nIndian carriers now have the second-largest order book, with an over 6% share of the industry backlog, behind only the United States, according to a June 1 report by Barclays.\n\nBut some analysts have expressed concern that airlines could be over-ordering jets in pursuit of the same passengers.\n\nAir India's provisional deal included 250 planes from Airbus and 220 from Boeing. The Airbus part comprised 210 A320neo narrowbodies and 40 A350 widebodies, while the Boeing deal was for 190 737 MAX, 20 787 Dreamliners and 10 mini-jumbo 777X.\n\nTogether with another 25 Airbus jets to be leased, the overall acquisition reaches 495 jets, an Airbus executive said at the time.\n\nThe companies declined to comment on Tuesday.\n\nAir India, with its maharajah mascot, was once known for its lavishly decorated planes and stellar service, but its reputation declined in the mid-2000s as financial troubles mounted.\n\nIts renaissance under the Tata conglomerate aims to capitalise on India's growing base of fliers and large diaspora across the world, which is currently mostly served by foreign rivals such as Emirates.\n\nThe mega-order will also put Air India on a stronger footing to compete with budget rival IndiGo, which has a majority share of the Indian market and a strong position in regional flights.\n\nElsewhere at the show on Tuesday, Ethiopian Airlines said it expected to announce an order for about 130 Airbus and Boeing planes shortly after the event.\n\nPhilippine Airlines finalised an order for nine Airbus A350-1000 widebody jets, while Qantas firmed up a deal for nine Airbus A220-300s, confirming a Reuters report. (Reporting by Tim Hepher, Joanna Plucinska, Allison Lampert, Valerie Insinna and Aditi Shah Editing by Mark Potter)", "link": "https://finance.yahoo.com/news/wrapup-1-india-centre-stage-095007538.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.854, "neg": 0.018, "neu": 0.934, "pos": 0.048}}, {"date": "2023-06-20T09:41:00+00:00", "title": "Air Algérie Orders Eight Boeing 737 MAX Jets, Commits To Two 737-800 Boeing Converted Freighters", "content": "- Algerian flag carrier to deploy 737-9 on short- and medium-haul routes\n\n- 737-800 BCF positioned to meet growing air cargo demand\n\nLE BOURGET, France, June 20, 2023 /PRNewswire/ -- Boeing [NYSE: BA] and Air Algérie today confirmed an order for eight fuel-efficient 737-9 jets at the Paris Air Show. The Algerian flag carrier also signed a Memorandum of Understanding (MoU) for two 737-800 Boeing Converted Freighters (BCF) to meet increasing cargo demand in the region. Boeing and Air Algérie today confirmed an order for eight fuel-efficient 737-9 jets at the Paris Air Show. (Image: Boeing)\n\n\"This order will contribute to the development of the Air Algérie fleet,\" said Yacine Benslimane, general manager of Air Algérie. \"This acquisition is part of Air Algérie's fleet extension strategy through the purchase of new aircraft.\"\n\nAir Algérie operates a single-aisle fleet of more than 30 737-500, 737-600 and 737-800 jets. Adding the 737-9 allows the airline to carry more passengers, increasing profitability within its network. With added capacity and increased profitability, the 737-9 is designed to serve 193 passengers in a two-class configuration with a range of 3,300 nautical miles.\n\n\"The 737-9 is ideally suited for Air Algérie's regional network, providing it with additional capacity and flexibility to operate seamlessly with its existing 737 fleet,\" said Stan Deal, president and CEO of Boeing Commercial Airplanes. \"In addition, the highly reliable and capable 737-800 Boeing Converted Freighters will enable Air Algerie to capture growing cargo opportunities, expanding beyond its passenger business.\"\n\nThis 737-9 order was unidentified on Boeing's Orders & Deliveries website.\n\nThe 737 MAX airplane family delivers enhanced efficiency, improved environmental performance and increased passenger comfort to the single-aisle market. Powered by CFM International LEAP-1B engines and advanced technology winglets, the 737 MAX reduces fuel use and emissions 20% compared to airplanes it replaces.\n\nBoeing customers have placed more than 1,000 orders and commitments for the company's new commercial airplanes since July 2022. This includes over 750 737 MAX airplanes, reflecting the value of the family's versatility and commonality.\n\nThe 737-800BCF carries more payload (up to 23.9 tonnes) and offers more range (2,025 nautical miles) than previous standard-body freighters. Global customers have placed more than 250 orders and commitments for the 737-800 BCF.\n\nAs a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity. Join our team and find your purpose at boeing.com/careers.\n\nContact Nadine Fanous\r\n+971-56-422-9051\r\nnadine.fanous@boeing.com\n\nBoeing Media Relations\r\nmedia@boeing.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/air-algerie-orders-eight-boeing-737-max-jets-commits-to-two-737-800-boeing-converted-freighters-301855147.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/air-alg-rie-orders-eight-094100788.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.006, "neu": 0.869, "pos": 0.125}}, {"date": "2023-06-20T09:05:00+00:00", "title": "China Airlines Announces Order for Eight 787 Dreamliners at Paris Air Show", "content": "- Airline exercises options for eight 787-9s to add flexibility to their regional route network\n\n- Super-efficient Dreamliner reduces fuel use, emissions by 20% compared to previous-generation jets\n\nLE BOURGET, France, June 20, 2023 /PRNewswire/ -- Boeing [NYSE: BA] and China Airlines today finalized an order for eight 787-9 Dreamliners at the 2023 Paris Air Show. This firm order, which was previously posted to Boeing's Orders and Deliveries website as unidentified, follows the airline's first-ever order for 16 787-9s announced last year. Stan Deal, President and CEO Boeing Commercial Airplanes, and Su-Chien Hsieh, Chairman of China Airlines, signing today's order for eight 787-9 Dreamliners at the 2023 Paris Air Show. (Photo: Boeing)\n\nChina Airlines also becomes the newest 787-10 customer as it converts six 787-9s to the 787-10, the largest member of the 787 family, to add flexibility and capacity on its regional network as passenger demand continues to rise above pre-pandemic levels.\n\nWith this order, the carrier will introduce 24 super-efficient 787s over the next several years, strengthening the airline's existing global network. The 787 enables China Airlines to reduce fuel use and emissions by 20%, which will support the airline to meet its sustainability goals.\n\nThe 787 family is selling at the highest rate in its history, receiving more than 250 orders and commitments in the past six months.\n\nAs a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity. Join our team and find your purpose at boeing.com/careers.\n\nContact Kevin Yoo\r\nInternational Sales Communications\r\nBoeing Commercial Airplanes\r\n+1 206-249-6372\r\nkevin.k.yoo@boeing.com\n\nBoeing Media Relations\r\nmedia@boeing.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/china-airlines-announces-order-for-eight-787-dreamliners-at-paris-air-show-301855106.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/china-airlines-announces-order-eight-090500311.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.983, "neg": 0.004, "neu": 0.891, "pos": 0.104}}, {"date": "2023-06-20T09:01:00+00:00", "title": "These Stocks Are Moving the Most Today: Alibaba, Boeing, Intel, UPS, FedEx, and More", "content": "Alibaba says Daniel Zhang will be stepping down as chairman and chief executive, Intel stock rises after the Israeli government said the chip maker is investing $25 billion to manufacture semiconductors in the country, and FedEx is scheduled to report earnings after the closing bell Tuesday.", "link": "https://finance.yahoo.com/m/49c13555-f62f-3bd8-9a59-b574ee831892/these-stocks-are-moving-the.html", "symbols": ["9988.HK", "AHLA.F", "AHLA.XETRA", "BA.MX", "BA.US", "BABA.US", "BABA34.SA", "BABAF.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "FDX.F", "FDX.MX", "FDX.US", "FDX.XETRA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-06-20T08:33:59+00:00", "title": "Stocks to Watch Tuesday: Alibaba, Stellantis, FedEx", "content": "**↘️** [**Alibaba (BABA)**](https://www.wsj.com/market-data/quotes/BABA): The Chinese e-commerce giant is [replacing Chairman and Chief Executive Daniel Zhang](https://www.wsj.com/articles/alibaba-says-joseph-tsai-to-take-over-as-chairman-succeeding-daniel-zhang-3bdf7a9) with two successors, as it pursues a major reorganization.", "link": "https://finance.yahoo.com/m/085698b2-68ae-326a-9e03-6e1035e2b650/stocks-to-watch-tuesday%3A.html", "symbols": ["013A.F", "8TI.F", "9618.HK", "9988.HK", "AHLA.F", "AHLA.XETRA", "BA.MX", "BA.US", "BABA.US", "BABA34.SA", "BABAF.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "JD.US", "JDCMF.US", "JDCO34.SA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.273, "neg": 0, "neu": 0.92, "pos": 0.08}}, {"date": "2023-06-20T08:08:03+00:00", "title": "FedEx, Avis and PayPal rise premarket; Palantir falls", "content": "Investing.com -- Stocks in focus in premarket trade on Tuesday, June 20th. Please refresh for updates.\n\nFedEx (NYSE:FDX) stock rose 0.5% ahead of the delivery giant’s quarterly results, with investors looking to see whether cost cuts will help it catch up with rival  United Parcel Service (NYSE:UPS) on the margin front.\n\nBoeing (NYSE:BA) stock rose 0.1% after the head of Boeing Commercial Airplanes said Sunday the aircraft manufacturer expects to increase production of its best-selling 737 MAX to 38 jets a month \"pretty soon.\"\n\nNiSource (NYSE:NI) stock rose 0.4% after the utility firm agreed to sell a 19.9% equity interest in its unit NIPSCO for $2.15 billion to asset manager Blackstone's (NYSE:BX) infrastructure unit.\n\nPalantir (NYSE:PLTR) stock fell 2.1% after Raymond James downgraded its stance on the data analytics company to ‘outperform’ from ‘strong buy’, citing its \"premium\" valuation after a strong run since its first-quarter print.\n\nAlibaba  (NYSE:BABA) ADRs fell 2.3% after the Chinese e-commerce giant announced that CEO Daniel Zhang will step down, in order to concentrate on the company’s cloud intelligence business.\n\nAvis (NASDAQ:CAR) stock rose 4.1% after Morgan Stanley upgraded the budget car rental company to ‘overweight’ from ‘equal weight’, saying the stock is likely to add to the already strong gains seen this year.\n\nPayPal (NASDAQ:PYPL) stock rose 2% after the payments company said investment firm KKR (NYSE:KKR) will purchase up to €40B (€1 = $1.0930) of its buy now, pay later loans in Europe.\n\nRelated Articles\n\nFedEx, Avis and PayPal rise premarket; Palantir falls\n\nSingapore's Grab cuts 1,000 jobs to stay competitive\n\nGoldman Sachs Asset Management head of healthcare investing to leave", "link": "https://finance.yahoo.com/news/fedex-avis-paypal-rise-premarket-080803923.html", "symbols": ["2PP.F", "2PP.XETRA", "BA.US", "BABA.US", "BX.US", "CAR.US", "CUCA.F", "FDX.F", "FDX.MX", "FDX.US", "FDX.XETRA", "KKR.US", "NI-PB.US", "NI.US", "NOU.F", "PLTR.US"], "tags": [], "sentiment": {"polarity": 0.982, "neg": 0.024, "neu": 0.848, "pos": 0.128}}, {"date": "2023-06-20T05:08:53+00:00", "title": "China rate cut, Alibaba shuffle, aircraft manufacturers - what's moving markets", "content": "Investing.com -- China's central bank has trimmed its benchmark lending rates in an attempt to stimulate its flagging economy, while e-commerce giant Alibaba sees a major shakeup at the board level. Wall Street is expected to return from the long weekend in a cautious mood.\n\n1. China cuts interest rates\n\nThe People’s Bank of China cut its key lending benchmarks on Tuesday, in the latest sign that the country’s authorities are concerned that the post-pandemic recovery in the world's second-largest economy is losing momentum.\n\nThe one-year loan prime rate was lowered by 10 basis points to 3.55%, while the five-year LPR was cut by the same margin to 4.20% - the first such reductions in 10 months.\n\nThe PBOC had also lowered short- and medium-term policy rates last week.\n\nHowever, these moves received a lukewarm reception as concerns about the country’s property market had meant that some within the market had expected more.\n\nChina's cabinet met on Friday to discuss measures to spur growth in the economy, and while nothing fresh emerged from these discussions, wider stimulus measures are widely expected in the fullness of time.\n\nThe weakening Chinese economy could also be behind the apparent thawing in relations between Beijing and Washington - the last thing needed at this point would be a trade war with a major export market!\n\nSecretary of State Antony Blinken met with President Xi Jinping on Monday, with the Chinese leader calling the progress “very good”.\n\nAlthough little in concrete was agreed upon, the two sides are still talking, with Chinese Foreign Minister Qin Gang now likely to visit Washington in the next few months.\n\n2. Alibaba CEO to head up cloud unit\n\nThe importance of Alibaba’s cloud unit was laid bare Tuesday, with the Chinese e-commerce giant announcing earlier Tuesday that current chairman and CEO Daniel Zhang will step down after eight years to front up the key unit.\n\n“This is the right time for me to make a transition, given the importance of Alibaba Cloud Intelligence Group as it progresses towards a full spin-off,” Zhang said in a statement issued by Alibaba (NYSE:BABA).\n\nAlibaba announced in March that the company would be restructured into six business groups, looking to spin off and potentially list them in the coming year.\n\nEddie Yongming Wu, chairman of the Taobao and Tmall Group will take over from Zhang as CEO, while Joseph Tsai, who is currently executive vice chair, will replace Zhang as chairman.\n\n3. Futures lower; Fed speakers prompt caution\n\nU.S. futures traded lower Tuesday, as investors return to a holiday-shortened week and cautiously await more clues of the Federal Reserve’s future monetary policy.\n\nAt 04:50 ET (08:50 GMT), the Dow futures contract had dropped 130 points or 0.4%, S&P 500 futures fell 19 points or 0.4%, and Nasdaq 100 futures dropped 85 points or 0.6%.\n\nThe main equity averages posted strong gains last week after the Fed paused its prolonged rate-hiking cycle, with the broad-based S&P 500 and the tech-heavy Nasdaq Composite recording their best weekly performances since March, rising 2.6% and 3.3%, respectively.\n\nHowever, investors appear to be reluctant to chase these gains higher, with the likes of Federal Reserve St. Louis President James Bullard, New York Fed President John Williams, and Fed Vice Chair for Supervision Michael Barr all set to speak later in the session.\n\nAdditionally, Fed chair Jerome Powell starts his two-day congressional testimony on Wednesday.\n\nThese officials could potentially hint at a July hike given the Fed signaled the possibility of more rate increases later in the year if inflation remained an issue.\n\nIn corporate news, shipping giant FedEx (NYSE:FDX) reports its quarterly results after the closing bell.\n\n4. Tide turning for aircraft manufacturers\n\nHard hit during the pandemic, aircraft manufacturers are starting to show signs of having turned the corner, with demand seemingly on the rise.\n\nAirbus (EPA:AIR) secured a historic deal on Monday, announcing an order for 500 narrowbody jets from Indian budget carrier IndiGo - the most jets ever bought by a single airline.\n\nThe deal beats Air India's combined purchase of 470 jets earlier this year as India's two largest carriers plan for a sharp expansion in regional travel demand.\n\nThis follows rival Boeing (NYSE:BA) stating over the weekend that it expects to increase production of its best-selling 737 MAX to 38 jets a month \"pretty soon,\" as the U.S. company looks to take advantage of demand ramping up.\n\nThat said, there are still likely to be problems ahead, with the head of Boeing Commercial Airplanes, Stan Deal, noting that the company is still likely to see supply chain instability, while Airbus CEO Guillaume Faury said that supply disruption remained a short-term issue.\n\n5. Oil mixed; demand concerns remain despite China cut\n\nCrude prices traded in a mixed fashion Tuesday, as U.S. traders returned from the long weekend to digest the Chinese rate cut.\n\nBy 04:50 ET, U.S. crude futures were 0.2% lower at $71.78 a barrel than Friday’s close, while the Brent contract rose 0.6% to $76.58 per barrel. There was no settlement in the WTI contract on Monday due to a public holiday in the United States.\n\nGrowing concerns over an economic recovery in China, the world’s largest crude importer, have weighed on oil prices of late, and the latest cut in the country’s benchmark loan prime rate [see above] only had a limited impact given it was largely anticipated by markets.\n\nTraders are also nervous ahead of Fed chair Jerome Powell’s two-day congressional testimony, starting Wednesday, given the central bank hinted at more interest rate hikes ahead even as it paused its year-long tightening cycle last week.\n\nThe prospect of rising U.S. rates and the associated impact on economic activity in the world’s largest energy consumer have weighed heavily on crude this year.\n\nU.S. crude inventories jumped almost 8 million barrels last week, way above forecast, while fuel stocks exceeded expectations as well, raising questions about energy demand during the peak summer travel period.\n\nRelated Articles\n\nChina rate cut, Alibaba shuffle, aircraft manufacturers - what's moving markets\n\nHSBC cuts China's GDP forecast to 5.3% on weak property, business outlook\n\nForeigners biggest buyers of Asian bonds in two years", "link": "https://finance.yahoo.com/news/china-rate-cut-alibaba-shuffle-050853641.html", "symbols": ["BA.MX", "BA.US", "BABA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "FDX.US", "GSPC.INDX", "IXIC.INDX"], "tags": [], "sentiment": {"polarity": -0.076, "neg": 0.072, "neu": 0.862, "pos": 0.066}}]