[{"date": "2023-11-13T23:30:00+00:00", "title": "Markets Stay Flat Ahead of CPI Tuesday Morning", "content": "You don’t get much flatter than this, folks. Market indices climbed out of the negative territory we saw in today’s pre-market by mid-day, and just sort of stayed there. The Dow was up +54 points, +0.16%, but this was pulled forward by a strong day from Boeing BA; the S&P 500 dipped -0.08%, the Nasdaq took a few profits, -0.22%, and the small-cap Russell 2000 gained +0.01%.\r\n\r\nThe good news for Boeing came this morning, when it was announced the aerospace giant is selling 125 777X wide-body jets to Emirates Airlines, the Dubai-based company that also owns flyDubai. This deal is reportedly worth $52 billion. (777X jets include both the 777-8 and 777-9 models.) Expectations are for the jets to be delivered in 2025. Aside from gaining +4% in today’s session, Boeing is up +15% from late-October lows for the year.\r\n\r\nOther than this, however, and with most of the marquee names for Q3 earnings season already reported, we’ve been pretty uneventful today — but for good reason: tomorrow morning brings us October Consumer Price Index (CPI) numbers, one of the most important gauges tracking domestic inflation. Month over month and headline year over year (aka the Inflation Rate) are expected to cool down further, helping bring down inflation the way the Fed intends with elevated interest rate levels.\r\n\r\nPerhaps most important of all may be core CPI year over year, which is expected to remain even with the previous month at +4.1%. This suggests stickier inflation when we strip out volatile food and energy costs, though we have come down considerably over the past 12 months — from +6.3% in October of last year. Yes, we’re still double where the Fed considers optimum inflation levels, but this steady, gradual move downward is a good indication that the efforts to cool the economy have not (thus far) dragged our economy into recession.\r\n\r\nHome Depot HD reports earnings Tuesday, kicking off Retail Week(s) toward the end of earnings season, and already within the holiday shopping quarter just begun. Target TGT and TJX Companies TJX report in Wednesday, and Walmart WMT, Macy’s M and others are out Thursday. By Friday of this week — even with another couple weeks or so of earnings season to go — we should have a good take on where the American consumer is situated going into the end of 2023.\r\n\r\nQuestions or comments about this article and/or author? Click here>>\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nMacy's, Inc. (M) : Free Stock Analysis Report\n\nTarget Corporation (TGT) : Free Stock Analysis Report\n\nThe TJX Companies, Inc. (TJX) : Free Stock Analysis Report\n\nWalmart Inc. (WMT) : Free Stock Analysis Report\n\nThe Home Depot, Inc. (HD) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/markets-stay-flat-ahead-cpi-233000375.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.015, "neu": 0.804, "pos": 0.181}}, {"date": "2023-11-13T22:25:30+00:00", "title": "S&amp;P 500 Gains and Losses Today: Boeing Shares Soar After Emirates Plane Purchase", "content": "The S&P 500 fell less than 0.1% on Monday, Nov. 13, 2023, after Moody's cut its outlook on U.S. credit and ahead of Tuesday's report on consumer inflation.\n\nContinue reading", "link": "https://finance.yahoo.com/m/3432531f-fb2e-3870-b706-62f0353473b2/s%26p-500-gains-and-losses.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "HS2.F", "HSIC.US", "TF7A.F", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA", "TSN.US"], "tags": [], "sentiment": {"polarity": 0.128, "neg": 0.064, "neu": 0.856, "pos": 0.08}}, {"date": "2023-11-13T21:56:23+00:00", "title": "Boeing Shares Surge After Securing a $52B Order from Emirates", "content": "Boeing shares jumped as Emirates announced that it was purchasing 95 Boeing aircraft worth $52 billion.\n\nContinue reading", "link": "https://finance.yahoo.com/m/cefe9b7a-9cfe-32a0-bc1c-d662ffde3bff/boeing-shares-surge-after.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0, "neu": 0.796, "pos": 0.204}}, {"date": "2023-11-13T21:35:10+00:00", "title": "US STOCKS-S&amp;P 500 takes a pause ahead of U.S inflation data", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window)\n\n*\n\nCPI October reading due early Tuesday\n\n*\n\nBoeing up on report China plans to end 737 deal freeze\n\n*\n\nMedtech companies rally after data on weight loss drug\n\n*\n\nDow up 0.16%, S&P dips 0.08%, Nasdaq down 0.22%\n\n(Updated with preliminary closing prices 04:00 p.m. ET/2100 GMT)\n\nBy Sinéad Carew and Sruthi Shankar\n\nNov 13 (Reuters) - The S&P 500 closed Monday's session slightly lower as investors held their breath before a crucial inflation reading that could provide clues as to how long the U.S. Federal Reserve will keep interest rates elevated.\n\nAfter the indexes enjoyed a solid rally on Friday, the market turned its focus on Monday to Consumer Price Index (CPI) data, due out Tuesday morning. Economists expect a headline increase of 3.3% for October, easing from 3.7% in September. But core prices are expected to be unchanged from the previous month. The CPI reading, along with labor market, \"are clearly in the driver's seat for what matters to financial markets, because it dictates where Fed policy goes from here,\" said Matt Stucky, chief portfolio manager for equities at Northwestern Mutual Wealth Management Company in Milwaukee, Wisconsin.\n\n\"The market has the expectation the Fed is done with interest rate hikes and for that to be true, you need to have continued progress on the inflation front,\" along with labor market cooling, he said.\n\nTraders have priced in a nearly 86% chance the Fed holds interest rates steady in December, according to the CME Group's FedWatch tool.\n\nWhile the CPI reading was the key issue keeping investors \"in a holding pattern\" on Monday, Michael O’Rourke, chief market strategist at JonesTrading in Stamford, Connecticut said they were also digesting a weaker U.S. credit outlook issued. Moody's late on Friday lowered its outlook on the U.S. credit rating to \"negative\" from \"stable\", citing large fiscal deficits and a decline in debt affordability.\n\nStory continues\n\nThis added to investor reluctance to make big decisions ahead of a weekend deadline that could potentially result in a U.S. government shutdown, O'Rourke said.\n\nU.S. House of Representatives Speaker Mike Johnson unveiled a Republican stopgap spending measure on Saturday aimed at averting a shutdown, but the measure quickly met opposition from lawmakers from both parties in Congress.\n\nHowever on Monday afternoon, top U.S. Senate Democrat Chuck Schumer expressed tentative support for Johnson's short-term funding bill that would keep the government open past the weekend.\n\nThe Dow Jones Industrial Average rose 54.77 points, or 0.16%, to 34,337.87, the S&P 500 lost 3.69 points, or 0.08%, to 4,411.55 and the Nasdaq Composite dropped 30.37 points, or 0.22%, to 13,767.74.\n\nThe major U.S. stock indexes had rebounded so far this month, fueled by a stronger-than-expected earnings season and hopes that U.S. interest rates are near their peak.\n\nAmong the S&P 500's 11 major sectors energy was the biggest gainer, ending up 0.7% while utilities was the biggest loser, falling 1.2%.\n\nHelping keep the Dow afloat, Boeing rallied 4% on Monday after Bloomberg News reported that China is considering resuming purchases of 737 Max aircraft.\n\nAnd, Dubai's Emirates placed an order for 90 more Boeing 777X jets at the opening of the Dubai Airshow on Monday.\n\nThe S&P healthcare index was the benchmark's second biggest percentage gainer, adding 0.6%. It's biggest percentage gainer was dialysis company Davita Inc, which rose 6.5%.\n\nOther medtech companies rallying included Insulet, which added 5.6% and Dexcom, up 4.6%, along with Abbott's 1.9% gain as analysts reacted to data about the cardiovascular benefits for Novo Nordisk's weight-loss drug Wegovy.\n\nWhile Tesla shares, finishing up more than 4%, added some support to the consumer discretionary index declines in heavyweight stocks such as Apple and Microsoft helped weigh down the S&P 500 technology index.\n\nAdvancing issues outnumbered declining ones on the NYSE by a 1.08-to-1 ratio; on Nasdaq, a 1.03-to-1 ratio favored decliners.\n\nThe S&P 500 posted 24 new 52-week highs and 7 new lows; the Nasdaq Composite recorded 52 new highs and 227 new lows.\n\nOn U.S. exchanges 9.34 billion shares changed hands compared with the 10.97 billion after for the last 20 sessions. (Reporting by Sinéad Carew in New York, Sruthi Shankar and Amruta Khandekar in Bengaluru; Editing by Maju Samuel and Aurora Ellis)", "link": "https://finance.yahoo.com/news/us-stocks-p-500-takes-213510075.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.031, "neu": 0.874, "pos": 0.094}}, {"date": "2023-11-13T21:10:00+00:00", "title": "These Stocks Moved the Most Today: Boeing, Tyson Foods, Plug Power, Monday.com, Illumina, Nvidia, and More", "content": "A report says China is considering lifting a commercial freeze on Boeing's 737 MAX, Monday.com raises full-year guidance, and Nvidia unveils its newest AI chip.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9b416fc6-f5fa-38d9-bdf4-9eb83c815930/these-stocks-moved-the-most.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "NONOF.US", "NOVA.F", "NOVO-B.CO", "NVO.US", "TF7A.F", "TSN.US"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0, "neu": 0.952, "pos": 0.048}}, {"date": "2023-11-13T20:15:59+00:00", "title": "Boeing to boost production capacity for Patriot missile sensors", "content": "(Reuters) - Boeing said on Monday it will increase Huntsville factory production capacity for sensors that are used to guide Patriot missiles to their targets to meet rising air and missile defense needs worldwide.\n\nThe facility with increased production capacity, expected to be operational in early 2027, will enable Boeing to increase annual PAC-3 (Patriot Advanced Capability-3) seeker production by more than 30%, the company said.\n\nThe move comes as the United States seeks to replenish its weapon stockpiles following shipments to Ukraine. Ukraine has used Patriot missiles in its effort to repel Russia's invasion.\n\nPatriot, which stands for Phased Array Tracking Radar for Intercept on Target, is considered one of the most advanced air defense systems in the U.S. arsenal. RTX manufactures radar and ground systems, and Lockheed Martin manufactures the interceptor missiles.\n\nBoeing has been awarded more than $2 billion in contracts for making the sensors over the past two years and has produced PAC-3 seekers as a subcontractor to Lockheed Martin for more than 20 years.\n\n(Reporting by Aatreyee Dasgupta in Bengaluru; Editing by Shounak Dasgupta)", "link": "https://finance.yahoo.com/news/boeing-boost-production-capacity-patriot-201559171.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.927, "neg": 0.012, "neu": 0.884, "pos": 0.105}}, {"date": "2023-11-13T19:33:04+00:00", "title": "US STOCKS-Wall Street wavers after rally, focus on inflation data", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window)\n\n*\n\nCPI, retail sales data due this week\n\n*\n\nBoeing up on report China plans to end 737 deal freeze\n\n*\n\nDow up 0.15%, S&P off 0.02%, Nasdaq down 0.09%\n\n(Updated at 02:18 p.m. ET/1918 GMT)\n\nBy Sinéad Carew and Sruthi Shankar\n\nNov 13 (Reuters) - Wall Street's three main stock indexes were making little progress in either direction on Monday as investors awaited a crucial inflation reading that could shape expectations around how long the U.S. Federal Reserve will keep interest rates elevated.\n\nAfter the indexes enjoyed a rally on Friday investors turned their focus to Consumer Price Index (CPI) data, due out Tuesday morning. Economists expect a headline increase of 3.3% for October, easing from 3.7% in September. But core prices are expected to be unchanged from the previous month. \"Everyone's kind of in a holding pattern waiting to see what happens with the inflation data in morning,\" Michael O’Rourke, chief market strategist at JonesTrading in Stamford, Connecticut.\n\nWhile the CPI reading was likely the biggest concern, O'Rourke said that investors were also still digesting Moody's weaker U.S. credit outlook issued after market close on Friday.\n\nFriday Moody's lowered its outlook on the U.S. credit rating to \"negative\" from \"stable\", citing large fiscal deficits and a decline in debt affordability.\n\nThis added to investor reluctance to make big decisions ahead of a weekend deadline that could result in a U.S. government shutdown, O'Rourke said.\n\nU.S. House of Representatives Speaker Mike Johnson unveiled a Republican stopgap spending measure on Saturday aimed at averting a shutdown, but the measure quickly met opposition from lawmakers from both parties in Congress.\n\nThe Dow Jones Industrial Average rose 52.18 points, or 0.15%, to 34,335.28, the S&P 500 lost 0.82 points, or 0.02%, to 4,414.42 and the Nasdaq Composite dropped 12.31 points, or 0.09%, to 13,785.80.\n\nStory continues\n\nThe major U.S. stock indexes had rebounded so far this month, fueled by a stronger-than-expected earnings season and hopes that U.S. interest rates are near their peak.\n\nTraders have priced in a nearly 86% chance that the Fed will hold interest rates in December, according to the CME Group's FedWatch tool.\n\nAmong the S&P 500's 11 major sectors energy was the biggest gainer, up 0.7%, while utilities was the biggest loser, down more than 1%.\n\nWhile Tesla shares, up more than 4%, added some support to the consumer discretionary index declines in heavyweight stocks such as Apple and Microsoft helped weigh down the S&P 500 technology index .\n\nHelping keep the Dow afloat, Boeing climbed 4.3% after Bloomberg News reported that China is considering resuming purchases of 737 Max aircraft.\n\nAnd, Dubai's Emirates placed an order for 90 more Boeing 777X jets at the opening of the Dubai Airshow on Monday.\n\nMedtech companies were rising with Dexcom adding 5%, Insulet climbing more than 6% and Abbott rising 2% as analysts commented on data about the cardiovascular benefits for Novo Nordisk's weight-loss drug Wegovy.\n\nAdvancing issues outnumbered declining ones on the NYSE by a 1.08-to-1 ratio; on Nasdaq, a 1.02-to-1 ratio favored decliners.\n\nThe S&P 500 posted 23 new 52-week highs and 7 new lows; the Nasdaq Composite recorded 44 new highs and 199 new lows. (Reporting by Sinéad Carew in New York, Sruthi Shankar and Amruta Khandekar in Bengaluru; Editing by Maju Samuel and Aurora Ellis)", "link": "https://finance.yahoo.com/news/us-stocks-wall-street-wavers-193304575.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX"], "tags": [], "sentiment": {"polarity": 0.983, "neg": 0.033, "neu": 0.881, "pos": 0.085}}, {"date": "2023-11-13T19:25:14+00:00", "title": "Boeing Stock Today: This Put Ratio Spread Could Put As Much As $600 In Your Wallet", "content": "A tent-shaped profit zone exists between 179 and 190 with the maximum gain occurring at 185, yielding around $600 in total profit.\n\nContinue reading", "link": "https://finance.yahoo.com/m/fef50423-cf38-3546-9476-3fcba13e6f8f/boeing-stock-today%3A-this-put.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.848, "neg": 0, "neu": 0.685, "pos": 0.315}}, {"date": "2023-11-13T17:40:27+00:00", "title": "Boeing shares take off on report that China may lift 737 freeze, bumper Dubai orders", "content": "(Reuters) - Shares of Boeing rose on Monday after a report said China was considering ending its freeze on purchases of the planemaker's best-selling 737 MAX aircraft after more than four years.\n\nThis, coupled with bumper jet orders from Middle Eastern airlines at the Dubai Airshow, sent Boeing shares up 4%. Supplier Spirit Aerosystems also rose 2.7%.\n\nChina is considering resuming purchases of Boeing's 737 MAX aircraft when the U.S. and Chinese presidents meet this week at the APEC summit, Bloomberg News reported on Sunday, citing people familiar with the matter.\n\nThe resumption of 737 orders from China would be meaningful to Boeing's bottom line over the next six to 18 months, said Thomas Hayes, chairman of hedge fund Great Hill Capital.\n\nDeliveries of Boeing's bestselling 737 MAX to Chinese airlines were halted following two deadly crashes.\n\nBoeing also secured orders for 125 widebody jets worth more than $50 billion from Emirates and its sister airline flydubai at the opening of the Dubai Airshow on Monday.\n\nDemand for the industry's biggest jets that dominated the region's airports is humming after a prolonged cyclical downturn followed by the damaging effect of COVID-19 on long-haul travel.\n\nCarriers have been placing orders with urgency as planemakers' backlogs have grown and as jet deliveries have been pushed out toward the end of the decade.\n\n\"Potential reopening of the 737 in China for Boeing and the contracts at the Dubai Airshow is all kind of the perfect combination of optimism and positive outlook that the stock has been needing for many months where it has underperformed,\" Hayes added.\n\nBoeing shares were trading at $205.15, compared with analysts' current median price target of $250, according to LSEG data.\n\n(Reporting by Shivansh Tiwary and Ananya Mariam Rajesh in Bengaluru; Editing by Shilpi Majumdar)", "link": "https://finance.yahoo.com/news/boeing-shares-off-report-china-174027643.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.969, "neg": 0.015, "neu": 0.886, "pos": 0.099}}, {"date": "2023-11-13T17:39:06+00:00", "title": "Midday Movers: Boeing and Tesla Gain, Tyson Falls", "content": "U.S. equities were up slightly at midday Monday, Nov. 13, 2023, continuing the rally that sent the major indexes up 1% or more on Friday.\n\nContinue reading", "link": "https://finance.yahoo.com/m/db33dc65-ca9c-3f36-9276-9a4e605b8536/midday-movers%3A-boeing-and.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "CHV.F", "CHV.XETRA", "CVX.MX", "CVX.US", "EXXO34.SA", "TF7A.F", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA", "TSN.US", "XOM.MX", "XOM.US", "XONA.F"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-11-13T17:36:44+00:00", "title": "US STOCKS-Wall Street wavers after rally, focus on inflation data", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window)\n\n*\n\nCPI, retail sales data due this week\n\n*\n\nBoeing up on report China plans to end 737 deal freeze\n\n*\n\nDow up 0.24%, S&P off 0.03%, Nasdaq up 0.21%\n\n(Updated at 12:12 p.m. ET/1712 GMT)\n\nBy Sruthi Shankar and Amruta Khandekar\n\nNov 13 (Reuters) - The main U.S. stock indexes were mixed on Monday as investors awaited a crucial inflation reading this week that could shape expectations around how long the Federal Reserve will keep interest rates elevated.\n\nThe cautious mood followed a strong session on Wall Street on Friday, when a rally in megacap stocks lifted the tech-heavy Nasdaq to a two-month peak and the benchmark S&P 500 to a near eight-week closing high.\n\nInvestors will focus on a slew of economic data and speeches from Fed officials this week for clues on the trajectory of U.S. interest rates amid growing expectations that the Fed is done hiking borrowing costs.\n\nData on Tuesday is expected to show headline consumer prices eased to 3.3% in October from 3.7% in September. However, core prices are seen unchanged from the previous month.\n\n\"The concern is that if you get hot CPI data, that puts the prospect of Fed raising rates at the next meeting back on the table,\" said Michael James, managing director of equity trading at Wedbush Securities in Los Angeles.\n\n\"Given the healthy slate of retail earnings that we have this week, along with the CPI data tomorrow, there's clearly risk to the rally's strength.\"\n\nThe major U.S. stock indexes have rebounded strongly this month, fueled by a stronger-than-expected earnings season and hopes that U.S. interest rates are near their peak.\n\nTraders have priced in a nearly 86% chance that the Fed will hold interest rates in December, according to the CME Group's FedWatch tool.\n\nAdding to jitters on Monday, Moody's\n\nlowered its outlook on the U.S. credit rating to \"negative\" from \"stable\", citing large fiscal deficits and a decline in debt affordability.\n\nStory continues\n\nU.S. House of Representatives Speaker Mike Johnson unveiled a Republican stopgap spending measure on Saturday aimed at averting a government shutdown on Friday, but the measure quickly ran into opposition from lawmakers from both parties in Congress.\n\nAt 12:12 p.m. ET, the Dow Jones Industrial Average was up 81.50 points, or 0.24%, at 34,364.60, the S&P 500 was down 1.13 points, or 0.03%, at 4,414.11, and the Nasdaq Composite was down 28.99 points, or 0.21%, at 13,769.12.\n\nHelping keep the Dow afloat, Boeing climbed 4.6% after Bloomberg News reported that China is considering resuming purchases of 737 Max aircraft.\n\nMeanwhile, Dubai's Emirates placed an order for 90 more Boeing 777X jets at the opening of the Dubai Airshow on Monday.\n\nMedtech companies\n\nsuch as Dexcom, Abbott and Insulet rose between 1.9% and 6.9% as analysts said data for cardiovascular benefits for Novo Nordisk's weight-loss drug Wegovy is better than feared for the companies.\n\nAdvancing issues outnumbered decliners by a 1.12-to-1 ratio on the NYSE. Declining issues outnumbered advancers for a 1.05-to-1 ratio on the Nasdaq.\n\nThe S&P index recorded 22 new 52-week highs and seven new lows, while the Nasdaq recorded 41 new highs and 182 new lows. (Reporting by Sruthi Shankar and Amruta Khandekar in Bengaluru; Editing by Maju Samuel)", "link": "https://finance.yahoo.com/news/us-stocks-wall-street-wavers-173644570.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX"], "tags": [], "sentiment": {"polarity": 0.927, "neg": 0.036, "neu": 0.891, "pos": 0.073}}, {"date": "2023-11-13T16:58:17+00:00", "title": "Stock Market Indexes Venture Into Positive Ground; Boeing Soars On Deal News", "content": "Stock market indexes took a tumble Monday after Moody's Investor's Service cut its rating on U.S. debt. Boeing surged on deal news.\n\nContinue reading", "link": "https://finance.yahoo.com/m/c78ae580-0bf7-36af-bc0c-97508713d832/stock-market-indexes-venture.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.557, "neg": 0.18, "neu": 0.82, "pos": 0}}, {"date": "2023-11-13T16:28:27+00:00", "title": "Why Boeing Stock Is Gaining Altitude Today", "content": "Boeing (NYSE: BA) received a massive order for one of its most important customers and could be in for a windfall as the U.S. tries to repair relations with China. The combination has investors taking a fresh look at the aerospace giant, sending shares of Boeing up about 4% as of 10:30 Eastern on Monday. Boeing investors have been flying through turbulence for years now.\n\nContinue reading", "link": "https://finance.yahoo.com/m/b44f6e83-623f-3f93-b1ee-1801911bfbe1/why-boeing-stock-is-gaining.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.677, "neg": 0, "neu": 0.903, "pos": 0.097}}, {"date": "2023-11-13T15:58:52+00:00", "title": "Middle Eastern carriers place orders worth tens of billions of dollars", "content": "Deals for over 100 aircraft on first day of Dubai air show cement industry rebound despite regional tensions\n\nContinue reading", "link": "https://finance.yahoo.com/m/e3736217-73e5-3764-8da1-7fe92d87d95d/middle-eastern-carriers-place.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.128, "neg": 0, "neu": 0.927, "pos": 0.073}}, {"date": "2023-11-13T15:40:00+00:00", "title": "Boeing Has a Flurry of Positives, But Is It Worth Chasing Here?", "content": "If President Xi of China has a productive meeting with President Biden, one key headline here or there will send this stock a long way... in either direction.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d29622cf-f9d4-3157-8ac4-c52bc043d035/boeing-has-a-flurry-of.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-11-13T15:15:56+00:00", "title": "Boeing stock soars on $52B Emirates deal", "content": "Boeing (BA) shares are climbing Monday after the company secured major deals with Emirates Airline. Emirates agreed to purchase 90 Boeing 777 jets valued at $52 billion, while sister airline Flydubai will add 30 Boeing 787 Dreamliners to its fleet in an $11 billion deal.\n\nThis deal comes as Emirates faces increasing competition in the Middle East, including from Turkish Airlines which plans to add 600 new planes to its fleet. The deals were announced at the Dubai Air Show amid declining travel demand in the region resulting from the Israel-Hamas conflict.\n\nYahoo Finance's Akiko Fujita breaks down all the details. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nVideo Transcript\n\n- Emirates and Boeing close a major deal for the airline to buy 90 Boeing 777X jets. The deal is estimated to be worth close to $52 billion. Good news for Boeing. Let's get right over to Akiko Fujita has more on this one. Kiko.\n\nAKIKO FUJITA: Good morning to you, Brian. While the Dubai air show being closely watched as a good gauge for the demand in the airline industry, aviation industry in the face of global economic slowdown. It's also seen as a good gauge for what travel looks like in the region against the backdrop of that war between Israel and Hamas. That order for those wide body 777 jets seen as not just a win for Boeing, but also for Emirates, which faces increasing competition in its own back yard.\n\nYou pointed to those numbers there. Emirates already the largest buyer of those 777 Jets. The airline has not confirmed the number of jets ordered, but Reuters and AP reporting the carriers adding 90 new jets to that fleet and a price tag of roughly $52 billion.\n\nThat is a huge boost in confidence to a Boeing program that has been marred by a lot of delays. We're talking about a delivery now expected in 2025. That is five years later than initially scheduled. Its sister airline, we're talking about Emirates sister airline, FlyDubai, also expected to announce an order here, adding to the total of its own fleet with 30 Boeing, 787-9 Dreamliners. That is worth $11 billion.\n\nStory continues\n\nYou see what the stock is doing there in pre-market certainly on the back of these big announcements. We should point out this order comes as Emirates faces increasing competition in its own backyard. Turkish Airlines, its largest competitor, also looking to make its own splash with a reported 355 order for Airbus Jets as part of an overall 600 fleet buy. That was reported by Turkey's state-run news agency over the weekend.\n\nAll of these airlines looking to feed travel demand that has seen a big bounce back since the lows of the pandemic. But we should point out this Dubai air show coming against the backdrop of this ongoing war between Israel and Hamas with no end in sight, there certainly going to be concerns about what that does to demand in the region.\n\nBookings to the Middle East have dropped off 26% since October 7, according to travel firm Forwardkeys. But, guys, the expectation, at least among aviation analysts right now, is that drop off is likely going to be short term. But of course, this all depends on how long that conflict extends.\n\n- Akiko, while we have you, several kind of press releases that have rolled across for Boeing this morning seems like it's already been a pretty successful air show for themselves. Royal Air, Maroc, Royal Jordanian, you've also got FlyDubia ordering 30 Boeing, 787. So a mix of the 787 with the 777 here.\n\nWhat more can we expect for this to be one of the areas perhaps that at least strengthens some of the international business at a time where, yes, you did lay out that there is still this geopolitical conflict and that risk that many CEOs are trying to navigate through?\n\nAKIKO FUJITA: Yeah. Let's put this geopolitical issue aside because there's no way to really gauge how long this extends. Reality is for Boeing, they are looking to really bounce back from the lows in the pandemic. But it's sort of been twofold, as you guys have been reporting out.\n\nBoeing having its own issues with its own program. We're not just talking about the 777, but the Dreamliners as well. That has been extended years out.\n\nSo these orders that have been coming through in the Dubai air show certainly a big boost of confidence. And by the way, this is the second largest air show globally. So that's a big boost of confidence, a big announcement on the part of Boeing being able to rack in some of those orders that have been coming through.\n\nCertainly going to be watching over the next few days to see if any other orders come through as well. But as we pointed out, the Boeing stock up more than 4% pre market.\n\n- Yeah. Investors trying to price this in as best they can, even if those orders are set to be delivered over years and in some cases decades as well.", "link": "https://finance.yahoo.com/video/boeing-stock-soars-52b-emirates-151556683.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.033, "neu": 0.858, "pos": 0.109}}, {"date": "2023-11-13T15:13:02+00:00", "title": "US STOCKS-Wall St falls as megacaps drag ahead of inflation data", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nCPI, retail sales data due this week\n\n*\n\nBoeing up on report China plans to end 737 deal freeze\n\n*\n\nIndexes down: Dow 0.06%, S&P 0.43%, Nasdaq 0.70%\n\n(Updated at 9:41 a.m. ET/1341 GMT)\n\nBy Sruthi Shankar and Amruta Khandekar\n\nNov 13 (Reuters) - Wall Street's main indexes slipped on Monday as investors awaited a crucial inflation reading and other economic data this week that could shape expectations around how long the Federal Reserve will keep interest rates elevated.\n\nMegacap growth stocks were a big drag, as the benchmark U.S. 10-year Treasury yield rose. Shares of Microsoft, Amazon.com and Apple fell between 0.5% and 1.5% in early trade.\n\nEight of the 11 major S&P 500 sectors were in the red, with rate-sensitive real estate stocks down 1.2% and leading declines.\n\nThis week's economic data as well as speeches from Fed officials will provide clues on the trajectory of interest rates amid growing expectations that the Fed is done hiking borrowing costs.\n\nA report on Tuesday is expected to show headline consumer prices eased to 3.3% in October from 3.7% in September. However, core prices are seen unchanged from the previous month.\n\n\"If the year-over-year (number) continues to show a decline, then that seals the fact that the Fed is not going to raise in December and most likely they're done with the hiking campaign,\" said Peter Cardillo, chief market economist at Spartan Capital Securities.\n\nThe major U.S. stock indexes have rebounded strongly this month, fueled by a stronger-than-expected earnings season and on hopes that U.S. interest rates are near their peak.\n\nThe benchmark S&P 500 closed at near eight-week highs on Friday, while the tech-heavy Nasdaq hit a two-month peak.\n\nTraders have priced in a nearly 86% chance that the Fed will hold interest rates in December, but have pushed back bets of rate cuts to June from May, according to the CME Group's FedWatch tool.\n\nStory continues\n\nAdding to the cautious mood, Moody's\n\nlowered its outlook on the U.S. credit rating to \"negative\" from \"stable\", citing large fiscal deficits and a decline in debt affordability.\n\n\"With the absence of macro news and the strong rally that we had on Friday, the downgrade and the anticipation of the inflation data is inducing some selling this morning,\" Cardillo said.\n\nU.S. House of Representatives Speaker Mike Johnson unveiled a Republican stopgap spending measure on Saturday aimed at averting a government shutdown on Friday, but the measure quickly ran into opposition from lawmakers from both parties in Congress.\n\nAt 9:41 a.m. ET, the Dow Jones Industrial Average was down 20.28 points, or 0.06%, at 34,262.82, the S&P 500 was down 19.10 points, or 0.43%, at 4,396.14, and the Nasdaq Composite was down 96.40 points, or 0.70%, at 13,701.71.\n\nMedtech companies such as Dexcom, Abbott and Insulet rose between 2% and 5% as analysts said data for cardiovascular benefits for Novo Nordisk's weight-loss drug Wegovy is better than feared for the companies.\n\nCushioning the Dow, Boeing climbed 5.1% after Bloomberg News reported that China is considering resuming purchases of 737 Max aircraft.\n\nDeclining issues outnumbered advancers for a 2.49-to-1 ratio on the NYSE and for a 2.18-to-1 ratio on the Nasdaq.\n\nThe S&P index recorded 11 new 52-week highs and one new low, while the Nasdaq recorded 19 new highs and 82 new lows. (Reporting by Sruthi Shankar and Amruta Khandekar in Bengaluru; Editing by Maju Samuel)", "link": "https://finance.yahoo.com/news/us-stocks-wall-st-falls-151302247.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX"], "tags": [], "sentiment": {"polarity": 0.953, "neg": 0.035, "neu": 0.89, "pos": 0.075}}, {"date": "2023-11-13T14:46:00+00:00", "title": "Boeing Stock Gets a Lift on New Orders, China Hopes", "content": "Shares of Boeing are up 4% early Monday on a big jet order and hopes that it will resume selling planes to China. Dubai-based [Emirates Airline says it’s buying 95 aircraft](https://www.wsj.com/business/airlines/emirates-airline-orders-95-boeing-jets-worth-52-billion-b285ab9f) from Boeing.\n\nContinue reading", "link": "https://finance.yahoo.com/m/2b52f876-36ed-36a7-9d2b-bfe4dd3cde05/boeing-stock-gets-a-lift-on.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.612, "neg": 0, "neu": 0.865, "pos": 0.135}}, {"date": "2023-11-13T14:42:31+00:00", "title": "Dow Jones Falls On Moody's Debt Warning; Boeing Stock Surges On $52 Billion Order", "content": "The Dow Jones Industrial Average dropped Monday on Moody's U.S. debt warning. Aerospace giant Boeing surged on a $52 billion order.\n\nContinue reading", "link": "https://finance.yahoo.com/m/5863024f-43a4-307c-86ff-d9b9347c0210/dow-jones-falls-on-moody%27s.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "IXIC.INDX", "TL0.F", "TL0.XETRA", "TSLA.MX"], "tags": [], "sentiment": {"polarity": -0.599, "neg": 0.197, "neu": 0.803, "pos": 0}}, {"date": "2023-11-13T14:28:26+00:00", "title": "Boeing Stock Soars On Dubai Orders, $52 Billion Deal, China Commitment Rumors", "content": "Boeing stock leapt Monday as the Dow Jones jet maker secures big deals at the Dubai Airshow. China rumored to end freeze on Boeing orders.\n\nContinue reading", "link": "https://finance.yahoo.com/m/82bf8d6d-3414-3184-861c-6c402a6ba177/boeing-stock-soars-on-dubai.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.361, "neg": 0, "neu": 0.877, "pos": 0.123}}, {"date": "2023-11-13T13:51:20+00:00", "title": "US STOCKS-Wall St set to dip at open, focus on inflation data", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nKey economic data releases due this week\n\n*\n\nBoeing up on report China plans to end 737 deal freeze\n\n*\n\nTyson Foods drops after downbeat forecast\n\n*\n\nFutures down: Dow 0.10%, S&P 0.14%, Nasdaq 0.19%\n\n(Updated at 8:33 a.m. ET)\n\nBy Sruthi Shankar and Amruta Khandekar\n\nNov 13 (Reuters) - Wall Street was set to open marginally lower on Monday as investors awaited a crucial inflation reading and other economic data this week that could shape expectations around how long the Federal Reserve will keep interest rates elevated.\n\nThe benchmark S&P 500 and the blue-chip Dow closed at near eight-week highs on Friday, while the tech-heavy Nasdaq Composite hit a two-month peak as megacap stocks rallied on the back of easing Treasury yields.\n\nInvestors will focus on a slew of economic data this week as well as speeches from Fed officials for clues on the trajectory of interest rates amid growing expectations that the Fed is done hiking borrowing costs.\n\nData on Tuesday is expected to show headline consumer prices eased to 3.3% in October from 3.7% in September. However, core prices that exclude volatile food and energy components are seen unchanged from the previous month.\n\n\"If the year-over-year (number) continues to show a decline, then that seals the fact that the Fed is not going to raise in December and most likely they're done with the hiking campaign,\" said Peter Cardillo, chief market economist at Spartan Capital Securities.\n\nThe major U.S. stock indexes have rebounded strongly this month, fueled by a stronger-than-expected earnings season and on hopes that U.S. interest rates are near their peak, though investors have pushed back bets of rate cuts to June from May.\n\nTraders have priced in a nearly 86% chance that the Fed will hold interest rates in December.\n\nAdding to early weakness on Monday, Moody's\n\nlowered its outlook on the U.S. credit rating to \"negative\" from \"stable\", citing large fiscal deficits and a decline in debt affordability.\n\nStory continues\n\n\"With the absence of macro news and the strong rally that we had on Friday, the downgrade and the anticipation of the inflation data is inducing some selling this morning,\" Cardillo said.\n\nMoody's move, which follows a rating downgrade of the sovereign by Fitch this year, had little impact on the Treasury market.\n\nThe benchmark U.S. 10-year Treasury yield was largely steady at 4.640%, below a 16-year peak hit last month partly due to concerns over government spending.\n\nU.S. House of Representatives Speaker Mike Johnson unveiled a Republican stopgap spending measure on Saturday aimed at averting a government shutdown on Friday, but the measure quickly ran into opposition from lawmakers from both parties in Congress.\n\nAt 8:33 a.m. ET, Dow e-minis were down 33 points, or 0.1%, S&P 500 e-minis were down 6 points, or 0.14%, and Nasdaq 100 e-minis were down 30 points, or 0.19%.\n\nBoeing climbed 3.4% premarket after Bloomberg News reported that China is considering resuming purchases of 737 Max aircraft when the U.S. and Chinese presidents meet this week at the APEC summit.\n\nMeanwhile, Dubai's Emirates placed an order for 90 more Boeing 777X jets at the opening of the Dubai Airshow.\n\nTyson Foods fell 3.6% after the U.S. meatpacker issued a downbeat revenue forecast for next fiscal year after falling chicken and pork prices and slowing demand for its beef products hurt fourth-quarter sales. (Reporting by Sruthi Shankar and Amruta Khandekar in Bengaluru; Editing by Maju Samuel)", "link": "https://finance.yahoo.com/news/us-stocks-wall-st-set-135120879.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "GSPC.INDX", "IXIC.INDX", "TF7A.F", "TSN.US"], "tags": [], "sentiment": {"polarity": 0.855, "neg": 0.032, "neu": 0.908, "pos": 0.061}}, {"date": "2023-11-13T13:14:58+00:00", "title": "Boeing goes big in Dubai on first day of show while Airbus waits", "content": "(Bloomberg) — Boeing Co. (BA) opened the Dubai Airshow with a flurry of orders led by a whopping $52 billion widebody commitment from Emirates Airline, while teasing the possibility of more as China moves closer to a major deal for the 737 Max.\n\nMost Read from Bloomberg\n\nIceland Girds for Volcanic Eruption That Could Wipe Out Town China Weighs Ending Freeze on Boeing With 737 Max Deal in US Biden Has Wiped Away $127 Billion in Student Loan Debt Xi Jinping’s ‘Old Friends’ From Iowa Get a Dinner Invitation Sunak Fires Braverman and Names David Cameron Foreign Secretary\n\nShares of the US planemaker advanced 3.3% in premarket US trading after the world’s largest international carrier said it would buy an additional 90 of Boeing’s coming 777X model and five more 787s, confirming a Bloomberg News report. Emirates is already the biggest buyer of the massive twin-engine 777X, which sports wingtips that fold to make it easier to fit through airports.\n\nBoeing also scored wins with a narrowbody order for as many as 90 of its top-selling 737 Max jets at Turkey’s SunExpress, and 18 of the model from EgyptAir. The US manufacturer picked up more commitments for the hot-selling 787 widebody, with Royal Jordanian adding a handful of Dreamliners and FlyDubai picking up 30 of the model — the first time the carrier has bought larger twin-aisle aircraft.\n\n“It’s pretty darn big,” Boeing commercial chief Stan Deal said of the order flow in Dubai. “I’m not counting my chickens yet, and it’s not over. But it’s a big one.”\n\nAirbus talks\n\nAirbus, meanwhile, made do with a midsize A220 narrowbody order from AirBaltic and a confirmation from Turkish Airlines that the two sides are close on a major aircraft order. But there was no megadeal, either from Turkish or from Emirates, as talks around engines supplied by Rolls-Royce Holdings Plc proved to be a sticking point to a deal with the Gulf carrier.\n\nDeal spent much of the day shuttling back and forth between Boeing’s offices at the show, where airline executives and prospective customers mingle to get deals over the line, and the main press center where he announced the accords in rapid succession. Emirates made by far the biggest impact with its top-up order, which massively extends the airline’s already huge backlog of widebody planes.\n\nStory continues\n\n“Demand for travel on Emirates is one of the strongest it’s ever been in its history,” the airline’s president, Tim Clark, said in an interview. “If we had those aircraft we ordered today in place tomorrow, we’d fill them up. It’s as strong as that.”\n\nWaiting for planes\n\nBoeing’s haul on the first day pushes it into territory last seen a decade ago, when Emirates placed its first massive order for the 777X. The company’s flagship aircraft has been severely delayed by several years amid certification issues, though Deal said the current timeline that sees an entry into service in 2025 is attainable. A Boeing 777X at the Farnborough International Airshow in 2022. REUTERS/Matthew Childs (Matthew Childs / reuters)\n\nThe action on the first day continues the dominant order pattern this year among airlines rushing to place giant orders as delivery slots become scarce. While that’s translated into ever-longer order books and backlogs for Boeing and Airbus, some industry experts have begun cautioning that not all deals will necessarily make it over the finish line.\n\n“There’s been a massive amount of activity from airlines to line up slots,” said Steven Udvar-Hazy, who runs Air Lease Corp. and helped place a deal on Monday for EgyptAir for 737 single-aisle Boeings. “Time will tell whether all these aircraft will deliver on time, and whether the airlines that ordered them will be able to absorb them at a later time. It would not be surprising if some of these aircraft would get deferred into a later time frame.”\n\nBoeing’s profitable run contrasts with Airbus’s first day of the show, which turned into a more muted performance. The European planemaker has few available delivery slots, and a tougher negotiating stance by engine supplier Rolls under its new CEO has made it harder to bring widebody deals across the finish line.\n\nOver the weekend, Airbus looked to have the upper hand touting a giant order from Turkish Airlines for close to 350 aircraft. The accord hasn’t materialize at the event, though Airbus and its customer confirmed that they’d reached an accord in principle, with final details still be hashed out.\n\nAn order from Emirates, which likes to balance its fleet between the two main rivals, was also elusive for Airbus on the first day. Emirates has said that it’s in the market for more widebody aircraft, including Airbus aircraft. But Clark signaled that talks with Rolls remain a sticking point.\n\n“We’ve still got to get over the last jump for the commercial terms of this, and we have to get through some of the engine issues that exist at the moment,” Clark said.\n\nTalks with China\n\nMore good news, meanwhile, beckons for Boeing as it emerges from several years of shaky performance and makes strides in regaining the trust of major customers like Emirates. The new agreement brings the Gulf carrier’s commitment to the 777X to 205 planes, giving the program a shot of support after years of delays.\n\nBoeing has also made progress in its effort to open the door to further jet sales in China. Deal said he’s optimistic about talks between presidents Xi Jinping of China and Joe Biden of the US scheduled to take place in San Francisco this week.\n\nBloomberg News reported earlier that China is considering lifting a freeze on jet purchases from the US planemaker as a signal of recent thaw between the two nations.\n\n—With assistance from Julie Johnsson and Guy Johnson.\n\nMost Read from Bloomberg Businessweek\n\nEverything Biden and Xi Need From Their Summit—Starting With Each Other Can a Triangle-Shaped Jet Cut Fuel Consumption in Half? A German Startup Races Google to Develop a Universal Translator US Veterans Got a Mortgage Break. Now They’re Losing Their Homes Elon Musk’s Brain Implant Startup Is Ready to Start Surgery\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/boeing-goes-big-dubai-first-131458137.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.02, "neu": 0.908, "pos": 0.072}}, {"date": "2023-11-13T12:51:35+00:00", "title": "Midday movers: Boeing, HP, Micron and more", "content": "Investing.com -- U.S. stocks were wobbling on Monday, with last week’s positive sentiment diluted by Moody’s rating agency downgrading its outlook for the U.S. long-term credit rating.\n\nHere are some of the biggest U.S. stock movers today:\n\nBoeing (NYSE:BA) stock rose 4.3% after Bloomberg News reported that China is mulling potentially resuming purchases of the planemaker's fast-selling 737 Max jets.\n\nHP (NYSE:HPQ) stock rose 0.6% after Citigroup upgraded the computer hardware manufacturer to ‘buy’ from ‘neutral’, citing a favorable valuation, substantial cost reductions and the possibility for AI integration on PCs.\n\nMicron (NASDAQ:MU) stock fell 1.3% after Chinese chipmaker Yangtze Memory Technologies filed a lawsuit against the U.S. rival alleging infringement of eight of its patents.\n\nRobinhood (NASDAQ:HOOD) stock rose 1.7% after Google-parent Alphabet (NASDAQ:GOOGL) said it had dissolved its stake in the trading app operator, a few months after the tech giant slashed its stake in the company by nearly 90%.\n\nNovo Nordisk (NYSE:NVO) stock rose 0.3% after the drugmaker presented data over the weekend showing that the heart protective benefits of its popular obesity drug Wegovy are not solely due to weight loss.\n\nPlug Power  (NASDAQ:PLUG) stock rose 2.2%, continuing Friday’s hefty losses after the hydrogen fuel-cell firm pulled its 2023 guidance, citing “unprecedented supply challenges.”\n\nTyson Foods  (NYSE:TSN) stock fell 2.8% after the food processor announced the closing of two of its case-ready meat production facilities in the US.\n\nCapital Product (NASDAQ:CPLP) stock rose 3.9% after the transport tanker and vessel owner said it has acquired 11 newbuild LNG carriers from Capital Maritime for $3.1 billion.\n\n--Peter Nurse contributed to this report\n\nRelated Articles\n\nMidday movers: Boeing, HP, Micron and more\n\nExclusive-Bain eyes Varsity Brands cash-out at $6 billion-plus valuation -sources\n\nSenator asks Treasury to bar Chinese battery firms, minerals from US EV tax credits", "link": "https://finance.yahoo.com/news/boeing-hp-novo-nordisk-rise-073137733.html", "symbols": ["7HP.F", "7HP.STU", "7HP.XETRA", "BA.US", "CPLP.US", "GOOGL.US", "HOOD.US", "HPQ.US", "MTE.F", "MTE.XETRA", "MU.MX", "MU.US", "MUTC34.SA", "NONOF.US", "NOVA.F", "NOVO-B.CO", "NVO.US"], "tags": [], "sentiment": {"polarity": 0.92, "neg": 0.037, "neu": 0.884, "pos": 0.079}}, {"date": "2023-11-13T12:33:36+00:00", "title": "US STOCKS-Futures dip as focus shifts to inflation data", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nBoeing up on report China plans to end 737 deal freeze\n\n*\n\nEli Lilly gains as Novo's Wegovy shows heart benefits\n\n*\n\nFutures down: Dow 0.08%, S&P 0.17%, Nasdaq 0.20%\n\n(Updated at 7:08 a.m. ET/1208 GMT)\n\nBy Sruthi Shankar and Amruta Khandekar\n\nNov 13 (Reuters) - U.S. stock index futures edged lower on Monday as investors awaited a crucial inflation reading and other economic data this week that could shape expectations around how long the Federal Reserve will keep interest rates elevated.\n\nThe benchmark S&P 500 and the blue-chip Dow closed at near eight-week highs on Friday, while the tech-heavy Nasdaq Composite hit a two-month peak as megacap stocks rallied on the back of easing Treasury yields.\n\nInvestors will focus on a slew of economic data this week as well as speeches from Fed officials for clues on the trajectory of interest rates amid growing expectations that the Fed is done hiking borrowing costs.\n\nInflation data on Tuesday is expected to show headline consumer prices eased to 3.3% in October from 3.7% in September. However, core rates are seen unchanged from the previous month.\n\n\"We think that U.S. CPI inflation figures tomorrow are unlikely to challenge the market conviction that there is no more need for further tightening by the Fed,\" Unicredit analysts said in a note.\n\nThe major U.S. stock indexes have rebounded strongly this month, fueled by a stronger-than-expected earnings season and on hopes that U.S. interest rates are near their peak, though investors have pushed back bets of rate cuts to June from May.\n\nAdding to Monday's jitters, Moody's lowered its outlook on the U.S. credit rating to \"negative\" from \"stable\", citing large fiscal deficits and a decline in debt affordability.\n\nThe move, which follows a rating downgrade of the sovereign by Fitch this year, had little impact on the Treasury market.\n\nStory continues\n\nThe benchmark U.S. 10-year Treasury yield was largely steady at 4.632%, below a 16-year peak hit last month partly due to concerns over government spending.\n\nU.S. House of Representatives Speaker Mike Johnson unveiled a Republican stopgap spending measure on Saturday aimed at averting a government shutdown on Friday, but the measure quickly ran into opposition from lawmakers from both parties in Congress.\n\nAt 7:08 a.m. ET, Dow e-minis were down 28 points, or 0.08%, S&P 500 e-minis were down 7.75 points, or 0.17%, and Nasdaq 100 e-minis were down 31.25 points, or 0.2%.\n\nBoeing climbed 3.7% premarket after Bloomberg News reported that China is considering resuming purchases of 737 Max aircraft when the U.S. and Chinese presidents meet this week at the APEC summit.\n\nMeanwhile, Dubai's Emirates placed an order for 90 more Boeing 777X jets at the opening of the Dubai Airshow.\n\nMicron Technology slipped 0.8% after Chinese chipmaker Yangtze Memory Technologies Co (YMTC) filed a lawsuit against the U.S. rival alleging infringement of eight of its patents.\n\nEli Lilly rose 1% after rival Novo Nordisk said heart protective benefits of its Wegovy obesity treatment are due to more than weight-loss alone. (Reporting by Sruthi Shankar and Amruta Khandekar in Bengaluru; Editing by Maju Samuel)", "link": "https://finance.yahoo.com/news/us-stocks-futures-dip-focus-123336914.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "GSPC.INDX", "IXIC.INDX", "LILY34.SA", "LLY.F", "LLY.MX", "LLY.US", "LLY.XETRA"], "tags": [], "sentiment": {"polarity": 0.954, "neg": 0.033, "neu": 0.889, "pos": 0.078}}, {"date": "2023-11-13T12:32:00+00:00", "title": "Royal Air Maroc Confirms Order for Two Boeing 787 Dreamliners", "content": "- 787-9 jets support the North African airline's plans to modernize fleet\n\n- Boeing and Morocco's flag carrier enjoy more than 55 years of partnership\n\nDUBAI, United Arab Emirates, Nov. 13, 2023 /PRNewswire/ -- Boeing [NYSE: BA] and Royal Air Maroc announced today the North African carrier placed a repeat order for the 787 Dreamliner, confirming two 787-9s in its order book as the airline grows its widebody fleet. The carrier, which currently operates nine Dreamliners, leverages the 787 family's efficiency and flexibility to expand its long-haul network. Boeing and Royal Air Maroc announced today the North African carrier placed a repeat order for the 787 Dreamliner, confirming two 787-9s in its order book as the airline grows its widebody fleet.\n\n\"The two Boeing 787-9 Dreamliners will enable Royal Air Maroc to expand in the short-term its long-haul network in response to the highly favorable market conditions in 2023,\" said Abdelhamid Addou, Chairman and Chief Executive Officer, Royal Air Maroc. \"Simultaneously, the company is actively pursuing a significant tender to quadruple the fleet before 2037.\"\n\nRoyal Air Maroc has added to its widebody airplane count with a mix of 787-8s and 787-9s over the last nine years. This order was previously unidentified on Boeing's Orders & Deliveries website.\n\n\"The 787 Dreamliner is perfectly suited to support Royal Air Maroc's growth and modernization plans,\" said Brad McMullen, Boeing senior vice president of Commercial Sales and Marketing. \"Boeing's relationship with the airline spans more than five decades, and we look forward to more opportunities to strengthen our partnership with Royal Air Maroc.\"\n\nRoyal Air Maroc, the national carrier of Morocco, is a member of the oneworld Alliance and flies to 82 destinations in 41 territories around the world, including frequent departures to the biggest capitals in Europe, Africa, North America and the Middle East. Its fleet of Boeing airplanes includes 737s, in addition to 787s.\n\nSince revenue service began in 2011, the 787 family has launched more than 380 new nonstop routes around the world and reduces fuel use and emissions by 25% compared to the airplanes it replaces. Passengers enjoy a better experience with the largest windows of any jet, air that is more humid and pressurized at a lower cabin altitude for greater comfort, large overhead bins, soothing LED lighting, and technology that senses and counters turbulence for a smoother ride.\n\nStory continues\n\nAs a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity. Join our team and find your purpose at boeing.com/careers.\n\nContact\r\nNadine Fanous\r\n+971-56-422-9051\r\nnadine.fanous@boeing.com\n\nBoeing Media Relations\r\nmedia@boeing.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/royal-air-maroc-confirms-order-for-two-boeing-787-dreamliners-301986035.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/royal-air-maroc-confirms-order-123200439.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.004, "neu": 0.843, "pos": 0.153}}, {"date": "2023-11-13T12:26:27+00:00", "title": "UPDATE 1-Royal Jordanian CEO says war in Gaza could hurt profitability", "content": "(Adds Royal Jordanian CEO comments, EgyptAir Chairman comments)\n\nDUBAI, Nov 13 (Reuters) - The chief executive of Royal Jordanian said on Monday the Israel-Hamas war in Gaza was leading to some cancellations in bookings and making it operate longer, costlier flights, which could hurt the airline's profitability in the fourth quarter.\n\nThe airline made a nine-month profit of 10.7 million Jordanian dinars ($15.1 million) and prior to the war expected the last quarter to increase profitability.\n\nChief Executive Samer Majali said the airline was no longer sure, warning that costs had increased substantially as it had to fly longer flights to avoid neighbouring airspace.\n\n\"We've seen some reduction in traffic and obviously we have additional costs because we have to fly longer routes to avoid the conflict areas,\" he told journalists at the Dubai Airshow.\n\nTravellers have cancelled bookings to the region amid fears the war, now in its fifth week, could spillover into a regional conflict. Majali, however, urged people to visit Jordan, which he described as an \"oasis of stability\".\n\nThe airline signed an agreement at the Dubai Airshow with Boeing to purchase six 787-9 Dreamliner jets, of which Majali said two were of the same aircraft that had earlier been cancelled and now reordered.\n\nEgyptAir Chairman Yehia Zakaria similarly said that the airline was seeing some bookings cancelled, which like Royal Jordanian, were typically those made by foreign tourists.\n\n\"It's not more than 10%,\" Zakaria said of the cancellations, describing it as a \"very low\" and \"not considerable\".\n\nHe said that the cancellations were not at a critical level and that tourists were still visiting Egypt, though certain destinations were being avoided due to the war in Gaza.\n\nJordan and Egypt both neighbour Israel, while Egypt also shares a border with Gaza.\n\nEgyptAir signed a leasing agreement with Air Lease Corp at the Dubai Airshow for 18 new Boeing 737 MAX 8 aircraft. ($1 = 0.7098 Jordanian dinars) (Reporting by Alexander Cornwell; editing by Jason Neely and David Evans)", "link": "https://finance.yahoo.com/news/1-royal-jordanian-ceo-says-122627311.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.957, "neg": 0.125, "neu": 0.798, "pos": 0.077}}, {"date": "2023-11-13T12:22:57+00:00", "title": "5 Things to Know Before Markets Open", "content": "Stock futures were lower after Moody’s downgraded the U.S. credit outlook and Boeing shares moved higher following reports China could agree to a 737 Max deal. Here’s what investors need to know today.\n\nContinue reading", "link": "https://finance.yahoo.com/m/fb69e908-8406-3466-be82-bae43da3b4e4/5-things-to-know-before.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "NONOF.US", "NOVA.F", "NOVO-B.CO", "NVO.US"], "tags": [], "sentiment": {"polarity": 0.625, "neg": 0.056, "neu": 0.759, "pos": 0.185}}, {"date": "2023-11-13T11:55:00+00:00", "title": "Royal Jordanian Grows its Long-Haul Fleet With Order for Boeing 787-9 Dreamliners", "content": "- Latest order for fuel-efficient 787s will support the airline's growth plans\n\n- Royal Jordanian was the first in the Middle East to order the 787 Dreamliner\n\nDUBAI, United Arab Emirates, Nov. 13, 2023 /PRNewswire/ -- Boeing [NYSE: BA] and Royal Jordanian announced today an order for four 787-9 Dreamliner jets as the airline expands and modernizes its widebody fleet. Jordan's flag carrier also reconfirmed at the Dubai Airshow a previous order for two 787-9s, bringing its total 787-9 backlog to six. Boeing and Royal Jordanian announced today an order for four 787-9 Dreamliner jets as the airline expands and modernizes its widebody fleet.\n\n\"Our decision to add the 787-9 Dreamliners to our fleet is a testament to our dedication to providing an unparalleled travel experience,\" said Samer Majali, vice chairman and CEO of Royal Jordanian. \"This move aligns seamlessly with our broader strategy of fleet modernization, emphasizing fuel efficiency, sustainability and passenger comfort. As we embark on this journey, we are confident that the Dreamliner's cutting-edge technology will play a pivotal role in elevating our operational capabilities.\"\n\nBuilding on Royal Jordanian's fleet of seven 787-8 airplanes, the addition of another member of the Dreamliner family will enable the airline to fly more passengers and cargo farther. The 787-9 can fly 296 passengers 14,010 km (7,565 nautical miles), building on routes first opened by the 787-8.\n\n\"Royal Jordanian, having been the first in the Middle East to order the 787 over 16 years ago, continues to lead in adopting advancements in aviation,\" said Majali. \"The airline's current fleet of seven 787-8 Dreamliners has proven successful in connecting Amman to major global destinations. The additional order underscores Royal Jordanian's forward-looking approach and commitment to meeting the growing demand for long-haul travel.\"\n\n\"This order for additional 787s is a testament to Royal Jordanian's longstanding commitment to the market-leading capabilities of the Dreamliner,\" said Stan Deal, president and CEO of Boeing Commercial Airplanes. \"We are confident Royal Jordanian will profitably expand its network and operate a more sustainable fleet with these new fuel-efficient jets.\"\n\nStory continues\n\nBoeing Global Services will also provide modification services for Royal Jordanian's in-service 787s that will enhance in-flight connectivity for passengers and crew. As part of the agreement, Boeing will perform the engineering work, while supplying kits for the modifications.\n\nSince revenue service began in 2011, the 787 family has launched more than 380 new nonstop routes around the world. The 787 Dreamliner family reduces fuel use and emissions by 25% compared to the airplanes it replaces.\n\nBoeing's 2023 Commercial Market Outlook (CMO) cites a growing need for widebody airplanes in the Middle East as passenger demand in the region continues to grow between major population centers. The CMO projects delivery of 3,025 new commercial airplanes in the region by 2042 ─ nearly half of which will be widebodies.\n\nAs a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity. Join our team and find your purpose at boeing.com/careers.\n\nContact\r\nNadine Fanous\r\n+971-56-422-9051\r\nnadine.fanous@boeing.com\n\nBoeing Media Relations\r\nmedia@boeing.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/royal-jordanian-grows-its-long-haul-fleet-with-order-for-boeing-787-9-dreamliners-301986011.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/royal-jordanian-grows-long-haul-115500246.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.005, "neu": 0.878, "pos": 0.117}}, {"date": "2023-11-13T11:35:18+00:00", "title": "US STOCKS-Futures dip as focus shifts to economic data", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nFutures down: Dow 0.02%, S&P 0.17%, Nasdaq 0.22%\n\nNov 13 (Reuters) - U.S. stock index futures edged lower on Monday as investors awaited economic data later this week that could shape expectations around how long the Federal Reserve will keep interest rates elevated.\n\nThe benchmark S&P 500 and the blue-chip Dow closed at near eight-week highs on Friday, while the tech-heavy Nasdaq Composite hit a two-month peak as megacap stocks rallied on the back of easing Treasury yields.\n\nInvestors will focus on a slew of economic data this week as well as speeches from Fed officials for signs on the trajectory of interest rates amid growing expectations that the Fed is done hiking borrowing costs.\n\nInflation data on Tuesday is expected to show headline consumer prices eased to 3.3% in October from 3.7% in September. However, core rates are seen unchanged from the previous month.\n\n\"We think that U.S. CPI inflation figures tomorrow are unlikely to challenge the market conviction that there is no more need for further tightening by the Fed,\" Unicredit analysts said in a note.\n\nThe major U.S. stock indexes have rebounded strongly this month, fueled by a stronger-than-expected earnings season and on hopes that U.S. interest rates are near their peak.\n\nAdding to Monday's jitters, however, Moody's lowered its outlook on the U.S. credit rating to \"negative\" from \"stable\", citing large fiscal deficits and a decline in debt affordability.\n\nThe move follows a rating downgrade of the sovereign by another ratings agency, Fitch, this year.\n\nU.S. House of Representatives Speaker Mike Johnson unveiled a Republican stopgap spending measure on Saturday aimed at averting a government shutdown on Friday, but the measure quickly ran into opposition from lawmakers from both parties in Congress.\n\nAt 6:06 a.m. ET, Dow e-minis were down 6 points, or 0.02%, S&P 500 e-minis were down 7.75 points, or 0.17%, and Nasdaq 100 e-minis were down 34.75 points, or 0.22%.\n\nStory continues\n\nBoeing climbed 3.8% premarket after Bloomberg News reported that China is considering resuming purchases of 737 Max aircraft when the U.S. and Chinese presidents meet this week at the APEC summit.\n\nMeanwhile, Dubai's Emirates placed an order for 90 more 777X jets at the opening of the Dubai Airshow.\n\nMicron Technology slipped 0.4% after Chinese chipmaker Yangtze Memory Technologies Co (YMTC) filed a lawsuit against the U.S. rival alleging infringement of eight of its patents. (Reporting by Sruthi Shankar in Bengaluru; Editing by Maju Samuel)", "link": "https://finance.yahoo.com/news/us-stocks-futures-dip-focus-113518899.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "GSPC.INDX", "IXIC.INDX"], "tags": [], "sentiment": {"polarity": 0.681, "neg": 0.032, "neu": 0.913, "pos": 0.055}}, {"date": "2023-11-13T11:13:00+00:00", "title": "Emirates Airline Orders 95 Boeing Jets Worth $52 Billion", "content": "Emirates Airline will buy 95 wide-body jets from Boeing, moving to expand its fleet of long-haul jets in the coming years to meet rising demand for global travel.\n\nContinue reading", "link": "https://finance.yahoo.com/m/176bd500-dca5-3792-bf96-3fd50e9d6b3e/emirates-airline-orders-95.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0.047, "neu": 0.881, "pos": 0.072}}, {"date": "2023-11-13T11:03:00+00:00", "title": "Boeing leaps as Emirates places $52 billion 777-X order, China nears 737 Max return", "content": "Boeing scored big at the Dubai Airshow this week, including a $52 billion order for its 777-X widebody with Emirates Airlines.\n\nContinue reading", "link": "https://finance.yahoo.com/m/0075ff01-d8c2-3011-ba4d-9b5ade3ccf6f/boeing-leaps-as-emirates.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-11-13T10:28:00+00:00", "title": "flydubai Orders 30 Boeing 787 Dreamliners, Its First Widebody Airplanes", "content": "- Dubai-based carrier to add 787-9s to all-737 fleet to open new routes and serve more destinations\n\nDUBAI, United Arab Emirates, Nov. 13, 2023 /PRNewswire/ -- Boeing [NYSE: BA] and flydubai announced today an agreement to purchase 30 787-9 Dreamliners as the airline diversifies its fleet with the introduction of widebody jets. In a signing ceremony at the Dubai Airshow, the Dubai-based carrier said it plans to use the efficient 787 to open new routes and grow capacity on existing routes. Boeing and flydubai announced today an agreement to purchase 30 787-9 Dreamliners as the airline diversifies its fleet with the introduction of widebody jets.\n\n\"In 2008 when we placed our first-ever order for 50 Boeing 737 aircraft, we were confident of the vital role flydubai would play in supporting Dubai's aviation hub,\" said His Highness Sheikh Ahmed bin Saeed Al Maktoum, Chairman of flydubai. \"I am proud today to see flydubai evolve further, surpassing labels and challenging the traditional conventions around travel. Today's order reaffirms flydubai's commitment to enabling more people to travel across its expanding network. The highly fuel-efficient Boeing 787 Dreamliner will allow flydubai to expand its horizon and cater to the growing demand on existing routes.\"\n\n\"Innovation is at the heart of everything we do at flydubai. We are committed to offering the right product at the right time to cater to the changing market and customer needs,\" said Ghaith Al Ghaith, Chief Executive Officer at flydubai. \"The Boeing 787 Dreamliner offers a perfect combination of operational excellence, fuel efficiency as well as passenger appeal.\"\n\nThe 787-9 can fly 296 passengers 14,010 km (7,565 nautical miles) in addition to more cargo. Since revenue service began in 2011, the 787 family has launched more than 380 new nonstop routes around the world. Half of all 787 Dreamliner flights are operated in short- and medium-haul markets below 5,000 km (2,700 nautical miles), demonstrating its versatility and efficiency across all network segments.\n\n\"The 787-9 is perfectly suited for the needs of flydubai as it looks to open up longer-range routes and add capacity across its network,\" said Stan Deal, president and CEO of Boeing Commercial Airplanes. \"flydubai passengers will enjoy the Dreamliner effect, an experience like no other in the air, flying with more comfort and arriving at their destinations feeling more refreshed.\"\n\nStory continues\n\nflydubai currently operates an all-737 fleet of 79 airplanes. The airline has an order backlog of 137 737s.\n\nAccording to Boeing's Commercial Market Outlook, the Middle East airplane fleet is projected to more than double over the next 20 years. Nearly half of these deliveries will be widebody airplanes, driven by the region's growing position as an international air transit hub.\n\nAs a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity. Join our team and find your purpose at boeing.com/careers.\n\nContact\r\nNadine Fanous\r\n+971-56-422-9051\r\nnadine.fanous@boeing.com\n\nBoeing Media Relations\r\nmedia@boeing.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/flydubai-orders-30-boeing-787-dreamliners-its-first-widebody-airplanes-301985941.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/flydubai-orders-30-boeing-787-102800056.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.006, "neu": 0.827, "pos": 0.167}}, {"date": "2023-11-13T10:23:54+00:00", "title": "Emerging-Market Stocks Halt Declines as China Sentiment Improves", "content": "(Bloomberg) -- Emerging-market stocks rose for the first time in five days amid signs of improving corporate performance in Asia and a thaw in US-China relations.\n\nMost Read from Bloomberg\n\nIceland Girds for Volcanic Eruption That Could Wipe Out Town Biden Has Wiped Away $127 Billion in Student Loan Debt China Weighs Ending Freeze on Boeing With 737 Max Deal in US Xi Jinping’s ‘Old Friends’ From Iowa Get a Dinner Invitation An Opioid-Like Drink Is Masquerading As a Wholesome Alcohol Alternative\n\nThe benchmark MSCI Emerging Markets Index rebounded above its 50-day moving average, with Taiwan Semiconductor Manufacturing Co. contributing a third of the gauge’s gains after posting the first monthly sales increase since February. Alibaba Group Holdings Ltd. and JD.com Inc. advanced after posting an increase at the Nov. 11 Singles Day shopping event.\n\nInvestors are awaiting results from Asian technology and e-commerce firms to gauge whether China’s stimulus is helping quicken the country’s post-Covid recovery. Meanwhile, sentiment is improving as Beijing signals it wants to improve relations with the US, ahead of this week’s meeting between presidents Xi Jinping and Joe Biden. China may unveil a commitment for Boeing’s 737 jetliner during the APEC Summit in San Francisco.\n\nRead more: China Weighs Ending Freeze on Boeing With 737 Max Deal in US\n\nMost sovereign bonds advanced Monday, with Colombia and Gabon leading the gainers in the dollar-bond space. The average risk premium on emerging-market debt over Treasuries narrowed to about 426 basis points, according to indicative data from JPMorgan Chase & Co.\n\nThat followed an increasing preference among investors in US exchange-traded funds for developing-nation bonds over stocks. The iShares JPMorgan USD EM Bond ETF received $388 million of fresh inflows last week, the biggest deposits since January. The biggest emerging-market equity ETFs, on the other hand, failed to garner substantial inflows.\n\nStory continues\n\nEquity markets outside Asia were muted, trading with small gains, while bonds and currencies were stuck in a range. Investors refrained from taking big bets before Tuesday’s US inflation data which may yield clues on the policy direction of the Federal Reserve.\n\nGoldman Sachs Group Inc. offered a cautious view on China, lowering its recommendation on the country’s Hong Kong-listed stocks, while maintaining a bullish view on its shares traded on the mainland. Morgan Stanley, on its part, had highlighted its preference for A-shares in a note dated Nov. 12, while staying equal-weight on China overall.\n\nRead more: Goldman Downgrades Hong Kong-Traded China Stocks, Raises India\n\nThe Israeli shekel fluctuated between gains and losses after the US conducted airstrikes on eastern Syrian locations linked to Iran, while Biden continued his efforts to free hostages seized by Hamas last month.\n\nMost Read from Bloomberg Businessweek\n\nEverything Biden and Xi Need From Their Summit—Starting With Each Other Can a Triangle-Shaped Jet Cut Fuel Consumption in Half? A German Startup Races Google to Develop a Universal Translator US Veterans Got a Mortgage Break. Now They’re Losing Their Homes Elon Musk’s Brain Implant Startup Is Ready to Start Surgery\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/emerging-market-stocks-halt-declines-102354574.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.967, "neg": 0.044, "neu": 0.864, "pos": 0.092}}, {"date": "2023-11-13T10:14:00+00:00", "title": "Boeing Stock Rises. It’s Not Just New Plane Deals but Warming Relations in China.", "content": "Boeing hasn’t made any significant sales of the 737 in China since 2018, when the model was grounded after two crashes.\n\nContinue reading", "link": "https://finance.yahoo.com/m/74c0c5ef-47e7-304e-a2f3-6d48a78bbfde/boeing-stock-rises.-it%E2%80%99s-not.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0, "neu": 0.924, "pos": 0.076}}, {"date": "2023-11-13T10:11:00+00:00", "title": "Emirates Orders Nearly 100 More Boeing Widebody Airplanes", "content": "- World's largest 777 operator buys 55 777-9 and 35 777-8 jets, expanding its 777X backlog to 205 jets\n\n- Carrier updates 787 Dreamliner order book to 35, adding five jets to further meet long-haul demand\n\nDUBAI, United Arab Emirates, Nov. 13, 2023 /PRNewswire/ -- Boeing [NYSE: BA] and Emirates announced today that the world's largest 777 operator has placed an order for 90 777X airplanes, including 55 777-9 and 35 777-8 jets. The new order, which increases Emirates' 777X family backlog to 205 planes, was announced during the Dubai Airshow at a signing event attended by His Highness Sheikh Ahmed bin Saeed Al Maktoum, Chairman and Chief Executive, Emirates Airline and Group; and Stan Deal, president and CEO of Boeing Commercial Airplanes. Boeing and Emirates announced today that the world’s largest 777 operator has placed an order for 90 777X airplanes, including 55 777-9 and 35 777-8 jets.\n\nIn addition, Emirates updated its 787 Dreamliner order book to better align future capacity to demand. The airline is buying five more 787 jets – growing its 787 backlog to 35 – while converting 30 787-9s to 20 787-8 and 10 787-10 airplanes.\n\n\"Emirates is the biggest operator of Boeing 777 aircraft, and today's order cements that position,\" said HH Sheikh Ahmed bin Saeed Al Maktoum, Chairman and Chief Executive, Emirates Airline and Group. \"We've been closely involved in the 777 program since its start up until this latest generation of 777X aircraft. The 777 has been central to Emirates' fleet and network strategy of connecting cities on all continents non-stop to Dubai. We are pleased to extend our relationship with Boeing and look forward to the first 777-9 joining our fleet in 2025.\"\n\nBoeing's relationship with Emirates dates back to the airline's first 777 order in 1992. Today, Emirates has nearly 150 777 jets in its fleet. Based on the most successful twin-aisle airplane ever, the 777, the 777X family is designed to maximize efficiency and environmental performance by 25%, while providing an exceptional onboard experience.\n\n\"This order is an incredible vote of confidence in Boeing's highly efficient widebody family and the versatility of our 777X and 787 airplanes to meet Emirates' needs for global long-haul travel,\" said Stan Deal, president and CEO of Boeing Commercial Airplanes. \"The 777-9 and 777-8 are the perfect airplanes to support Emirates' growth, improving environmental performance and unmatched payload capability along the way.\"\n\nStory continues\n\nThe 777-9 will be the largest and most fuel-efficient twin-engine jet in the world, with the lowest operating cost per seat of any commercial airplane. Opening new growth opportunities for airlines, the 777-9 seats 426 passengers in a typical two-class configuration, with a range of 13,510 km (7,295 nautical miles).\n\nThe 777-8 seats 395 passengers with a range capability of up to 16,190 km (8,745 nautical miles). The 777-8 also offers airlines more revenue potential through more payload and improved fuel efficiency on short and long flights.\n\nThe 777X family also provides unmatched passenger comfort with a wider cabin and interiors that provide better humidity levels, a smoother ride and more natural light.\n\nThe 787 is the industry's most versatile widebody jet, operating with superior efficiency and comfort across all network segments. The enhanced efficiency and performance of the 787 family reduce fuel use and emissions by up to 25% compared to today's similarly sized airplanes. Passengers enjoy a better experience with the largest windows of any jet, air that is more humid and pressurized at a lower cabin altitude for greater comfort, and technology that senses and counters turbulence for a smoother ride.\n\nBoeing's 2023 Commercial Market Outlook forecasts widebody airplanes will comprise 45% of deliveries to Middle East airlines over the next 20 years ─ the highest regional percentage worldwide. Many airlines in the region provide service between major global population centers and as a result, a higher proportion of widebody aircraft are needed to carry larger passenger volumes.\n\nAs a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity. Join our team and find your purpose at boeing.com/careers.\n\nContact\r\nNadine Fanous\r\n+971-56-422-9051\r\nnadine.fanous@boeing.com\n\nBoeing Media Relations\r\nmedia@boeing.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/emirates-orders-nearly-100-more-boeing-widebody-airplanes-301985923.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/emirates-orders-nearly-100-more-101100177.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.013, "neu": 0.859, "pos": 0.128}}, {"date": "2023-11-13T09:56:41+00:00", "title": "UPDATE 1-Emirates and flyDubai place Dubai Airshow jet orders", "content": "(Adds detail)\n\nDUBAI, Nov 13 (Reuters) - Dubai's Emirates placed an order for 90 more Boeing 777X jets at the opening of the Dubai Airshow on Monday, including both variants of the future long-haul jet.\n\nThe world's largest international carrier also added five more Boeing 787s to an existing order, saying the total package of new widebody jets was worth over $50 billion at list prices.\n\nSheikh Ahmed bin Saeed Al Maktoum, chairman and CEO of Emirates airline, said the deal would power Dubai's growth plans and reflected its commitment to the future of aviation.\n\nThe 777X order includes 55 of the 400-seat 777-9 variant and 35 of the smaller 777-8, he told a news conference.\n\nSister airline flyDubai also weighed in at the start of the biennial event with an order for 30 Boeing 787-9 in its first order for wide-body jets. (Reporting by Alexander Cornwell; editing by Tim Hepher)", "link": "https://finance.yahoo.com/news/1-emirates-flydubai-place-dubai-095641881.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.727, "neg": 0, "neu": 0.954, "pos": 0.046}}, {"date": "2023-11-13T09:52:36+00:00", "title": "Emirates and flyDubai place Dubai Airshow jet orders", "content": "DUBAI (Reuters) -Dubai's Emirates placed an order for 90 more Boeing 777X jets at the opening of the Dubai Airshow on Monday, including both variants of the future long-haul jet.\n\nThe world's largest international carrier also added five more Boeing 787s to an existing order, saying the total package of new widebody jets was worth over $50 billion at list prices.\n\nSheikh Ahmed bin Saeed Al Maktoum, chairman and CEO of Emirates airline, said the deal would power Dubai's growth plans and reflected its commitment to the future of aviation.\n\nThe 777X order includes 55 of the 400-seat 777-9 variant and 35 of the smaller 777-8, he told a news conference.\n\nSister airline flyDubai also weighed in at the start of the biennial event with an order for 30 Boeing 787-9 in its first order for wide-body jets.\n\n(Reporting by Alexander Cornwell; editing by Tim Hepher)", "link": "https://finance.yahoo.com/news/emirates-flydubai-place-dubai-airshow-095236508.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.727, "neg": 0, "neu": 0.952, "pos": 0.048}}, {"date": "2023-11-13T09:35:00+00:00", "title": "These Stocks Are Moving the Most Today: Boeing, Novo Nordisk, Tyson Foods, Home Depot, Walmart, and More", "content": "A report says China is considering lifting a commercial freeze on Boeing's 737 MAX, and data show Novo Nordisk's weight-loss drug Wegovy reduces heart attack risks. Home Depot and Walmart report quarterly earnings later this week.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9b416fc6-f5fa-38d9-bdf4-9eb83c815930/these-stocks-are-moving-the.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "NONOF.US", "NOVA.F", "NOVO-B.CO", "NVO.US", "TF7A.F", "TSN.US"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0.122, "neu": 0.751, "pos": 0.127}}, {"date": "2023-11-13T09:31:46+00:00", "title": "UPDATE 1-SunExpress jump starts Dubai Airshow with Boeing jet order", "content": "(Rewrites, adds quotes, details)\n\nDUBAI, Nov 13 (Reuters) - SunExpress Airlines, a joint venture between Turkish Airlines and Lufthansa , placed the first order at the Dubai Airshow on Monday and used the spotlight to remind Boeing to deliver on time after a series of industry delays.\n\nThe budget carrier said it was placing a firm order for 45 narrow-body 737 MAX jets to be delivered between 2029 and 2035, with options or purchase rights for another 45.\n\nThe roughly $5 billion-deal at list prices unexpectedly kicked off the aerospace jamboree as the schedule for big-ticket purchases expected from regional heavyweights such as Emirates and Turkish Airlines slipped amid last-minute negotiations.\n\nSunExpress Chief Executive Max Kownatzki presented a picture of the Frankfurt skyline to Boeing Commercial Airplanes CEO Stan Deal in a play on the term \"skyline\" used to describe the backlog of planned deliveries in Boeing's airplane factories.\n\nBoeing and rival Airbus have been hit with chronic delays.\n\n\"This is a bit of a breach of protocol. We had agreed not to exchange presents,\" Kownatzki said.\n\n\"So we wanted to have a friendly token of thank you and also a gently and friendly reminder (to) make sure that the skyline is kept for the deliveries that we’re waiting for,\" he told Deal in a joint press conference.\n\nAs travel rebounds from the pandemic, low-cost tourist airlines rely especially on getting new planes delivered in time for the summer season each year.\n\n\"We can’t get enough capacity at the moment and hence we’re pushing for a timely delivery of the skyline as much as we can. The earlier the better,\" Kownatzki said.\n\n\"If you forget, just look at the picture and remember where we are in your Boeing deliveries timeline.”\n\nDeal replied that industrial performance was a key priority.\n\n\"I am not going to shy away from predictability; that has been a challenge,\" Deal said. \"We are stabilising our deliveries.\"\n\nEmirates was meanwhile expected to place a keenly awaited wide-body order around 0930 GMT, with a planned Airbus order by Turkish Airlines slipping into Tuesday, delegates said. (Reporting by Alexander Cornwell, Tim Hepher, Pesha Magid, Editing by Louise Heavens and Miral Fahmy)", "link": "https://finance.yahoo.com/news/1-sunexpress-jump-starts-dubai-093146915.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.962, "neg": 0.008, "neu": 0.923, "pos": 0.068}}, {"date": "2023-11-13T09:05:00+00:00", "title": "SunExpress to Buy up to 90 Boeing 737 MAX Jets to Fuel Robust Growth", "content": "- Agreement includes 45 737-8 and 737-10 models with opportunity for up to 45 more jets\n\n- Leading Türkiye leisure carrier to more than double 737 fleet, reaching up to 150 jets in the next decade\n\n- 737 MAX family offers greater efficiency to enable long-term sustainability goals\n\nDUBAI, United Arab Emirates, Nov. 13, 2023 /PRNewswire/ -- Boeing [NYSE: BA] and SunExpress, a joint venture of Turkish Airlines and Lufthansa, announced today the airline has again selected the 737 MAX to continue its robust growth. With a commitment to purchase up to 90 fuel-efficient single-aisle Boeing jets, announced at the Dubai Airshow, Türkiye's leading leisure carrier will more than double its fleet into the next decade. The agreement includes 28 737-8 and 17 737-10 models, with the opportunity for up to 45 additional 737 MAX airplanes. Boeing and SunExpress, a joint venture of Turkish Airlines and Lufthansa, announced today the airline has again selected the 737 MAX to continue its robust growth.\n\n\"Building on the resounding success of our strategy in the post-pandemic period, SunExpress is now poised for next-level growth to meet market demand and achieve a greater international footprint,\" said Max Kownatzki, SunExpress CEO. \"Over the next decade, we will more than double our fleet, reaching a 150-aircraft fleet by 2033. Also, the addition of the 737-10, the newest 737 MAX plane with up to 230 seats, to our fleet will allow us to strengthen our capacity further. SunExpress is well-positioned for the future and will expand its network with a more fuel-efficient and environmentally sustainable aircraft fleet, while continuing to fulfill its role as Türkiye's tourism ambassador.\"\n\nThis new commitment from SunExpress will build on the airline's previous order for 42 737-8s, nine of which have been delivered.\n\n\"SunExpress's continued commitment to the 737 MAX reflects its confidence in the airplane's capability to meet demand from travelers to popular destinations across Türkiye and beyond,\" said Stan Deal, president and CEO of Boeing Commercial Airplanes. \"The 737 MAX is a proven airplane on the SunExpress network, delivering unmatched fuel efficiency and reliability.\"\n\nStory continues\n\nThe 737 MAX offers carriers flexibility for short- and medium-haul air travel, an ideal airplane family for leisure operators such as SunExpress. The 737-8 seats 162 to 200 passengers depending on configuration and offers a range of up to 6,480 km (3,500 nautical miles), while the 737-10, the largest 737 MAX model, offers a range of up to 5,740 km (3,100 nautical miles). The 737 MAX family reduces fuel use and carbon emissions by 20% compared to the airplanes they replace.\n\nSunExpress, which specializes in offering direct connections between Europe, Türkiye and popular holiday destinations, continues to expand its Boeing 737 fleet to support its significant growth. In 2022, the airline's passenger count reached nearly 11 million across 175 routes to 30 countries.\n\nAbout SunExpress Established in 1989 as a joint venture of Turkish Airlines and Lufthansa, SunExpress acts as a tourism ambassador between Türkiye and Europe with its 30 years of experience and leisure airline expertise. SunExpress flies to more than 175 routes to 30 countries and carries more than 10 million passengers every year. With its headquarters in Antalya and Frankfurt and bases in Izmir and Ankara, SunExpress has more than 3500 employees and a fleet of 66 aircraft. SunExpress named the 'Best Leisure Airline in Europe' in the latest global survey by Skytrax. You may find detailed information about SunExpress at www.SunExpress.com.\n\nAbout Boeing As a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity. Join our team and find your purpose at boeing.com/careers.\n\nContact: Elena Alexandrova, Boeing Communications \r\nelena.alexandrova@boeing.com\n\nBoeing Media Relations\r\nmedia@boeing.com\n\nDicle Atalay Peçen, Head of Communications, SunExpress\r\ndicle.pecen@sunexpress.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/sunexpress-to-buy-up-to-90-boeing-737-max-jets-to-fuel-robust-growth-301985868.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/sunexpress-buy-90-boeing-737-090500517.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.006, "neu": 0.836, "pos": 0.158}}, {"date": "2023-11-13T03:05:42+00:00", "title": "UPDATE 1-China weighs ending freeze on Boeing purchases with 737 Max deal in US -Bloomberg News", "content": "(Adds details from Bloomberg report in paragraph 2, background in paragraphs 3-7)\n\nNov 12 (Reuters) - China is considering resuming purchases of Boeing's 737 Max aircraft when the U.S. and Chinese presidents meet this week at the APEC summit, Bloomberg News reported on Sunday, citing people familiar with the matter.\n\nChinese President Xi Jinping is not expected to unveil a formal order for the 737 Max; aircraft commitments that are not a firm sale often take the form of a memorandum of understanding or letter of intent, the report said, adding that the terms of any potential agreement were under discussion and could change or fall apart before the heads of state meet on Wednesday.\n\nBoeing is still waiting to resume deliveries of its bestselling 737 MAX to Chinese airlines more than four years after they were halted following two deadly crashes. The company had said that as of the end of June, about 90% of its 737 Max jets in China had resumed commercial operations.\n\nThe company has been all but shut out of new orders from Chinese carriers since 2017 amid rising political and trade tensions between Beijing and Washington.\n\nBoeing in September slightly\n\nincreased\n\nits annual 20-year forecast for new plane deliveries to China, citing economic growth and increasing demand for domestic travel.\n\nThe U.S. planemaker said that China's fleet would more than double to nearly 9,600 jets over the next 20 years and that its domestic aviation market would be the largest in the world by the end of the forecast period, with demand for 6,470 single-aisle planes such as the Boeing 737 MAX family.\n\nReuters reported in April that China's aviation regulator published a report that Boeing viewed as a key step for the U.S. planemaker to resume deliveries, but none have resumed.\n\nBoeing declined to comment on the Bloomberg report.\n\n(Reporting by Gokul Pisharody in Bengaluru; Editing by Tom Hogue and Gerry Doyle)", "link": "https://finance.yahoo.com/news/1-china-weighs-ending-freeze-030542766.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.251, "neg": 0.022, "neu": 0.947, "pos": 0.031}}, {"date": "2023-11-13T02:21:20+00:00", "title": "China Weighs Ending Freeze on Boeing With 737 Max Deal", "content": "Beijing is said to considering and end to its freeze on Boeing Co. The US planemaker may see a sales breakthrough for its 737 Max aircraft in China when presidents Joe Biden and Xi Jinping meet in San Francisco this week on the sidelines of the APEC Summit. Danny Lee reports on Bloomberg Television.", "link": "https://finance.yahoo.com/video/china-weighs-ending-freeze-boeing-022120377.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0, "neu": 0.977, "pos": 0.023}}, {"date": "2023-11-13T02:15:35+00:00", "title": "China weighs ending freeze on Boeing purchases with 737 Max deal in US -Bloomberg News", "content": "(Reuters) -China is considering resuming purchases of Boeing's 737 Max aircraft when the U.S. and Chinese presidents meet this week at the APEC summit, Bloomberg News reported on Sunday, citing people familiar with the matter.\n\nChinese President Xi Jinping is not expected to unveil a formal order for the 737 Max; aircraft commitments that are not a firm sale often take the form of a memorandum of understanding or letter of intent, the report said, adding that the terms of any potential agreement were under discussion and could change or fall apart before the heads of state meet on Wednesday.\n\nBoeing is still waiting to resume deliveries of its bestselling 737 MAX to Chinese airlines more than four years after they were halted following two deadly crashes. The company had said that as of the end of June, about 90% of its 737 Max jets in China had resumed commercial operations.\n\nThe company has been all but shut out of new orders from Chinese carriers since 2017 amid rising political and trade tensions between Beijing and Washington.\n\nBoeing in September slightly increased its annual 20-year forecast for new plane deliveries to China, citing economic growth and increasing demand for domestic travel.\n\nThe U.S. planemaker said that China's fleet would more than double to nearly 9,600 jets over the next 20 years and that its domestic aviation market would be the largest in the world by the end of the forecast period, with demand for 6,470 single-aisle planes such as the Boeing 737 MAX family.\n\nReuters reported in April that China's aviation regulator published a report that Boeing viewed as a key step for the U.S. planemaker to resume deliveries, but none have resumed.\n\nBoeing declined to comment on the Bloomberg report.\n\n(Reporting by Gokul Pisharody in Bengaluru; Editing by Tom Hogue and Gerry Doyle)", "link": "https://finance.yahoo.com/news/china-weighs-ending-freeze-boeing-021535201.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.251, "neg": 0.023, "neu": 0.944, "pos": 0.033}}, {"date": "2023-11-13T00:00:00+00:00", "title": "BA Stock Alert: The $52 Billion Reason Boeing Is Up Today", "content": "Boeing stock is rising on Monday as investors in BA react to the company signing a $52 million deal for its 777-X widebody jets.", "link": "https://investorplace.com/2023/11/ba-stock-alert-the-52-billion-reason-boeing-is-up-today/", "symbols": ["BA.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-11-12T21:55:10+00:00", "title": "UPDATE 1-Looming Emirates 777X deal to kick-start Dubai Airshow -sources", "content": "(Adds context on delays in paragraph 4, analyst quote in paragraph 7)\n\nBy Tim Hepher and Alexander Cornwell\n\nDUBAI, Nov 13 (Reuters) - Middle East carriers look set to order tens of billions of dollars of long-haul jets at the opening of the Dubai Airshow on Monday, as Emirates renews confidence in the delayed Boeing 777X while facing new competition from rivals like Turkish Airlines.\n\nHosts Emirates and low-cost cousin flyDubai are expected to stamp their mark early on the world's second-largest aerospace event, industry sources said, despite concerns about a drop in the economically key travel sector due to Mideast tensions.\n\nThat includes a new order for several dozen Boeing 777X jets, they said, in a boost for the programme amid ongoing uncertainty over the schedule for the world's largest twin-engined jet, currently expected in 2025 after a five-year delay.\n\nPeople familiar with the flagship programme have said the risks are weighted toward further delays as Boeing first gauges the impact of tighter certification rules on other projects. Boeing said on Friday there was no change to its schedule.\n\nEmirates is the world's largest user of wide-body jets, including Airbus A380 superjumbos and current-generation Boeing 777s. It has publicly said it is considering more orders of the upgraded 777X as well as the Airbus A350 and smaller Boeing 787.\n\nOf these, the 787 is least likely to feature immediately.\n\nFlyDubai flies Boeing 737 MAX narrowbody jets, which compete with the Airbus A320neo, and is set to order more planes in that category this week, sources said.\n\nEmirates, Airbus and Boeing declined comment.\n\nIndustry officials estimate airlines worldwide are negotiating behind the scenes to buy some 700-800 new jets, including 200-300 of the world's largest, as they catch up on fleet replacement plans set aside during the pandemic.\n\nHow many of those bear fruit in time for the Nov. 13-17 show depends on the state of negotiations and jockeying for the limelight as Gulf groups face a widening circle of competition.\n\nStory continues\n\nTurkish Airlines (THY) burst onto the show's agenda on Saturday with word from state-run Anadolu news agency that it was in talks to buy up to 355 Airbus jets.\n\nFollowing more talks, industry sources said the airline could announce at least part of the deal on Monday.\n\nIt has said it is in discussions for as many as 600 planes overall, likely to be split between Airbus and Boeing.\n\nOne Mideast source described the prospect of a Turkish order as a \"bold move,\" stepping up competition at the showcase event.\n\nHowever, speculation of a large Dubai order for narrowbody jets from the region's newest player, Saudi Arabia's Riyadh Air, as early as Dubai is premature, other sources said.\n\nThe airline, which has hinted at a decision in coming weeks, declined to comment.\n\nAviation powerhouse Dubai is staging the biennial aerospace pageant against the backdrop of the Israel-Hamas war in Gaza that is pushing up demand for weapons and closing airspace, making flights longer and more expensive for some airlines.\n\nTravel analysis firm ForwardKeys said on Friday flight bookings had fallen around the world since Oct. 7.\n\nBookings to the Middle East have slumped 26%, it said.\n\n\"There's enough statistical evidence, at least in the short term, to show that there's been a substantial drop in tickets sales into the region,\" said Daniel Silke, director of Cape Town-based Political Futures Consultancy.\n\nAnalysts have said the war in Gaza is also likely to reinforce demand for weapons on top of a surge in the past 18 months as the United States and its allies rearm Ukraine against Russia. However, few major arms deals are expected at the show.\n\n(Reporting by Tim Hepher, Alexander Cornwell, Pesha Magid; Editing by Hugh Lawson and Lisa Shumaker)", "link": "https://finance.yahoo.com/news/1-looming-emirates-777x-deal-215510703.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": -0.883, "neg": 0.054, "neu": 0.908, "pos": 0.038}}, {"date": "2023-11-12T20:14:22+00:00", "title": "Looming Emirates 777X deal to kick-start Dubai Airshow -sources", "content": "By Tim Hepher and Alexander Cornwell\n\nDUBAI (Reuters) -Middle East carriers look set to order tens of billions of dollars of long-haul jets at the opening of the Dubai Airshow on Monday, as Emirates renews confidence in the delayed Boeing 777X while facing new competition from rivals like Turkish Airlines.\n\nHosts Emirates and low-cost cousin flyDubai are expected to stamp their mark early on the world's second-largest aerospace event, industry sources said, despite concerns about a drop in the economically key travel sector due to Mideast tensions.\n\nThat includes a new order for several dozen Boeing 777X jets, they said, in a boost for the programme amid ongoing uncertainty over the schedule for the world's largest twin-engined jet, currently expected in 2025 after a five-year delay.\n\nPeople familiar with the flagship programme have said the risks are weighted toward further delays as Boeing first gauges the impact of tighter certification rules on other projects. Boeing said on Friday there was no change to its schedule.\n\nEmirates is the world's largest user of wide-body jets, including Airbus A380 superjumbos and current-generation Boeing 777s. It has publicly said it is considering more orders of the upgraded 777X as well as the Airbus A350 and smaller Boeing 787.\n\nOf these, the 787 is least likely to feature immediately.\n\nFlyDubai flies Boeing 737 MAX narrowbody jets, which compete with the Airbus A320neo, and is set to order more planes in that category this week, sources said.\n\nEmirates, Airbus and Boeing declined comment.\n\nIndustry officials estimate airlines worldwide are negotiating behind the scenes to buy some 700-800 new jets, including 200-300 of the world's largest, as they catch up on fleet replacement plans set aside during the pandemic.\n\nHow many of those bear fruit in time for the Nov. 13-17 show depends on the state of negotiations and jockeying for the limelight as Gulf groups face a widening circle of competition.\n\nStory continues\n\nTurkish Airlines (THY) burst onto the show's agenda on Saturday with word from state-run Anadolu news agency that it was in talks to buy up to 355 Airbus jets.\n\nFollowing more talks, industry sources said the airline could announce at least part of the deal on Monday.\n\nIt has said it is in discussions for as many as 600 planes overall, likely to be split between Airbus and Boeing.\n\nOne Mideast source described the prospect of a Turkish order as a \"bold move,\" stepping up competition at the showcase event.\n\nHowever, speculation of a large Dubai order for narrowbody jets from the region's newest player, Saudi Arabia's Riyadh Air, as early as Dubai is premature, other sources said.\n\nThe airline, which has hinted at a decision in coming weeks, declined to comment.\n\nAviation powerhouse Dubai is staging the biennial aerospace pageant against the backdrop of the Israel-Hamas war in Gaza that is pushing up demand for weapons and closing airspace, making flights longer and more expensive for some airlines.\n\nTravel analysis firm ForwardKeys said on Friday flight bookings had fallen around the world since Oct. 7.\n\nBookings to the Middle East have slumped 26%, it said.\n\n\"There's enough statistical evidence, at least in the short term, to show that there's been a substantial drop in tickets sales into the region,\" said Daniel Silke, director of Cape Town-based Political Futures Consultancy.\n\nAnalysts have said the war in Gaza is also likely to reinforce demand for weapons on top of a surge in the past 18 months as the United States and its allies rearm Ukraine against Russia. However, few major arms deals are expected at the show.\n\n(Reporting by Tim Hepher, Alexander Cornwell, Pesha Magid; Editing by Hugh Lawson and Lisa Shumaker)", "link": "https://ca.finance.yahoo.com/news/looming-emirates-777x-deal-kickstart-201422628.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": -0.883, "neg": 0.055, "neu": 0.906, "pos": 0.039}}, {"date": "2023-11-12T20:12:06+00:00", "title": "Looming Emirates 777X deal to kickstart Dubai Airshow -sources", "content": "By Tim Hepher and Alexander Cornwell\n\nDUBAI, Nov 13 (Reuters) - Middle East carriers look set to order tens of billions of dollars of long-haul jets at the opening of the Dubai Airshow on Monday, as Emirates renews confidence in the delayed Boeing 777X while facing new competition from rivals like Turkish Airlines.\n\nHosts Emirates and low-cost cousin flyDubai are expected to stamp their mark early on the world's second-largest aerospace event, industry sources said, despite concerns about a drop in the economically key travel sector due to Mideast tensions.\n\nThat's likely to include an order for several dozen Boeing 777X jets, despite ongoing uncertainty over the schedule for the world's largest twin-engined jet, currently expected in 2025 after a five-year delay. Boeing has said the schedule is intact.\n\nThe world's largest user of wide-body jets, including Airbus A380 superjumbos and current-generation Boeing 777s, has publicly said it is considering the upgraded 777X model as well as the Airbus A350 and smaller Boeing 787 for a new batch.\n\nOf these, the 787 is least likely to feature immediately.\n\nFlyDubai flies Boeing 737 MAX narrowbody jets and is set to order more planes in that category, sources said.\n\nEmirates, Airbus and Boeing declined comment.\n\nIndustry officials estimate airlines worldwide are negotiating behind the scenes to buy some 700-800 new jets, including 200-300 of the world's largest, as they catch up on fleet replacement plans set aside during the pandemic.\n\nHow many of those bear fruit in time for the Nov. 13-17 show depends on the state of negotiations and jockeying for the limelight as Gulf groups face a widening circle of competition.\n\nTurkish Airlines (THY) burst onto the show's agenda on Saturday with word from state-run Anadolu news agency that it was in talks to buy up to 355 Airbus jets.\n\nFollowing more talks, industry sources said the airline could announce at least part of the deal on Monday.\n\nStory continues\n\nIt has said it is in discussions for as many as 600 planes overall, likely to be split between Airbus and Boeing.\n\nOne Mideast source described the prospect of a Turkish order as a \"bold move,\" stepping up competition at the showcase event.\n\nHowever, speculation of a large Dubai order for narrowbody jets from the region's newest player, Saudi Arabia's Riyadh Air, as early as Dubai is premature, other sources said.\n\nThe airline, which has hinted at a decision in coming weeks, declined to comment.\n\nAviation powerhouse Dubai is staging the biennial aerospace pageant against the backdrop of the Israel-Hamas war in Gaza that is pushing up demand for weapons and closing airspace, making flights longer and more expensive for some airlines.\n\nTravel analysis firm ForwardKeys said on Friday flight bookings had fallen not only in the Middle East, but around the world since Oct 7. Bookings to the Middle East have slumped 26%, it said. (Reporting by Tim Hepher, Alexander Cornwell; Editing by Hugh Lawson)", "link": "https://finance.yahoo.com/news/looming-emirates-777x-deal-kickstart-201206094.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": -0.186, "neg": 0.025, "neu": 0.949, "pos": 0.026}}, {"date": "2023-11-11T20:00:00+00:00", "title": "Boeing: Middle East fleet to more than double by 2042 with new-technology widebodies leading the way", "content": "- Region resuming above-average growth following pandemic recovery\n\n- Forecast shows demand for more than 3,000 new airplanes in the Middle East\n\nDUBAI, United Arab Emirates, Nov. 12, 2023 /PRNewswire/ -- Boeing [NYSE: BA] forecasts widebody airplanes will comprise 45% of deliveries to Middle East airlines over the next 20 years ─ the highest percentage of the 10 global regions featured in Boeing's Commercial Market Outlook (CMO) forecast. The region's fleet of dedicated freighters is projected to more than double to 180 jets by 2042, according to the CMO, Boeing's annual long-term forecast of demand for commercial airplanes and services.\n\n\"Airlines in the Middle East have increasingly expanded their influence and reach, transforming the region into an international air transit hub,\" said Darren Hulst, Boeing vice president, Commercial Marketing. \"Air travel and cargo demand continue to gain momentum, driven by significant economic growth and national development plans. As airlines in the region will require efficient and versatile fleet solutions, Boeing products will be ready to meet market demands.\"\n\nThe CMO projects delivery of 3,025 new commercial airplanes in the Middle East by 2042, including 1,350 widebodies. Many airlines in the region provide service between major population centers in Asia, Africa and Europe via growing hubs that offer efficient connectivity. As a result, a higher proportion of widebody aircraft are needed to carry larger passenger volumes.\n\nThe Middle East single-aisle fleet is also expected to more than double as low-cost carriers (LCC) and short-haul networks continue to develop and expand. By 2042, nearly half of the region's aircraft will be single-aisle jets.\n\nAdditional 2023 CMO highlights for the Middle East through 2042 include:\n\nTwo-thirds of new deliveries will support air traffic and cargo growth while one-third of deliveries will replace older airplanes with more fuel-efficient models The total fleet will increase 2.4 times to 3,360 airplanes — 1,610 (48%) will be single aisles, while 1,520 (45%) will be widebodies The commercial fleet will generate demand for $335 billion in aviation services including maintenance, repair, training and spare parts\n\nStory continues\n\nCommercial airplane deliveries to the Middle East (2023-2042) Regional Jet 35 Single Aisle 1,570 Widebody 1,350 Freighter 70 Total 3,025\n\nRecent orders and deliveries in the region:\n\nIraqi Airways Celebrates Delivery of its First Boeing 787 Dreamliner (Jun. 22, 2023) SAUDIA to Grow Long-Haul Fleet with up to 49 Boeing 787 Dreamliners (March 14, 2023) New Saudi Arabian Carrier Riyadh Air to Launch with All-Boeing Fleet of up to 72 787-9 Dreamliners(March 14, 2023)\n\nBoeing has published the CMO annually since 1961. As the longest-running jet forecast, the CMO is regarded as the most comprehensive analysis of the commercial aviation industry. Learn more about the Commercial Market Outlook on Boeing.com or search \"Boeing CMO\" in your smartphone app store.\n\nAs a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future, leading with sustainability, and cultivating a culture based on the company's core values of safety, quality and integrity. Join our team and find your purpose at boeing.com/careers.\n\nContact:\r\nNadine Fanous\r\n+971-56-422-9051\r\nnadine.fanous@boeing.com\n\nBoeing Media Relations\r\nmedia@boeing.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/boeing-middle-east-fleet-to-more-than-double-by-2042-with-new-technology-widebodies-leading-the-way-301983966.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/boeing-middle-east-fleet-more-200000632.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.01, "neu": 0.874, "pos": 0.116}}, {"date": "2023-11-11T13:38:00+00:00", "title": "3 Things You Need to Know if You Buy Boeing Stock Today", "content": "The aerospace and defense giant's stock has plenty of upside potential, but it also has significant downside risk.\n\nContinue reading", "link": "https://finance.yahoo.com/m/7d4ee977-878d-3ec4-95f5-31ff3a0e1bbd/3-things-you-need-to-know-if.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.402, "neg": 0.209, "neu": 0.65, "pos": 0.14}}]