[{"date": "2023-04-14T21:17:00+00:00", "title": "3 Hot Aerospace Stocks That Are Screaming Buys", "content": "For entirely different reasons, the aerospace and defense markets are looking good in the near and long term. Aerospace is usually split into two end markets: the original equipment manufacturer (OEM) market and the aftermarket. Aircraft production rates drive the OEM market at companies like Boeing and Airbus --both striving to ramp aircraft production and deliver on multiyear backlogs.\n\nContinue reading", "link": "https://finance.yahoo.com/m/65c5cc18-faff-36f7-abea-206815a2d2ab/3-hot-aerospace-stocks-that.html", "symbols": ["5UR.F", "AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "RTX.US", "WW1.F", "WWD.US"], "tags": [], "sentiment": {"polarity": 0.802, "neg": 0, "neu": 0.861, "pos": 0.139}}, {"date": "2023-04-14T20:50:00+00:00", "title": "Boeing Stock Falls After Halting 737 MAX Deliveries. It’s Not What Investors Want to Hear.", "content": "The aerospace company said a supplier told it a nonstandard manufacturing process was used in installing fittings on some airplanes.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e854c3ad-d7da-35c8-a1e2-a2651e997566/boeing-stock-falls-after.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-04-14T20:19:23+00:00", "title": "Boeing stock falls on halted deliveries of 737 Max jets", "content": "Shares of Boeing drop after reports of halted deliveries of the aviation company's landmark 737 Max jets.", "link": "https://finance.yahoo.com/video/boeing-stock-falls-halted-deliveries-201923619.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.103, "neg": 0.107, "neu": 0.714, "pos": 0.179}}, {"date": "2023-04-14T20:16:00+00:00", "title": "JPMorgan, Citigroup, Boeing, Spirit AeroSystems, Catalent, and More Market Movers", "content": "JPMorgan Chase, Citigroup, and Wells Fargo report first-quarter earnings that beat estimates, Boeing shares fall after the airplane maker halts deliveries of its 737 MAX jet, and Catalent slides after issuing a profit warning.\n\nContinue reading", "link": "https://finance.yahoo.com/m/354824f1-77f1-357d-a0ff-1f8a766e9845/jpmorgan%2C-citigroup%2C-boeing%2C.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.572, "neg": 0.059, "neu": 0.765, "pos": 0.175}}, {"date": "2023-04-14T19:45:51+00:00", "title": "UPDATE 2-Ukraine secures another $5 billion in funding after meetings, prime minister says", "content": "(Adds IFC commitments)\n\nBy Andrea Shalal and Katharine Jackson\n\nWASHINGTON, April 14 (Reuters) - Ukraine secured promises of $5 billion in additional funding to support its ongoing fight against Russia amid \"fruitful meetings\" in Washington this week, Ukrainian Prime Minister Denys Shmyhal told reporters on Friday.\n\nShmyhal met with representatives of the International Monetary Fund, the World Bank and the European Investment Bank as well as top U.S. officials, on the sidelines of the spring meetings of the IMF and World Bank.\n\nHe said Ukraine received new pledges of additional support from Switzerland, Denmark and a number of other countries during the meetings, as well as an agreement from U.S. aircraft maker Boeing Co to relieve Ukrainian companies of $200 million in previous commitments. Kyiv expected to receive more support during an upcoming conference in London, he added.\n\n\"The international partners have reassured us of their long-term support,\" Shmyhal said, describing his meetings in Washington, and referring to total financing of $115 billion over the next four years that was leveraged by the IMF's approval last month of a $15.6 billion loan.\n\nUkraine needs about $14 billion in funding this year to close a budget gap, Shmyhal said, noting that the United States would provide $2.3 billion to plug the hole, while the European Union would provide 1 billion euros ($1.10 billion).\n\nIn addition to Switzerland and Denmark, he said Spain, Ireland, Japan, Latvia, Lithuania, Iceland and the Netherlands also promised more aid.\n\nU.S. Treasury Secretary Janet Yellen, who paid a surprise visit to Kyiv in February and met with Shmyhal again on Thursday, repeatedly urged finance ministers and central banks to maintain support for Ukraine, the Treasury Department said.\n\nYellen on Thursday said she told Shmyhal the United States had provided significant economic support to Ukraine since the start of the war in February 2022, and would deliver more in coming months, on top of security and humanitarian aid.\n\nStory continues\n\n'ON LIFE SUPPORT'\n\nShmyhal said Ukrainian officials met with a number of U.S. cabinet secretaries in addition to Yellen, including Defense Secretary Lloyd Austin and U.S. Commerce Secretary Gina Raimondo, with a big focus on laying the groundwork for Ukraine's recovery and attracting foreign investment.\n\nHe said the discussions also touched on Ukraine's insistence that the United States and other allies confiscate Russian assets to help cover the cost of rebuilding Ukraine - a sum put at $411 billion by the World Bank in a recent estimate.\n\nHe urged the Group of Seven advanced economies to reaffirm their support for Ukraine and discuss the confiscation issue during an upcoming leaders summit in Japan, which is leading the G7 this year.\n\nThe Netherlands and Switzerland also pledged support for the International Finance Corp's $2 billion Economic Resilience Action program that is designed to ramp up support for Ukraine’s private sector and boost economic resilience amid the war.\n\nThe IFC program aims to leverage these donor funds using private sector investments, which will be needed to help cover the staggering cost of Ukraine's recovery.\n\n\"A strong private sector is essential to help Ukraine's economy recover and support reconstruction efforts,\" said Makhtar Diop, the IFC's managing director. \"Ukraine's economy remains on life support, and we will continue working with other development partners to provide the guarantees and grants the private sector needs.\"\n\nThe World Bank also announced $200 million in grant financing for a project to Ukraine’s energy infrastructure, with some $300 million in additional funding envisaged to come from partners through grants and other contributions.\n\n($1 = 0.9094 euros) (Reporting by Andrea Shalal and Katharine Jackson; editing by Susan Heavey, Diane Craft and Paul Simao)", "link": "https://finance.yahoo.com/news/1-ukraine-secures-5-bln-194551822.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.016, "neu": 0.817, "pos": 0.167}}, {"date": "2023-04-14T19:30:43+00:00", "title": "Stock Market Rally Rises Amid Recession Worries; JPMorgan Headlines Earnings: Weekly Review", "content": "The stock market rally generally advanced, but with ups and downs amid rising recession fears. JPMorgan led key earnings reports.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f4dcdc98-e6b4-3ab8-9397-884bc2d15b89/stock-market-rally-rises-amid.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "CMC.F", "CMC.XETRA", "DAL.MX", "DAL.US", "JPM-PC.US", "JPM-PD.US", "JPM.MX", "JPM.US", "JPMC34.SA", "OYC.F", "UNH.MX", "UNH.US", "UNH.XETRA", "UNHH34.SA"], "tags": [], "sentiment": {"polarity": -0.785, "neg": 0.265, "neu": 0.681, "pos": 0.054}}, {"date": "2023-04-14T18:32:05+00:00", "title": "Ukraine secures $5bln in more funds after meetings, prime minister says", "content": "WASHINGTON, April 14 (Reuters) - Ukraine secured promises of $5 billion in additional funding to support its ongoing fight against Russia amid \"fruitful meetings\" in Washington this week, Ukrainian Prime Minister Denys Shmyhal told reporters on Friday.\n\nShmyhal met with representatives of the International Monetary Fund, the World Bank and the European Investment Bank as well as top U.S. officials, on the sidelines of the spring meetings of the IMF and the World Bank.\n\nHe said Ukraine received new pledges of additional support from Switzerland, Denmark and a number of other countries during the meetings, as well as an agreement from U.S. aircraft maker Boeing to relieve Ukrainian companies of $200 million in previous commitments. Kyiv expected to receive more support during an upcoming conference in London, he added. (Reporting by Andrea Shalal and Katharine Jackson; editing by Susan Heavey)", "link": "https://finance.yahoo.com/news/ukraine-secures-5bln-more-funds-183205903.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.966, "neg": 0.017, "neu": 0.802, "pos": 0.181}}, {"date": "2023-04-14T18:23:11+00:00", "title": "US STOCKS-Wall St slides as rate hike expectations firm, banks surge", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window)\n\n*\n\nJPMorgan profit surges 52% on robust consumer business\n\n*\n\nWells Fargo, Citi profits climb on higher interest income\n\n*\n\nBlackRock profit beats on robust inflows\n\n*\n\nIndexes down: Dow 0.72%, S&P 0.62%, Nasdaq 0.90%\n\n(Updates to afternoon, adds NEW YORK dateline, changes byline)\n\nBy Stephen Culp\n\nNEW YORK, April 14 (Reuters) - Wall Street lost ground on Friday as a barrage of soft economic data appeared to affirm another interest rate hike from the Federal Reserve, dampening investor enthusiasm after a series of big U.S. bank earnings launched first-quarter reporting season.\n\nAll three major U.S. stock indexes were in the red, but coming on the heels of Thursday's robust rally, the S&P 500 and the Dow remained on track for weekly gains.\n\n\"Yesterday we saw one of the strongest rallies heading into earnings season in quite some time, so there was a really high bar for stocks to continue that rally,\" said Ross Mayfield, investment strategy analyst at Baird in Louisville, Kentucky.\n\nCitigroup Inc, JPMorgan Chase & Co and Wells Fargo & Co beat earnings expectations, benefiting from rising interest rates and easing fears of stress in the banking system.\n\n\"As expected, the bigger banks were probably not harmed that much by the regional banking turmoil, and possibly even beneficiaries of it,\" Mayfield added. \"We saw mostly strong and healthy balance sheets, and it's pretty clear (the regional banking) crisis isn't systemic.\"\n\nThe S&P 500 banking sector jumped 3.4% and JPMorgan Chase surged 7.3%, setting itself up for its biggest one-day percentage gain since Nov. 9, 2020.\n\nCitigroup advanced 5.0% while Wells Fargo edged 0.1% higher.\n\nBut a slew of mixed economic data including retail sales, industrial production and consumer sentiment cemented expectations that the Fed will hike rates another 25 basis points at next month's policy meeting.\n\nStory continues\n\nThose expectations were underscored by Atlanta Fed President Raphael Bostic, who said another 25 basis point hike could allow the Fed to end its tightening cycle, even as Chicago Fed President Austan Goolsbee called for the central bank to be prudent.\n\nAt last glance, financial markets have priced in an 80% likelihood of that happening, according to CME's FedWatch tool.\n\nAt 2:03 p.m. ET, the Dow Jones Industrial Average fell 245.05 points, or 0.72%, to 33,784.64; the S&P 500 lost 25.64 points, or 0.62%, at 4,120.58; and the Nasdaq Composite dropped 109.03 points, or 0.9%, to 12,057.24.\n\nAmong the 11 major sectors of the S&P 500, financials were the sole gainers.\n\nFirst-quarter earnings season hits full stride next week, with reports expected from a number of high profile companies including Goldman Sachs Group Inc, Morgan Stanley, Bank of America Corp, Netflix Inc and a long list of regional banks and industrials.\n\nAnalysts have lowered expectations, forecasting aggregate S&P 500 earnings having fallen by 4.8% from a year ago, a reversal of the 1.4% year-on-year gain seen at the beginning of the quarter.\n\nBlackRock Inc rose 2.8% after the world's largest asset manager beat quarterly profit expectations.\n\nBoeing Co slid 6.3% after the planemaker halted deliveries of some 737 MAXs due to a supplier quality problem attributed to Spirit AeroSystems.\n\nSpirit AeroSystems' shares swooned, falling 20.5%.\n\nShares of Lucid Group Inc dropped 7.6% following the luxury electric automaker's disappointing first-quarter production and delivery numbers.\n\nDeclining issues outnumbered advancers on the NYSE by a 3.01-to-1 ratio; on Nasdaq, a 2.58-to-1 ratio favored decliners.\n\nThe S&P 500 posted nine new 52-week highs and two new lows; the Nasdaq Composite recorded 37 new highs and 182 new lows.\n\n(Reporting by Stephen Culp; Additional reporting by Sruthi Shankar, Ankika Biswas and Bansari Mayur Kamdar in Bengaluru and Richard Chang)", "link": "https://finance.yahoo.com/news/us-stocks-wall-st-slides-182311106.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "C-PJ.US", "C.MX", "C.US", "CTGP34.SA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "TRVC.F", "TRVC.XETRA"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.065, "neu": 0.796, "pos": 0.139}}, {"date": "2023-04-14T17:28:45+00:00", "title": "Why Spirit AeroSystems Stock Is Down Today", "content": "Boeing (NYSE: BA) has a fresh problem with its 737 MAX, and it appears that supplier Spirit AeroSystems Holdings (NYSE: SPR) is at fault. Boeing and Spirit have a long history together. Spirit was part of Boeing until 2005 and remains a primary supplier to its commercial programs, including the 737 MAX line.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d2dcf649-7fd0-3ebb-8738-436c8fe51904/why-spirit-aerosystems-stock.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0.092, "neu": 0.782, "pos": 0.126}}, {"date": "2023-04-14T16:57:55+00:00", "title": "Stock market today: Dow closes lower on rate hike jitters, but notches 4th weekly win", "content": "By Yasin Ebrahim\n\nInvesting.com -- The Dow closed lower Friday, weighed down by a slide in Boeing and UnitedHealth while fresh fears of Federal Reserve rate hikes overshadowed a rally in bank stocks on strong quarterly earnings.\n\nTheDow Jones Industrial Average fell 0.4%, or 143 points, though notched a fourth-straight winning week higher. The Nasdaq fell 0.4% and the S&P 500 fell 0.2%.\n\nFed Governor Christopher Waller said further rate hikes were still needed to curb inflation, adding that investors shouldn’t “expect rates to fall any time soon.”\n\nThe hawkish remarks from Waller pushed the United States 2-Year sharply higher as investors upped their bets on further Fed monetary policy tightening ahead just as data showed signs of weakness in the consumer.\n\nThe report showed “further slowing in consumer spending, but importantly, not a sharp deterioration,” Morgan Stanley said in a note. “The largest declines were driven by a reversal in gas prices, but there was also broad-based weakness across nearly every category of spending,” it added.\n\nThe backdrop of rising rates weighed on tech with Microsoft (NASDAQ:MSFT) falling more than 1% followed by Apple Inc (NASDAQ:AAPL). But Amazon.com Inc (NASDAQ:AMZN) and Alphabet (NASDAQ:GOOGL) closed higher.\n\nFinancials, however, bucked the trend lower as major Wall Street banks kicked off the quarterly earnings season with mostly better-than-expected results.\n\nJPMorgan Chase&Co (NYSE:JPM) Chase about 7% after reporting first-quarter results that beat analyst estimates on the top and bottom lines as net interest margin was bolstered by higher interest rates.\n\nCitigroup Inc (NYSE:C) and Wells Fargo&Company (NYSE:WFC) also reported better-than-expected results to end the day up 4% and flat, respectively.\n\nThe recent bank turmoil did, however, have an impact on banks, with JPMorgan and Wells Fargo reporting a 7% and 8% decline in deposits from a year ago, respectively.\n\nGoldman Sachs (NYSE:GS) continues the earnings parade from banks next week, though regional banks will also dominate attention, with First Republic also set to report first-quarter results.\n\nStory continues\n\nIn other news, UnitedHealth Group (NYSE:UNH) fell more than 2% despite lifting its 2023 guidance and delivering first-quarter results that topped estimates.\n\nElectric vehicle maker Lucid Group Inc (NASDAQ:LCID), meanwhile reported preliminary first-quarter deliveries of 2,314 vehicles that fell short of estimates of 1,406, sending its shares more than 6% lower.\n\nRival EV maker Rivian Automotive (NASDAQ:RIVN) also dived into the red, down 7%, after Piper Sandler downgraded the stock to Neutral from Buy, citing worries about high costs.\n\nBoeing (NYSE:BA), a major Dow component, fell more than 5% after the aircraft maker warned it would have to halt some 737 Max deliveries, citing a new supplier quality problem.\n\nRelated Articles\n\nStock market today: Dow closes lower on rate hike jitters, but notches 4th weekly win\n\nElon Musk plans AI startup to rival OpenAI - FT\n\nCitigroup bets on ex-BofA exec Andy Sieg's connections to revamp wealth unit", "link": "https://finance.yahoo.com/news/stock-market-today-dow-closes-165755461.html", "symbols": ["AAPL.US", "AMZN.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "C-PJ.US", "C.MX", "C.US", "CTGP34.SA", "GOOGL.US", "GS.US", "JPM.US", "LCID.US", "MSFT.US", "RIVN.US", "TRVC.F"], "tags": [], "sentiment": {"polarity": 0.925, "neg": 0.067, "neu": 0.841, "pos": 0.092}}, {"date": "2023-04-14T16:28:00+00:00", "title": "There's Another Problem With Boeing's 737 Max (Here's What's Wrong)", "content": "Few airplanes have generated as much discussion, controversy and media attention as the Boeing 737 Max. Designed as the fourth and most efficient version of the narrow-body Boeing 737 , the new type of aircraft had its maiden flight in January 2016 but was then grounded worldwide between March 2019 and November 2020 after two crashes that took the lives of 346 people. In 2021, Boeing paid $2.5 billion to settle Department of Justice allegations that it defrauded the Federal Aviation Administration (FAA) by covering up defects.\n\nContinue reading", "link": "https://finance.yahoo.com/m/318d3f80-319b-3de9-bb11-235b36ce1502/there%27s-another-problem-with.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.474, "neg": 0.037, "neu": 0.893, "pos": 0.07}}, {"date": "2023-04-14T16:01:32+00:00", "title": "Big Bank's Big Q1 Performance, Florida Gov. Quietly Slips 6-Week Abortion Ban Into Law, Subway Sandwich Seeks $10B Sale: Today's Top Stories", "content": "Benzinga\n\nDeSantis Quietly Slips 6-Week Abortion Ban Into Law Despite Florida Residents Opposing It: 'We're Proud To Support Life'\n\nFlorida Governor Ron DeSantis quietly signed legislation prohibiting abortions after the first six weeks of pregnancy within the state on Thursday. DeSantis signed the measure, which would likely weigh on his 2024 presidential bid, just hours after the legislature passed it in the afternoon but announced it late in the evening on his Twitter account. \"We are proud to support life and family in the state of Florida,\" DeSantis said.\n\nElon Musk To Host Exclusive Twitter AMAs, Spaces Sessions For Subscribers\n\nElon Musk, the most followed person on Twitter, is ready to engage with netizens relatively more regularly — but there's a catch. On Friday, the tech billionaire and entrepreneur announced that he would be hosting an exclusive ask-me-anything session \"once every few weeks\" for subscribers. At this point, it is unclear whether Musk is referring to Twitter Blue subscribers or his subscribers — who can subscribe for his \"content\" by availing of the new \" Subscriptions \" feature as it is unavailable in all the regions around the world.\n\nPayPal's Outgoing CEO Dan Schulman Got A Significant Pay Cut for FY22, Down 32% To $22M\n\nPayPal Holdings Inc (NASDAQ: PYPL) granted $22.0 million to CEO Dan Schulman as CEO pay for FY22, down from $32.1 million a year ago. In February, Dan Schulman shared his plans to retire as CEO at year-end. The board has formed a CEO search committee and retained a search firm to help identify Schulman's successor.\n\nAmazon Seeks First Incentives For Virginia Headquarters\n\nAmazon.Com Inc (NASDAQ: AMZN) sought its first round of economic incentive payments from Virginia for its new Arlington headquarters. The incentive could imply over $152 million in state money paid to the tech giant by late 2026. The state promised up to $750 million for Amazon's new Northern Virginia offices, the first phase of which will likely open in June.\n\nStory continues\n\nElon Musk's SpaceX Holds Up Transporter-7 Launch Again As Weather Plays Spoilsport\n\nElon Musk's SpaceX has postponed the launch of Transporter-7 to April 14 at around midnight Pacific Time, citing unfavorable weather conditions. SpaceX is now looking to launch the Transporter-7 mission on Friday, April 14 at 11:47 p.m. PT from California, the company said on its website. Transporter-7 is the rocket manufacturer's seventh dedicated smallsat rideshare mission. Initially expected to be launched on April 11, it was postponed to April 13 and now again to April 14.\n\nPalantir-Backed Faraday Future Delays Deliveries Of Flagship EV Again, Seeks Funding\n\nCalifornia-based EV firm Faraday Future Intelligent Electric Inc (NASDAQ: FFIE) further postponed the delivery timeline of its FF 91 vehicles after certain suppliers flagged its inability to meet the company's timeline. Faraday Future will commence reservations for its FF 91 vehicles in late May, the company said in a statement on Thursday. Those who reserve will take possession of the vehicle in the second phase of the three-phase delivery process, expected to commence at the end of the second quarter.\n\nWells Fargo Q1 Results Beat Expectations, Net Interest Income Jumps 45%\n\nWells Fargo & Co (NYSE: WFC) shares are up 3% premarket Friday following its solid first-quarter results that beat Street expectations. WFC reported first-quarter FY23 revenue growth of 17% year-over-year to $20.73 billion, beating the consensus of $20.07 billion. Q1 Net interest income was $13.3 billion (+45% Y/Y), and noninterest income was $7.4 billion (-13% Y/Y).\n\nJPMorgan's Shares Surge On Q1 Earnings: 25% Revenue Growth, 51% Jump In Credit Loss Provision, and FY23 NII Outlook of $81B\n\nJPMorgan Chase & Co (NYSE: JPM) reported Q1 net revenue (managed) of $39.3 billion, up 25% Y/Y, beating the consensus of $36.2 billion. Reported revenue was $38.35 billion, up 21.4% Y/Y. Noninterest revenue stood at $18.5 billion, up 5% Y/Y, on higher CIB Markets noninterest revenue. Noninterest expense increased 5% Y/Y to $20.1 billion due to higher structural costs and ongoing investments.\n\nUK Veterinary Drugmaker Dechra Pharma In Discussions With EQT For Possible Deal Of Around £5 Billion Takeover\n\nPrivate Equity EQT is discussing a possible takeover offer of a U.K. veterinary pharmaceutical company Dechra Pharmaceuticals Plc (OTC: DCHPF) (OTC: DPHAY), sending shares gaining over 30% on Friday morning in response. Dechra Pharmaceuticals confirmed that it has entered into discussions with the Swedish private equity giant about a possible all-cash offer. The bid would value Dechra, listed on the FTSE 250, at roughly £4.6 billion.\n\nFDA Strikes Down Eli Lilly's Application Seeking Approval For Ulcerative Colitis Drug\n\nThe FDA has issued a complete response letter for Eli Lilly And Co's (NYSE: LLY) mirikizumab biologic license application (BLA) for ulcerative colitis (UC). In the letter, the FDA cited issues related to the proposed manufacturing of mirikizumab, with no concerns about the clinical data package, safety, or label for the medicine. In January, the FDA issued a complete response letter for the accelerated approval submission of Eli Lilly's donanemab for early symptomatic Alzheimer's disease due to the limited number of patients with at least 12 months of drug exposure data provided in the submission.\n\nBP Starts Pumping Crude At Argos Platform In The Gulf Of Mexico\n\nBP plc (NYSE: BP) has started oil production at its Argos offshore platform in the Gulf of Mexico. Argos has a gross production capacity of up to 140,000 barrels of oil daily. It is BP's fifth platform in the Gulf of Mexico and the region's first new BP-operated production facility since 2008. Argos is expected to increase BP's gross operating production capacity in the Gulf of Mexico by 20%.\n\nCNBC\n\nDid Jim Cramer Just Jinx Boeing With His 'Really Incredible' Comment?\n\nCNBC Mad Money host Jim Cramer is notorious for his calls that invariably go wrong, so much so that an Inverse Cramer Tracker ETF has recently been launched to capitalize on his bets that go awry. Cramer was at it again late Thursday when he tweeted about aerospace giant Boeing Co (NYSE: BA). \"Boeing's really incredible,\" he said. Arlington, Virginia-based Boeing said Thursday that production issues would impact deliveries of a significant number of 737 Max jets, multiple media reports said, citing the company.\n\nBloomberg\n\nWeightWatchers Latest Strategic Acquisition: Simplify Insurance Reimbursement For Costly Weight-Loss Drugs\n\nWW International Inc (NASDAQ: WW) or WeightWatchers snapped telemedicine company Sequence in March after scanning through 30 different startups that prescribe obesity medications, CEO Sima Sistani said. Sistani credited Sequence for building a superior tech stack in Thursday's Bloomberg Radio interview. Sequence's preauthorization engine helped ease the challenges of health insurance reimbursement for the costly obesity drugs, Sistani said.\n\nLong COVID-Fatigue Impacts 50M People - Axcella Health Seeks Funding To Support Drug Development\n\nAxcella Health Inc (NASDAQ: AXLA) is reportedly looking for funding to support its advanced trial of a drug initially found to improve fatigue in long Covid patients. An early-stage trial of the drug, dubbed AXA1125, with the University of Oxford, found that participants given the treatment significantly improved fatigue compared with those in the placebo arm, according to the results published Friday in the Lancet eClinical Medicine journal. Axcella has the U.S. and the U.K. regulatory authorization to proceed with advanced trials, and the company plans to enroll about 300 people once funding is secured.\n\nWall Street Journal\n\nSubway Sandwiches: The Latest Menu Item on Billionaire Investors' Plates\n\nA bidding war has started for the auction of the sandwich chain, Subway, with suitors heading toward the second round of bidding. There are over ten possible suitors, including some big private equity companies. Subway is seeking a valuation of $10 billion or more. The company's advisors have eliminated several interested parties for offering a low valuation in the first pool of bids last month.\n\nPhoto via Wikimedia Commons\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Big Bank's Big Q1 Performance, Florida Gov. Quietly Slips 6-Week Abortion Ban Into Law, Subway Sandwich Seeks $10B Sale: Today's Top Stories originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/big-banks-big-q1-performance-160132599.html", "symbols": ["AMZN.US", "AXLA.US", "BA.US", "BP.US", "FFIE.US", "JPM.US", "LLY.US", "PYPL.US", "WFC.US", "WW.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.057, "neu": 0.804, "pos": 0.138}}, {"date": "2023-04-14T15:50:14+00:00", "title": "Dow Jones Slumps 225 Points Despite Big JPMorgan Rally; Boeing Dives On 737 MAX Halt; On Holding Jumps 3.5%", "content": "Dow Jones and other stock indexes held modest losses near midday Friday as investors weighed a round of earnings in the financial sector.\n\nContinue reading", "link": "https://finance.yahoo.com/m/7f25468b-ac00-357c-8a5f-32570550790f/dow-jones-slumps-225-points.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX"], "tags": [], "sentiment": {"polarity": -0.402, "neg": 0.105, "neu": 0.895, "pos": 0}}, {"date": "2023-04-14T15:27:06+00:00", "title": "Boeing pauses deliveries of 737 MAX jet, stock declines", "content": "Yahoo Finance Live’s Ines Ferre joins the Live show to discuss the decline in stock for Boeing.\n\nVideo Transcript\n\nINES FERRE: Our trending ticker Boeing pausing deliveries of its 737 MAX jet due to parts production problems. This is in addition to existing delivery problems with a decline in February due to lingering supply chain issues and a delivery pause on the Dreamliner. Boeing shares are down more than 5 and 1/2%, dragging on the Dow.", "link": "https://finance.yahoo.com/video/boeing-pauses-deliveries-737-max-152706297.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.494, "neg": 0.07, "neu": 0.902, "pos": 0.028}}, {"date": "2023-04-14T15:21:46+00:00", "title": "Ryanair summer holiday flights at risk from Boeing 737 Max delays", "content": "ryanair\n\nRyanair is scrambling to understand the impact of fresh production delays for Boeing’s flagship 737 Max on its summer holiday schedule.\n\nEurope’s biggest airline is scheduled to receive 24 of the aircraft between now and June ahead of a busy summer season.\n\nRyanair is planning to carry a record number of passengers - some 185 million - in the year to March 2024.\n\nMichael O’Leary, the budget airline’s chief executive, has previously warned that passenger targets could be under threat if 737 Max deliveries in the first half of the 2023 calendar year were even 10 fewer than expected.\n\nBut Boeing announced overnight on Thursday that it has discovered production errors in making its popular but troubled planes.\n\nSpirit AeroSystems, one of Boeing’s suppliers, was using a process to install fittings in the jets which did not comply with strict aviation regulations, the US firm said.\n\nThe production method “is not an immediate safety of flight issue” and will not affect jets already being flown, the plane-maker added.\n\nA spokesman for Ryanair said: “This Boeing announcement does not affect Ryanair’s current fleet of 540 737 aircraft. We are assessing with Boeing how this will impact the 24 737 aircraft which are scheduled for delivery in the remainder of April, May and June.” Boeing 737 Max aircraft - REUTERS/Peter Cziborra/File Photo\n\nBoeing’s 737 Max and rival Airbus’s A320 single-aisle jets are the workhorses of cross-continental flight, carrying passengers between European and North American cities for work and holidays.\n\nThey have both been crucial in the nascent recovery of air travel after the pandemic. Any slowdown in production could hit airlines’ plans for expansion.\n\nBoeing is also struggling to recover confidence in the 737 Max after two fatal crashes in 2018 and 2019 claimed the lives of 346 passengers and triggered a grounding of the craft. Faulty software was found to be the cause.\n\nThe company said it had told its regulator, the Federal Aviation Administration, about the construction error, adding that it was “working to conduct inspections and replace the non-conforming fittings where necessary”.\n\nStory continues\n\nThe problem affects other craft in the 737 Max “family”, Boeing said, including the Max 7, Max 8 and Max 8200 planes, in addition to the P-8 Poseidon maritime surveillance aircraft.\n\nSpirit said it and Boeing would work towards a solution.\n\nSmaller jets contribute the majority of sales at both Boeing and Airbus, with intercontinental jets with two aisles proving less popular among customers.\n\nAlthough the 737 Max jets have now been signed off as safe by regulators, Boeing has been hit by supply chain problems and production delays. But airlines are keen to acquire the aircraft as it will cut carriers’ fuel costs and reduce emissions.\n\nIn February, it emerged Boeing would cut 2,000 office jobs in the US as the struggling planemaker battles to improve its stalling production line.\n\nRoughly a third of the roles being cut will be outsourced to India, The Seattle Times reported, with the remainder disappearing completely.\n\nBoeing said it will increase its overall workforce size by 10,000 this year, with a “focus on engineering and manufacturing” roles. The firm’s headcount grew by 15,000 last year.", "link": "https://uk.finance.yahoo.com/news/ryanair-summer-holiday-flights-risk-152146344.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "RY4C.F", "RY4C.XETRA", "RYAAY.US", "RYAOF.US"], "tags": [], "sentiment": {"polarity": -0.913, "neg": 0.088, "neu": 0.843, "pos": 0.069}}, {"date": "2023-04-14T14:53:45+00:00", "title": "Why Boeing Stock Is Falling Today", "content": "Boeing (NYSE: BA) has once again paused 737 MAX deliveries after a new supplier quality problem was discovered. Investors are not pleased, sending Boeing shares down as much as 7% on Friday morning. Boeing's 737 MAX has been a star-crossed program from the beginning.\n\nContinue reading", "link": "https://finance.yahoo.com/m/dcce1f16-6e64-3cda-a936-229cbe2770a2/why-boeing-stock-is-falling.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.263, "neg": 0.09, "neu": 0.864, "pos": 0.046}}, {"date": "2023-04-14T14:24:22+00:00", "title": "S&amp;P 500 slumps as Fed rate hike fears overshadow earnings-led rally in banks", "content": "By Yasin Ebrahim\n\nInvesting.com -- The S&P 500 slumped Friday, as a rally in bank stocks on strong quarterly earnings was offset by fresh fears of Federal Reserve rate hikes just as data flagged signs of a weaker consumer.\n\nThe S&P 500 fell 0.7%, the Dow Jones Industrial Average added 0.8%, or 261 points, and the Nasdaq fell 0.9%.\n\nFed Governor Christopher Waller said further rate hikes were still needed to curb inflation, adding that investors shouldn’t “expect rates to fall any time soon.”\n\nThe hawkish remarks from Waller pushed the United States 2-Year sharply higher as investors upped their bets on further Fed monetary policy tightening just as data showed signs of weakness in the consumer.\n\nThe report showed “further slowing in consumer spending, but importantly, not a sharp deterioration,” Morgan Stanley said in a note. “The largest declines were driven by a reversal in gas prices, but there was also broad-based weakness across nearly every category of spending,” it added.\n\nThe backdrop of rising rates weighed heavy on big tech, except for Alphabet (NASDAQ:GOOGL), with Microsoft (NASDAQ:MSFT) falling more than 1% following Apple Inc (NASDAQ:AAPL) and Meta Platforms Inc (NASDAQ:META).\n\nFinancials, however, bucked the trend lower as major Wall Street banks kicked off the quarterly earnings season with mostly better-than-expected results.\n\nJPMorgan Chase&Co (NYSE:JPM) Chase was up about 7% after reporting first-quarter results that beat analyst estimates on the top and bottom lines as net interest margin was bolstered by higher interest rates.\n\nWells Fargo &Company (NYSE:WFC) and Citigroup Inc (NYSE:C) were also in rally mode after reporting better-than-expected results, rising more than 1% and 4%, respectively.\n\nThe recent bank turmoil did, however, have an impact on banks, with JPMorgan and Wells Fargo reporting a 7%% and 8% decline in deposits from a year ago.\n\nIn other news, UnitedHealth Group (NYSE:UNH) fell more than 2% despite lifting its 2023 guidance and delivering first-quarter results that topped estimates.\n\nStory continues\n\nElectric vehicle maker Lucid Group Inc (NASDAQ:LCID), meanwhile reported preliminary first-quarter deliveries of 2,314 vehicles that fell short of estimates of 1,406, sending its shares more than 5% lower.\n\nRival EV maker Rivian Automotive (NASDAQ:RIVN) also dived into the red, down 8%, after Piper Sandler downgraded the stock to Neutral from Buy, citing worries about high costs.\n\nBoeing (NYSE:BA), a major Dow component, fell more than 5% after the aircraft maker warned it would have to halt some 737 Max deliveries, citing a new supplier quality problem.\n\nRelated Articles\n\nQ1 earnings for S&P 500 seen falling 4.8% vs yr ago -Refinitiv\n\nWall St slides to lower close as rate hike bets firm, banks jump", "link": "https://finance.yahoo.com/news/p-500-slumps-fed-rate-142422916.html", "symbols": ["AAPL.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "C.US", "GOOGL.US", "JPM.US", "LCID.US", "META.US", "MSFT.US", "RIVN.US", "UNH.US", "WFC.US"], "tags": [], "sentiment": {"polarity": -0.669, "neg": 0.075, "neu": 0.861, "pos": 0.064}}, {"date": "2023-04-14T13:45:16+00:00", "title": "Boeing 737 MAX manufacturing issue expected to \"impact\" Southwest Airlines", "content": "(Reuters) - Southwest Airlines expects an ongoing Boeing 737 MAX manufacturing problem to delay some plane deliveries this year, Southwest said Friday.\n\n“We are in discussions with Boeing to understand what that impact will be in 2023 and beyond,” the company said.\n\nThe manufacturing problem involves fittings that were incorrectly installed on the fuselage made by Spirit AeroSystems.\n\nSouthwest -- which exclusively flies the 737 -- initially expected to receive 100 planes from Boeing in 2023, but the company dropped that projection down to 90 jets, according to regulatory filings published by the company on March 14.\n\n(Reporting by Valerie Insinna)", "link": "https://finance.yahoo.com/news/boeing-737-max-manufacturing-issue-134516507.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "LUV.MX", "LUV.US", "SWN.F"], "tags": [], "sentiment": {"polarity": -0.459, "neg": 0.052, "neu": 0.935, "pos": 0.013}}, {"date": "2023-04-14T13:42:56+00:00", "title": "Boeing stock slides as company halts 737 MAX deliveries", "content": "Yahoo Finance Live’s Brad Smith and Brian Sozzi break down the decline in stock for Boeing.\n\nVideo Transcript\n\nBRIAN SOZZI: Boeing shares are flying into some turbulence as the discovery of a parts compliance issue brings its 737 MAX deliveries to a halt. We're seeing Boeing shares really hammered here, Brad, down about 5% here. Losses really accelerating here throughout the early going. And very disappointing for Boeing. Just a couple of weeks ago--\n\nI'll do a name drop here because it's Friday. And I feel like I want to do that. I talked to Dave Calhoun on a call when they struck a big, almost $40 billion deal with Saudi Arabia. And he sounded like a confident CEO. CEOs are always confident. But he sounded like, you know what, Brian, we're starting to get beyond the major problems-- production problems we have had. He told me that the supply chain was starting to improve.\n\nAnd then, Brad, you have news like this. And it's just like, wow, what is the state of Boeing? And when are they officially going to be just that good, old-fashioned US manufacturer that is steady Eddie? And maybe it's not today.\n\nBRAD SMITH: Yeah, into some of the numbers here, during the first quarter of 2023, they delivered about 113 737 MAXes. Of course, the news today is that they're going to have to halt and ultimately inspect for where Spirit AeroSystems and the kind of manufacturing mishap took place.\n\nBut here's where the real issue is. The number of-- we mentioned 113 737 commercial airplanes in delivery that had taken place during the first quarter. That was out of a pie of 130 total, which means you only had one 747 get delivered. You only had one 767 get delivered. You only had 777s get delivered and then 11 787s there.\n\nNow, at the end of the day for Boeing, this is important to remember because between Boeing and Airbus, they make up essentially 90% based on some Thiel Group data, 90%, if not more than that, of the large plane orders internationally. And so with that in mind, I mean this is significant because it really paints this picture, at least in the orders that Boeing has taken on, where there are still some of the uncovers of where--\n\nStory continues\n\nAnd Spirit AeroSystems, this is not the first time that they've been in the news about one of these issues with regard to the production. So at the end of the day, I think coming right back to that, it just goes, once again, against everything that Boeing's been trying to paint in this recovery story as well, which, for the 737, had done well. I flew a 737 a couple of weeks back.\n\nBRIAN SOZZI: You actually flew the plane?\n\nBRAD SMITH: I did not fly it.\n\nBRIAN SOZZI: Oh, I've been on the show in a while. So I've missed, I think, a couple of things. But I thought, wow, what did I miss?\n\nBRAD SMITH: I've got a lot of side gigs, flying planes isn't one of them.\n\n[LAUGHTER]\n\nBRIAN SOZZI: Wow, my god.\n\nBRAD SMITH: I wish.\n\nBRIAN SOZZI: Oh, it's Friday.", "link": "https://finance.yahoo.com/video/boeing-stock-slides-company-halts-134256322.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0.031, "neu": 0.864, "pos": 0.105}}, {"date": "2023-04-14T13:41:09+00:00", "title": "Boeing Falls as Parts Issue Stifles 737 Max Deliveries", "content": "(Bloomberg) -- Boeing Co. is pausing deliveries of some 737 Max jets to address a production issue on the rear end of some aircraft, dealing a setback to the US manufacturer just as it ramps up production of the model that’s a major cash cow for the company.\n\nMost Read from Bloomberg\n\nUS Embarrassed After 21-Year-Old Arrested in Classified Documents Leak Arnault's Wealth Soars to $210 Billion, Leaving Musk in the Dust US-Saudi Oil Pact Breaking Down as Russia Grabs Upper Hand JPMorgan Says Frank’s Javice Moved Millions to a Shell Company US Arrests 21-Year-Old National Guardsman in Classified Documents Leak\n\nThe shares fell 6.1% to $200.49 as of 9:37 a.m. in New York Friday after Boeing said late Thursday it expects deliveries to decline in the near-term as it inspects affected aircraft. Spirit AeroSystems Holdings Inc., which supplies the faulty part, declined 18% — its biggest drop in more than three years — to $29.18.\n\nBoeing was just regaining its footing following years of turmoil caused by the pandemic and a global grounding of the single-aisle Max. The planemaker had been briefing customers on plans to increase production rates of the Max, Bloomberg reported last week. Days later, Boeing reported a surge in quarterly deliveries that outpaced rival Airbus SE for the first time in almost five years.\n\n“Prior to the announcement, Boeing was coming off a high,” Jefferies analyst Sheila Kahyaoglu wrote in a note.\n\nBased on preliminary knowledge, the analyst expects to cut her estimate for Max deliveries this year by 20% from its current level of 425 planes. She sees an $800 million hit to free cash flow for Boeing, where the Max represents more than a quarter of expected 2023 revenue.\n\nRead More: Boeing to Boost Output of 737 Jets in Push for More Cash\n\nThe planemaker said it was formally notified of the issue on April 12 by Spirit, which assembles most of the 737’s aluminum frame. The problem involves two of the eight fittings that attach the jet’s vertical tail to the rear end of its fuselage.\n\nStory continues\n\nThe issue involves Boeing’s best-selling 737 Max 8, Max 7, a high-density version, along with a militarized 737 known as the P-8. Spirit and Boeing said they have identified the production numbers of the planes with the problematic fittings, though not every jet is affected.\n\nIt’s too soon to tell if the quality flaw will affect Boeing’s plans to speed up 737 production. The planemaker is working to learn the extent of the problem and what’s required to address it, according to the company.\n\nAirlines’ Max Dependence\n\nUnited Airlines Holdings Inc. said it doesn’t expect a significant impact to flying plans for the summer. Southwest Airlines Co. said it’s talking with Boeing to determine the effect on deliveries this year and beyond, but has a “near term cushion” in terms of available aircraft.\n\nSouthwest, which is counting on the Max for future fleet growth, estimates it will receive 100 of the aircraft this year, while United is scheduled to receive 135, according to regulatory filings.\n\nThe manufacturing issue doesn’t immediately affect the safety of planes in the air, Boeing said. It likely involves a significant number of undelivered aircraft that are either in production or storage, and a portion of in-service jets built as far back as 2019, according to the company.\n\nBoeing stock was down about 4.8% in European trading on Friday, after closing at $213.59 in New York. Wichita, Kansas-based Spirit fell 12% from its Thursday close of $35.60.\n\nWhat Bloomberg Intelligence Says:\n\n“The stoppage is concerning given the airplane is vital to Boeing’s turnaround. Its importance likely means a remedy will be urgently pursued, though reworking it could be costly and an extended pause would significantly hurt commercial profit, cash generation and the balance sheet.”\n\n— George Ferguson, BI aerospace industry analyst\n\nClick here to read the research\n\n“We have processes in place to address these of types of production issues upon identification, which we are following,” Spirit said in a separate statement. “Spirit is working to develop an inspection and repair for the affected fuselages.”\n\nInspections, Rework\n\nThe inspections will take place in an accessible area of the structure. That means any rework is likely to be far less disruptive than Boeing’s repairs to address structural imperfections with the 787 Dreamliner, the company said.\n\nDeliveries of those planes were halted for more than a year, starting in mid-2021, over tiny manufacturing flaws in the jet’s carbon-composite frame. In some instances they could only be reached by ripping out aircraft cabins.\n\nBoeing temporarily paused Dreamliner deliveries again earlier this year after learning of a documentation issue with a fuselage component. Analysts expect Boeing officials to provide updates on the company’s efforts to stabilize 737 and 787 production at its April 18 annual meeting and first-quarter earnings report on April 26.\n\n“This is another loss of credibility and trust in Boeing production quality and standards,” said aviation consultant Mark D Martin. “While the extent of the rework required is unknown, on the face of it, it could be extremely expensive.”\n\n--With assistance from Richard Clough, Siddharth Philip, Anurag Kotoky and Mary Schlangenstein.\n\n(Updates with opening shares in second paragraph; Adds airlines comments from ninth paragraph.)\n\nMost Read from Bloomberg Businessweek\n\nA Smart Gun Is Finally Here, But Does Anyone Want It? There Are No Fees at America’s Smallest Bank Inside the IRS’s Shrinking Band of Wealth Hunters Death, Taxes and ‘Teflon Don’ The Business of … Death\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/boeing-falls-parts-issue-stifles-103440413.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.939, "neg": 0.056, "neu": 0.872, "pos": 0.072}}, {"date": "2023-04-14T13:06:38+00:00", "title": "Midday movers: JPMorgan Chase, Boeing, Express and more", "content": "By Liz Moyer\n\nInvesting.com -- Stocks are falling on Friday as investors digested big bank earnings and a weaker-than-expected report on retail sales. Here are the market movers for April 14.\n\nJPMorgan Chase&Co (NYSE:JPM) shares rose 6.9% after the bank reported record revenue that beat expectations, fueled by a 49% rise in net interest income compared with the same time last year after the Fed's aggressive rate increases. Citigroup Inc (NYSE:C) shares rose 3.9%.  Boeing Co (NYSE:BA) shares were down 5.6% after the plane maker suspended deliveries of some 737 MAX jets on a part supply problem. Boeing said there isn't an immediate safety issue and planes in service can continue flying.  Express Inc (NYSE:EXPR) shares jumped 31% after the retailer, teaming up with WHP Global, inked a deal to acquire the menswear brand Bonobos from Walmart (NYSE:WMT) for a reported $75 million.\n\nUnitedHealth Group Incorporated (NYSE:UNH) shares fell 2.6% after the health insurer reported results that beat expectations and raised its forecast for profit in 2023.\n\nLucid Group Inc (NASDAQ:LCID) shares fell 7.1% after the electric vehicle maker reported it delivered fewer Air sedans in the first quarter than it produced and missed expectations for delivery numbers.\n\nRelated Articles\n\nMidday movers: JPMorgan Chase, Boeing, Express and more\n\nElon Musk is reportedly working on an OpenAI rival\n\nJPMorgan amasses deposits as customers move money to largest U.S. bank", "link": "https://finance.yahoo.com/news/midday-movers-jpmorgan-chase-boeing-130638655.html", "symbols": ["02Z.F", "BA.US", "C.US", "EXPR.US", "JPM.US", "LCID.US", "UNH.MX", "UNH.US", "UNH.XETRA", "UNHH34.SA", "WALM34.SA", "WMT.F", "WMT.MX", "WMT.US", "WMT.XETRA"], "tags": [], "sentiment": {"polarity": 0.749, "neg": 0.053, "neu": 0.868, "pos": 0.079}}, {"date": "2023-04-14T12:44:00+00:00", "title": "These Stocks Are Moving the Most Today: JPMorgan, Wells Fargo, Citigroup, Boeing, Catalent, Lucid,  and More", "content": "JPMorgan Chase, Wells Fargo, and Citigroup report first-quarter earnings that beat estimates, while Boeing shares fall after the airplane maker halts deliveries of its 737 MAX jet.\n\nContinue reading", "link": "https://finance.yahoo.com/m/354824f1-77f1-357d-a0ff-1f8a766e9845/these-stocks-are-moving-the.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.494, "neg": 0, "neu": 0.865, "pos": 0.135}}, {"date": "2023-04-14T12:38:00+00:00", "title": "Boeing Halts 737 MAX Deliveries. The Stock Tanks.", "content": "The aerospace company said a supplier told it a nonstandard manufacturing process was used in installing fittings on some airplanes.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e854c3ad-d7da-35c8-a1e2-a2651e997566/boeing-halts-737-max.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-04-14T12:24:33+00:00", "title": "Boeing Stock Sinks On 737 Production Issue; Analysts 'Cautiously Optimistic' BA Can Meet Guidance", "content": "Boeing stock sank Friday after warning of weaker 737 Max production and deliveries for the short term, citing a parts issues.\n\nContinue reading", "link": "https://finance.yahoo.com/m/3fee16ba-5740-3457-97ca-632f8c822d2e/boeing-stock-sinks-on-737.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.649, "neg": 0.209, "neu": 0.791, "pos": 0}}, {"date": "2023-04-14T11:21:00+00:00", "title": "US STOCKS-S&amp;P 500, Dow futures pare losses after resilient bank earnings", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window)\n\n*\n\nBlackRock first-quarter profit beats on robust inflows\n\n*\n\nWells Fargo profit rises as higher rates bolster interest income\n\n*\n\nJPMorgan profit surges 52% on robust consumer business\n\n*\n\nFutures down: Dow 0.03%, S&P 0.10%, Nasdaq 0.52%\n\n(Updates prices throughout)\n\nBy Sruthi Shankar and Ankika Biswas\n\nApril 14 (Reuters) - Futures tied to the S&P 500 and the Dow pared losses on Friday as resilient earnings from big U.S. banks helped assuage fears of further stress in the sector after the failure of two mid-sized lenders last month sparked concerns about a potential recession.\n\nWells Fargo & Co and JPMorgan Chase & Co reported a rise in first-quarter profits on the back of higher interest rates and their shares were up 1.0% and 4.5%, respectively.\n\nBlackRock Inc's quarterly profit also beat analysts' estimates as investors continued to pour money in the world's largest asset manager's various funds. The stock was up 1.1% in thin volumes.\n\n\"Early bank earnings numbers are suggesting that U.S. finance houses have so far managed to weather the impact of the Fed's tighter monetary policy and are posting results that are proving better than forecast,\" Equiti Capital economist Stuart Cole said.\n\n\"However, markets will likely be scrutinizing balance sheets closely to ascertain exposure to troubled sectors such as commercial and retail real estate, which continue to suffer from post-Covid working pattern changes and higher financing costs.\"\n\nData on Wednesday showed the Federal Reserve's lending to banks eased further in the latest week, signaling that while the absolute levels of emergency credit remain high, financial sector strains are continuing to ease.\n\nThe S&P 500 banks index has lagged the broader S&P 500 this year with a 13% decline, while the KBW Regional Banking index has already lost 20% in its worst performance since 2009.\n\nStory continues\n\nRegional bank PNC Financial Services Group Inc rose 3.8% after its quarterly earnings.\n\nThe S&P 500 and the Dow Jones Industrial closed at almost two-month highs on Thursday as economic data showed cooling inflation and a loosening labor market, fueling optimism that the Fed could be nearing the end of its aggressive interest rate-hike cycle.\n\nAdding to the narrative, Atlanta Fed President Raphael Bostic on Friday said another 25-basis point rate hike can allow the U.S. central bank to end its tightening cycle with some confidence that inflation will steadily return to the 2% target.\n\nInvestors will keep an eye out for comments from Fed Board Governor Christopher Waller on economic outlook later in the day.\n\nData on Friday is expected to show retail sales slipped 0.4% in March, on a month-over-month basis, likely maintaining the pace of decline in February. The University of Michigan's consumer sentiment index for April is also due later in the day.\n\nAmong other big-ticket earnings, healthcare conglomerate UnitedHealth Group Inc beat estimates for quarterly profit and raised its annual forecast, pushing its shares up 0.7%.\n\nAt 7:00 a.m. ET, Dow e-minis were down 9 points, or 0.03%, S&P 500 e-minis were down 4 points, or 0.10%, and Nasdaq 100 e-minis were down 68.75 points, or 0.52%.\n\nBoeing Co fell 5.9% after the planemaker halted deliveries of some 737 MAXs due to a supplier quality problem by Spirit AeroSystems.\n\nSpirit AeroSystems' shares tumbled 11.8%.\n\nLucid Group Inc dropped 6.8% after the luxury electric-car maker reported first-quarter production and delivery figures that were lower than the preceding three months.\n\n(Reporting by Sruthi Shankar and Ankika Biswas in Bengaluru; Editing by Shounak Dasgupta)", "link": "https://finance.yahoo.com/news/us-stocks-p-500-dow-112100571.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BLAK34.SA", "BLK.MX", "BLK.US", "BLQA.F", "BOEI34.SA", "GSPC.INDX", "NWT.F", "NWT.XETRA", "WFC-PL.US", "WFC-PQ.US", "WFC-PR.US", "WFC-PY.US", "WFC.BA", "WFC.MX", "WFC.US", "WFCO34.SA"], "tags": [], "sentiment": {"polarity": 0.973, "neg": 0.063, "neu": 0.83, "pos": 0.107}}, {"date": "2023-04-14T11:15:39+00:00", "title": "U.S. stocks were falling after bank earnings and retail sales", "content": "By Liz Moyer\n\nInvesting.com -- U.S. stocks turned negative after record revenue by JPMorgan Chase (NYSE:JPM) kicked off the first-quarter reporting season and retail sales data was weaker than expected.\n\nAt 11:10 ET (15:10 GMT), the Dow Jones Industrial Average was down 177 points or 0.5%, while the S&P 500 was down 0.3% and the NASDAQ Composite was down 0.4%.\n\nJPMorgan, Citigroup (NYSE:C) and Wells Fargo (NYSE:WFC) all beat expectations for the quarter, which was marred by turbulence from the collapse of two big banks.\n\nBut retail sales fell by a more than expected 1% in March from the month before as shoppers cut back their spending on vehicles and other big-ticket purchases.\n\nRecent economic data, including retail sales, have shown signs that the economy is cooling after the Federal Reserve’s aggressive attack on inflation through successive interest rate hikes. Futures traders are betting on another quarter of a percentage point rate hike at the Fed’s next meeting in May.\n\nAtlanta Fed President Raphael Bostic said Friday that a quarter of a point increase could mean the central bank can end its tightening cycle with some confidence that it has nudged inflation in the direction of its 2% target.\n\nConsumer sentiment is holding up. The University of Michigan's consumer sentiment index for April was 63.5 versus expectations for 62.\n\nUnitedHealth Group Incorporated (NYSE:UNH) shares fell 2.9% after it beat estimates for quarterly profit and raised its outlook for the year.\n\nBoeing Co (NYSE:BA) shares fell more than 5.6% after it stopped deliveries of some 737 MAXs because of a supplier quality problem.\n\nOil was rising. Crude Oil WTI Futures rose 0.6% to $82.71 a barrel, while Brent Oil Futures rose 0.3% to $86.34 a barrel. Gold Futures fell 2% to $2,013.\n\nRelated Articles\n\nU.S. stocks were falling after bank earnings and retail sales\n\nGermany stocks mixed at close of trade; DAX up 0.50%\n\nWall St falls as Fed seen on track to hike rates; banks shine", "link": "https://finance.yahoo.com/news/u-stocks-were-falling-bank-111539129.html", "symbols": ["BA.US", "C.US", "DJI.INDX", "IXIC.INDX", "JPM.US", "UNH.US", "WFC.US"], "tags": [], "sentiment": {"polarity": -0.758, "neg": 0.076, "neu": 0.866, "pos": 0.058}}, {"date": "2023-04-14T11:07:32+00:00", "title": "Boeing hit by new manufacturing delays for flagship 737 Max", "content": "Boeing 737 Max - Lindsey Wasson/Reuters\n\nAviation giant Boeing said it has discovered production errors in making its popular but troubled 737 Max planes, dealing a blow to the US manufacturer’s long recovery.\n\nSpirit AeroSystems, one of Boeing’s suppliers, was using a process to install fittings in the jets which did not comply with strict aviation regulations, it said.\n\nThe production method “is not an immediate safety of flight issue” and will not affect jets already being flown, the plane-maker added.\n\nBoeing’s 737 Max and rival Airbus’s A320 single-aisle jets are the workhorses of cross-continental flight, carrying passengers between European and North American cities for work and holidays.\n\nThey have both been crucial in the nascent recovery of air travel after the pandemic. Any slowdown in production could hit airlines’ plans for expansion. Boeing 737 Max - Lindsey Wasson/Reuters\n\nBoeing is also struggling to recover confidence in the 737 Max after two fatal crashes in 2018 and 2019 claimed the lives of 346 passengers and triggered a grounding of the craft. Faulty software was found to be the cause.\n\nThe company said it had told its regulator, the Federal Aviation Administration, about the construction error, adding that it was “working to conduct inspections and replace the non-conforming fittings where necessary”.\n\nThe problem affects other craft in the 737 Max “family”, Boeing said, including the Max 7, Max 8 and Max 8200 planes, in addition to the P-8 Poseidon maritime surveillance aircraft.\n\nSpirit said it and Boeing would work towards a solution.\n\nSmaller jets contribute the majority of sales at both Boeing and Airbus, with intercontinental jets with two aisles proving less popular among customers.\n\nAlthough the 737 Max jets have now been signed off as safe by regulators, Boeing has been hit by supply chain problems and production delays. But airlines are keen to acquire the aircraft as it will cut carriers’ fuel costs and reduce emissions.\n\nIn February, it emerged Boeing would cut 2,000 office jobs in the US as the struggling planemaker battles to improve its stalling production line.\n\nRoughly a third of the roles being cut will be outsourced to India, The Seattle Times reported, with the remainder disappearing completely.\n\nBoeing said it will increase its overall workforce size by 10,000 this year, with a “focus on engineering and manufacturing” roles. The firm’s headcount grew by 15,000 last year.", "link": "https://uk.finance.yahoo.com/news/boeing-hit-manufacturing-delays-flagship-110732759.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": -0.915, "neg": 0.107, "neu": 0.815, "pos": 0.078}}, {"date": "2023-04-14T11:02:00+00:00", "title": "Bank Earnings Are Here. They’re a Test of Whether ‘Crisis’ Is Really Over.", "content": "GOP planning one-year deal on debt limit, travel bookings and airfares are soaring, and other news to start your day.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4bbf1329-ab49-3c8c-8cae-e5d5dc6287ea/bank-earnings-are-here..html", "symbols": ["AH9.F", "AMC.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DAL.MX", "DAL.US", "OYC.F"], "tags": [], "sentiment": {"polarity": -0.361, "neg": 0.106, "neu": 0.894, "pos": 0}}, {"date": "2023-04-14T09:52:00+00:00", "title": "Stocks Edge Lower, JPMorgan Earnings, Fed Borrowing, Boeing Delays, Washington Commanders Sold - Five Things To Know", "content": "Stock futures slip lower ahead of earnings, retail sales data; JPMorgan kicks of big bank earnings with focus on sector fallout; U.S. banks pare borrowing from Fed as crisis pressure ease; Boeing shares slump on renewed 737 Max delivery delays and Washington Commanders sold for $6 billion in NFL franchise record.\n\nContinue reading", "link": "https://finance.yahoo.com/m/44b1b05f-af43-317f-aca9-bc5a411e948d/stocks-edge-lower%2C-jpmorgan.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.586, "neg": 0.139, "neu": 0.784, "pos": 0.077}}, {"date": "2023-04-14T09:42:58+00:00", "title": "Boeing shares tumble as parts issue halts deliveries of some 737 MAXs", "content": "(Reuters) - Boeing Co's shares fell 6% in premarket trading on Friday after the U.S. planemaker halted deliveries of some 737 MAXs due to a new supplier quality problem by Spirit AeroSystems.\n\nSpirit, which manufactures fuselage, thrust reversers, engine pylons and wing components for the 737 MAX airplanes, slumped 14%.\n\nThe latest quality issue pertains to a fuselage fitting supplied by Spirit and is believed to date back to 2019, Boeing disclosed on Thursday.\n\n\"I don't know if there's a long term concern about the 737s for Boeing....\" said Art Hogan, chief market strategist at Riley Wealth.\n\n\"We have known for quite some time that there was going to be a financial cost at Boeing in getting their house in order. What we didn't know was how many of these 737s they were going to be able to deliver and it sounds like it's even more than we estimated.\"\n\nBoeing warned that the issue will likely affect a \"significant\" number of undelivered 737 MAX airplanes both in production and in storage, and could result in lowered 737 MAX deliveries in the near term.\n\nAnalysts worry that the latest hiccup will weigh on Boeing's plans to ramp up production of its bestselling jet amid an industrywide shortage of aircraft and warned of a likely hit to cash flow.\n\nOn the cash flow impact, Melius Research Vice President Scott Mikus said \"that's not entirely clear yet. It certainly makes it more likely.\"\n\nHowever, Bernstein analyst Caius Slater expects the issue to have a \"relatively modest\" impact on Boeing's earnings and cash flow.\n\nThe problem, which affects a portion of the 737 MAX family of airplanes, including the MAX 7, MAX 8 and MAX 8200 airplanes as well as the P-8 Poseidon maritime surveillance aircraft based on the 737 NG, is not a safety of flight issue and in-service planes can continue to operate, Boeing said.\n\n\"We see more negative financial exposure to this news at Spirit than at Boeing,\" said J.P. Morgan analyst Seth Seifman.\n\nIn February, the planemaker had to temporarily halt deliveries of its 787 Dreamliner jets to conduct additional analysis on a fuselage component.\n\n(Reporting by Aishwarya Nair in Bengaluru; Additional reporting by Bansari Kamdar; Editing by Sriraj Kalluvila)", "link": "https://finance.yahoo.com/news/boeing-shares-tumble-parts-issue-094258235.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.548, "neg": 0.06, "neu": 0.886, "pos": 0.054}}, {"date": "2023-04-14T08:09:32+00:00", "title": "Boeing halts deliveries of some 737 MAXs, shares fall", "content": "Boeing is putting the brakes on deliveries of some 737 MAX jets as it grapples with a new supplier quality problem.\n\nThe latest announcement comes after the planemaker said last month that it was getting ready to ramp up production.\n\nThe problem involves the installation of two fittings that join the aft fuselage made by Spirit AeroSystems to the vertical tail, which were not attached correctly to the structure of the fuselage before it was sent to Boeing.\n\nThe problem could stretch back to 2019.\n\nBOEING RESUMES DELIVERIES OF 787 DREAMLINERS AFTER PAUSE, EDGES AIRBUS IN Q1 A Boeing 737 Max is displayed during the Farnborough Airshow.\n\nShares of Boeing are more than 4% lower in remarket trading., while shares of Spirit AeroSystems are down more than 10%.\n\nREAD ON THE FOX BUSINESS APP\n\nBoeing provided the following statement to FOX Business:\n\n\"This is not an immediate safety of flight issue and the in-service fleet can continue operating safely. However, the issue will likely affect a significant number of undelivered 737 MAX airplanes, both in production and in storage.\"\n\nFAA WARNS OF SAFETY HAZARD FROM LEAKY FAUCETS IN BOEING 787, CALLS FOR INSPECTIONS\n\nBoeing said in late March it was planning to ramp up production for the 737 MAX airliners \"very soon.\"\n\nThe problem impacts a portion of the 737 MAX family of airplanes, including the MAX 7, MAX 8 and MAX 8200 airplanes as well as the P-8 Poseidon maritime surveillance aircraft. The headquarters of Spirit AeroSystems Holdings Inc, is seen in Wichita, Kansas, U.S.\n\nBOEING PLANS TO INCREASE 737 MAX PRODUCTION RATES 'VERY SOON'\n\nThe Federal Aviation Administration said it had \"validated\" Boeing's assessment that there was no immediate safety issue.\n\nCertain versions of the aircraft, like the MAX 9, use fittings from different suppliers and were correctly installed.\n\nGET FOX BUSINESS ON THE GO HERE\n\nBoeing had aimed to increase monthly MAX production rates from 31 to 38 by June.\n\nReuters contributed to this report.", "link": "https://finance.yahoo.com/news/boeing-halts-deliveries-737-maxs-080932876.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.937, "neg": 0.055, "neu": 0.836, "pos": 0.109}}, {"date": "2023-04-14T07:48:17+00:00", "title": "JPMorgan, Wells Fargo and BlackRock rise premarket; Boeing, Lucid fall", "content": "By Peter Nurse\n\nInvesting.com -- Stocks in focus in premarket trade on Friday, April 14th. Please refresh for updates.\n\nJPMorgan (NYSE:JPM) stock rose 5.9% after the banking giant reported a 52% jump in first-quarter profit with record revenues, helped by strong results in its consumer business in a period that saw two of the biggest banking failures in U.S. history.\n\nWells Fargo  (NYSE:WFC) stock rose 2.9% after the lender posted a rise in sharp profit as it earned more from interest rate payments in the first quarter, helped by the U.S. Federal Reserve's tighter monetary policy.\n\nPNC Financial (NYSE:PNC) stock rose 1.3% after the regional lender reported an 18.5% rise in first-quarter profit, as the Fed's rate hikes fueled a surge in its net interest income.\n\nBoeing (NYSE:BA) stock fell 5.7% after the aircraft manufacturer halted deliveries of some 737 MAXs as it grapples with a new supplier quality problem from Spirit AeroSystems (NYSE:SPR), which fell over 13%.\n\nLucid Group (NASDAQ:LCID) stock fell 6.4% after the luxury electric car manufacturer reported first-quarter production and delivery figures that were lower than the preceding three months, as it struggles with supply chain and logistics issues.\n\nTesla (NASDAQ:TSLA) stock fell 0.8% after the electric car maker lowered the price of its Model 3 in Germany, according to data on its website, in a bid to spur demand.\n\nHartford Financial (NYSE:HIG) stock fell 2.2% after the insurer warned its first-quarter earnings could be weaker than previously expected, weighed by catastrophic losses from winter storms.\n\nBlackRock (NYSE:BLK) stock rose 1.5% after assets at the world's largest asset manager jumped to $9.09 trillion in the first quarter as depositors sought cover following the collapse of several U.S. banks.\n\nUnitedHealth (NYSE:UNH) stock rose 0.9% after the healthcare and insurance company beat Wall Street estimates for quarterly profit on Friday and raised its annual forecast, helped by lower medical costs at its insurance unit.\n\nStory continues\n\nRelated Articles\n\nJPMorgan, Wells Fargo and BlackRock rise premarket; Boeing, Lucid fall\n\nHSBC warns France sale in jeopardy over capital concerns\n\nGoldman slashes S&P 500 dividend forecast for 2024 on weak earnings", "link": "https://finance.yahoo.com/news/jpmorgan-wells-fargo-blackrock-rise-074817896.html", "symbols": ["BA.US", "BLAK34.SA", "BLK.MX", "BLK.US", "BLQA.F", "HFF.F", "HFF.STU", "HIG-PG.US", "HIG.US", "JPM.US", "LCID.US", "PNC.US", "PNP.F", "SPR.US", "TL0.F", "TL0.XETRA", "TSLA.MX"], "tags": [], "sentiment": {"polarity": -0.546, "neg": 0.101, "neu": 0.813, "pos": 0.086}}, {"date": "2023-04-14T06:36:33+00:00", "title": "Dow futures fall 55 pts; big bank results, retail sales in focus", "content": "By Peter Nurse\n\nInvesting.com -- U.S. stocks are seen opening marginally lower Friday, consolidating after the previous session’s gains as investors await earnings from a number of major banks, marking the start of the new results season.\n\nAt 06:30 ET (10:30 GMT), the Dow Futures contract was down 55 points, or 0.2%, S&P 500 Futures traded 6 points, or 0.2%, lower and Nasdaq 100 Futures dropped 45 points, or 0.4%.\n\nThe main indices closed firmly higher Wednesday, boosted by more economic data that pointed to cooling inflation, increasing the chances that the Federal Reserve ends its rate-hiking cycle soon, probably with a final increase in May.\n\nThe blue-chip Dow Jones Industrial Average closed over 380 points, or 1.1% higher, the broad-based S&P 500 ended up 1.3% and the tech-heavy Nasdaq Composite surged 2%.\n\nHelping that positive tone was the soft reading on March U.S. producer prices, and there’s more economic data to study Friday, with the March retail sales report the highlight.\n\nForecasts favor a dip of 0.4%, but risks seem tilted to the downside given the possibility of a sharp pullback in spending given the banking instability during that month.\n\nThat said, the major focus Friday is likely to be the start of the new quarterly earnings seasons, with results due from the major banks Citigroup (NYSE:C), Wells Fargo (NYSE:WFC) and JPMorgan Chase (NYSE:JPM).\n\nInvestors will be looking to see what the banking officials say about the economic outlook, consumer credit quality and business activity, especially after Fed policymakers mentioned concerns about the sector when forecasting the possibility of a “mild recession” later this year.\n\nIn other corporate news, Boeing (NYSE:BA) stock is sharply lower premarket after the aircraft manufacturer halted deliveries of some 737 MAXs as it grapples with a new supplier quality problem.\n\nLucid Group (NASDAQ:LCID) stock also slumped premarket after the luxury electric car maker reported first-quarter production and delivery figures that were lower than the preceding three months.\n\nStory continues\n\nOil prices edged higher Friday, with the latest monthly report from the International Energy Agency stating that the output cuts announced by OPEC+ producers are set to exacerbate the supply deficit this year.\n\nThe Paris-based organization estimated global oil supply to fall by 400,000 barrels per day by the end of the year, while world oil demand is set to grow by 2 million barrels per day in 2023 to a record 101.9 million barrels, driven in most part by stronger Chinese consumption.\n\nBy 06:30 ET, U.S. crude futures traded 0.4% higher at $82.45 a barrel, while the Brent contract climbed 0.3% to $86.38.\n\nAdditionally, gold futures traded 0.1% lower at $2054.20/oz, while EUR/USD traded 0.2% higher at 1.1061.\n\nRelated Articles\n\nDow futures fall 55 pts; big bank results, retail sales in focus\n\nWhen it comes to climate risk, investors prize disclosure, report suggests\n\nJPMorgan beats Wall Street estimates on boost from rate hikes", "link": "https://finance.yahoo.com/news/dow-futures-fall-55-pts-063633531.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "C.US", "DJI.INDX", "JPM.US", "LCID.US", "WFC.US"], "tags": [], "sentiment": {"polarity": -0.507, "neg": 0.07, "neu": 0.858, "pos": 0.072}}, {"date": "2023-04-14T04:51:45+00:00", "title": "Big bank earnings, IEA report, Tesla prices - what's moving markets", "content": "By Peter Nurse\n\nInvesting.com -- Investors will focus on the major U.S. banks at the beginning of the new quarterly earnings season, as well as the International Energy Agency's monthly report on the state of the oil market. Stocks are seen marginally lower, while Tesla has cut its prices in Germany.\n\n1. Bank results start new earnings season\n\nThe new earnings season starts in earnest later Friday, with quarterly numbers from the banking giants Citigroup (NYSE:C), Wells Fargo (NYSE:WFC) and JPMorgan Chase (NYSE:JPM) leading the way.\n\nThe banking system has been under stress from rising interest rates, which have pinched the value of bond holdings. Rising rates have also quieted the deal markets and lessened demand for mortgages and other credit products.\n\nAdditionally, Fed policymakers cited concern about the health of the country’s banks while predicting a mild recession this year.\n\nThus, these big U.S. bank earnings reports will be studied even more carefully than before, with investors focusing on what the bankers say about the economic outlook, consumer credit quality, and business activity.\n\n2. Turning Japanese\n\nNews this week of Warren Buffett’s increased interest in Japanese stocks has focused attention for Western investors on this long-abandoned region.\n\nAfter a decade-long bull run through the 1980s, the Nikkei 225 index, Japan’s benchmark stock index, reached an all-time high of 38,915 on the last trading day of 1989. As the New Year arrived, the bubble burst, and the index has remained below that level for more than 30 years!\n\nHowever, Japanese stocks have seen demand this year–with the Nikkei up over 9% year to date–as signs of easing inflation and a leadership change in the Bank of Japan saw markets bet that the central bank will maintain its ultra-easy monetary policy in the near term.\n\nNews that America’s most popular investor has increased his holdings in Japan’s five major trading houses as well as talk that he is considering more local investment is likely to lead to more widespread interest.\n\nStory continues\n\n3. Futures just lower; Tesla cuts Model 3 price in Germany\n\nU.S. futures traded marginally lower Friday, with investors consolidating after the previous session’s strong gains ahead of the start of the new earnings season.\n\nAt 04:30 ET (08:30 GMT), the Dow futures contract had dropped 95 points or 0.3%, S&P 500 futures inched 7 points or 0.2% lower, and Nasdaq 100 futures fell 27 points or 0.2%.\n\nThe main indices closed firmly higher Thursday, with investors cheered by the cooling of the March producer prices, suggesting a less hawkish Federal Reserve going ahead.\n\nThe earnings from a number of the nation’s biggest banks will be in focus Friday [see above].\n\nElsewhere, big insurer UnitedHealth (NYSE:UNH) is also expected to report earnings. Tesla (NASDAQ:TSLA) has lowered the price of its Model 3 in Germany by around 4.5%, according to data on its website, and Boeing (NYSE:BA) has halted deliveries of some 737 MAXs as it grapples with a new supplier quality problem.\n\n4. U.S. economic data deluge\n\nFresh off the release of the lowest U.S. headline inflation rate in almost two years and minutes from the last Federal Reserve meeting talking about a “mild recession”, investors have a number of economic data releases to study later Friday.\n\nRetail sales for March are expected at 08:30 ET (12:30 GMT), and are expected to show a year-over-year gain of 5.9% versus the 5.4% in the previous month, and a monthly contraction of 0.4%, same as before.\n\nIndustrial production, released 45 minutes later, is seen growing 0.2% on the month in March, an annual drop of 0.9%, while the preliminary reading of the consumer sentiment index from the University of Michigan is due at 10:00 ET.\n\n5. Oil prices creep higher, heading for another positive week\n\nCrude prices edged higher Friday, with the market heading for a fourth straight week of gains, supported by signs of a tightening global market.\n\nBy 04:30 ET, U.S. crude futures were 0.1% higher at $82.25 a barrel, while the Brent contract edged up to $86.10 per barrel.\n\nThe monthly report from the Organization of Petroleum Exporting Countries, released on Thursday, forecast that world markets would be under-supplied by about 2 million barrels a day in the fourth quarter as a result of the cartel’s recent cutbacks.\n\nThe International Energy Agency is set to release its monthly oil market report later in the session, and traders will be looking to see if the Paris-based organization downgrades its global demand outlook given the faltering macroeconomic growth.\n\nRelated Articles\n\nBig bank earnings, IEA report, Tesla prices - what's moving markets\n\nDollar set for longest stretch of weekly losses since 2020\n\nU.S. money market funds draw inflows for fifth straight week", "link": "https://finance.yahoo.com/news/big-bank-earnings-iea-report-045145051.html", "symbols": ["BA.US", "C.US", "GSPC.INDX", "JPM.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA", "UNH.US", "WFC.US"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.05, "neu": 0.854, "pos": 0.096}}, {"date": "2023-04-14T00:18:12+00:00", "title": "Boeing says deliveries of 737 Max jet will be held up by production issue", "content": "Boeing said on Thursday that a production issue would affect its ability to deliver a “significant” number of 737 Max jets, worsening aircraft shortages for airlines around the world. The aerospace manufacturer said supplier Spirit AeroSystems had used a “non-standard” process when installing two fittings in the fuselage of certain models of the narrow-body jet, creating the possibility that it might not comply with specifications laid out by aviation regulators. The delay will deepen headaches for Boeing’s customers, many of whom would like to expand their flying schedules, but they need to secure more planes to do so.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e16daeef-413e-3a64-814f-a8742ed32d3d/boeing-says-deliveries-of-737.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.705, "neg": 0.047, "neu": 0.821, "pos": 0.132}}, {"date": "2023-04-14T00:18:12+00:00", "title": "Boeing warns of delays to 737 Max deliveries over production issue", "content": "Boeing said on Thursday that a production issue would affect its ability to deliver a “significant” number of 737 Max jets, worsening aircraft shortages for airlines around the world. The aircraft manufacturer said supplier Spirit AeroSystems had used a “non-standard” process when installing two fittings in the fuselage of certain models of the narrow-body jet, creating the possibility that it might not comply with specifications laid out by aviation regulators. Shares in Boeing fell more than 5 per cent in after-hours trading.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e16daeef-413e-3a64-814f-a8742ed32d3d/boeing-warns-of-delays-to-737.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.637, "neg": 0.052, "neu": 0.814, "pos": 0.133}}, {"date": "2023-04-14T00:00:00+00:00", "title": "BA Stock Sinks 6% as Boeing Halts 737 Max Deliveries", "content": "BA stock is falling after the plane maker reported that there was a problem with the fuselages of some of its 737 Max planes. ", "link": "https://investorplace.com/2023/04/ba-stock-sinks-6-as-boeing-halts-737-max-deliveries/", "symbols": ["BA.US"], "tags": [], "sentiment": {"polarity": -0.511, "neg": 0.17, "neu": 0.83, "pos": 0}}, {"date": "2023-04-13T23:06:00+00:00", "title": "Boeing Pauses MAX Deliveries After Parts Problem", "content": "Boeing said it was pausing deliveries of some 737 MAX jets because of incorrectly installed parts, disrupting an important business line as the plane maker seeks to improve its finances. The company said Thursday there would be a significant impact on near-term deliveries of the 737 MAX 7, 737 MAX 8 and larger MAX 8-200 jets, as well as the P-8 military reconnaissance planes that are also based on the 737. Boeing said it was notified by a supplier of “a nonstandard manufacturing process” used to install two fittings at the rear of the plane.\n\nContinue reading", "link": "https://finance.yahoo.com/m/70d0b29d-0d4c-31cd-adab-b1161c3219a6/boeing-pauses-max-deliveries.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.765, "neg": 0, "neu": 0.913, "pos": 0.087}}, {"date": "2023-04-13T23:03:33+00:00", "title": "Boeing Max production could be slowed by issue with parts", "content": "Boeing said Thursday that production and delivery of a “significant number” of its 737 Max planes could be delayed because of questions about a supplier’s work on the fuselages.\n\nBoeing said the supplier, Spirit AeroSystems, used a “non-standard manufacturing process” during installation of fittings near the rear of some 737s. Aircraft parts must be produced and installed to meet exacting federal standards.\n\nThe company said the situation is not an immediate safety issue and planes already flying “can continue operating safely.” But, Boeing said, it notified the Federal Aviation Administration about the matter and is working to inspect planes and replace fittings when necessary.\n\nThe FAA said that “based on the facts and data Boeing presented, the FAA validated the company’s assessment that there is no immediate safety issue.\"\n\nThe parts issue is the latest setback for Boeing. All Max planes were grounded worldwide for nearly two years after a pair of deadly crashes, and production flaws halted deliveries of the larger 787 jetliner several times in the past three years.\n\nSpirit provides fuselages for all Max jets, but it is not the only supplier for the fittings. For that reason, production of one model, the Max-9, is not affected by the current situation.\n\nSpirit, which is based in Wichita, Kansas, said it “identified a quality issue” on the rear section of some Max fuselages and told Boeing.\n\n“We have processes in place to address these of types of production issues upon identification, which we are following,” the company said.\n\nA Boeing spokeswoman said Thursday that the company could not say exactly how many planes are affected because the issue was just discovered.\n\nShares of Arlington, Virginia-based Boeing fell more than 5% and Spirit tumbled about 7% in after-hours trading.", "link": "https://finance.yahoo.com/news/boeing-max-production-could-slowed-230333180.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.723, "neg": 0.021, "neu": 0.927, "pos": 0.052}}, {"date": "2023-04-13T21:35:02+00:00", "title": "Boeing halts deliveries of some 737 MAXs amid new supplier problem", "content": "By Valerie Insinna and David Shepardson\n\nWASHINGTON (Reuters) -Boeing has halted deliveries of some 737 MAXs as it grapples with a new supplier quality problem by Spirit AeroSystems that could stretch back to 2019, the U.S. planemaker disclosed on Thursday.\n\nThe issue will likely affect a \"significant\" number of undelivered 737 MAX airplanes both in production and in storage, and could result in lowered 737 MAX deliveries in the near term, the company said.\n\nBoeing shares fell 5.3% and shares of Spirit AeroSystems fell 11.8% in after hours trade following the announcement.\n\nThe problem, which affects a portion of the 737 MAX family of airplanes, including the MAX 7, MAX 8 and MAX 8200 airplanes as well as the P-8 Poseidon maritime surveillance aircraft based on the 737 NG, is not a safety of flight issue and in-service planes can continue to operate, Boeing said.\n\nThe Federal Aviation Administration said it had \"validated\" Boeing's assessment that there was no immediate safety issue \"based on the facts and data Boeing presented\" and the agency will evaluate all affected aircraft before delivery.\n\nThe problem involves the installation of two fittings that join the aft fuselage made by Spirit to the vertical tail, which were not attached correctly to the structure of the fuselage before it was sent to Boeing. Certain versions of the aircraft, like the MAX 9, use fittings from different suppliers and were correctly installed.\n\nBoeing was officially notified about the problem by Spirit on Wednesday, however the problem is believed to date back to 2019 and the company is still determining how many aircraft could be impacted, Boeing said.\n\nBoeing declined to comment on whether the problem will force it to roll back plans to boost 737 production this year as it races to deliver at least 400 MAXs in 2023. The company, which announced deliveries of 111 MAXs over the first quarter, had aimed to increase monthly MAX production rates from 31 to 38 by June.\n\nStory continues\n\n\"We have notified the FAA of the issue and are working to conduct inspections and replace the non-conforming fittings where necessary,\" Boeing said. \"We regret the impact that this issue will have on affected customers and are in contact with them concerning their delivery schedule.\"\n\nUnited Airlines said late Thursday after discussions with Boeing that \"at this time we do not expect any significant impact on our capacity plans for this summer or the rest of the year.\"\n\nSpirit said it is working to develop an inspection and repair for the affected fuselages. Officials said the FAA is likely to issue an airworthiness directive that would mandate an inspection and repair regime.\n\nThe FAA has closely scrutinized Boeing aircraft since two fatal plane crashes in 2018 and 2019. The FAA continues to inspect each 737 MAX and 787 aircraft before an airworthiness certificate is issued and cleared for delivery. Typically the FAA delegates airplane ticketing authority to the manufacturer.\n\n(Reporting by Valerie Insinna and David Shepardson in Washington; Editing by Chris Reese and Christopher Cushing)", "link": "https://ca.finance.yahoo.com/news/boeing-pauses-deliveries-737-maxs-213502831.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.093, "neg": 0.063, "neu": 0.869, "pos": 0.068}}, {"date": "2023-04-13T21:30:00+00:00", "title": "Boeing pauses deliveries of some 737 MAXs amid new supplier problem", "content": "By Valerie Insinna\n\nWASHINGTON, April 13 (Reuters) - Boeing has paused deliveries of some 737 MAXs as it grapples with a new supplier quality problem involving noncompliant fittings, the company disclosed on Thursday.\n\nThe problem, which affects a portion of the 737 MAX family of airplanes, including the MAX 7, MAX 8 and MAX 8200 airplanes as well as the P-8 Poseidon maritime surveillance aircraft based on the 737 NG, is not a safety of flight issue and in-service planes can continue to operate, Boeing said.\n\nThe U.S. planemaker declined to comment on whether the problem will force Boeing to roll back plans to boost 737 production this year as it races to deliver at least 400 MAXs in 2023.\n\nHowever, the issue will likely affect a \"significant\" number of undelivered 737 MAX airplanes both in production and in storage, and could result in lowered 737 MAX deliveries as the company acknowledged.\n\nThe problem involves two fittings that join the aft fuselage made by Spirit Aerosystems to the vertical tail, which were not attached correctly. Certain versions of the aircraft, like the MAX 9, use fittings from different suppliers that have not been found to be nonconforming.\n\nBoeing said it is still determining the exact number of aircraft impacted by the issue, and production of the MAX continues.\n\nSpirit said it is working to develop an inspection and repair for the affected fuselages.\n\n(Reporting by Valerie Insinna Editing by Chris Reese)", "link": "https://finance.yahoo.com/news/boeing-pauses-deliveries-737-maxs-213000351.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.307, "neg": 0.067, "neu": 0.872, "pos": 0.062}}, {"date": "2023-04-13T12:28:12+00:00", "title": "Boeing (BA) Wins $1.2B Deal to Supply Missiles &amp; Spare Parts", "content": "The Boeing Company BA recently won a modification contract involving missile systems and associated spares. The award has been offered by the Naval Air Systems Command, Patuxent River, MD.\n\nDetails of the Deal\n\nThe contract, valued at $1.17 billion, is expected to get completed by March 2029. Per the terms of the deal, Boeing will supply 400 RGM-84L-4 Harpoon Block II Update (HIIU) Grade B canister tactical missiles, four RTM-84L-4 Block II HIIU Grade B canister exercise missiles, 411 containers, four blast test vehicles and two Harpoon Weapon System Joint Common Test Sets (JCTS).\n\nThe jet giant will also deliver Harpoon Coastal Defense System (HCDS) spares, weapon station support equipment, JCTS spares and missile spares. It will also provide HCDS training equipment, integrated logistics support and technical publications, field service representatives and training.\n\nA major portion of work related to this deal will be executed in McKinney, TX and Pontiac, MI.\n\nBenefits of the Deal\n\nIncreasing geopolitical tensions worldwide have prompted nations to further strengthen their defense systems. With rapid technological upgrades, missile defense has steadily become pivotal in a nation’s defense strategy. With the United States being the world’s largest weapon supplier and Boeing being a prominent U.S. missile maker, the increased missile defense adoption by the nations provides the company with solid growth opportunities.\n\nNotably, Boeing’s Defense, Space & Security segment engages in the research, development, production and modification of products and related services, including strategic missile and defense systems. Its Harpoon missile is the world’s most successful anti-ship missile and is in service with the armed forces of more than 30 countries.\n\nHarpoon missiles have been upgraded over the years and are now available as the Harpoon Block II. Some other missiles in Boeing’s product portfolio include the supersonic Bomarc missile, Thor missile, AGM-86B/C Air Launched Cruise Missile and GAM-77 Hound Dog Missile.\n\nStory continues\n\nWith such advanced weaponry in its portfolio, Boeing enjoys solid demand in the defense space. The latest contract is a bright example of that, which, in turn, should boost its top-line growth.\n\nGrowth Prospects\n\nNations have increased their defense spending on military equipment and various arsenals to strengthen their defense capabilities. The surge in demand for defense products is primarily due to rising geopolitical tensions and amplified terrorist threats. Hence, military missiles, an integral part of any defense system, have registered a steady growth in demand.\n\nPer the report from Mordor Intelligence, the missiles and missile defense system market is projected to witness a CAGR of 4.9% from 2022-2027. Such abounding growth trends indicate ample development opportunities for Boeing as it enjoys a lucrative position in the missile market.\n\nA few defense primes that can reap the benefits of the aforementioned market are Northrop Grumman NOC, Raytheon Technologies RTX and Lockheed Martin LMT.\r\n\r\nNorthrop Grumman designs and produces missile products, including advanced high-speed propulsion systems, fuses, warheads and controls for air, sea and land-based systems.\n\nThe company boasts a long-term earnings growth of 3.5%. The Zacks Consensus Estimate for NOC’s 2023 sales reflects an improvement of 4.6% from the 2022 reported figure.\n\nRaytheon’s Missiles & Defense is a leading designer, developer, integrator, producer and sustainer of integrated air and missile defense systems. The unit serves as a prime contractor or major subcontractor on numerous missile and related programs with the U.S. Department of Defense.\n\nRaytheon’s long-term earnings growth is pegged at 8.3%. The Zacks Consensus Estimate for RTX’s 2023 sales indicates a 7.8% increase from the prior-year reported figure.\n\nLockheed Martin’s Missiles and Fire Control (MFC) is a recognized designer, developer and manufacturer of precision engagement aerospace and defense systems for the United States and allied militaries. MFC develops, manufactures and supports advanced combat, missile, rocket, manned and unmanned systems for military customers. These include the U.S. Army, Navy, Air Force, Marine Corps, NASA and dozens of foreign allies.\n\nLMT’s long-term earnings growth is pegged at 6.9%. Shares of the company have gained 4.4% in the past year.\n\nPrice Performance\n\nShares of Boeing have rallied 16.8% in the past year against the industry’s 8.9% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nBoeing currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRaytheon Technologies Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/boeing-ba-wins-1-2b-122812481.html", "symbols": ["5UR.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "RTX.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.045, "neu": 0.764, "pos": 0.191}}, {"date": "2023-04-13T12:16:12+00:00", "title": "The Zacks Analyst Blog Highlights JPMorgan Chase, AbbVie, NextEra Energy, The Boeing  and Canadian Natural Resources", "content": "For Immediate Release\n\nChicago, IL – April 13, 2023 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: JPMorgan Chase & Co. JPM, AbbVie Inc. ABBV, NextEra Energy, Inc. NEE, The Boeing Co. BA and Canadian Natural Resources Ltd. CNQ.\n\nHere are highlights from Wednesday’s Analyst Blog:\n\nTop Research Reports for JPMorgan, AbbVie and NextEra Energy\n\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including JPMorgan Chase & Co., AbbVie Inc. and NextEra Energy, Inc. These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today's research reports here >>>\r\n\r\nShares of JPMorgan Chase have outperformed the Zacks Banks - Major Regional industry and the broader market over the past year (+0.9% vs. -16.7% for the industry and -8.2% for the S&P 500 index). The stock has lagged the broader market as well as the industry over the past month or so since the banking problems took center stage.\n\nThe stock was up in response to the last quarterly release on January 13th when the company handily beat estimates and provided reassuring commentary on broader business trends. Ahead of Q1 earnings release before the market's open this Friday (April 14th), estimates have largely been unchanged. A lot will be riding on management's characterization of business conditions following the Silicon Valley episode.\n\nHigher rates and a steady loan demand are expected to have aided net interest income (NII) growth in the Q1 report. Yet, the volatile nature of the capital markets business and higher mortgage rates are likely to have made fee income growth challenging. We expect non-interest income (managed) to be relatively stable this year.\r\n\r\nHowever, steadily rising costs is a major woe, and we expect the same to rise 5.8% in 2023. Given the possibility of an economic slowdown, provisions are likely to keep rising, with we projecting the same to jump 53.1% in 2023.\r\n\r\n(You can read the full research report on JPMorgan here >>>)\r\n\r\nAbbVie shares have gained +4.5% over the past year against the Zacks Large Cap Pharmaceuticals industry's gain of +7.5%. The company has several new drugs in its portfolio that have the potential to drive the top line to make up for lost Humira revenues. Skyrizi and Rinvoq have established outstanding launch trajectories bolstered by the approval of new indications.\r\n\r\nIt has several early/mid-stage candidates that have blockbuster potential. However, there are concerns about long-term sales growth since Humira generics have entered the U.S. market. Slowing consumer demand due to economic pressure is hurting the aesthetics franchise's sales.\r\n\r\nNonetheless, though revenues are expected to decline in 2023, AbbVie expects to return to robust sales growth in 2025. Estimates have declined ahead of Q1 earnings. AbbVie has a positive record of earnings surprises in recent quarters.\r\n\r\n(You can read the full research report on AbbVie here >>>)\r\n\r\nShares of NextEra Energy have gained +8.4% over the past six months against the Zacks Utility - Electric Power industry's gain of +13.7%. The company continues to expand its operations through the efficient execution of organic projects and strategic acquisitions. The company currently has many renewable projects in its backlog and their completion will ensure reduced emissions.\r\n\r\nThe merger of Gulf Power and FPL strengthens NextEra's position in Florida. FPL's customer base is expanding as Florida's economy improves and continues to boost demand for its services. NextEra has ample liquidity to meet its near-term debt obligations and efficient debt management acting as tailwinds. Its shares have lost narrower than industry in the past one year.\r\n\r\nHowever, the nature of its business is subject to complex federal, state and other regulations. Risk in operating nuclear units, unfavorable weather conditions and an increase in supply costs adversely impact earnings.\r\n\r\n(You can read the full research report on NextEra Energy here >>>)\r\n\r\nOther noteworthy reports we are featuring today include The Boeing Co. and Canadian Natural Resources Ltd.\n\nStory continues\n\nWhy Haven't You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\n\nNextEra Energy, Inc. (NEE) : Free Stock Analysis Report\n\nCanadian Natural Resources Limited (CNQ) : Free Stock Analysis Report\n\nAbbVie Inc. (ABBV) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-jpmorgan-121612529.html", "symbols": ["4AB.F", "4AB.XETRA", "ABBV.MX", "ABBV.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "CNQ.TO", "CNQ.US", "CRC.F", "FP3.F", "GSPC.INDX", "NEE.US", "NEP.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.036, "neu": 0.82, "pos": 0.144}}, {"date": "2023-04-13T12:00:00+00:00", "title": "Millennium Space Systems' Tetra-1 is mission ready", "content": "EL SEGUNDO, Calif., April 13, 2023 /PRNewswire/ -- Since launching Tetra-1 November 1, 2022, Millennium Space Systems, a Boeing (NYSE: BA) company partnered with the U.S. Space Force's Space Systems Command successfully deployed the vehicle from its host, initialized all components and subsystems and performed systems check out. Tetra-1 is healthy and ready for mission operations. Tetra-1 is healthy and ready for mission operations.\n\n\"Tetra-1 has helped us learn about small satellites' potential to operate in super GEO,\" said Capt JeanCarlo Vasquez, Tetra-1 deputy program manager at SSC. \"Due to Tetra-1's maneuverability, it has enabled us to experiment and train with various tactics, techniques, and procedures. Thus, allowing our program office and operators to identify what roles small satellites can potentially play in future USSF Missions. Furthermore, Tetra-1's robustness permitted SSC to work with Space Delta 11 in Space Training and Readiness Command and perform maneuvers dedicated solely to a live on orbit training campaign, known as 'Scarlet Star.'\"\n\nSSC is now assuming full spacecraft operations, using the procedures developed jointly with Millennium Space Systems.\n\n\"We developed new operations tools to ease the planning for actions like station changes and planning and executing on-orbit maneuvering,\" said Mike Todaro, vice president of Mission Operations & Integration at Millennium Space Systems. \"This is particularly important for super GEO, where if you're not mission capable, you're considered in the graveyard.\"\n\nSuper GEO is new ground for small satellites, with known and unknown challenges operating so far away – about 38,000 km from Earth.\n\n\"When Guardians work on Tetra-1, they'll learn new ways of doing things that were previously done on much larger satellites,\" said Todaro. \"Because Tetra-1 is smaller, more agile and maneuverable, you have different options. It's like the difference between maneuvering a speed boat versus a cruise ship.\"\n\nStory continues\n\nThe experience Tetra-1 provides is critical to space operators understanding how to manage a small satellite. An example is operating during eclipse season.\n\n\"Actions for what you want the satellite to do are taken more deliberately because it has a smaller power system,\" said Todaro. \"And operators must manage consumables differently compared to a larger satellite, all of which requires training beyond just having classroom knowledge – it takes hands-on experience.\"\n\nMillennium Space Systems delivered the spacecraft and ground software to SSC to operate independently, and provided a different type of training, simulation and confidence-building for operators to understand the nuances of a small satellite. This training experience, new tools and space-qualified spacecraft components support Millennium Space Systems' ability to deliver small satellites for high-stakes critical missions for National Security Space.\n\nMedia Contact: \r\nDana Carroll, vice president, Marketing\r\nMillennium Space Systems\r\ndana.carroll@millennium-space.com\n\nAbout Millennium Space Systems\n\nMillennium Space Systems, a Boeing Company, delivers high-performance prototype and constellation solutions across advanced national security and environmental observation missions. Founded in 2001, the company's small satellite missions support government, civil and commercial space customers' needs across orbits. (PRNewsfoto/Millennium Space Systems) Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/millennium-space-systems-tetra-1-is-mission-ready-301796187.html\n\nSOURCE Millennium Space Systems", "link": "https://finance.yahoo.com/news/millennium-space-systems-tetra-1-120000945.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.011, "neu": 0.868, "pos": 0.121}}, {"date": "2023-04-12T17:49:00+00:00", "title": "7 Blue-Chip Stocks That Are Crushing the Market in 2023", "content": "Most readers will be aware of the virtues blue-chip stocks possess:\n\nThey’re large, well-established companies with a financially sound business that lends great credibility to their equity in general. These companies are household names with track records of steady growth and operational profitability in some cases over decades. They’ve weathered economic cyclicality and the recessions that come with it, making them particularly timely.\n\nWe’re exploring those blue-chip stocks that beat the market in 2023. I define that as providing better returns than the average of the 7.35% return from the S&P 500 year-to-date and the 1.05% return from the Dow Jones Industrial Average. So, we’re talking about shares that exceeded 4.2% returns in 2023, also listed here.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nBlue-Chip Stocks: American Express (AXP) the American Express logo etched into wood\n\nSource: First Class Photography / Shutterstock.com\n\nAmerican Express (NYSE:AXP) is well-known for providing credit cards catering to more affluent customers. Those same affluent customers tend to be less affected by economic downturns. In turn, it’s logical to guess that the company stands to do better in the difficult environment this year. So far, that has been the case.\n\nAmerican Express had a very strong 2022, during which it reached its goal of delivering 25% revenue growth. It did exactly that, reaching $52.86 billion in sales on payments volume that increased by a slightly smaller 21%.\n\nThe company’s strategy focuses on acquiring more customers and growing that base. American Express established 12.5 million new card accounts in 2022. Investors should expect companywide EPS to increase by 15-17% in 2023. The company has rewarded investors for the strong year by planning to increase its dividend by 15%. American Express’s stable business and customer base give it advantages in this environment, suggesting continued strength.\n\nBoeing (BA) It Will Be a Very Long Road to Recovery for BA Stock\n\nSource: Shutterstock\n\nStory continues\n\nBoeing (NYSE:BA) is moving into a new chapter as sales ramp up and problems of the recent past fade. A strong sales trajectory and a backlog of business suggest that Boeing is back. That said, Boeing continues to have operational difficulties that resulted in net losses overall in 2022, a continuation of 2021 results.\n\nBoeing’s 2022 sales increased by 7% to $66.61 billion. Boeing suffered a net loss again in 2022 but posted a positive operating cash flow of $3.5 billion, largely due to Q4 results. That led to positive cash flows during the year.\n\nBA stock is trending upward in 2023 because the business is now headed in the right direction after major setbacks. Boeing delivered 480 commercial planes and recorded 808 orders overall. With supply chains returning to normal, Boeing should be able to better fulfill that backlog, including a large order of its 787 Dreamliners to Saudi carriers. Thus, it is among the top blue-chip stocks.\n\nDisney (DIS) dis stock the Disney logo in red font on a storefront\n\nSource: David Tran Photo / Shutterstock.com\n\nDisney (NYSE:DIS) continues to grow at an impressive rate, especially for a firm of its size. Meanwhile, the company is undertaking efforts to reorganize to increase efficiency. Let’s focus on those two aspects of its story to understand why it does well even in a challenging economy.\n\nDisney’s fiscal year’s first quarter ends on Dec. 31, which, for most other firms, is the end of the fiscal year. Despite the slight difference, Disney moved into the new year with strong momentum on an 8% increase in sales. That solid growth increased EPS from $0.63 to $0.70 in Q1 year-over-year.\n\nMeanwhile, Disney is reorganizing for efficiency as the economy tightens. Structurally, the company has realigned its three core businesses, Entertainment, ESPN, Parks, Products, and Experiences, to be headed separately. The company believes the reorganization will reduce inefficiency leading to $5.5 billion in savings.\n\nMcDonald’s (MCD) McDonald's restaurant in Thailand.\n\nSource: Tama2u / Shutterstock\n\nLet’s face it, current headlines about McDonald’s (NYSE:MCD) expose the brutal truth of business. Even when business and stock are strong, restructuring will continue to occur. Like Disney, another thriving business, McDonald’s is restructuring and conducting layoffs.\n\nMcDonald’s began a round of layoffs beginning April 3, targeting hundreds of corporate employees. I can’t speak to their individual performance. They may indeed be less productive. But McDonald’s grew by 12% in Q4 with double-digit growth across all segments. During 2022, company-wide sales increased by 10%. Business is business, but there’s a human toll exacted that broad metrics simply can’t account for.\n\nThe result of current layoffs is likely to be a boon to MCD stock from the perspective of the markets. It’ll be viewed as leaner and ready for the next growth cycle. McDonald’s has also continued to focus on affordability and a pared-down menu which are arguably strengths currently.\n\nWalmart (WMT) Walmart sign on front of Walmart store at sundown\n\nSource: fotomak / Shutterstock.com\n\nReaders are likely aware that Walmart (NYSE:WMT) is the world’s largest retailer. But the facts about its massive scale provide a bit more perspective for us to understand its relevance. Let’s look at some of those statistics.\n\nThe world’s largest retailer tallied $572.75 billion in worldwide revenues in 2022 from its 10,953 locations, 4,650 of which are U.S. located. That means that 140 million customers visit Walmart every week.\n\nThe company has become the largest grocery store in the U.S. as well. That’s probably not surprising to those of you who have visited recently: The grocery section dominates the store. However, what is interesting – at least to me – is that Walmart became the largest U.S. grocer back in 2001.\n\nI’m trying to make a simple point: Walmart continues to dominate in 2023 with low-price offerings, especially on staple items. That is a strong reason that its stock continues to perform well.\n\nGeneral Electric (GE) Company breakups: The General Electric GE logo on a building\n\nSource: Sundry Photography / Shutterstock.com\n\nThe past is not a prologue. And that’s a positive for General Electric (NYSE:GE) stock which has provided negative annual returns over the last decade. The company had long been in a slow decline, and following years of declining revenues, it was dropped from the DJIA in 2018 as the last original component. 2023 has started very differently for the firm as it outperforms the market.\n\nThe reason for the strong performance has to do with overarching trends and a military build-up. The firm’s new XA100 military jet engine is shrouded in mystery. Few outside the military have seen the engine, and those that recently did were allowed no recording devices in the room where it was displayed.\n\nGE hopes the engines will be fitted to sixth-generation fighter jets used by the U.S. and its allies. Rising tension in the Pacific ensures GE will continue to receive serious attention for the next few years at least. Thus, it is one of the top blue-chip stocks in my book.\n\nExxon Mobil (XOM) Exxon Mobil logo outside of a corporate building\n\nSource: Harry Green / Shutterstock.com\n\n2022 was an exceptionally strong year for Exxon Mobil (NYSE:XOM) as favorable market prices resulted in $55.74 billion in earnings. That was more than double the earnings Exxon Mobil reported a year earlier.\n\nBut it’s difficult to maintain strength and grow quarter after quarter. Like all big oil firms, Exxon Mobil rewards investors willing to experience that volatility with revenues and share buybacks. Its dividend is extremely safe, having last been reduced in 1983. In any case, the point here is that Exxon Mobil, as a company, is adept at manipulating its share price to remain smooth despite volatile commodity markets.\n\nSo, it does well even when the price of Brent crude trends is lower. However, it might not have to worry as much now about playing defensively. OPEC+ cut production, which suggests that per barrel prices should rise as firms scramble to fill the supply gap. That’s a positive catalyst for XOM stock which has done well over the last three years despite the tumult.\n\nOn the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.comPublishing Guidelines.\n\nAlex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks.Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live The Best $1 Investment You Can Make Today It doesn’t matter if you have $500 or $5 million. Do this now. Massive Bear Market “Divergence Event” Ahead… And The #1 Way to Play It\n\nThe post 7 Blue-Chip Stocks That Are Crushing the Market in 2023 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-blue-chip-stocks-crushing-174900662.html", "symbols": ["AEC1.F", "AEC1.XETRA", "AXP.BA", "AXP.MX", "AXP.US", "AXPB34.SA", "BA.US", "DIS.MX", "DIS.US", "DISB34.SA", "EXXO34.SA", "GE.MX", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "MCD.MX"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.037, "neu": 0.825, "pos": 0.138}}, {"date": "2023-04-12T17:21:05+00:00", "title": "Top Research Reports for JPMorgan Chase, AbbVie &amp; NextEra Energy", "content": "Wednesday, April 12, 2023\r\n\r\nThe Zacks Research Daily presents the best research output of our analyst team. Today's Research Daily features new research reports on 16 major stocks, including JPMorgan Chase & Co. (JPM), AbbVie Inc. (ABBV) and NextEra Energy, Inc. (NEE). These research reports have been hand-picked from the roughly 70 reports published by our analyst team today.\r\n\r\nYou can see all of today’s research reports here >>>\r\n\r\nShares of JPMorgan Chase have outperformed the Zacks Banks - Major Regional industry and the broader market over the past year (+0.9% vs. -16.7% for the industry and -8.2% for the S&P 500 index). The stock has lagged the broader market as well as the industry over the past month or so since the banking problems took center stage.\n\nThe stock was up in response to the last quarterly release on January 13th when the company handily beat estimates and provided reassuring commentary on broader business trends. Ahead of Q1 earnings release before the market's open this Friday (April 14th), estimates have largely been unchanged. A lot will be riding on management's characterization of business conditions following the Silicon Valley episode.\n\nHigher rates and a steady loan demand are expected to have aided net interest income (NII) growth in the Q1 report. Yet, the volatile nature of the capital markets business and higher mortgage rates are likely to have made fee income growth challenging. We expect non-interest income (managed) to be relatively stable this year.\r\n\r\nHowever, steadily rising costs is a major woe, and we expect the same to rise 5.8% in 2023. Given the possibility of an economic slowdown, provisions are likely to keep rising, with we projecting the same to jump 53.1% in 2023.\r\n\r\n(You can read the full research report on JPMorgan here >>>)\r\n\r\nAbbVie shares have gained +4.5% over the past year against the Zacks Large Cap Pharmaceuticals industry’s gain of +7.5%. The company has several new drugs in its portfolio that have the potential to drive the top line to make up for lost Humira revenues. Skyrizi and Rinvoq have established outstanding launch trajectories bolstered by the approval in new indications.\r\n\r\nIt has several early/mid-stage candidates that have blockbuster potential. However, there are concerns about long-term sales growth since Humira generics have entered the U.S. market. Slowing consumer demand due to economic pressure is hurting the aesthetics franchise’s sales.\r\n\r\nNonetheless, though revenues are expected to decline in 2023, AbbVie expects to return to robust sales growth in 2025. Estimates have declined ahead of Q1 earnings. AbbVie has a positive record of earnings surprises in recent quarters.\r\n\r\n(You can read the full research report on AbbVie here >>>)\r\n\r\nShares of NextEra Energy have gained +8.4% over the past six months against the Zacks Utility - Electric Power industry’s gain of +13.7%. The company continues to expand its operations through the efficient execution of organic projects and strategic acquisitions. The company currently has many renewable projects in its backlog and their completion will ensure reduced emissions.\r\n\r\nThe merger of Gulf Power and FPL strengthens NextEra’s position in Florida. FPL’s customer base is expanding as Florida’s economy improves and continues to boost demand for its services. NextEra has ample liquidity to meet its near-term debt obligations and efficient debt management acting as tailwinds. Its shares have lost narrower than industry in the past one year.\r\n\r\nHowever, the nature of its business is subject to complex federal, state and other regulations. Risk in operating nuclear units, unfavorable weather conditions and an increase in supply costs adversely impact earnings.\r\n\r\n(You can read the full research report on NextEra Energy here >>>)\r\n\r\nOther noteworthy reports we are featuring today include The Boeing Company (BA), BP p.l.c. (BP) and Canadian Natural Resources Limited (CNQ).\r\n\r\nDirector of Research\r\n\r\nSheraz Mian\r\n\r\nNote: Sheraz Mian heads the Zacks Equity Research department and is a well-regarded expert of aggregate earnings. He is frequently quoted in the print and electronic media and publishes the weekly Earnings Trends and Earnings Preview reports. If you want an email notification each time Sheraz publishes a new article, please click here>>>\n\nStory continues\n\nToday's Must Read\n\nHigher Rates, Buyouts Aid JPMorgan (JPM), Fee Income a Woe\n\nAbbVie's (ABBV) Skyrizi, Rinvoq Key to Long-Term Growth\n\nSteady Investment & Renewable Focus Aid NextEra Energy (NEE)\n\nFeatured Reports\n\nOrder Growth Boost Boeing (BA), 777X-9 Program Issues Woe\r\nPer the Zacks analyst, order flow for products tend to boost Boeing's revenue growth prospects. Yet, paused production of 777X-9 may result in abnormal production costs which may hurt its performance.\n\nBP Likely to Benefit From Lightsource BP JV Acquisition\r\nThe acquisition will enable BP to increase its access to renewable power generation and simplify the decision-making processes. However, rising exploration expenses concern the Zacks analyst.\n\nDiverse Production Mix to Aid Canadian Natural (CNQ)\r\nThe Zacks analyst sees Canadian Natural's diverse production mix facilitating long-term value and reducing risk profile but is worried about the company's debt maturities each year out till 2027.\n\nStrong Domestic Demand, Cost Cuts Aid Sherwin-Williams (SHW)\r\nPer the Zacks Analyst, Sherwin-Williams will gain from strong U.S. architectural demand and efforts to cut operating costs. However, higher energy costs are expected to weigh on its margins.\n\nKroger's (KR) Product Freshness, Digital Efforts to Lift Sales\r\nPer the Zacks analyst, Kroger has been making investments to enhance product freshness and quality as well as expand digital capabilities. Digital sales grew 12% during fourth-quarter fiscal 2022.\n\nInfrastructure Demand Aids Martin Marietta (MLM), Costs High\r\nPer the Zacks analyst, Martin Marietta is poised to gain from global trends in infrastructure modernization, energy transition and national security investments. Higher raw material costs are risks.\n\nLucrative SCS Market Aids Nevro (NVRO) Amid Stiff Competition\r\nThe Zacks analyst is upbeat about Nevro's solid prospects in the global spinal cord stimulation or SCS market despite its operation in a highly competitive medical device industry.\n\nNew Upgrades\n\nBuyouts of AVK & VAS Aid Copart's (CPRT) Expansion Efforts\r\nPer the Zacks analyst, buyout of AVK and Vincent Auto Solutions have expanded Copart's portfolio. Strong balance sheet with low leverage and high liquidity provides it with financial flexibility.\n\nStrong Sales, High Client Retention Benefit Insperity (NSP)\r\nPer the Zacks analyst, Insperity's worksite employee growth is being driven by strong sales, higher client retention and a rise in net hiring of worksite employees by the company's client base.\n\nSolid Digital Platform Aids Client Growth at MoneyGram (MGI)\r\nPer the Zacks Analyst, a robust digital platform built on partnerships with financial services providers and significant investments boosts the company's capabilities and customer base.\n\nNew Downgrades\n\nYelp (YELP) Hurt by Rising Competition, Falling Delivery\r\nPer the Zacks analyst, competition from Google and Facebook is a major threat to Yelp. Declining food take-out and delivery order volumes due to reopening of economies is hurting transaction revenues.\n\nHigher Costs, Weak Asset Quality Hurt Truist Financial (TFC)\r\nPer the Zacks analyst, Truist Financial's profits will be hurt because of a rise in costs as the company continues with investments in technology upgrades. Rising provisions is another major concern.\n\nCogent (CCOI) Plagued by Higher Operating Costs, Margin Woes\r\nPer the Zacks analyst, Cogent is likely to be plagued by margin woes driven by high operating costs to maintain network infrastructure, stiff competitive pressure and high technological obsolescence.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\n\nNextEra Energy, Inc. (NEE) : Free Stock Analysis Report\n\nBP p.l.c. (BP) : Free Stock Analysis Report\n\nCanadian Natural Resources Limited (CNQ) : Free Stock Analysis Report\n\nAbbVie Inc. (ABBV) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/top-research-reports-jpmorgan-chase-172105207.html", "symbols": ["4AB.F", "4AB.XETRA", "ABBV.MX", "ABBV.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "CNQ.TO", "CNQ.US", "CRC.F", "FP3.F", "NEE.US", "NEP.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.064, "neu": 0.784, "pos": 0.152}}, {"date": "2023-04-12T12:29:12+00:00", "title": "Boeing (BA) Gains From 36.8% Surge in Commercial Shipments", "content": "The Boeing Company’s BA shares rose 0.7% to reach $212.32 on Apr 11, driven by its recently revealed impressive first-quarter 2023 delivery figures.\n\nThe company’s first-quarter 2023 delivery numbers reflected a solid improvement of 36.8% in commercial shipments from the previous year’s tally. Also, defense shipments rose 2.4% year over year.\n\nCombining both the segments, Boeing’s total deliveries in the first quarter were 172 units compared with the 136 units delivered in the year-ago period. Such strong delivery numbers are likely to bolster BA’s top line in the first quarter.\n\nCommercial Deliveries Remain a Key Contributor\n\nBoeing reported commercial deliveries of 130 airplanes in the first quarter of 2023, a solid increase from the prior-year tally of 95. This was primarily driven by increased 737 and 787 airplane deliveries.\n\nThe shipments of Boeing 737 totaled 113 compared with 86 in the year-ago period, registering growth of 31.4% year over year. Boeing delivered 11,787 jets in the first quarter, while the same in the year-ago quarter was nil. The company also shipped 4,777 jets in the quarter, one more than the year-ago quarter’s tally.\n\nThe shipment of the 767 model was one compared with five in the previous year’s first-quarter tally. The delivery figure of Boeing 747 was one in the quarter, in line with the last year’s figure.\n\nBoeing vs. Airbus\n\nA comparative analysis of Boeing’s arch-rival Airbus SE’s EADSY commercial shipment indicates that the U.S. jet giant came ahead of Airbus in terms of delivery numbers. EADSY delivered 127 commercial aircraft in the first quarter compared with Boeing’s 130 in the same period.\n\nThe year-over-year growth rate of both companies also tells the same story, with Boeing’s deliveries indicating an improvement of an impressive 36.8%. Meanwhile, Airbus registered a decline of 11%, suggesting that BA is on a better growth trajectory.\n\nDefense Deliveries Up\n\nBoeing reported defense deliveries of 42 airplanes in the first quarter of 2023, reporting an increase by one jet from the prior-year tally.\n\nStory continues\n\nThe shipments of AH-64 Apache (remanufactured) deliveries declined by two jets at 13 compared with the year-ago period’s tally. Meanwhile, the delivery of AH-64 Apache (new) remained steady at seven compared with the year-ago period.\n\nMoreover, the company delivered five CH-47 Chinook (new) jets in the first quarter compared with four in the year-ago quarter. Meanwhile, one CH-47 Chinook (renewed) was delivered in the reported quarter compared with three in the first quarter of 2022.\n\nThe shipments of F-15 Models included two jets compared with one in the prior-year quarter. Meanwhile, the delivery of the KC-46 Tanker declined by three jets year over year at four, while seven F/A-18 jets were delivered compared with four in the first quarter of 2023.\n\nThe delivery of P-8 models remained unchanged at three from the first-quarter 2022 tally. Three commercial and civil satellites were delivered compared to none in the year-ago quarter.\n\nPeer Prospects\n\nJet makers who are yet to report their delivery numbers are Embraer S.A. ERJ and Textron TXT.\n\nIn the last reported quarter, Embraer delivered 30 commercial and 50 executive (33 light and 17 midsize) jets compared with 10 commercial and 23 executive (15 light and eight mid/super-midsize) jets in the prior quarter.\n\nThe long-term earnings growth rate for Embraer is pegged at 17%. The Zacks Consensus Estimate for ERJ’s 2023 earnings has been revised upward by 28.7% in the past 60 days.\n\nTextron delivered 52 jets in the fourth quarter of 2022, down from 46 in the year-ago quarter. It also delivered 47 commercial turboprops, up from 43 in the fourth quarter of 2021.\n\nThe long-term earnings growth rate for Textron is 11.2%. The Zacks Consensus Estimate for TXT’s 2023 earnings indicates growth of 24.2% from the prior-year reported figure.\n\nPrice Performance\n\nShares of Boeing have rallied 20.4% in the past year against the industry’s decline of 7.7%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nBoeing carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/boeing-ba-gains-36-8-122912869.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "EMBR3.SA", "EMY.F", "ERJ.US", "ERJN.MX", "TXT.F", "TXT.US"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.003, "neu": 0.898, "pos": 0.099}}, {"date": "2023-04-12T10:27:00+00:00", "title": "Why Upcoming Bank Earnings Could Hold the Key to Fed’s Next Rate Rise", "content": "This time, more than usual, what the banks say will be one of the best forward-looking economic indicators available. Banks were already tightening lending conditions in January, before the turmoil that brought down Silicon Valley Bank, according to the Federal Reserve’s Senior Loan Officer Opinion Survey. The question is by how much—is it equivalent to a quarter-point Fed hike, a half-point, or even more?\n\nContinue reading", "link": "https://finance.yahoo.com/m/3192cd04-171e-330a-bd70-6e549522da82/why-upcoming-bank-earnings.html", "symbols": ["0QF.F", "AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "MRNA.US"], "tags": [], "sentiment": {"polarity": 0.402, "neg": 0.036, "neu": 0.902, "pos": 0.061}}, {"date": "2023-04-12T00:00:33+00:00", "title": "Boeing resumes deliveries of 787 Dreamliners after pause, edges Airbus in Q1", "content": "Deliveries of the Boeing 787 \"Dreamliner\" jet resumed last month which helped elevate the U.S. aircraft maker over its European rival Airbus in terms of aircraft delivered and new orders in the first quarter.\n\nBoeing reported Tuesday that it delivered 64 commercial aircraft in March – an amount that nearly equaled combined deliveries in January and February. That total included seven of the widebody 787s that have been in high demand from airlines but have experienced repeated delays in the last two years due to manufacturing and regulatory issues.\n\nThe Federal Aviation Administration (FAA) allowed 787 deliveries to resume in mid-March after a weeks-long pause. However, the regulator has also called on airlines to inspect an issue with leaky bathroom faucets in the 787s that may pose a hazard to the jetliner’s electronics. Boeing and the manufacturer have worked on a fix for the problem and are coordinating retrofits with airlines.\n\nFAA WARNS OF SAFETY HAZARD FROM LEAKY FAUCETS IN BOEING 787, CALLS FOR INSPECTIONS Boeing was permitted to resume deliveries of 787 \"Dreamliners\" like the above in March which helped the American aircraft maker edge out its European rival Airbus.\n\nThe bulk of Boeing’s March deliveries were centered on the smaller 737 MAX jet, with a total of 52 delivered and Southwest Airlines and United Airlines landing a dozen each. It also delivered its first 767 of the year after the company resolved a fuel tank problem, in addition to a trio of 777s.\n\nBoeing received new orders for 60 planes in March and received 22 cancellations, leaving the Arlington, Virginia-based firm with 38 new net orders in March. The new orders consisted of 40 737 MAXs and 20 787s, while the cancellations included 16 MAXs and six 787s. Boeing’s backlog also inched down from 4,559 to 4,555 orders.\n\nREAD ON THE FOX BUSINESS APP\n\nBOEING PLANS TO INCREASE 737 MAX PRODUCTION RATES ‘VERY SOON’ Airbus delivered 61 aircraft in March, most of which were A320 variants like the above.\n\nAirbus reported the delivery of 61 aircraft in March which increased its total number of deliveries this year to 127 planes. The majority of aircraft delivered by the Blagnac, France-headquartered company were A320 variants that compete with Boeing 737 for orders from airlines.\n\nStory continues\n\nAirbus received orders for 20 planes in March, while orders for two others were canceled.\n\nOver the course of this year, Boeing has set a target of delivering at least 400 737 MAXs plus 70 787s, whereas Airbus aims to deliver 720 airplanes.\n\nThe Associated Press and Reuters contributed to this report.", "link": "https://finance.yahoo.com/news/boeing-resumes-deliveries-787-dreamliners-000033325.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.934, "neg": 0.025, "neu": 0.918, "pos": 0.057}}, {"date": "2023-04-12T00:00:00+00:00", "title": "7 Blue-Chip Stocks That Are Crushing the Market in 2023", "content": "Investors looking to beat the market should start here as these blue-chip stocks have outperformed broader markets so far in 2023.", "link": "https://investorplace.com/2023/04/7-blue-chip-stocks-that-are-crushing-the-market-in-2023/", "symbols": ["AXP.US", "BA.US", "GE.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}]