[{"date": "2023-08-24T20:30:41+00:00", "title": "Why Boeing Stock Was Down Today", "content": "Boeing (NYSE: BA) has discovered a new issue with its 737 MAX jet that could threaten the company's delivery targets. Investors are disappointed to see yet another setback, sending Boeing shares down 4.9% on Thursday. The 737 MAX was once expected to be among the best-selling jet designs of all time, but the program has been plagued with issues.\n\nContinue reading", "link": "https://finance.yahoo.com/m/49279c0a-5afe-3730-9a12-4d7d0440e954/why-boeing-stock-was-down.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.307, "neg": 0.062, "neu": 0.913, "pos": 0.026}}, {"date": "2023-08-24T18:24:23+00:00", "title": "Boeing adds Middle East site for 737-800 cargo conversions", "content": "Joramco has five hangars that can accommodate up to 17 wide and narrowbody aircraft, supported by 10 workshops specialized in the repair and overhaul of multiple aircraft types. (Photo: Joramco)\n\nBoeing is establishing its eighth production line for converting Boeing 737-800 passenger aircraft to freighters after agreeing with Amman, Jordan-based maintenance and repair company Joramco to carry out the aftermarket work.\n\nJoramco, a subsidiary of service company Dubai Aerospace Enterprise, is the first site in the Middle East to support Boeing’s 737-800 conversion program. It will reconfigure used aircraft for customers in the Middle East, Europe, North Africa and the Commonwealth of Independent States. Dubai Aerospace Enterprise has a leasing company with 550 aircraft, including 140 of the 737 family. Tuesday’s announcement suggested that DAE Capital would utilize Joramco to overhaul some of its own 737s for dedicated cargo business.\n\nJoramco has expanded to occupy five hangars with 22 maintenance lines by the end of 2024.\n\n“We continue to look for opportunities to bring freighter conversion capacity closer to our customers,” said Mike Doellefeld, Boeing’s vice president of engineering services, converted freighters and subcomponents, in the news release.\n\nBoeing did not provide details about the Joramco supplier relationship, such as when the new production line will be ready to begin work and any initial orders that will be sent to Amman. It typically takes more than a year for Boeing (NYSE: BA) partners to set up a hangar for conversion, acquire the necessary technology and tooling, and train staff.\n\nThe expansion of Boeing’s conversion program comes in the middle of a serious downturn in air cargo volumes that has resulted in a sharp reduction in orders for converted freighters by lessors and all-cargo operators. During the pandemic, when air cargo capacity was at a premium, passenger-to-freighter conversions were the rage. Rising values of narrowbody aircraft at a time when manufacturers are having difficulty meeting commitments for factory-built planes is also discouraging investment in conversions.\n\nBut Boeing’s outlook sees a need for 1,300 standard-size freighter conversions, such as the 737-800 and Airbus A321, by 2040. Boeing has delivered more than 130 converted 737-800s, with a backlog of 120 orders and commitments. In March, Boeing announced plans to activate a 737-800 production line in India.\n\nStory continues\n\nBoeing 737-800 BCF (Boeing Converted Freighter) at SJO/Juan Santamaria Int’l Airport.\r\nCosta Rica is a beautiful country pic.twitter.com/PqSLEr9IDp\n\n— #cockpitview (@lonlowe) August 22, 2023\n\nCooperativa Autogestionaria de Servicios Aeroindustriales, a licensed partner in Costa Rica that installed its first conversion kit in January, recently completed a modification for WestJet Cargo, according to a post on social media showing the finished plane at the San Juan airport. WestJet, whic started its freighter airline earlier this year with three leased aircraft, confirmed on LinkedIn on Thursday that the cargo jet has joined its fleet. The fourth 737-800 took longer to convert because it was a WestJet passenger aircraft that required different modifications than the other aircraft.\n\nClick here for more FreightWaves stories by Eric Kulisch.\n\nContact reporter: ekulisch@freightwaves.com\n\nRECOMMENDED READING:\n\nBoeing adds 737-800 conversion line in India\n\nThe post Boeing adds Middle East site for 737-800 cargo conversions appeared first on FreightWaves.", "link": "https://finance.yahoo.com/news/boeing-adds-middle-east-737-182423129.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.938, "neg": 0.019, "neu": 0.929, "pos": 0.052}}, {"date": "2023-08-24T17:19:04+00:00", "title": "Markets Fall Midday as Tech Rally Fades Ahead of Speech by Fed Chair Powell", "content": "U.S. equity markets fell in midday trading on Thursday, Aug. 24, 2023, as tech gains following Nvidia's earnings beat faded ahead of Fed Chair Jerome Powell's coming speech at the Jackson Hole Economic Symposium.\n\nContinue reading", "link": "https://finance.yahoo.com/m/2909174d-22f5-3b74-98ec-aebf23307412/markets-fall-midday-as-tech.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "GSPC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0, "neu": 0.936, "pos": 0.064}}, {"date": "2023-08-24T17:03:00+00:00", "title": "Here Are the 2 Stocks Overshadowing Nvidia's Big News", "content": "Investors interested in artificial intelligence got the news they wanted, as Nvidia continued to show dominating performance in the tech sector. Yet even though major benchmarks initially jumped Thursday morning on the news, the gains proved short-lived.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a2673e79-db36-30fa-83bd-75752555e092/here-are-the-2-stocks.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.718, "neg": 0.048, "neu": 0.771, "pos": 0.181}}, {"date": "2023-08-24T16:42:29+00:00", "title": "Spirit AeroSystems stock plummets after new manufacturing error identified", "content": "Spirit AeroSystems' stock hit a 52-week low Thursday morning after it was discovered there are new issues with some of the materials it supplies to the Boeing Co. Boeing (NYSE: BA) has identified a new 737 Max quality problem, Reuters reported, involving Wichita-based supplier Spirit AeroSystems (NYSE: SPR). The issue is related to improperly drilled holes on the aft pressure bulkhead. Boeing, the report said, said the defect will delay near-term deliveries.\n\nContinue reading", "link": "https://finance.yahoo.com/m/cfa83400-d667-33f6-b3f7-a7eeb3a9b1f1/spirit-aerosystems-stock.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.807, "neg": 0.146, "neu": 0.811, "pos": 0.042}}, {"date": "2023-08-24T16:33:49+00:00", "title": "Why Spirit AeroSystems Stock Is Down Big Today", "content": "Boeing has a fresh 737 MAX concern, and it appears one of the company's suppliers is to blame. Shares of Spirit AeroSystems (NYSE: SPR) fell more than 14% on Thursday after Boeing revealed the details of the latest setback to its most important aircraft platform. Boeing has discovered that one of its primary suppliers improperly drilled holes in a component of the jet that helps maintain cabin pressure.\n\nContinue reading", "link": "https://finance.yahoo.com/m/5f42e27c-5d6f-3dc9-82e0-c4c8416dcdb4/why-spirit-aerosystems-stock.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.644, "neg": 0.06, "neu": 0.798, "pos": 0.142}}, {"date": "2023-08-24T16:33:04+00:00", "title": "Disney on Track for Its Lowest Close Since 2014. Boeing Also Drags on Dow.", "content": "Walt Disney stock was falling Thursday in a head-scratching move as shares dropped for three of the past four days. Disney (ticker: DIS) shares were tumbling 3.1% to $83.14 and were on pace for their lowest close since October 2014, according to Dow Jones Market Data.\n\nContinue reading", "link": "https://finance.yahoo.com/m/891c2d9b-1345-32d6-bacb-7cfafe335878/disney-on-track-for-its.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DIS.MX", "DIS.US", "DISB34.SA", "DJI.INDX", "WDP.F", "WDP.XETRA"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0.081, "neu": 0.833, "pos": 0.085}}, {"date": "2023-08-24T16:03:20+00:00", "title": "Is Spirit AeroSystems Holdings Inc Set to Underperform? Analyzing the Factors Limiting Growth", "content": "Long-established in the Aerospace & Defense industry, Spirit AeroSystems Holdings Inc (NYSE:SPR) has enjoyed a stellar reputation. However, it has recently witnessed a decline of 16.32%, juxtaposed with a three-month change of -26.67%. Fresh insights from the GuruFocus Score Rating hint at potential headwinds. Notably, its diminished rankings in financial strength, growth, and valuation suggest that the company might not live up to its historical performance. Join us as we dive deep into these pivotal metrics to unravel the evolving narrative of Spirit AeroSystems Holdings Inc.\n\nWarning! GuruFocus has detected 3 Warning Signs with SPR. Click here to check it out.  SPR 30-Year Financial Data The intrinsic value of SPR Is Spirit AeroSystems Holdings Inc Set to Underperform? Analyzing the Factors Limiting Growth\n\nUnderstanding the GF Score\n\nThe GF Score is a stock performance ranking system developed by GuruFocus using five aspects of valuation, which has been found to be closely correlated to the long-term performances of stocks by backtesting from 2006 to 2021. The stocks with a higher GF Score generally generate higher returns than those with a lower GF Score. Therefore, when picking stocks, investors should invest in companies with high GF Scores. The GF Score ranges from 0 to 100, with 100 as the highest rank.\n\n1. Financial strength rank: 2/10 2. Profitability rank: 6/10 3. Growth rank: 1/10 4. GF Value rank: 4/10 5. Momentum rank: 7/10\n\nBased on the above method, GuruFocus assigned Spirit AeroSystems Holdings Inc the GF Score of 61 out of 100, which signals poor future outperformance potential.\n\nUnderstanding Spirit AeroSystems Holdings Inc Business\n\nSpirit AeroSystems Holdings Inc, with a market cap of $2.02 billion and sales of $5.39 billion, designs and manufactures aerostructures, particularly fuselages, for commercial and military aircraft. The company was spun out of Boeing in 2005, and the firm is the largest independent supplier of aerostructures. Boeing and Airbus are the firms and their primary customers, Boeing composes roughly 80% of annual revenue and Airbus composes roughly 15% of revenue. The company is highly exposed to Boeing's 737 program, which generally accounts for about half of the company's revenue.\n\nStory continues Is Spirit AeroSystems Holdings Inc Set to Underperform? Analyzing the Factors Limiting Growth\n\nFinancial Strength Breakdown\n\nSpirit AeroSystems Holdings Inc's financial strength indicators present some concerning insights about the company's balance sheet health. The company's interest coverage ratio of 0, which positions it worse than 0% of 187 companies in the Aerospace & Defense industry. This ratio highlights potential challenges the company might face when handling its interest expenses on outstanding debt. It's worth noting that the esteemed investor Benjamin Graham typically favored companies with an interest coverage ratio of at least five.\n\nThe company's Altman Z-Scoreis just 1.1, which is below the distress zone of 1.81. This suggests that the company may face financial distress over the next few years. Additionally, the company's low cash-to-debt ratio at 0.13 indicates a struggle in handling existing debt levels.\n\nGrowth Prospects\n\nA lack of significant growth is another area where Spirit AeroSystems Holdings Inc seems to falter, as evidenced by the company's low Growth rank. The company's revenue has declined by -13.8 per year over the past three years, which underperforms worse than 85.44% of 261 companies in the Aerospace & Defense industry. Stagnating revenues may pose concerns in a fast-evolving market.\n\nLastly, Spirit AeroSystems Holdings Inc predictability rank is just one star out of five, adding to investor uncertainty regarding revenue and earnings consistency. Is Spirit AeroSystems Holdings Inc Set to Underperform? Analyzing the Factors Limiting Growth\n\nConclusion\n\nGiven the company's financial strength, profitability, and growth metrics, the GuruFocus Score Rating highlights the firm's unparalleled position for potential underperformance. While Spirit AeroSystems Holdings Inc has a rich history in the Aerospace & Defense industry, its current financial indicators suggest a challenging road ahead. Investors should consider these factors when making investment decisions.\n\nGuruFocus Premium members can find more companies with strong GF Scores using the following screener link: GF Score Screen\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/spirit-aerosystems-holdings-inc-set-160320601.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.06, "neu": 0.782, "pos": 0.158}}, {"date": "2023-08-24T16:03:15+00:00", "title": "Boeing Co's Rocky Flight Path: A Deep Dive into Its Performance Metrics", "content": "Long-established in the Aerospace & Defense industry, Boeing Co (NYSE:BA) has enjoyed a stellar reputation. However, it has recently witnessed a decline of 3.19%, juxtaposed with a three-month change of 11.51%. Fresh insights from the GuruFocus Score Rating hint at potential headwinds. Notably, its diminished rankings in financial strength, growth, and valuation suggest that the company might not live up to its historical performance. Join us as we dive deep into these pivotal metrics to unravel the evolving narrative of Boeing Co.\n\nWarning! GuruFocus has detected 5 Warning Signs with BA. Click here to check it out.  BA 30-Year Financial Data The intrinsic value of BA Boeing Co's Rocky Flight Path: A Deep Dive into Its Performance Metrics\n\nDecoding the GF Score\n\nThe GF Score is a stock performance ranking system developed by GuruFocus using five aspects of valuation, which has been found to be closely correlated to the long-term performances of stocks by backtesting from 2006 to 2021. The stocks with a higher GF Score generally generate higher returns than those with a lower GF Score. Therefore, when picking stocks, investors should invest in companies with high GF Scores. The GF Score ranges from 0 to 100, with 100 as the highest rank.\n\n1. Financial strength rank: 3/10 2. Profitability rank: 6/10 3. Growth rank: 2/10 4. GF Value rank: 5/10 5. Momentum rank: 10/10\n\nBased on the above method, GuruFocus assigned Boeing Co the GF Score of 68 out of 100, which signals poor future outperformance potential.\n\nUnderstanding Boeing Co's Business\n\nBoeing Co, with a market cap of $133.48 billion, is a major player in the aerospace and defense industry. It operates in four segments: commercial airplanes; defense, space, and security; global services; and Boeing capital. Competing with Airbus in the production of aircraft and with Lockheed, Northrop, and several other firms in creating military aircraft and weaponry, Boeing Co has a significant presence in the industry. However, its operating margin stands at -4.63, indicating potential profitability issues. The company's sales amount to $73.61 billion.\n\nStory continues Boeing Co's Rocky Flight Path: A Deep Dive into Its Performance Metrics\n\nFinancial Strength Breakdown\n\nBoeing Co's financial strength indicators present some concerning insights about the company's balance sheet health. The company's interest coverage ratio of 0 positions it worse than 0% of 187 companies in the Aerospace & Defense industry. This ratio highlights potential challenges the company might face when handling its interest expenses on outstanding debt. The company's Altman Z-Score is just 1.48, which is below the distress zone of 1.81. This suggests that the company may face financial distress over the next few years. Additionally, the company's low cash-to-debt ratio at 0.26 indicates a struggle in handling existing debt levels.\n\nGrowth Prospects\n\nA lack of significant growth is another area where Boeing Co seems to falter, as evidenced by the company's low Growth rank. The company's revenue has declined by -6.1 per year over the past three years, which underperforms worse than 72.8% of 261 companies in the Aerospace & Defense industry. Stagnating revenues may pose concerns in a fast-evolving market. Lastly, Boeing Co predictability rank is just one star out of five, adding to investor uncertainty regarding revenue and earnings consistency. Boeing Co's Rocky Flight Path: A Deep Dive into Its Performance Metrics\n\nConclusion\n\nGiven Boeing Co's financial strength, profitability, and growth metrics, the GuruFocus Score Rating highlights the firm's unparalleled position for potential underperformance. While the company has a strong presence in the Aerospace & Defense industry, its financial health and growth prospects raise concerns about its ability to outperform in the future. Therefore, investors should exercise caution when considering this stock.\n\nGuruFocus Premium members can find more companies with strong GF Scores using the following screener link: GF Score Screen\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/boeing-cos-rocky-flight-path-160315064.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.065, "neu": 0.797, "pos": 0.138}}, {"date": "2023-08-24T16:00:38+00:00", "title": "Stock market today: Dow falls as Nvidia shine fails to stop tech rout; Powell eyed", "content": "Investing.com -- The Dow closed lower Thursday, sidestepping a rip-roaring move higher in Nvidia (NASDAQ:NVDA) as investors remain wary of making bullish bets a day ahead of potential clues on monetary policy from Federal Reserve chairman Jerome Powell at the upcoming Jackson Hole symposium.\n\nThe Dow Jones Industrial Average fell 1%, or 354 points, the S&P 500 fell 1.2%, Nasdaq was down 1.7%.\n\nNvidia's shine not enough to lift big tech\n\nNvidia rallied to an all-time high before giving back some gains even as Wall Street cheered the chipmaker's blowout results and guidance.\n\nThe chipmaker's third-quarter revenue guidance of $16 billion was well ahead of expectations for $12B as the growth was bolstered by AI-led chip demand.\n\nBut the rally in Nvidia failed to lift big tech as investor appetite for bullish bets on the stock was kept in check by rising Treasury yields ahead of a speech from Powell on Friday\n\nApple (NASDAQ:AAPL), Alphabet (NASDAQ:GOOGL), Meta (NASDAQ:META), and Microsoft (NASDAQ:MSFT) were down around 2%.\n\nBoeing bombards on 737 Max delays\n\nAircraft maker Boeing (NYSE:BA), a major Dow component, fell more than 4% after the aircraft maker said it would delay 737 Max deliveries owing to fresh manufacturing flows.\n\nAutodesk, Splunk rack up gains on earning stage\n\nAutodesk (NASDAQ:ADSK) delivered upbeat guidance, after second-quarter results beat expectations amid strong demand for design software.\n\nThe design software company said its end-market exposure \"remains well-positioned to support several years of digitization momentum.\n\nSplunk (NASDAQ:SPLK), meanwhile, also delivered guidance that topped Wall Street's estimates as ongoing demand for cybersecurity posted performance.\n\nThe cybersecurity and analytics company guided third-quarter revenue between $1.02B and $1.035B, topping estimates of $982M.\n\nFresh signs labor market remains robust\n\nU.S. jobless claims fell more than expected last week, stoking ongoing fears about a tight labor market and a threat to wage inflation.\n\nStory continues\n\nJobless claims fell to 230,000, a three-week low and more than forecasts of 240,000.\n\nRelated Articles\n\nStock market today: Dow falls as Nvidia shine fails to stop tech rout; Powell eyed\n\nGM battery joint venture agrees to hike Ohio workers wages\n\nAfter-hours movers: Affirm gains following results, Domo sinks", "link": "https://finance.yahoo.com/news/stock-market-today-dow-falls-160038256.html", "symbols": ["AAPL.US", "ADSK.US", "AUD.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "GOOGL.US", "META.US", "MSFT.US", "NVDA.US", "S0U.F", "SPLK.US"], "tags": [], "sentiment": {"polarity": 0.823, "neg": 0.067, "neu": 0.843, "pos": 0.09}}, {"date": "2023-08-24T15:36:32+00:00", "title": "Is Boeing Co (BA) Fairly Valued? A Comprehensive Analysis", "content": "On August 24, 2023, Boeing Co (NYSE:BA) closed at $223.05, experiencing a daily loss of 2.42%. Despite this, the stock has seen a 3-month gain of 12.82%. With a reported Loss Per Share of 7.49, the question arises: Is Boeing Co (NYSE:BA) fairly valued? This article presents a detailed valuation analysis of Boeing Co. Keep reading to gain valuable insights.\n\nIntroduction to Boeing Co\n\nWarning! GuruFocus has detected 5 Warning Signs with BA. Click here to check it out.  BA 30-Year Financial Data The intrinsic value of BA\n\nBoeing Co (NYSE:BA) is a leading aerospace and defense company. It operates in four segments: commercial airplanes; defense, space, and security; global services; and Boeing capital. Boeing's commercial airplanes segment competes with Airbus, producing aircraft with seating capacity starting from 130. Its defense, space, and security segment competes with companies like Lockheed and Northrop to create military aircraft and weaponry. Boeing's global services provide aftermarket support to airlines.\n\nCurrently, the stock price of Boeing Co (NYSE:BA) stands at $223.05, while the GF Value, an estimation of fair value, is $230.89. This comparison sets the stage for a deeper exploration of the company's value. Is Boeing Co (BA) Fairly Valued? A Comprehensive Analysis\n\nUnderstanding the GF Value\n\nThe GF Value is a unique measure of a stock's intrinsic value. It is calculated considering three factors:\n\nHistorical multiples (PE Ratio, PS Ratio, PB Ratio and Price-to-Free-Cash-Flow) at which the stock has traded. GuruFocus adjustment factor based on the company's past performance and growth. Future estimates of the business performance.\n\nThe GF Value Line on our summary page provides an overview of the fair value at which the stock should ideally be traded. If the stock price is significantly above the GF Value Line, it is overvalued, and its future return is likely to be poor. Conversely, if it is significantly below the GF Value Line, its future return will likely be higher.\n\nStory continues\n\nAccording to GuruFocus Value calculation, the stock of Boeing Co (NYSE:BA) is estimated to be fairly valued. With its current price of $223.05 per share and a market cap of $134.50 billion, the stock appears to be trading at its fair value. This suggests that the long-term return of its stock is likely to be close to the rate of its business growth. Is Boeing Co (BA) Fairly Valued? A Comprehensive Analysis\n\nLink: These companies may deliver higher future returns at reduced risk.\n\nFinancial Strength of Boeing Co\n\nCompanies with poor financial strength pose a high risk of permanent capital loss to investors. To avoid this, it's crucial to analyze a company's financial strength before purchasing shares. Key indicators of financial strength include the cash-to-debt ratio and interest coverage.\n\nBoeing Co has a cash-to-debt ratio of 0.26, ranking worse than 66.32% of 285 companies in the Aerospace & Defense industry. This gives Boeing Co an overall financial strength rating of 3 out of 10, indicating poor financial strength. Is Boeing Co (BA) Fairly Valued? A Comprehensive Analysis\n\nProfitability and Growth\n\nInvesting in profitable companies carries less risk, especially if the company has demonstrated consistent profitability over the long term. Boeing Co has been profitable for 6 years over the past 10 years. In the past 12 months, the company had revenues of $73.60 billion and a Loss Per Share of $7.49. Its operating margin of -4.63% is worse than 74.56% of 283 companies in the Aerospace & Defense industry. GuruFocus ranks Boeing Co's profitability as fair.\n\nGrowth is a crucial factor in a company's valuation. Faster-growing companies create more value for shareholders, especially if the growth is profitable. The 3-year average annual revenue growth of Boeing Co is -6.1%, ranking worse than 72.8% of 261 companies in the Aerospace & Defense industry. The 3-year average EBITDA growth rate is 0%, ranking worse than 0% of 227 companies in the Aerospace & Defense industry, indicating poor growth.\n\nAnother way to assess a company's profitability is to compare its return on invested capital (ROIC) and the weighted cost of capital (WACC). ROIC measures how well a company generates cash flow relative to the capital it has invested in its business. WACC is the rate that a company is expected to pay on average to all its security holders to finance its assets. Ideally, ROIC should be higher than WACC. For the past 12 months, Boeing Co's ROIC is -3.54, and its WACC is 10.72. Is Boeing Co (BA) Fairly Valued? A Comprehensive Analysis\n\nConclusion\n\nOverall, Boeing Co (NYSE:BA) stock is estimated to be fairly valued. The company's financial condition is poor, and its profitability is fair. Its growth ranks worse than 0% of 227 companies in the Aerospace & Defense industry. To learn more about Boeing Co's stock, you can check out its 30-Year Financials here.\n\nTo find high-quality companies that may deliver above-average returns, consider checking out the GuruFocus High Quality Low Capex Screener.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/boeing-co-ba-fairly-valued-153632067.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.062, "neu": 0.727, "pos": 0.211}}, {"date": "2023-08-24T15:01:41+00:00", "title": "Boeing and Spirit AeroSystems Shares Drop as Defect Delays 737 MAX Deliveries", "content": "Boeing and Spirit AeroSystems shares dropped as a 737 MAX quality problem delays deliveries and Boeing warned it could miss this year's delivery target.\n\nContinue reading", "link": "https://finance.yahoo.com/m/3996fa64-25ea-39f6-9428-bc095f7f5cb8/boeing-and-spirit-aerosystems.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.361, "neg": 0.211, "neu": 0.66, "pos": 0.129}}, {"date": "2023-08-24T14:23:27+00:00", "title": "Boeing stock dips on warning about delivery delays", "content": "Boeing (BA) shares traded slightly lower in early trading after the company warned of potential delivery delays of its 737 MAX jets. The delay stems from concerns about a quality issue on a part manufactured by Spirit AeroSystems (SPR). Yahoo Finance breaks down the stocks' reaction.", "link": "https://finance.yahoo.com/video/boeing-stock-dips-warning-delivery-142327609.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.348, "neg": 0.129, "neu": 0.792, "pos": 0.079}}, {"date": "2023-08-24T14:17:47+00:00", "title": "Durable Goods Orders Tumble. Why It's Not a Big Surprise.", "content": "Durable goods orders missed economist expectations Thursday. It was all due to Boeing. The overall stock market is higher and shares of the commercial aerospace giant are down, but the economic data doesn’t have anything to do with either move.\n\nContinue reading", "link": "https://finance.yahoo.com/m/325c6f4d-7978-3c77-bd94-b6324f6510b2/durable-goods-orders-tumble..html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0.037, "neu": 0.926, "pos": 0.037}}, {"date": "2023-08-24T13:24:00+00:00", "title": "Boeing (BA) Secures Order for 12 Dreamliner Jets From Qantas", "content": "The Boeing Company BA recently secured an order for the 787 Dreamliner family of jets from the Australian carrier, Qantas Group. To expand its 787 Dreamliner family jet, Qantas is looking to add four more 787-9 and eight 787-10 airplanes to its already existing portfolio of 14 787-9 jets.\n\nBoeing’s 787 Dreamliner family of jets can fly with sustainable aviation fuel, and eco-friendly GE engines will assist Qantas in taking a step forward in its sustainability goals and reducing emissions by up to 25%. These jets are capable of flying a longer distance non-stop and provide Qantas with the benefits of adding new routes to its network and using less fuel.\n\nWhat’s Favoring Boeing?\n\nBoeing’s latest Commercial Market Outlook projects the demand for 42,000 new commercial airplanes for the next 20 years. The report further suggests passenger traffic to continue to show strength. This reflects bright growth prospects for commercial aerospace players like Boeing.\n\nIt remains the largest aircraft manufacturer in the United States in terms of revenues, orders and deliveries. The strong demand for its commercial planes can be gauged by revenues in the Commercial segment, which increased 41% year over year, mainly driven by higher 787 deliveries.\n\nBoeing delivered 136 commercial planes during the last reported quarter, thus recording growth of 12% year over year. The backlog for its Commercial segment remained healthy, with more than 4,800 airplanes valued at $363 billion.\n\nSuch an impressive order backlog assures strength in the performance of the top line of the company, thus boosting its overall returns.\n\nPeer Prospects\n\nApart from Boeing, aircraft manufacturers in the industry that have an established position in the aircraft manufacturing market and may gain from the flourishing demand are as follows:\n\nAirbus EADSY enjoys strong demand in the commercial aircraft segment. EADSY delivered 189 commercial aircraft in the second quarter, thus registering growth of 21.9% year over year.EADSY expects to deliver 720 commercial aircraft in 2023.\n\nStory continues\n\nThe long-term (three to five years) earnings growth of EADSY stands at 12.4%. The Zacks Consensus Estimate for 2023 sales calls for a growth rate of 17.8%.\n\nEmbraer ERJ continues to witness the strong market demand for its E-jets worldwide. ERJ delivered 17 commercial jets in the second quarter compared with seven in the prior quarter. ERJ’s commercial jet deliveries are projected in the band of 65-70 jets, while Executive Aviation deliveries are expected in the band of 120-130 aircraft.\n\nEmbraer’s long-term earnings growth rate is 17%. ERJ shares have returned 42.5% in the past year.\n\nPrice Performance\n\nShares of Boeing have rallied 39.7% in the past year against the industry’s fall of 7%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nBoeing carries a Zacks Rank #3 (Hold). One better-ranked stock in the same industry is Textron TXT, carrying a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nThe Zacks Consensus Estimate for Textron’s 2023 sales suggests a growth rate of 32.2% from the prior-year reported figure. The Zacks Consensus Estimate for TXT’s 2024 sales calls for a growth rate of 7.7% from the prior-year estimated figure.\n\nTXT has a long-term earnings growth rate of 11.7%. Shares of Textron have risen 16% in the past year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/boeing-ba-secures-order-12-132400657.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "TXT.F", "TXT.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.011, "neu": 0.819, "pos": 0.17}}, {"date": "2023-08-24T12:51:51+00:00", "title": "Boeing Stock Stalls, Spirit AeroSystems Pokes More Holes In 737 Delivery Schedule", "content": "Boeing stock eased early Thursday after discovering a manufacturing defect from supplier Spirit AeroSystems, potential delivery delays.\n\nContinue reading", "link": "https://finance.yahoo.com/m/8f835b41-811a-39fe-bd48-f72c25f7edda/boeing-stock-stalls%2C-spirit.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.128, "neg": 0.113, "neu": 0.704, "pos": 0.183}}, {"date": "2023-08-24T12:50:21+00:00", "title": "Norwegian Air feeling more positive on Boeing MAX 10, CEO says", "content": "OSLO (Reuters) - Norwegian Air may consider adding Boeing's MAX 10 model to its fleet, CEO Geir Karlsen said on Thursday, after finding the plane's flight range was better-suited to the airline than initially thought.\n\n\"We were kind of negative towards the MAX 10 back six months ago, partly because of the range these aircraft can fly in the network we are flying,\" Karlsen said.\n\n\"Based on new information we have received, that has changed to some extent so we are actually evaluating right now whether we should bring MAX 10 into our fleet.\"\n\nThe Boeing Max 10 was launched at the Paris Air Show in 2017, but has not yet entered into commercial operation.\n\nBoeing has said it expects the Federal Aviation Administration (FAA)to begin flight testing certification for the MAX 10 this year, and the first delivery is currently expected in 2024.\n\nThe MAX 10 is the largest of Boeing's best-selling single aisle airplane family.\n\nNorwegian entered a deal to buy 50 Boeing 737 MAX 8 aircraft in May last year, and also secured options for a further 30 of the planes at an undisclosed price.\n\nIn a Norwegian Air configuration, the Boeing MAX 10 would have 225 seats compared to the 189 seats for a Norwegian-configured MAX 8.\n\n\"The seat cost would obviously go down, also of course depending on the price of the aircraft,\" Karlsen said.\n\nThe carrier's 81-strong fleet currently consists of 16 Boeing MAX aircraft, and if Boeing's delivery schedule holds it will have 34 of by the end of next year - a third of the total fleet.\n\n(Reporting by Victoria Klesty; Editing by Sharon Singleton)", "link": "https://finance.yahoo.com/news/norwegian-air-feeling-more-positive-125021603.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.182, "neg": 0.011, "neu": 0.971, "pos": 0.018}}, {"date": "2023-08-24T12:25:27+00:00", "title": "Spirit Aerosystems aware of quality issue on some fuselage units for 737", "content": "Airline supplier Spirit Aerosystems says it's aware of a quality issue involving elongated fastener holes on the aft pressure bulkhead on certain models of the 737 fuselage it produces.\n\nThe Wichita, Kansas-based company said because it uses multiple suppliers, only some units are impacted and it will continue to make unit deliveries to Boeing.\n\n“Boeing has determined that there is no immediate safety of flight concern associated with this issue for the 737 fleet and that the in-service fleet may continue to operate,” Spirit Aerosystems said in a statement.\n\nAircraft manufacturers have wrestled with supply issues in recent years. Spirit Aerosystems builds the fuselage for Boeing’s 737 Max narrowbody jet and substantial sections of aircraft bodies in other of its models. The company builds components for Airbus aircraft as well.\n\nIn April Boeing cautioned that production and delivery of a “significant number” of its 737 Max planes could be delayed because of questions about Spirit Aerosystems' work on the fuselages.\n\nAll Max planes were grounded worldwide for nearly two years after a pair of deadly crashes, and production flaws halted deliveries of the larger 787 jetliner several times in the past three years.\n\nShares of Spirit Aerosystems Holdings Inc. dropped more than 6% before the market open on Thursday, while Arlington, Virginia-based Boeing Co.'s stock slipped nearly 2%.", "link": "https://finance.yahoo.com/news/spirit-aerosystems-aware-quality-issue-122527985.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.891, "neg": 0.028, "neu": 0.876, "pos": 0.096}}, {"date": "2023-08-24T11:50:00+00:00", "title": "Boeing Stock Drops. 737 Deliveries Are at Risk After Issue at Spirit AeroSystems.", "content": "Shares in Spirit AeroSystems take a bigger hit despite the Boeing supplier saying the 737 issue will not make a material impact to its delivery range.\n\nContinue reading", "link": "https://finance.yahoo.com/m/57f729c2-ab9e-355c-b668-d1a0c0d52734/boeing-stock-drops.-737.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.44, "neg": 0, "neu": 0.86, "pos": 0.14}}, {"date": "2023-08-24T11:20:40+00:00", "title": "5 Things to Know Before Markets Open", "content": "Nvidia shares surged after the chipmaker gave a higher-than-expected revenue forecast on rising demand for AI, and shares of software maker Splunk jumped after it narrowed losses on higher AI revenue. Here’s what investors need to know today.\n\nContinue reading", "link": "https://finance.yahoo.com/m/5b90ea56-3878-3445-a84f-1e937ea46a0e/5-things-to-know-before.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "S0U.F", "SPLK.US"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0.096, "neu": 0.803, "pos": 0.101}}, {"date": "2023-08-24T09:58:32+00:00", "title": "Boeing shares fall as 737 goal at risk from supplier defect involving Spirit", "content": "By Abhijith Ganapavaram\n\n(Reuters) -Boeing shares fell 2% before the bell on Thursday after the U.S. planemaker warned of delays in near-term deliveries of 737 MAX jets due to a fresh quality issue involving its biggest supplier Spirit AeroSystems.\n\nThis could put pressure on the top end of Boeing's annual 737 delivery target of 450 planes, some Wall Street analysts warned even as the planemaker said it was evaluating that goal.\n\nIt is for the second year that Boeing's delivery targets are under review, after supply-chain issues forced it to temper its goal last year. The latest quality issue is due to improperly shaped holes in the aft pressure bulkhead of some planes.\n\nThe bulkhead is a structure that seals off the rear of the pressurized cabin. The parts in question were made by Spirit, whose shares were down 6.4% in premarket trading on Thursday.\n\nBut not all 737 fuselages will be impacted as Spirit uses multiple suppliers for the aft pressure bulkhead.\n\nBoeing believes the defect is limited to a portion of its bestselling MAX 8 model, but was evaluating if older-model 737 Next Generation jets have also been impacted.\n\n\"It is early days on both the near and long-term financial impacts of the issue, but it appears the fix is likely to take several weeks for completed aircraft,\" Citi analyst Jason Gursky said in a note.\n\nThe planemaker's ratio of enterprise value to sales for the next 12 months is 2, compared to 1.3 for rival Airbus, as per Refinitiv data. A low ratio implies a more attractive investment opportunity.\n\nThe defect also adds more pressure on Spirit after it took a financial hit from a another quality issue and reported bleak results due to a worker strike earlier this year.\n\nBoeing's shares were trading at $224.03 compared with Wall Street's median price target of $254.70. It was $238.50 three months ago.\n\n(Reporting by Abhijith Ganapavaram in Bengaluru; Editing by Arun Koyyur)", "link": "https://ca.finance.yahoo.com/news/boeing-shares-fall-737-delivery-095832151.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.539, "neg": 0.075, "neu": 0.843, "pos": 0.082}}, {"date": "2023-08-24T08:59:00+00:00", "title": "These Stocks Are Moving the Most Today: Nvidia, Snowflake, Splunk, Boeing, AMC, U.S. Steel, and More", "content": "Nvidia stock surges after the chip maker forecasts third-quarter revenue of $16 billion at the midpoint of its range, well above analysts' forecasts. Snowflake, meanwhile, reports better-than-expected second-quarter earnings and revenue, and Splunk's quarterly revenue jumps 14% and tops estimates.\n\nContinue reading", "link": "https://finance.yahoo.com/m/84df7d52-2095-3124-b78f-71e1265449a9/these-stocks-are-moving-the.html", "symbols": ["5Q5.F", "ADSK.US", "AUD.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "S0U.F", "SNOW.US", "SPLK.US"], "tags": [], "sentiment": {"polarity": 0.66, "neg": 0, "neu": 0.881, "pos": 0.119}}, {"date": "2023-08-24T07:41:26+00:00", "title": "Nvidia, Microsoft, Alphabet, Splunk rise premarket; Boeing, Dollar Tree fall", "content": "Investing.com -- U.S. futures traded in a mixed fashion Thursday, with the tech sector dominating after Nvidia’s strong quarterly numbers.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nNvidia (NASDAQ:NVDA) stock rose 7.8% after the world’s most valuable chipmaker posted stellar quarterly earnings, with second-quarter revenues crushing lofty expectations, boosted by the frenzy over generative artificial intelligence.\n\nMicrosoft (NASDAQ:MSFT) stock rose 2% and Google-ownerAlphabet (NASDAQ:GOOGL) stock rose 1.4%, boosted by the strong Nvidia earnings as both companies have been rushing to incorporate generative AI into their web search platforms.\n\nBoeing (NYSE:BA) stock fell 1.8% after the planemaker warned of delays in near-term deliveries of 737 MAX jets due to a fresh quality issue involving its biggest supplier Spirit AeroSystems (NYSE:SPR), down 6.4%.\n\nSplunk (NASDAQ:SPLK) stock rose 13% after the data analytics software maker forecast third-quarter revenue above market estimates on expectations of AI-related spending.\n\nDollar Tree (NASDAQ:DLTR) stock fell 4.6% after the discount retailer forecast annual profit below expectations as it expects a hit from a shift in spending towards lower-margin consumables.\n\nPetco Health and Wellness Company (NASDAQ:WOOF) stock fell 13% after the pet supply retailer swings to a quarterly loss and cuts its annual guidance.\n\nKenvue (NYSE:KVUE) stock rose 1.2% after Goldman Sachs upgraded its stance on the consumer health company to 'Buy' from 'Neutral', saying it could rally more than 20%. United States Steel (NYSE:X) stock fell 1.8%, extending losses from the previous session that were sparked by a decision by Esmark to scrap its pursuit of a takeover of the alloy producer.\n\nRelated Articles\n\nNvidia, Microsoft, Alphabet, Splunk rise premarket; Boeing, Dollar Tree fall\n\nBoeing shares fall as 737 goal at risk from supplier defect involving Spirit\n\nShein inks deal with Forever 21-owner as fast-fashion majors look to boost reach", "link": "https://finance.yahoo.com/news/nvidia-microsoft-alphabet-splunk-rise-074126792.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DLTR.MX", "DLTR.US", "DT3.F", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US"], "tags": [], "sentiment": {"polarity": 0.951, "neg": 0.064, "neu": 0.817, "pos": 0.119}}, {"date": "2023-08-24T00:44:00+00:00", "title": "Spirit AeroSystems Says Aware of Quality Issue on Some 737 Fuselage Units", "content": "Spirit AeroSystems said it is aware of a quality issue on some models of the 737 fuselage it produces, but will continue to supply units to Boeing, which has determined that there is no immediate flight safety concern tied to the issue.\n\nContinue reading", "link": "https://finance.yahoo.com/m/7a4fb0b4-bdaa-3306-82a5-3f3f95b12656/spirit-aerosystems-says-aware.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.654, "neg": 0.056, "neu": 0.781, "pos": 0.163}}, {"date": "2023-08-24T00:00:00+00:00", "title": "The 3 Best Flying Taxi Stocks to Buy Now: August 2023", "content": "Dive into the future of transportation with these three best flying taxi stocks, offering investors tremendous upside ahead", "link": "https://investorplace.com/2023/08/the-3-best-flying-taxi-stocks-to-buy-now-august-2023/", "symbols": ["BA.US", "XPEV.US"], "tags": [], "sentiment": {"polarity": 0.637, "neg": 0, "neu": 0.802, "pos": 0.198}}, {"date": "2023-08-23T23:12:38+00:00", "title": "Qantas to secure new planes from Airbus, Boeing", "content": "(Reuters) -Australia's Qantas Airways on Thursday announced an order for 24 widebody aircraft, the final piece of the company's jet fleet renewal program.\n\nThe multi-billion dollar order is split between 12 Airbus A350s and 12 Boeing 787s, which will arrive from fiscal 2027 and into the next decade, Qantas said.\n\nQantas said the deal was aimed at providing a replacement for its current Airbus A330 and Airbus A380 aircraft.\n\nAs a part of the deals, Qantas will gain access to up to 500 million litres of sustainable aviation fuel (SAF) per annum which would start to flow from 2028.\n\nThis has the potential to meet up to 90% of the group’s interim SAF target for 2030, Qantas said.\n\nGlobal airline companies have been struggling hard to cut down on emissions and are looking for alternatives to traditional jet kerosene fuels.\n\n\"SAF reduces lifecycle carbon emissions by up to 80 per cent and is a key part of Qantas’ emissions reduction plan,\" it said.\n\nIncoming Qantas CEO Vanessa Hudson said in June the carrier would kickstart a competition to replace existing A330 jets by end-year.\n\n\"\"Both the 787-9 and 787-10 offer enhanced efficiency, flexibility and passenger comfort to connect Australia and destinations around the world,\" said Stan Deal, president and CEO of Boeing Commercial Airplanes.\n\nReuters earlier in the week had reported, citing industry sources, that Boeing was nearing a deal for its 787 Dreamliner aircraft with Qantas.\n\n(Reporting by Rishav Chatterjee in Bengaluru; Editing by Shailesh Kuber and Maju Samuel)", "link": "https://finance.yahoo.com/news/qantas-secures-planes-airbus-boeing-231238987.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "QABSY.US", "QAN.AU", "QAN.F", "QUBSF.US"], "tags": [], "sentiment": {"polarity": 0.671, "neg": 0.025, "neu": 0.933, "pos": 0.042}}, {"date": "2023-08-23T23:00:00+00:00", "title": "Qantas nearly doubles Boeing 787 Dreamliner fleet with order for 12 widebody jets", "content": "- Australian carrier orders four 787-9 and eight 787-10 jets\n\n- Fuel-efficient, widebody Boeing jets support Qantas' growth strategy to operate one of world's most sustainable fleets\n\nSEATTLE, Aug. 23, 2023 /PRNewswire/ -- Boeing [NYSE: BA] and the Qantas Group announced today the carrier has selected the 787 Dreamliner family to modernize its widebody fleet with an order for four 787-9 and eight 787-10 airplanes. With enhanced fuel efficiency and environmental performance, the 787 Dreamliner is pivotal to Qantas' global growth strategy to reduce its carbon emissions over the next decade and beyond. Boeing and Qantas Airlines announced the carrier has selected Boeing’s family of fuel-efficient airplanes to expand its future fleet with four 787-9 and eight 787-10 Dreamliner airplanes. (Boeing image)\n\n\"This is another multi-billion-dollar investment in the national carrier, and it's great news for our customers and our people,\" said Alan Joyce, Qantas Group CEO. \"The 787 and the GE engines fitted to them, are thoroughly proven and extremely capable.\"\n\nThe 787 enables Qantas to meet its near- and long-term sustainability goals, reducing fuel use and emissions by up to 25% and featuring quieter engines compared to previous generation jets. The airplanes are also capable of flying on a blend of Sustainable Aviation Fuel (SAF), an important pathway to reducing emissions. The new order is part of Qantas' major fleet renewal program that is significantly increasing the carrier's overall fuel efficiency each year.\n\n\"With its market-leading environmental performance, the 787 Dreamliner is central to Qantas' unwavering commitment to operate one of the most sustainable and capable fleets in the airline industry,\" said Stan Deal, president and CEO of Boeing Commercial Airplanes. \"Both the 787-9 and 787-10 offer enhanced efficiency, flexibility and passenger comfort to connect Australia and destinations around the world.\"\n\nCapable of flying an expansive international route network, the operating economics of the 787 family enables Qantas to open new routes and add more flights to its existing network. The 787-9 can fly up to 7,565 nautical miles (14,010 km) connecting Australia to North America and Europe. The larger 787-10 with a range of 6,330 nautical miles (11,730 km), will enable the airline to serve many popular international and regional routes. Currently, Qantas has a fleet of 14 787-9 jets.\n\nStory continues\n\nAs a leading global aerospace company, Boeing develops, manufactures and services commercial airplanes, defense products and space systems for customers in more than 150 countries. As a top U.S. exporter, the company leverages the talents of a global supplier base to advance economic opportunity, sustainability and community impact. Boeing's diverse team is committed to innovating for the future and living the company's core values of safety, quality and integrity. Learn more at www.boeing.com.\n\nContact: Amber Mizerak\r\nInternational Sales Communications, Boeing Commercial Airplanes\r\nAmber.mizerak@boeing.com\n\nBoeing Media Relations\r\nmedia@boeing.com Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/qantas-nearly-doubles-boeing-787-dreamliner-fleet-with-order-for-12-widebody-jets-301908574.html\n\nSOURCE Boeing", "link": "https://finance.yahoo.com/news/qantas-nearly-doubles-boeing-787-230000553.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0, "neu": 0.873, "pos": 0.127}}, {"date": "2023-08-23T22:37:08+00:00", "title": "New Boeing 737 MAX supplier defect to delay aircraft deliveries", "content": "By Valerie Insinna and David Shepardson\n\n(Reuters) -Boeing has recently identified a new 737 MAX supplier quality problem involving improperly drilled holes on the aft pressure bulkhead, the company said on Wednesday.\n\nBoeing said the new problem could delay near-term deliveries and is evaluating whether it could cause it to miss its annual delivery target of at least 400 737s this year.\n\nThe Federal Aviation Administration said it was aware of the issue, which does not affect safety of flight.\n\nTrade publication The Air Current, which first reported on the production flaw, said Spirit AeroSystems was responsible for the misdrilled holes. Spirit did not provide an immediate comment.\n\nThe defect is limited to Boeing's bestselling MAX 8 model, and it is unclear how many jets will need to be fixed or how long rework will ultimately take, Boeing said.\n\n\"We continue to deliver 737s that are not affected,\" Boeing said.\n\n(Reporting by Valerie InsinnaEditing by Chris Reese)", "link": "https://finance.yahoo.com/news/boeing-737-max-supplier-defect-223708162.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.892, "neg": 0.115, "neu": 0.851, "pos": 0.034}}, {"date": "2023-08-23T22:34:22+00:00", "title": "UPDATE 2-New Boeing 737 MAX supplier defect to delay aircraft deliveries", "content": "(Adds information on impacts to deliveries in paragraph 2 and 6, adds background on defect in paragraph 4-5)\n\nBy Valerie Insinna and David Shepardson\n\nAug 23 (Reuters) - Boeing has recently identified a new 737 MAX supplier quality problem involving improperly drilled holes on the aft pressure bulkhead, the company said on Wednesday.\n\nBoeing said the new problem could delay near-term deliveries and is evaluating whether it could cause it to miss its annual delivery target of at least 400 737s this year.\n\nThe Federal Aviation Administration said it was aware of the issue, which does not affect safety of flight.\n\nTrade publication The Air Current, which first reported on the production flaw, said Spirit AeroSystems was responsible for the misdrilled holes. Spirit did not provide an immediate comment.\n\nThe defect is limited to Boeing's bestselling MAX 8 model, and it is unclear how many jets will need to be fixed or how long rework will ultimately take, Boeing said.\n\n\"We continue to deliver 737s that are not affected,\" Boeing said. (Reporting by Valerie Insinna Editing by Chris Reese)", "link": "https://finance.yahoo.com/news/1-boeing-737-max-supplier-223422802.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.919, "neg": 0.115, "neu": 0.855, "pos": 0.03}}, {"date": "2023-08-23T21:32:00+00:00", "title": "What Embraer Stock Says About the Plane Crash Involving Wagner Chief", "content": "Yevgeny Prigozhin, head of the private military contractor Wagner Group, was listed as a passenger on an Embraer jet that crashed in Russia Wednesday.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a45a8079-3473-3fd5-b0ee-de44402b75be/what-embraer-stock-says-about.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-23T15:04:00+00:00", "title": "Embraer (ERJ) Secures Approval for E195-E2 Aircraft in China", "content": "Embraer S.A. ERJ was recently awarded the Type Certificate by the Civil Aviation Administration of China (“CAAC”) for its E195-E2 jets after the successful approval received from the authority for its E190-E2 in November 2022. This will expand Embraer’s presence in the Chinese aviation market, thus potentially leading to increased sales from China in the days ahead.\n\nEmbraer’s Prospects in China\n\nChina is poised to show rising domestic demand for traveling, which is likely to boost the growth of the civil aviation market. Per the CAAC, China’s domestic passenger traffic volume recorded growth of a whopping 135% to reach 224.8 million year to date compared to the 2022 levels, thus effortlessly surpassing the 2019 levels.\n\nPer Embraer’s latest 20-Year Market Outlook, the Asia Pacific, including China, is poised to witness growth of 4.4% per year in its Revenue Passenger Kilometers over 20 years. The report also suggests the possible thriving demand for narrow-body aircraft in the up to 150-seat segment in China.\n\nThis unfolds immense opportunities for Embraer, which is currently seeking to broaden its presence in the region to capitalize on the probable growing demand. The recently acquired certification by the CAAC is a step forward for the company in fulfilling its commitment to solidifying its positioning in China’s aviation market.\n\nPeers to Gain\n\nApart from Embraer, aircraft manufacturers in the industry that have an established position in China and may gain from the flourishing demand are as follows:\n\nAirbus EADSY: The company enjoys significant demand in the region, with its service fleet in China rising to more than 2,100 aircraft up to 2023, implying more than 50% of the market.\n\nIn April 2023, Airbus reached an agreement in the region to expand the A320 Family’s final assembly capacity with a second line at its Tianjin site. The agreement will contribute to Airbus’ overall rate objective of 75 aircraft per month in 2026 throughout its global production network.\n\nStory continues\n\nBoeing BA: The company witnesses strong demand in China. More than 50% of commercial jetliners operating in China are Boeing airplanes.\n\nThe aerospace giant secured an order for eight 787-9 Dreamliners at the 2023 Paris Air Show in June 2023. With this order, the carrier will introduce 24 super-efficient 787s over the next several years.\n\nPrice Movement\n\nIn the past year, shares of Embraer have rallied 40.6% against the industry’s decline of 6.5%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nEmbraer currently carries a Zacks Rank #3 (Hold). One better-ranked stock in the same industry is Textron TXT, carrying a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nThe Zacks Consensus Estimate for Textron’s 2023 sales suggests a growth rate of 32.2% from the prior-year reported figure. The Zacks Consensus Estimate for TXT’s 2024 sales calls for a growth rate of 7.7% from the prior-year estimated figure.\n\nTXT has a long-term earnings growth rate of 11.7%. Shares of Textron have risen 16.3% in the past year.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nEmbraer-Empresa Brasileira de Aeronautica (ERJ) : Free Stock Analysis Report\n\nTextron Inc. (TXT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/embraer-erj-secures-approval-e195-150400587.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "TXT.F", "TXT.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.014, "neu": 0.83, "pos": 0.156}}, {"date": "2023-08-23T12:58:00+00:00", "title": "Boeing (BA) Wins Contract to Support Harpoon Missile System", "content": "The Boeing Company BA recently clinched a contract involving its Harpoon missiles. The award has been offered by the Naval Air Systems Command, Patuxent River, MD.\n\nDetails of the Deal\n\nValued at $14.7 million, the contract is expected to be completed by June 2028. Per the terms of the deal, Boeing will procure one Harpoon Weapon System (HWS) joint common test set (JCTS); one two-year HWS JCTS interim spares kit; and technical manuals.\n\nUnder this agreement, the jet giant will also offer JCTS weapons station installation and checkout, installation and checkout equipment loan, temporary shipment/loan of tools, weapon station training, JCTS checkout and calibration support, and engineering technical services.\n\nThe contract will serve the government of Egypt. Majority of the work related to this deal will be carried out in St. Charles, MO.\n\nBenefits of the Deal\n\nIncreasing geopolitical tensions worldwide have prompted nations to further strengthen their defense systems. With rapid technological upgrades, missile defense has steadily become pivotal in a nation’s defense strategy. With the United States being the world’s largest weapon supplier and Boeing being a prominent U.S. missile maker, the increased missile defense adoption by the nations provides the company with solid growth opportunities.\n\nNotably, Boeing’s Defense, Space & Security segment engages in the research, development, production and modification of products and related services, including strategic missile and defense systems. Its Harpoon missile is the world’s most successful anti-ship missile and is in service with the armed forces of more than 30 countries.\n\nHarpoon missiles have been upgraded over the years and are now available as the Harpoon Block II. Some other missiles in Boeing’s product portfolio include the supersonic Bomarc missile, the Thor missile, the AGM-86B/C Air Launched Cruise Missile and the GAM-77 Hound Dog Missile.\n\nWith such advanced weaponry in its portfolio, Boeing enjoys solid demand in the missile defense space. The latest contract win is a bright example of that, which, in turn, should boost BA’s top-line growth.\n\nStory continues\n\nGrowth Prospects\n\nNations have increased their defense spending on military equipment and various arsenals to strengthen their defense capabilities. The surge in demand for defense products is primarily due to rising geopolitical tensions and amplified terrorist threats. Hence, military missiles, an integral part of any defense system, have registered a steady growth in demand.\n\nPer a report from Mordor Intelligence, the missiles and missile defense system market is projected to witness a CAGR of 4.8% during 2023-2028. Such abounding growth trends indicate ample development opportunities for Boeing as it enjoys a lucrative position in the missile market.\n\nA few defense primes that can reap the benefits of the aforementioned market are Northrop Grumman NOC, RTX Corporation RTX and Lockheed Martin LMT.\n\nNorthrop Grumman designs and produces missile products, including advanced high-speed propulsion systems, fuses, warheads and controls for air, sea and land-based systems.\n\nThe company boasts a long-term earnings growth rate of 4.10%. The Zacks Consensus Estimate for NOC’s 2023 sales indicates an improvement of 5.6% from the 2022 reported figure.\n\nRTX is a leading designer, developer, integrator, producer and sustainer of integrated air and missile defense systems. Its product portfolio includes Advanced Medium Range Air-to-Air Missile (AMRAAM), Guidance Enhanced Missile (GEM-T), the National Advanced Surface-to-Air Missile System (NASAMS), Tomahawk, Standard Missile 2 (SM-2) and a few more.\n\nRTX’s long-term earnings growth rate is 7.9%. The Zacks Consensus Estimate for its 2023 sales indicates a 9.9% increase from the prior-year reported figure.\n\nLockheed Martin’s Missiles and Fire Control (MFC) is a recognized designer, developer and manufacturer of precision engagement aerospace and defense systems for the United States and allied militaries. MFC develops, manufactures and supports advanced combat, missile, rocket, manned and unmanned systems for military customers. These include the U.S. Army, Navy, Air Force, Marine Corps, NASA and dozens of foreign allies.\n\nLMT boasts a four-quarter average earnings surprise of 5.04%. The stock has a long-term earnings growth rate of 6.5%.\n\nPrice Performance\n\nShares of Boeing have rallied 43.7% in the past year against the industry’s 6.2% decline. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nBoeing currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nNorthrop Grumman Corporation (NOC) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/boeing-ba-wins-contract-support-125800170.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.043, "neu": 0.774, "pos": 0.184}}, {"date": "2023-08-23T06:40:04+00:00", "title": "INSIGHT-How Russia keeps its fleet of Western jets in the air", "content": "By David Gauthier-Villars and Gleb Stolyarov\n\nDUBAI, Aug 23 (Reuters) - A Ural Airlines Airbus landed in the Russian city of Yekaterinburg on Nov. 14 last year. Then it remained grounded on the tarmac.\n\nThree days later, a spare part crucial for navigation systems with a declared value of over a quarter of a million dollars, made by U.S. company Northrop Grumman, arrived for the jet, Russian customs records show.\n\nA week later, on Nov. 24, the A320 took off for Moscow and has been busy ferrying passengers across Russia and Central Asia ever since, according to flight tracking data.\n\nDespite Western sanctions designed to stop Russian carriers from procuring parts for their Airbus and Boeing jets, Ural Airlines has imported over 20 of the U.S.-made devices since Russia invaded Ukraine in February 2022, the customs data show.\n\nAll told, at least $1.2 billion worth of aircraft parts flowed to Russian airlines from May last year - when most U.S. and European trade curbs and export bans over Ukraine were in force - to the end of June this year, a Reuters analysis of the customs records shows.\n\nThe equipment ranged from essential items needed to keep a jet airworthy - such as the Northrop Grumman devices, cabin pressure valves, cockpit displays and landing gear - to more mundane spares, such as coffee makers, flight attendant telephone handsets and toilet seats.\n\nThe customs records showed the parts made their way to Russia through middlemen in countries including Tajikistan, the United Arab Emirates (UAE), Turkey, China and Kyrgyzstan – none of which has endorsed Western sanctions on Russia.\n\nThe $1.2 billion tally underestimates the total value of aircraft parts imported during the period reviewed by Reuters as it only includes shipments destined directly for Russian airlines or their maintenance units - and not plane parts shipped to other companies in Russia.\n\nOleg Panteleev, head of the AviaPort aviation think-tank in Moscow, said Russian airlines have \"solved the problem\" of operating under Western sanctions.\n\nStory continues\n\n\"At first there was a shock, no one knew what to do,\" he told Reuters. \"After two to three months, new supply channels were found and, after six or nine months, quite a lot of alternatives appeared, which allowed for a reduction in prices and delivery times.\"\n\n'UNNECESSARY INFORMATION'\n\nUral Airlines Deputy Chief Executive Kirill Skuratov declined to comment on how the Russian carrier procured its spare parts. \"I definitely will not tell you that,\" he told Reuters. \"It is unnecessary information.\"\n\nAfter reviewing the list compiled by Reuters, Northrop Grumman said it did not identify any sales or repair services by the company to Russian entities. Northrop Grumman said it has \"robust processes and procedures to help ensure compliance with all applicable export and sanctions-related laws and regulations.\"\n\nThe U.S. government said its export controls and those of its allies had severely affected the Russian aviation sector.\n\n\"We will continue to vigorously enforce our controls by rooting out and disrupting illicit networks, pursuing individuals evading restrictions, and directly engaging with industry and foreign governments to ensure compliance,\" a Department of Commerce spokesperson said.\n\nA European Union official said the bloc was closely coordinating with countries that had imposed similar trade curbs to ensure they were not circumvented.\n\n\"Systems are being put in place in some countries for monitoring, controlling and blocking re-exports,\" the official said.\n\nTo be sure, Western sanctions have made life more difficult for Russia's aviation sector.\n\nIn mid 2022, aviation industry sources described how some Russian airlines were stripping some planes for parts. And Russian carrier S7 Airlines said in June last year that it had to scrap plans to launch a low-cost operator because it could not take delivery of the Airbus planes it had ordered.\n\nLike its U.S. rival Boeing, the European planemaker cut links with its Russian clients when sanctions kicked in.\n\nBut as of May 1 this year, Russian carriers had 541 Western planes in active service or under maintenance, according to data compiled by Swiss aviation intelligence provider ch-aviation. That's more or less on a par with before the war, taking into account the 75 planes being leased by Russian airlines that were repossessed by their foreign owners, the ch-aviation data show.\n\nRussian airlines carried 10.1 million passengers in June, according to Russia's federal statistics agency Rosstat, compared to 8.87 million in June 2022 and 11.1 million in June 2021.\n\nWithout Western aircraft, Russian airlines would have had to downsize massively because they only have about 150 Russian-made passenger planes in their fleets, according to ch-aviation data.\n\nRussia's trade ministry and civil aviation authority did not respond to messages seeking comment.\n\nCIRCUITOUS ROUTE\n\nBefore the trade restrictions, Ural Airlines, Aeroflot , S7 and other Russian carriers relied on maintenance support from global firms such as Lufthansa Technik of Germany.\n\nWhen those firms stopped providing services – Lufthansa Technik said it suspended sales to Russia from Feb. 28, 2022 – Russian airlines turned to a pool of far smaller suppliers.\n\nIn April 2022, for example, S7's maintenance unit, S7 Engineering, began importing parts from a company in Moldova called Air Rock Solutions, according to the customs records.\n\nThe first shipment was for water filters for Airbus galleys with a declared value of $1,700. Over the next 14 months, S7 received at least $1.23 million of parts from Air Rock, the records show.\n\nIvan Melnicov, chief executive of Air Rock and another aircraft parts distributor in Moldova called Aerostage Services, denied selling products to Russia. He said most of his clients were in the UAE and Kyrgyzstan, among others.\n\n\"Business with Russian companies is impossible to be done from Moldova, simply considering that their banks are banned in Moldova and payments are not processed,\" Melnicov told Reuters. \"We are not interested in losing our local and international partners for short-term income.\"\n\nMost of the shipments listed in Russian customs records as having been made by Air Rock and Aerostage took circuitous routes, transiting through the UAE or Kyrgyzstan. Asked if that could indicate his clients in those countries had re-routed deliveries to Russian airlines, the Moldovan businessman did not respond.\n\nS7 and Aeroflot did not respond to messages seeking comment.\n\nNOSE TO TAIL SERVICES\n\nThe serial number listed in Russian customs records for the Northrop Grumman device sent to Yekaterinburg last year shows the part was manufactured in October 2008, and used on different aircraft, including one in Saudi Arabia six year ago, according to an industry source with access to maintenance databases.\n\nWhile the customs records don't name the company that shipped the device in November, they do show how more of the same crucial U.S. parts fitted with high-tech laser gyroscopes reached Urals Airlines during the 14-month period reviewed by Reuters.\n\nIn July 2022, for example, one was shipped to Ural Airlines via the UAE by Istikloliyat 20, a civil engineering company based in Tajikistan. In September 2022, another Tajik civil engineering firm, Kafolati Komil, also sent one of the parts to Russia via the UAE, the data show.\n\nMahmadbashir Yakubov, chief executive of Istikloliyat 20, did not respond to phone messages seeking comment. Reuters was unable to reach Komilchon Yakubov, the chief executive of Kafolati Komil.\n\nSome of the shipments of Northrop Grumman parts to Ural Airlines that went through the UAE were handled by a company named Skyparts FZCO, the customs records show.\n\nCreated in June 2022 and registered in a single-room office in one of Dubai's free economic zones, Skyparts says on its website it was founded by aviation professionals and offers customers \"nose to tail\" support for their aircraft.\n\nAsked about the shipments of the Northrop Grumman device, Skyparts manager Saeed Abdulloev told Reuters he was familiar with the part and confirmed that the Dubai firm was doing business with Tajik companies, including Istikloliyat 20.\n\nHe said Skyparts had procured one of the Northrop Grumman parts from a U.S. supplier but denied ever sending it to Russia. He declined to identify the U.S. firm.\n\nHUSBAND AND WIFE\n\nOne Russian carrier, Nordwind Airlines, appears to have harnessed family ties to procure parts for the 12 Airbus and 15 Boeing aircraft in its fleet, the customs data show.\n\nOwned by Russian entrepreneur Karine Bukrey, according to corporate records, the airline imported hundreds of parts from Ramses Turizm. Based in the Turkish resort town of Antalya, Ramses Turizm is owned by Bukrey's husband, Ramazan Akpinar.\n\nNordwind and Bukrey did not respond to messages seeking comment.\n\nContacted by Reuters on April 4 this year, Akpinar confirmed owning Ramses Turizm and being married to Bukrey. He did not answer questions about aircraft part exports to Nordwind.\n\nThe Russian records show Nordwind stopped receiving parts from Ramses Turizm three days after Reuters asked about them. However, the airline carried on importing parts from another Turkish company, Na Havacilik ve Teknik, also based in Antalya.\n\nReuters was unable to reach Nusret Alper, who founded Na Havacilik in August 2022, for comment.\n\nNordwind also imported parts via its maintenance unit, NW Technic, according to the customs records. Chief Executive Valery Pashaev told Reuters his unit was solely focused on maintaining aircraft and was not involved in parts procurement.\n\n\"People bring me parts and tell me where to install them,\" Pashaev said. \"I take the parts and install them.\"\n\n(Additional reporting by Lisa Barrington in Dubai and Maurice Tamman in New York; Editing by David Clarke and Daniel Flynn)", "link": "https://finance.yahoo.com/news/insight-russia-keeps-fleet-western-064004121.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "NOC.US", "NOCG34.SA", "NTH.F"], "tags": [], "sentiment": {"polarity": 0.676, "neg": 0.024, "neu": 0.944, "pos": 0.033}}, {"date": "2023-08-22T16:51:47+00:00", "title": "S&amp;P Slashes Ratings Of 5 US Banks, SEC Fines Fintech Adviser Titan For Misleading Crypto Claims, Microsoft Modifies Activision Blizzard Proposal: Today's Top Stories", "content": "Benzinga\n\nS&P Slashes Ratings Of 5 US Regional Banks Facing Growing Challenges\n\nS&P Global Ratings has cast a spotlight on the challenges faced by several U.S. regional banks, resulting in a series of downgrades that have reverberated through the financial sector. According to the renowned rating agency, the Federal Reserve's tight grip on monetary policy is now putting a strain on the funding, liquidity, and revenue of many U.S. banks. The impact of higher interest rates on borrowers is becoming evident through rising nonperforming assets, delinquencies, and charge-offs, approaching historical averages, according to S&P Global Ratings.\n\nYouTube Sets A New Beat, Unveils Pioneering AI Music Principles With Universal Music Group\n\nAlphabet Inc (NASDAQ: GOOG) (NASDAQ: GOOGL) YouTube unveiled its inaugural AI music principles, underlining a deepened commitment to responsible innovation in the music arena, extending the video-sharing platform's partnership with major players like Universal Music Group. The collaborative AI principles emphasize a shared vision, according to which both YouTube and its music industry partners aim to leverage AI's transformative capabilities in the music domain responsibly.\n\nSEC Slaps Fintech Adviser Titan For Misleading Crypto Claims: A Look at the New Marketing Rule\n\nTitan Global Capital Management USA LLC, a New York-based fintech investment adviser, has agreed to pay over $1 million to settle charges brought by the U.S. Securities and Exchange Commission (SEC). The charges pertain to misleading statements made by Titan about performance metrics and the custody of clients' crypto assets.\n\nBig Pharma Price-Fixing: Teva and Glenmark's $255M Settlement Shines Light on Industry Issues\n\nDrugmaker Teva Pharmaceutical Industries Limited (NYSE: TEVA) has agreed to pay $225 million in criminal fines to settle charges related to price fixing of three medications, including a generic cholesterol drug, pravastatin. The U.S. Department of Justice announced the settlement on Monday. This fine is the largest ever for a domestic antitrust case.\n\nStory continues\n\nUS Appeals Court Upholds Dismissal of Lawsuit Against Spirit AeroSystems Over Boeing's 737 MAX Production Claims\n\nA U.S. appeals court upheld the dismissal of a lawsuit targeting Spirit AeroSystems Holdings Inc (NYSE: SPR), a supplier to Boeing Co (NYSE: BA). The lawsuit accused Spirit of concealing information from investors about 737 MAX production reductions after the tragic crashes in 2018 and 2019.\n\nFDA Greenlights Pfizer's RSV Vaccine: Moms Can Now Protect Babies Before Birth\n\nMonday, the FDA approved Pfizer Inc's (NYSE: PFE) Abrysvo (Respiratory Syncytial Virus Vaccine), the company's bivalent RSV prefusion F (RSVpreF) vaccine, to prevent the infection in infants from birth up to six months of age by active immunization of pregnant individuals at 32 through 36 weeks gestational age. First and only U.S. approval of a maternal vaccine to help protect infants at birth through six months of life from lower respiratory tract disease (LRTD) and severe LRTD due to RSV.\n\nApollo Funds Acquire Majority Stake In Composite Advanced Technologies For Undisclosed Sum\n\nApollo Global Management Inc (NYSE: APO) said that Apollo-managed funds (the Apollo Funds) had acquired a majority interest in Composite Advanced Technologies Inc (CATEC). The financial terms were not disclosed. CATEC provides compressed natural gas (CNG), renewable natural gas (RNG), and hydrogen transportation and storage solutions in the U.S.\n\nNew York Post\n\nTrudeau Calls Out Mark Zuckerberg's Facebook Amid Canada's Burning Crisis\n\nCanadian Prime Minister Justin Trudeau has taken a stand against Mark Zuckerberg-led Meta Platforms Inc (NASDAQ: META), criticizing its decision to block news articles on Facebook at a time when Canada is grappling with devastating wildfires. Due to a newly instituted law, the company's recent action restricts Canadian users from accessing local news.\n\nCNBC\n\nMicrosoft Modifies Activision Blizzard Purchase After UK Regulatory Setback\n\nMicrosoft Corp (NASDAQ: MSFT) recently presented a revised proposal to purchase Activision BlizzardInc (NASDAQ: ATVI) after U.K. regulators quashed its original bid. The updated terms come in response to regulatory challenges the tech titan encountered not only in the U.K. but also in the U.S. and Europe following its announcement of a whopping $69 billion acquisition bid in early 2022.\n\nGold Rush In Weight Loss Industry Impacts Retailers With Pharmacy Businesses\n\nRetailers with pharmacy businesses, including major players like Walmart Inc (NYSE: WMT), Kroger Company (NYSE: KR), and Rite Aid Corp (NYSE: RAD), are also seeing a boost in sales due to increased demand for prescription weight loss drugs. However, while this surge in popularity has the potential to drive foot traffic into stores, analysts noted that the profitability of these blockbuster treatments is rather minimal for retail pharmacies, and in some cases, they might even come with margin challenges.\n\nTechCrunch\n\nAmazon's Fire TV Channels App Ignites Rivalry With Netflix, Disney\n\nAmazon.Com Inc (NASDAQ: AMZN) has unveiled its latest offering, the Fire TV Channels app, aimed at providing Fire TV users with a comprehensive selection of over 400 free ad-supported TV (FAST) channels fueling rivalry with the likes of Netflix Inc (NASDAQ: NFLX) and Walt Disney Co (NYSE: DIS). The company initially launched the Fire TV Channels initiative in May. It offered a unified platform for users to seamlessly explore many live and on-demand titles, spanning various genres such as sports, entertainment, and cooking.\n\nEurope Dictates Digital Change: How Meta's Latest Moves Comply with DSA\n\nFacebook and Instagram parent Meta Platforms Inc (NASDAQ: META) launched non-personalized content streams for users within the European Union. This significant move aligns with the European bloc's revamped digital mandate, the Digital Services Act (DSA).\n\nReuters\n\nHealthcare Software Firm Waystar Goes IPO Way With Potential $8B Valuation\n\nWaystar Inc, a provider of financial management software for hospitals and medical practices, is reportedly making strides toward an initial public offering (IPO) that could value the company up to $8 billion. The IPO is anticipated to materialize later this year or early in the next, contingent upon favorable market conditions. The valuation Waystar ultimately attains will also be contingent on market dynamics.\n\nEarnings\n\nBaidu's Q2 Earnings: Strong Growth, Beats Expectations, Says Well-Positioned To Capitalize on AI\n\nBaidu Inc (NASDAQ:BIDU) reported a second-quarter FY23 revenue growth of 15% year-on-year to $4.697 billion, beating the consensus of $4.570 billion. Baidu's Non-GAAP earnings per ADSof $3.11 beat the consensus of $2.32.\n\nMacy's Posts Q2 Earnings Above Street View; Stock Slides On Warning About Persisting Macro Uncertainty\n\nMacy's Inc (NYSE: M) reported a second-quarter FY23 sales decline of 8.4% year-on-year to $5.13 billion, beating the analyst consensus of $5.09 billion. Adjusted EPS of $0.26 beat the analyst consensus of $0.13. The company's FY23 sales outlook is unchanged at $22.8 billion - $23.2 billion, against the consensus of $23.17 billion.\n\nBJ's Wholesale Club Beats On Earnings, But Revenue Misses Reflecting Shift In Consumer Behavior\n\nBJ's Wholesale Club Holdings Inc (NYSE: BJ) reported a second-quarter FY23 sales decline of 2.9% year-on-year to $4.96 billion, missing the analyst consensus of $5.15 billion. Adjusted EPS of $0.97 beat the analyst consensus of $0.90. BJ's Wholesale expects FY23 EPS of $3.80-$3.92 versus the consensus of $3.87. The company previously expected EPS to remain approximately flat year-over-year, including the 53rd-week benefit of low-teens cents per share.\n\nMedtronic Lifts Annual Forecast On Better Than Expected Q1 Performance Across All Categories\n\nMedtronic Plc's (NYSE: MDT) reported Q1 FY24 sales of $7.7 billion, up 4.5% Y/Y as reported and 6% organic, ahead of expectations, beating the consensus of $7.57 billion. The adjusted EPS of $1.20 increased by 6%, exceeding the consensus of $1.11. Medtronic raised its FY24 revenue growth and EPS guidance, and it expects FY24 organic revenue growth of 4.5% versus the prior range of 4.0%-4.5%.\n\nLowe's Clocks Mixed Q2 Performance, Stock Rises On Reaffirmed Annual Outlook\n\nLowe's Companies Inc (NYSE: LOW) reported a second-quarter FY23 sales decline of 9.17% year-on-year to $24.96 billion, marginally missing the analyst consensus of $24.99 billion. Comparable sales decreased 1.6%. EPS of $4.56 beat the analyst consensus estimate of $4.49. Outlook: Lowe's reaffirmed its FY23 revenue outlook of $87 billion - $89 billion, against the Street view of $88.08 billion.\n\nDick's Sporting Goods Shares Are Down On Q2 Earnings Miss\n\nDick's Sporting Goods Inc (NYSE: DKS) Q2 sales grew 3.6% Y/Y to $3.22 billion, missing the analyst consensus of $3.23 billion. Adjusted EPS of $2.82, down 23% Y/Y, missed the analyst consensus of $3.81. FY23 Outlook: DKS reduced the adjusted EPS outlook to $11.50-$12.30 from $12.90-$13.80 vs. the consensus of $13.49.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article S&P Slashes Ratings Of 5 US Banks, SEC Fines Fintech Adviser Titan For Misleading Crypto Claims, Microsoft Modifies Activision Blizzard Proposal: Today's Top Stories originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/p-slashes-ratings-5-us-165147390.html", "symbols": ["2M6.F", "2M6.XETRA", "8BJ.F", "AIY.F", "AIY.XETRA", "AMZN.US", "APO.US", "ATVI.MX", "ATVI.US", "B1C.F", "BA.US", "BIDU.US", "BIDUN.MX", "BJ.US", "DIS.US", "DKS.US", "FB2A.F"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.063, "neu": 0.832, "pos": 0.105}}, {"date": "2023-08-22T15:05:00+00:00", "title": "RTX Secures US Navy Contract to Aid F135 Propulsion System", "content": "RTX Corporation’s RTX business unit, Pratt & Whitney, recently secured a modification contract involving the F135 propulsion system. The Naval Air Systems Command, Patuxent River, MD, has awarded the deal.\n\nValued at $59.3 million, the contract is scheduled to be completed by December 2025. Per the terms of this deal, RTX Corp. will procure Lot 16 advanced long-lead-time hardware in support of Lot 18 F135 propulsion systems equipped in F-35 Lighting II Joint Strike Fighter aircraft.\n\nThe work related to the deal will be carried out at multiple locations across the nation.\n\nWhat’s Favoring RTX?\n\nPratt & Whitney enjoys a considerable order inflow for military jet engines, buoyed by its in-depth expertise in manufacturing the same. The business unit has been manufacturing and sustaining the F135 engine for the U.S. government’s F-35 Joint Program to power the single-engine F-35 Lightning II aircraft produced by Lockheed MartinLMT.\n\nF135 propulsion system configurations are used for the U.S. Air Force’s F-35A, the U.S. Marine Corps’ F-35B and the U.S. Navy’s F-35C jets. F135 engines are also used in F-35 aircraft purchased by Joint Strike Fighter partner countries and other countries through foreign military sales arrangements.\n\nThe strong demand for F35 has indeed been beneficial for Pratt & Whitney as it has led to a steady stream of orders for F135 engines. Lockheed Martin has successfully delivered 944 F-35 airplanes since the program's inception as of Jun 30, 2023. This underscores the concurrent demand for the F135 engine, which is the power source for this advanced stealth fighter jet.\n\nGoing forward, LMT anticipates F-35 delivery numbers in the band of 147-153 jets per year in 2023 and 2024. Lockheed Martin also expects to supply nearly 156 jets in 2025 and beyond. This ensures a steady flow of F135 engine production and sustainment orders for RTXCorp., like the latest one. This should bolster RTX’s revenues from the Pratt & Whitney business unit.\n\nStory continues\n\nGrowth Prospects\n\nAs nations continue to prioritize bolstering their defense capabilities, in the days ahead, we can expect to see a growing commitment to investing in advanced fighter jets.\n\nPer the reports from Expert Market Research, the global military aircraft market is expected to witness a CAGR of 5.1% from 2023 to 2028. This stands to benefit RTX as it enjoys an established position in designing and manufacturing powerful engines for prominent fighter aircraft. Other defense contractors that are likely to benefit from the growth opportunities offered by the aforementioned market are as follows:\n\nBoeing BA: The company is a prominent jet maker and enjoys a dominant position in the combat aircraft market. Its expertise lies in a wide variety of defense aircraft and jet components, repair and modification-related programs. Its military aircraft include C-17 Globemaster III, P-8A Poseidon, V-22 Osprey, etc.\n\nBoeing has a long-term earnings growth rate of 4%. Its investors have gained 41.9% in the past year.\n\nAirbus Group EADSY: Its military aircraft consist of the A400M, the C295 tactical transporter, the new-generation A330 Multi Role Tanker Transport and the Eurofighter, the most advanced swing-role fighter ever conceived.\n\nAirbus’ long-term earnings growth rate is pegged at 12.4%. Shares of EADSY have returned 36.4% value to its investors in the past year.\n\nPrice Movement\n\nIn the past three months, shares of RTX Corp. have decreased 9.1% compared with the industry’s decline of 1%. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nZacks Rank\n\nRTX Corp. currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nThe Boeing Company (BA) : Free Stock Analysis Report\n\nLockheed Martin Corporation (LMT) : Free Stock Analysis Report\n\nAirbus Group (EADSY) : Free Stock Analysis Report\n\nRTX Corporation (RTX) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/rtx-secures-us-navy-contract-150500825.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.016, "neu": 0.82, "pos": 0.165}}, {"date": "2023-08-22T12:17:00+00:00", "title": "Boeing Nears Order for 787-10 Aircraft. The Stock Is Up.", "content": "Qantas is nearing a deal to purchase Boeing 787-10 Dreamliners, according to Reuters. The dash 10 version of the aircraft is the longest model of the 787.\n\nContinue reading", "link": "https://finance.yahoo.com/m/cd9e8371-64bb-3d59-b971-8427adbf7adc/boeing-nears-order-for-787-10.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US", "QABSY.US", "QAN.AU", "QAN.F", "QUBSF.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-22T03:17:28+00:00", "title": "Indonesia, Boeing sign deal for sale of F-15 fighter jets", "content": "JAKARTA, Aug 22 (Reuters) - Indonesia's defence ministry and U.S. planemaker Boeing have signed an agreement on the sale of 24 F-15EX fighter jets to help modernise the Southeast Asian country's ageing fleet, the ministry and the company said.\n\nOfficials from the ministry and a Boeing executive signed the memorandum of understanding at Boeing's St. Louis, Missouri, facility on Monday, Boeing said, though it underscored that the transaction was subject to U.S. government approval.\n\n\"This state-of-the-art fighter will protect and secure our nation with its advanced capabilities,\" Indonesian Defence Minister Prabowo Subianto said, according to Boeing's statement.\n\nBoeing and the defence ministry did not provide details on the deal's value.\n\nThe F-15EX is the most advanced version of the F-15, with digital fly-by-wire flight controls, a new electronic warfare system, a digital cockpit, and the latest mission systems and software capabilities, Boeing said.\n\nPrabowo and his U.S. counterpart, Lloyd Austin, discussed the planned procurement during Austin's visit to Jakarta last year.\n\nIndonesia has increased its defence spending in recent years to overhaul its fleet, which includes U.S-made F-16 and Russian Sukhoi Su-27 and Su-30 jets.\n\nThis year, Jakarta bought 42 Dassault Rafale fighter jets for $8.1 billion.\n\nIt has also purchased 12 used Mirage 2000-5 fighter jets in an $800 million deal that drew criticism as the aircraft were considered too old.\n\nLast year, the U.S. has also approved the potential sale of F-15ID aircraft and related equipment to Indonesia in a deal valued at up to $13.9 billion.\n\n\"After Rafale, the F-15 will make Indonesia a strong nation as we keeps building a mature defence diplomacy,\" the defence ministry spokesperson said. (Reporting by Ananda Teresia, Editing by Gayatri Suroyo and Gerry Doyle)", "link": "https://finance.yahoo.com/news/indonesia-boeing-sign-deal-sale-031728210.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.017, "neu": 0.822, "pos": 0.162}}]