[{"date": "2024-01-08T23:18:00+00:00", "title": "United Airlines Finds Loose Bolts on Some Boeing 737 MAX 9 Jets", "content": "The discovery came after U.S. safety regulators ordered inspections following a door-plug blowout on an Alaska Airlines flight.\n\nContinue reading", "link": "https://finance.yahoo.com/m/55454ab7-f8be-3e11-ba0a-95dc7429aadc/united-airlines-finds-loose.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "UAL.MX", "UAL1.F"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0, "neu": 0.865, "pos": 0.135}}, {"date": "2024-01-08T23:01:15+00:00", "title": "QUOTES-United Airlines finds loose bolts in Boeing 737 MAX planes", "content": "Jan 8 (Reuters) - United Airlines has found loose bolts on multiple 737 MAX 9 aircraft, it said on Monday, referring to the Boeing model grounded after a cabin panel blew off an Alaska Airlines-operated plane in mid-flight Friday.\n\nU.S. AIRCRAFT SAFETY EXPERT JOHN COX:\n\n“This changes a lot because it is now a fleet problem. This is a quality control problem.”\n\nANTHONY BRICKHOUSE, AN AIR SAFETY EXPERT AT EMBRY-RIDDLE AERONAUTICAL UNIVERSITY:\n\n“It was really important to figure out whether it was that specific aircraft from Friday night, whether it was an issue with Alaska Airlines’ fleet specifically or whether it’s a broader issue that could impact all MAX 9s that have that door. The fact that United has now found some aircraft with loose bolts, that just means that the investigation is going to be expanded.\n\n“It just illustrates how important it was to ground similar MAX 9s and do those inspections. A lot of times in the industry money and profit are placed before safety. And grounding a specific aircraft isn’t a light decision. It’s a very big decision and it involves money and a lot of cancelled flights. But Alaska Airlines and United Airlines did the right thing in grounding their fleet.”\n\nRICHARD ABOULAFIA, MANAGING DIRECTOR OF AERODYNAMIC ADVISORY:\n\n\"Yes, it is embarrassing. But it's also there's a certain predictability to it. You have the worst production ramp down ever, and then the fastest production ramp up ever coupled with a very tight labor market.\n\n\"There's the bigger cultural issue here Boeing management, needs to take a more hands on approach and get more involved. The FAA, even with their ticketing aircraft, can't check every bolt. In terms of who is responsible, ultimately, it's a Boeing jet, but of course, the work has been done by spirit. You can't really say.\" (Reporting By Valerie Insinna and Allison Lampert)", "link": "https://finance.yahoo.com/news/quotes-united-airlines-finds-loose-230115038.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "UAL.MX", "UAL.US", "UAL1.F"], "tags": [], "sentiment": {"polarity": 0.806, "neg": 0.036, "neu": 0.892, "pos": 0.072}}, {"date": "2024-01-08T22:24:00+00:00", "title": "What Is the Boeing 737 MAX 9 Jet—and What Went Wrong With the Alaska Plane’s Door", "content": "After an emergency landing of Boeing 737 MAX 9 jet operated by Alaska Air over the weekend, the Federal Aviation Administration has ordered the grounding and inspection of 171 planes, raising questions about their safety.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9eebde91-a5f4-39d7-9159-907723c64dce/what-is-the-boeing-737-max-9.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0.066, "neu": 0.863, "pos": 0.071}}, {"date": "2024-01-08T22:23:58+00:00", "title": "Analysts, Unfazed By 737 Max 9 Grounding, Say Spirit And Boeing Stock Are Buys", "content": "Analysts still rate Boeing stock, Spirit AeroSystems a buy after the FAA grounded all 737 Max 9 aircraft.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f2b9d31d-fe54-3605-8aac-fb71d44d791e/analysts%2C-unfazed-by-737-max.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0, "neu": 0.909, "pos": 0.091}}, {"date": "2024-01-08T21:57:26+00:00", "title": "Boeing: United Airlines finds loose bolts on 737 Max doors", "content": "United Airlines (UAL) has reportedly found loose bolts on plane plug doors after inspecting its Boeing (BA) 737 Max 9 jets. This comes after a mid-flight mishap on an Alaska Airlines (ALK) flight leading to the Federal Aviation Administration (FAA) to ground 737 Max 9 jets.\n\n\"As of Monday, service on that aircraft remains suspended and we have canceled 200 MAX 9 flights. We expect significant cancellations on Tuesday as well. We have been able to operate some planned flights by switching to other aircraft types, avoiding about 30 cancellations each on Monday and Tuesday,\" United representatives said in an official statement.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Luke Carberry Mogan.", "link": "https://finance.yahoo.com/video/boeing-united-airlines-finds-loose-215726908.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "UAL.MX", "UAL.US", "UAL1.F"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0.056, "neu": 0.875, "pos": 0.069}}, {"date": "2024-01-08T21:47:00+00:00", "title": "Don’t Be Scared by Boeing’s MAX-9 Jet. Flying Is Still the Safest Way to Travel.", "content": "According to the National Transportation Safety Board, the number of aviation accidents has been declining for two decades.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f2c4ec7b-05dc-33d7-9d65-78168029fab7/don%E2%80%99t-be-scared-by-boeing%E2%80%99s.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0.098, "neu": 0.726, "pos": 0.175}}, {"date": "2024-01-08T21:40:15+00:00", "title": "Boeing could payout $5M per day to Alaska Airlines: Analyst", "content": "Boeing (BA) shares slide following the Federal Aviation Administration's (FAA) grounding of 737 Max 9 jets. Bloomberg Intelligence Senior Aerospace/Defense & Airlines Analyst George Ferguson joins Yahoo Finance Live to weigh in on the financial and managerial impact of the recent Alaska Airlines incident.\n\n“Management’s job is to come in now to train people to do it right the first time,\" Ferguson comments on job turnovers seen across Boeing and the aerospace industry.\n\nFerguson believes the Alaska Airlines incident could cost Boeing “probably $5 million-ish per day in remuneration” if the manufacturer is found liable for the flight mishap.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Eyek Ntekim.\n\nVideo Transcript\n\n- And George, obviously we still need the results of that investigation before we can know a little bit more. But getting to the root cause here, do we anticipate, based on your experience in the industry, is this a management issue or is this about some of the talent turnover that we've seen coming out of the pandemic with just a dearth of talent in this industry. Which of those two do you think is, the more likely cause of what happened here.\n\nGEORGE FERGUSON: So I'm going to say that I would think that every talent issue would still be a management issue, right? So it is a turnover issue. There's been a lot of turnover at Spirit, and a lot of turnover at Boeing. But management's job is to bring in those replacement workers, train them well, train them on the processes so they don't miss anything, train them on safety, and then oversee them on the line.\n\nAnd if it's something that happened on the line and was overlooked, I'm going to say that's management's fault. Management needs to do a better job in that situation. So and I do think that's probably what happened here is that there's been a lot of turnover in these industries. Pre-pandemic, this airplane was grounded. So if you're at Spirit AeroSystems you're probably wondering what your long-term prospects were, as your most important airplane, the Max, wasn't even allowed to fly globally.\n\nStory continues\n\nAs that was getting fixed, we got into the pandemic, global airline traffic went to almost zero. So I think if you're at Boeing or Spirit, you might have been looking for another job, they've had a lot of turnover, management's job to come in now to train people to do it right the first time.\n\n- And George, I'm also interested, listen, United Alaska they're going to be the most impacted by this Max 9 grounding. I'm interested George, can we try and quantify how much they're being impacted financially in terms of just lost profit?\n\nGEORGE FERGUSON: Sure. So I plugged some numbers in yesterday. I used Alaska because United's a mixed fleet, right? United has narrow bodies and widebodies. So I took Alaska. First, we look at 1Q last year for Alaska, they didn't make any money. So I think they're not going to want to use that when they talk to Boeing about remuneration. If you look at 3Q, we did some numbers. If Boeing were to reimburse them for profits per airplane, based on their profitability in 3Q as well as reimburse for salaries, because salaries don't go away just because an airplane's grounded.\n\nWe think that the total fleet 225 airplanes, there's probably $5 million ish per day in remuneration that needs to come out of probably Boeing, if it's their fault, to reimburse the airlines. The question will be how long, how many airplanes will be on the ground for how long. When you do the math in that to figure out what the cost is. But five million per day because of the [INAUDIBLE].", "link": "https://finance.yahoo.com/video/boeing-could-payout-5m-per-214015844.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0.02, "neu": 0.896, "pos": 0.084}}, {"date": "2024-01-08T21:34:22+00:00", "title": "Boeing Stock, Spirit Return To Lows After Loose Bolts Reported On 737 Max 9s", "content": "Boeing stock, supplier Spirit AeroSystems tumbled early Monday after the FAA grounded all Boeing 737 Max 9 aircraft. Airlines traded lower.\n\nContinue reading", "link": "https://finance.yahoo.com/m/8b6aba6f-c830-3011-9b4a-c379eb40e294/boeing-stock%2C-spirit-return.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.128, "neg": 0.092, "neu": 0.837, "pos": 0.071}}, {"date": "2024-01-08T21:27:11+00:00", "title": "US STOCKS-Nasdaq ends higher as yields fall, Boeing curbs gains on Dow", "content": "*\n\nBoeing tumbles after MAX 9 groundings\n\n*\n\nOil stocks fall on Saudi price cuts, rise in OPEC output\n\n*\n\nApple climbs as Vision Pro AR headset to go on sale in Feb\n\n*\n\nIndexes up: Dow up 0.58%, S&P 500 up 1.41%, Nasdaq 2.20%\n\n(Updated at 4:17 p.m. ET/2117 GMT)\n\nBy Chuck Mikolajczak\n\nNEW YORK, Jan 8 (Reuters) - The Nasdaq scored its first gain of at least 1% in 2024 on Monday, as a fall in Treasury yields helped lift megacap stocks, while a sharp drop in Boeing shares kept gains on the Dow Industrials in check.\n\nMegacaps advanced, lifting stocks such as Amazon.com which closed up 2.66% and Alphabet, which rose 2.29%, as Treasury yields fell ahead of readings on inflation and a new supply of government debt this week, with the benchmark 10-year U.S. Treasury yield hitting a low of 3.966% on the session.\n\nIn addition, Apple climbed 2.42% after the iPhone maker said its Vision Pro mixed-reality device will be available for sale from Feb. 2 in the United States.\n\nNvidia surged 6.3% and fellow chipmaker Advanced Micro Devices jumped 5.48%, helping to push the Philadelphia SE Semiconductor Index up 3.28% as it bounced from a 5.8% drop last week, its biggest weekly percentage fall since October 2022.\n\n\"This is definitely a yield-driven market for now and investors are trying to discount when and how many rate cuts we will see, the timing and the magnitude of rate cuts,\" said Bill Merz, head of capital markets research at U.S. Bank Wealth Management in Minneapolis.\n\n\"Now we're probably in a more rational place in terms of yields and it's a question of, is the market getting that right and are yields falling for the right reasons or the wrong reasons? And investors have so far taken the view that yields are falling for all the right reasons, that the Fed is navigating what thus far has been a soft landing.\"\n\nThe Dow Jones Industrial Average rose 216.90 points, or 0.58%, to 37,683.01, the S&P 500 gained 66.30 points, or 1.41 %, to 4,763.54 and the Nasdaq Composite gained 319.70 points, or 2.20%, to 14,843.77.\n\nStory continues\n\nThe gains on the Nasdaq and S&P 500 marked their first daily percentage climbs of more than 1% since Dec. 21 and biggest one-day percentage advances since Nov. 14.\n\nMeanwhile, Boeing shares plunged 8.03% after the plane maker and U.S. regulators gave the go-ahead on Monday for airlines to inspect jets that were grounded after a panel blew off an Alaska Airlines-operated 737 MAX 9 in mid-flight which forced a dramatic landing of the airliner over the weekend.\n\nThe S&P 500 energy index was the sole decliner among the 11 S&P 500 sectors, falling 1.16% after hitting its lowest level in a month as crude prices sank about 4% after sharp price cuts by top exporter Saudi Arabia and a rise in OPEC output.\n\nOn Friday, the benchmark S&P 500 snapped a nine-week streak of gains, as investors dialed back expectations on the possible aggressiveness of the Federal Reserve in cutting interest rates this year following a mixed bag of economic data on the labor market and services sector.\n\nAtlanta Fed President Raphael Bostic said on Monday that the central bank's dual goals of lowering inflation and maintaining low unemployment are not yet in conflict.\n\nMoney markets now see a 63.8% chance of at least a 25 basis-point (bps) rate cut as soon as March, according to CME's FedWatch Tool, down from 88.5% a week ago.\n\nInvestors will eye inflation data this week in the form of the consumer price index (CPI) and producer price index (PPI) to shape expectations for the path of interest rates by the Fed.\n\nAdvancing issues outnumbered decliners by a 3-to-1 ratio on the NYSE while on the Nasdaq, advancing issues outnumbered decliners by a 2.3-to-1 ratio.\n\nThe S&P 500 posted 13 new 52-week highs and no new lows while the Nasdaq recorded 101 new highs and 92 new lows.\n\n(Reporting by Chuck Mikolajczak in New York Editing by Matthew Lewis)", "link": "https://finance.yahoo.com/news/us-stocks-nasdaq-ends-higher-212711803.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX"], "tags": [], "sentiment": {"polarity": 0.717, "neg": 0.073, "neu": 0.845, "pos": 0.082}}, {"date": "2024-01-08T21:22:29+00:00", "title": "Three AI Stocks Among S&amp;P 500 Top Performers Monday", "content": "Nvidia and other AI stocks were among the S&P 500's biggest winners Monday. Boeing and several oil stocks led the downside.\n\nContinue reading", "link": "https://finance.yahoo.com/m/31fce71e-4a67-39fd-a956-a6d8acab9a08/three-ai-stocks-among-s%26p-500.html", "symbols": ["A1G.F", "A1MD34.SA", "AAL.US", "AALL34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "FO8.F", "FTNT.US", "GSPC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.273, "neg": 0.077, "neu": 0.805, "pos": 0.119}}, {"date": "2024-01-08T21:09:18+00:00", "title": "Boeing 737 Max incident, groundings weigh on stock", "content": "Boeing (BA) shares are still in the red an hour out from Monday's market close. An incident involving a 737 Max 9 jet on an Alaska Airlines (ALK) flight has loomed over the stock all day.\n\nYahoo Finance's Jared Blikre joins the Live show to break down stock market reactions to Boeing's downturn and what it could mean for shares of Boeing-supplier Spirit Aerosystem (SPR).\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Nicholas Jacobino.\n\nVideo Transcript\n\nJOSH LIPTON: Shares of Boeing falling nearly 7% in trading today. It's after the FAA grounded more than 170 Boeing 737 MAX 9 aircraft after a door detached mid-air on an Alaska Airlines flight. With more on markets movements happening around that decision is Yahoo Finance's Jared Blikre. Jared.\n\nJARED BLIKRE: Thank you, Josh. Let's take a look at our aerospace board. Not a lot of red, except for Boeing. And I'll show you another exception there. Down 6 and 1/2%. This is going to be the worst day for Boeing since late 2022. And as you can see, we've been in several different trading ranges here.\n\nBut let me just show you historically how the stock has reacted to a couple of different events. And the first would be the Lion Air Flight 610 in late 2018 and then Ethiopian Airlines Flight 302 in early 2019.\n\nAnd what I've done is I've taken the stock action. I've shown one month before the event or 21 trading days along with 63 or one quarter's worth of trading days afterwards. And you can see in purple, that was the first incident.\n\nWe got a pretty steep decline, about 5%, 6%, 7% on the first day. Then the stock recovered pretty quickly. We did see some further fallout. But by the time the quarter had ended, the trailing quarter, we were kind of right back where we had started.\n\nNow the Ethiopian Airlines, that second disaster, that's when we saw more fallout. There were two 5 plus down days in a row there at the very beginning. As you saw before, we're down about 6% today just by comparison.\n\nStory continues\n\nAnd then you can see the stock really just drifted lower and had a tough time finding its footing. And eventually, it would drop pretty considerably. And let me just show you a five-year chart of Boeing going back to the beginning of this disaster.\n\nSo here is Boeing. Here is a five-year chart. And we had all of this price. Actually, let me put a 10-year chart. We had all of this price action up in here. Once this level went, it was a very quick drop, plus we had the pandemic. That compounded everything.\n\nBut you can see we are still in the bottom end of this very long trading range here. So if we were to jump above, we would have probably smooth sailing into the 300. But there's a considerable overhead resistance.\n\nAlso want to point out that one of the biggest suppliers here, one of the companies most dependent on Boeing for its revenue, that Spirit Aerosystem, seeing a 6% drop today. It's a more volatile stock. And if this chart looks somewhat similar to Boeing, that's because it is.\n\nThis was the same time period in which Boeing was trying to figure out its footing with respect to its highs. And then this drop was the same drop that we saw in Boeing. So two very different stocks reacting the same way to a tragic event here but not quite as bad as the earlier tragedies which involved the human life loss, of course.\n\n- Well, Jared, this is the latest, like you said, in a series of mechanical failures for Boeing, two fatal crashes, one in Indonesia in 2018, the other in Ethiopia in 2019, like you said, both involving those Boeing 737s. What were the stock moves then? And how does that compare to what we're seeing today?\n\nJARED BLIKRE: Well, I think they were quite a bit more dramatic. The first time this happened, this would be Lion Air Flight 610. We saw about a 5% drop on day one. But then by the second time we had Ethiopian Airlines flight, we not only got that first day drop, we got a big second day drop as well. And the difference between those two time periods, I think, was just the realization that something bigger was at play here.\n\nWhen there was only one failure, you can see the stock recovered pretty quickly those losses. This was only a few trading days later, whereas with the second disaster, we saw it meandering down here and kind of lingering at the lows for some time. And then it just drifted lower with the sequence of bad news that was coming out.\n\nSo hard to say where we're falling in line this time. It's hard to see here. But this yellow line is pretty-- this yellow line here is pretty comparable to the first day drops that we saw for these earlier two. So so far it looks kind of the same. But I can't stress enough that these are very, very different scenarios.", "link": "https://finance.yahoo.com/video/boeing-737-max-incident-groundings-210918421.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.975, "neg": 0.079, "neu": 0.867, "pos": 0.054}}, {"date": "2024-01-08T19:39:00+00:00", "title": "Boeing and Key Supplier Spirit Hit Hard After Alaska Air Blowout", "content": "Thankfully, no passengers or crew of Alaska Airlines Flight 1282 were critically injured after the frightening blowout of a plug door and piece of fuselage from the 737-9 MAX jet Friday night, which forced the plane to make an emergency landing in Portland, Oregon. Investors in Alaska Air Group (NYSE:ALK) didn’t seem too concerned about the incident either. Shares of Alaska Air were flat in midday trading. But it was another story for Boeing (NYSE:BA) and one of its key suppliers.\n\nBoeing, which makes the 737-9 MAX, tumbled nearly 7%. And Spirit AeroSystems Holdings (NYSE:SPR), the manufacturer of the fuselage that was on the Alaska Airlines plane, plunged over 6%. It’s understandable that traders would be nervous, especially since the Federal Aviation Administration (FAA) quickly announced the grounding of more than 170 Boeing 737-9 MAX planes pending safety inspections.\n\nSpirit AeroSystems said in a statement that it will work with Boeing on the investigation of Friday’s incident and that it is “following the protocols set by the regulatory authorities.” For its part, Boeing said that “we agree with and fully support the FAA’s decision to require immediate inspections of 737-9 airplanes with the same configuration as the affected airplane.” In addition, a Boeing technical team is supporting the National Transportation Safety Board’s (NTSB) investigation of the matter. And Alaska Air has said it is ready to perform the required inspections of the 737-9 MAX planes in its fleet while the jets remain grounded.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nInvestors Should Ignore SPR, BA Stocks\n\nSo, what does Friday’s incident mean for investors? Even though several analysts were quick to come out with reports defending Boeing Monday morning, the Alaska Air scare is probably another reason for traders to ignore Boeing and Spirit AeroSystems for the foreseeable future.\n\nWhile airline stocks have started to recover thanks to strong demand for travel as consumers and business people return to the skies, Boeing continues to suffer from a hit to its reputation and concerns about safety following two fatal crashes (one in late 2018 and another in early 2019) of 737 MAX jets that led to the deaths of 346 people.\n\nStory continues\n\nThe 737 MAX was temporarily grounded after those tragedies and Boeing has lost more than $20 billion in the past five years as the company has been forced to delay deliveries of planes while spending heavily to make necessary fixes. (Mounting costs to build new Air Force One planes for the government hasn’t helped either). The production slowdown for Boeing was a big problem for Spirit AeroSystems as well, which has also posted several years of losses because of both the pandemic and Boeing’s delivery woes. Spirit even disclosed in late October that Boeing was spending $100 million to help stabilize Spirit’s supply chain and support production increases.\n\nThe Bottom Line\n\nBut that development seems like a distant memory now. With safety worries once again surfacing for Boeing and Spirit, both companies are likely to continue to struggle financially. Although Boeing and Spirit AeroSystems are each currently expected to return to profitability in 2024, that’s no longer a certain bet given the new groundings enforced by the FAA. Analysts have already been slashing their profit forecasts for this year for both companies over the past few months due to macroeconomic concerns. That trend is likely to continue given the Alaska Air incident.\n\nShares of both Boeing and Spirit AeroSystems have tanked for the past five years, missing out on the market’s post-pandemic rebound to near record highs. Boeing has plummeted 35% since January 2019 while Spirit AeroSystems has shed nearly two-thirds of its market value. The Dow Jones, on the other hand, is up more than 50% during the same time frame and the S&P 500 has soared 80%. And with 737-MAX 9 planes remaining on the tarmac for the foreseeable future, it’s hard to imagine a scenario where Boeing and Spirit AeroSystems can gain altitude anytime soon.\n\nAs of this writing, Paul R. La Monica did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nPaul R. La Monica is a veteran financial journalist with nearly 30 years experience (including more than 20 at CNN) covering the stock market and other asset classes, the economy and other corporate and business news.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post Boeing and Key Supplier Spirit Hit Hard After Alaska Air Blowout appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/boeing-key-supplier-spirit-hit-193900086.html", "symbols": ["ALK.US", "BA.US", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.93, "neg": 0.079, "neu": 0.819, "pos": 0.102}}, {"date": "2024-01-08T18:47:09+00:00", "title": "Stock Market Holds Gains As Dow Narrows Loss; AMD Stock Pops On Processor News", "content": "The stock market started the week with the major indexes showing mostly gains. Intel stock helped lift the Dow after Boeing pulled it down.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9dfbf025-21f5-3620-8866-63572024fbd8/stock-market-holds-gains-as.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0, "neu": 0.912, "pos": 0.088}}, {"date": "2024-01-08T18:45:41+00:00", "title": "Alaska Airlines incident: What one pilot was surprised by", "content": "Boeing (BA) shares began to dip after a door plug blew out on a Boeing 737 Max 9 jet being flown by Alaska Airlines flight (ALK). The flight was able to return safely without harm to any passengers on board. Many questions arise around how this situation occurred, including was there anything Boeing and Alaska Airlines could've done to prevent it.\n\nAnthony C. Roman, FAA licensed commercial pilot and Founder & CEO of A.C. Roman and Associates joins Yahoo Finance to discuss the incident and what precautions could have potentially been taken.\n\nRoman discusses what the public has learned about the plane, saying \"What surprises me here is that this incident occurred several times, including depressurization problems, just the day prior to the accident. I'm surprised that Alaska Airlines did not ground their Max 9 fleet and conduct a thorough inspection of all of the aircraft to see if it could be replicated.\"\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Nicholas Jacobino", "link": "https://finance.yahoo.com/video/alaska-airlines-incident-one-pilot-184541213.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.447, "neg": 0.038, "neu": 0.897, "pos": 0.065}}, {"date": "2024-01-08T17:59:12+00:00", "title": "Why Boeing is still a buy despite latest 737 Max woes", "content": "Bank of America is keeping it's \"Buy\" rating on Boeing (BA) despite the most recent problem with its 737 Max aircraft.\n\nBank of America Senior Aerospace & Defense Analyst Ronald Epstein joins Yahoo Finance Live to explain his call and to break down why Boeing’s woes might not be as severe as some may think.\n\nEpstein believes that the cause for the recent Alaska Airlines incident, is unclear, \"it's not clear who did what in this,\" suggesting that there is not yet enough information to draw a conclusion on the actual cause of the incident and who may be to blame, whether it was Boeing, Spirit AeroSystems (SPR), or another company involved in the production. Epstein sees the incident as \"a bump in the road,\" and does not expect there to be a huge impact on the company.\n\nConsidering the \"huge aerospace ramp up\" post-COVID and the fact that the 737 Max model in question is not the manufacturer's only model, Epstein insists that Boeing will still fare well.\n\nWhile acknowledging the dip in the stock in response to the news, Epstein does not believe this will negatively impact demand, stating “demand for aircraft is outstripping the ability for the industry to supply them.”\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Eyek Ntekim", "link": "https://finance.yahoo.com/video/why-boeing-still-buy-despite-175912901.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.148, "neg": 0.054, "neu": 0.89, "pos": 0.056}}, {"date": "2024-01-08T17:58:00+00:00", "title": "FAA Approves Inspection Method for Grounded Boeing 737 MAX 9 Jets", "content": "The agency has approved procedures for airlines to inspect their grounded 737 MAX 9 jets, clearing the way for the planes to return to service.\n\nContinue reading", "link": "https://finance.yahoo.com/m/55454ab7-f8be-3e11-ba0a-95dc7429aadc/faa-approves-inspection.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0, "neu": 0.899, "pos": 0.101}}, {"date": "2024-01-08T17:45:15+00:00", "title": "3 Space Exploration Stocks for Out-Of-This-World Returns", "content": "Space stocks are the next frontier in more ways than one. These companies are pioneering us toward the stars but are also great businesses in their own right. Collectively, space stocks are helping us extend travel beyond the Earth’s atmosphere and are great growth drivers for delivering gains to investors.\n\nIn this article, I’ve put together a list of space stocks I believe are the best buys at today’s prices. These companies should be on every investor’s watch list due to their disruptive potential.\n\nSo, here are the best space stocks to consider.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nVirgin Galactic (SPCE) A photo of a man smiling into a camera on a plane.\n\nVirgin Galactic (NYSE:SPCE) is a spaceflight company within the Virgin Group, aiming to provide suborbital spaceflights to space tourists.\n\nNow might be a great time for investors to invest in SPCE stock. The reason is that its Galactic 06 space mission is due to launch near the end of this month. The mission will carry four astronauts, and I expect it will ramp up interest in spaceflight globally.\n\nMeanwhile, from a fundamental perspective, SPCE may also be undervalued. Analysts collectively predict its share has an implied 26.6% upside from its present levels.\n\nSince space flight is still in its very early stages, SPCE has yet to become cash flow positive, as it recorded a negative cash flow of $514.25 million for the last 12 months. But as missions like Galactic 06 ramp up in frequency and duration, I expect more investors will take notice of the collective potential of space stocks, which will be accretive for Virgin Galactic.\n\nBoeing (BA) BA stock: a blue and white Boeing 787 flying in the sky above the clouds\n\nSource: vaalaa / Shutterstock\n\nBoeing (NYSE:BA), to me, can be considered a kind of picks and shovels supplier to the space industry. It’s a key contractor for NASA and is also working on its own spacecraft, the Starliner.\n\nThe Starliner test flight is expected to be made in April, while its first operational flight could be as early as 2025. The main use of the spacecraft will be to transport astronauts to the International Space Station — a key divergence from shuttles.\n\nStory continues\n\nTo me, BA stock is a great buy in general while also keeping its growth as one of those space stocks in one’s back pocket. Namely, Wall Street rates Boeing as a Strong Buy. That recommendation also comes with a modest price target increase of around 4% over the next 12 months.\n\nAlthough BA stock’s P/E ratio is currently negative, its forward price-to-sales ratio is lower than its trailing 12-month price-to-sales ratio. That means its share could be trading hands at a discount to what analysts expect as fair value.\n\nNorthrop Grumman (NOC) Northrop Grumman (NOC) logo on a corporate building\n\nSource: Kristi Blokhin / Shutterstock.com\n\nNorthrop Grumman (NYSE:NOC) is deeply involved in space technology and exploration. Its core areas of expertise are in satellite technology and robotics, and the company previously worked with NASA during various missions.\n\nNOC is primarily a defense stock, but its engagements in space have also recently included collaborations with the Air Force Research Laboratory to integrate commercial space internet into airborne platforms.\n\nTo put this project into simple turns, it plans on reconfiguring existing satellite constellations to allow them to be used for military purposes, such as in warfighters.\n\nNOC is a solid defense pick based on its quarterly results. Its third-quarter earnings rose about 5% to $6.18 per share, with a 9% revenue growth reaching $9.78 billion. That performance exceeded analyst expectations.\n\nThe company also increased its full-year sales forecast to $39 billion, up from the earlier range of $38.4 billion to $38.8 billion.\n\nOn the date of publication, Matthew Farley did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMatthew started writing coverage of the financial markets during the crypto boom of 2017 and was also a team member of several fintech startups. He then started writing about Australian and U.S. equities for various publications. His work has appeared in MarketBeat, FXStreet, Cryptoslate, Seeking Alpha, and the New Scientist magazine, among others.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 3 Space Exploration Stocks for Out-Of-This-World Returns appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-space-exploration-stocks-world-174515894.html", "symbols": ["BA.US", "NOC.US", "SPCE.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.023, "neu": 0.838, "pos": 0.14}}, {"date": "2024-01-08T17:27:00+00:00", "title": "What Is the Boeing 737 Max 9—and What Went Wrong With the Alaska Air Flight’s Door", "content": "After an emergency landing of Boeing 737 MAX 9 jet operated by Alaska Air over the weekend, the Federal Aviation Administration has ordered the grounding and inspection of 171 planes, raising questions about their safety.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9eebde91-a5f4-39d7-9159-907723c64dce/what-is-the-boeing-737-max.html", "symbols": ["ALK.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0.066, "neu": 0.863, "pos": 0.071}}, {"date": "2024-01-08T17:13:27+00:00", "title": "US STOCKS-Boeing drags Dow to two-week low, megacaps boost Nasdaq", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nBoeing set to wipe nearly $10 bln in market cap after MAX 9 groundings\n\n*\n\nOil stocks fall on Saudi price cuts, rise in OPEC output\n\n*\n\nApple climbs as Vision Pro AR headset to go on sale in Feb\n\n*\n\nIndexes: Dow down 0.16%, S&P up 0.56%, Nasdaq up 1.18%\n\n(Updated at 11:47 a.m. ET/1647 GMT)\n\nBy Johann M Cherian and Ankika Biswas\n\nJan 8 (Reuters) - Tech-laden Nasdaq jumped more than 1% to a near one-week high on Monday, boosted by a rebound in megacaps and chip stocks, while blue-chip index Dow slipped to a fresh two-week low as Boeing shares tanked following the grounding of some its jets.\n\nMegacaps like Amazon.com and Alphabet gained over 1%, while Apple climbed 1.4% after saying its Vision Pro mixed-reality device will be available for sale from Feb. 2 in the United States.\n\nChipmakers Nvidia and Advanced Micro Devices jumped more than 4% each. The Philadelphia SE Semiconductor Index rebounded with a 2.6% advance from its worst week since Oct. 2022.\n\n\"We do think the gains (in megacaps) will be sustainable after last year's outperformance,\" said Chris Zaccarelli, chief investment officer at Independent Advisor Alliance.\n\n\"A lot of investors have been drawn to the mega caps because they are profit machines and in good times, they do really well.\"\n\nMeanwhile, Boeing slid 6.6% after the U.S. Federal Aviation Administration (FAA) ordered the temporary grounding of some 737 MAX 9 jets fitted with a panel that blew off an Alaska Air Group jet in midair on Friday.\n\nThe aircraft manufacturer could lose about $10 billion in value if losses hold through market close.\n\nEnergy stocks led declines among the 11 S&P 500 sectors, dropping by 2.1% to a three-week low as crude prices sank over 4% after sharp price cuts by top exporter Saudi Arabia and a rise in OPEC output.\n\nAt 11:47 a.m. ET, the S&P 500 was up 26.46 points, or 0.56%, at 4,723.70, the Nasdaq Composite was up 171.06 points, or 1.18%, at 14,695.14, and the Dow Jones Industrial Average was down 60.06 points, or 0.16%, at 37,406.05.\n\nStory continues\n\nOn Friday, the benchmark S&P 500 marked its worst week since late October, after mixed economic data turned investors cautious and prompted them to scale back expectations on when the Federal Reserve could begin rate cuts.\n\nRemarks by Atlanta's Raphael Bostic, a Federal Open Market Committee (FOMC) voting member this year, due at 12:30 p.m. ET, will be parsed for his stance on monetary policy easing. Over the weekend, Dallas' Lorie Logan warned the Fed may need to resume raising its short-term policy rate.\n\nMoney markets now see a 69.5% chance of at least a 25-basis-point (bps) rate cut as early as March, down from over 85% in the final weeks of 2023, according to the CME FedWatch Tool.\n\nInvestors were also awaiting December consumer and producer inflation reports later in the week and commentary by several policymakers for clues on the Fed's monetary policy trajectory.\n\nJPMorgan Chase, Wells Fargo, Bank of America and Citigroup are set to kick off the quarterly earnings season on Friday. Their shares were down over 1% each.\n\nAdvancing issues outnumbered decliners by a 2.22-to-1 ratio on the NYSE and by a 1.70-to-1 ratio on the Nasdaq.\n\nThe S&P index recorded six new 52-week highs and no new lows, while the Nasdaq recorded 50 new highs and 54 new lows. (Reporting by Johann M Cherian and Ankika Biswas in Bengaluru; Editing by Devika Syamnath)", "link": "https://finance.yahoo.com/news/us-stocks-boeing-drags-dow-171327110.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX"], "tags": [], "sentiment": {"polarity": 0.273, "neg": 0.063, "neu": 0.867, "pos": 0.07}}, {"date": "2024-01-08T17:04:16+00:00", "title": "Crocs, Enphase, Dell: Trending Tickers", "content": "Crocs (CROX) stock soars after the footwear brand updated its full-year 2023 guidance.\n\nSolar energy company Enphase (ENPH) received an upgrade from \"Equal Weight\" to \"Overweight\" from Wells Fargo analysts.\n\nDell (Dell) stock rises following multiple upgrades Monday morning.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Eyek Ntekim.", "link": "https://finance.yahoo.com/video/crocs-enphase-dell-trending-tickers-170416059.html", "symbols": ["12DA.F", "12DA.STU", "12DA.XETRA", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "C7N.F", "CROX.US", "D1EL34.SA", "DELL.US", "DJI.INDX", "E0P.F", "ENPH.US", "GSPC.INDX"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0, "neu": 0.942, "pos": 0.058}}, {"date": "2024-01-08T16:55:00+00:00", "title": "Boeing, Aviation Stocks Fall After Rough Start to Year for Air Travel", "content": "A surge in demand and labor issues have put the industry under stress. Commercial flying remains safe by historical measures.\n\nContinue reading", "link": "https://finance.yahoo.com/m/eefed52f-7bc5-32fe-b114-915651fe6802/boeing%2C-aviation-stocks-fall.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "UAL.MX", "UAL.US", "UAL1.F"], "tags": [], "sentiment": {"polarity": -0.103, "neg": 0.171, "neu": 0.714, "pos": 0.115}}, {"date": "2024-01-08T16:47:00+00:00", "title": "Alaska Airlines Boeing Probe: What We Know", "content": "Investigators will try to figure out why a panel ripped off Alaska Airlines Flight 1282, leaving a hole in the plane at 16,000 feet.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f0187dea-af98-3dac-bc78-9b7425b46e0c/alaska-airlines-boeing-probe%3A.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-01-08T16:37:01+00:00", "title": "Alaska and United May See Little Financial Hit from 737 Max 9 Grounding", "content": "Alaska Airlines and United Airlines may face little more than the cost of a “severe weather event” from the temporary grounding of most Boeing 737-9s, a second-largest model in the 737 Max family, following an accident aboard an Alaska aircraft on Friday.\n\nRaymond James analyst Savanthi Syth estimated Sunday that the cost of flight cancellations and passenger disruptions due to the suspension could be akin to a major snowstorm or hurricane that forces the cancellation of hundreds of flights over several days. Her estimate is based on the widely-held expectation that the Federal Aviation Administration will clarify what airlines need to inspect on 737-9s by the middle of the week, which would allow planes to begin returning to service.\n\nAlaska cancelled roughly 160 flights on Saturday and 170 flights on Sunday as a result of the suspension. United cancelled 90 flights on Saturday and 180 on Sunday. Both airlines expect cancellations to continue through the middle of the week.\n\nAlaska and United are the largest operators of the 737-9 with 65 and 79 aircraft, respectively. Other global operators include Aeromexico, Copa Airlines, FlyDubai, and Icelandair.\n\nThe FAA grounded most 737-9s on Saturday pending inspections of what is known as a “mid-cabin door plug.” Planes that do not have a door plug, including those at FlyDubai and Icelandair, are unaffected.\n\nBoeing on Monday provided airlines with critical information on how to inspect the planes to return them to service, Reuters reported.\n\nThe temporary grounding followed the sudden decompression and loss of the plug on an Alaska 737-9 operating flight AS1282 from Portland, Oregon, to Ontario, California, on Friday. The aircraft returned to Portland where all 171 passengers and six crew members deplaned. The plane involved in the accident, registration N704AL, was delivered new to Alaska on October 31.\n\nBoeing Fallout\n\nThe accident is the latest blow the beleaguered 737 Max. The plane was grounded for nearly two years until November 2020 following two fatal crashes in Ethiopia and Indonesia. Boeing has since racked up hundredsof ordersfor the Max, which is the only significant competitor to Airbus’ popular A320neo family of aircraft.\n\nStory continues\n\n“We do see the latest incident as eroding the fragile confidence that has been built around the 737 Max franchise,” wrote Bank of America analyst Ronald Epstein on Monday. “That said, at this point in time, due to the duopoly nature of the industry, we do not see this impacting orders for any of the 737 Max variants.”\n\nThe 737-9 is the least popular Max variant with just 76 outstanding orders plus 215 planes already delivered to airlines, according to Cirium Fleets Analyzer. The 737-8 is the most popular with 1,176 aircraft in service and at least another 1,971 on order. The yet-to-be-certified 737-7 has at least 333 orders and the -10 903 orders. Boeing has another 1,236 Max orders where the variant has yet to be determined.\n\nEpstein added that, at this early stage in the NTSB’s investigation, the cause “appears to be a manufacturing quality escape as opposed to a design issue. Door plugs are commonly used on commercial airframes.”\n\nBoeing supplier Spirit AeroSystems manufactures the fuselage section and door plug in question on the 737-9.\n\nBoeing shares opened down more than 8% at $228 on Monday, the first trading day since the accident.\n\nJanuary Benefit to Airlines\n\nA silver lining for Alaska, United, and the other airlines affected by the FAA’s grounding of most 737-9s is that it is January. The month is among the slowest of the year for travel demand in the Northern Hemisphere.\n\nHelane Becker, an analyst at TD Cowen, noted on Monday that airlines also benefit from an extra day in February owing to Leap Year, and the shift of the Easter holiday into March from April. Both are boosts to airlines’ first-quarter financial results.\n\nBecker expects airlines to have an estimate on the cost of the grounding by the time they report fourth-quarter results later in January.\n\nSpokespeople for Aeromexico, Alaska, and United both declined to comment on the cost of the 737-9 grounding.\n\nGet breaking travel news and exclusive hotel, airline, and tourism research and insights at Skift.com.", "link": "https://finance.yahoo.com/news/alaska-united-may-see-little-163701990.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "UAL.MX", "UAL.US", "UAL1.F"], "tags": [], "sentiment": {"polarity": 0.961, "neg": 0.044, "neu": 0.881, "pos": 0.075}}, {"date": "2024-01-08T16:35:58+00:00", "title": "Boeing Stock Sells Off After Blowout, 737 MAX 9 Groundings", "content": "Shares of Boeing and supplier Spirit AeroSystems fell Monday following a midair incident that left a gaping hole in a jet operated by Alaska Airlines. The [Federal Aviation Administration ordered that dozens of Boeing 737 MAX 9 jets](https://www.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1bbb824e-f044-3399-82fb-d7fd6cb1e739/boeing-stock-sells-off-after.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US", "UAL.MX", "UAL.US", "UAL1.F"], "tags": [], "sentiment": {"polarity": 0.44, "neg": 0, "neu": 0.897, "pos": 0.103}}, {"date": "2024-01-08T16:33:06+00:00", "title": "Boeing Issues Max 9 Inspection Memo in Step to Ungrounding Jets", "content": "(Bloomberg) -- Boeing Co. has issued a detailed bulletin to operators of its 737 Max 9 jetliners outlining the inspections needed in the wake of a mid-air structural failure on an Alaska Airlines flight, according to people briefed on the matter.\n\nMost Read from Bloomberg\n\nMusk’s Drug Use Concerns Tesla, SpaceX Leaders, WSJ Says Boeing Slumps After Panel Blowout Leads to Partial 737 Grounding China Says It Caught Foreign Consultant Spying for UK’s MI6\n\nThe so-called multi-operator message, which required the approval of US regulators, is the first step toward returning the partially grounded fleet of single-aisle aircraft to service.\n\nBoeing shares traded down 6.7% as of 11:13 a.m. on Monday in New York after an earlier decline of as much as 9.3%. Supplier Spirit AeroSystems Holdings Inc. fell 7.1% after sliding as much as 16%.\n\nAlaska Air and United Airlines Holdings Inc., the two biggest operators of the Max 9 variant, had said earlier that they were waiting for guidance from the Federal Aviation Administration for the checks.\n\nThe airlines had taken all their Max 9 aircraft offline after the Jan. 5 accident, and taken preliminary steps such as removing interior panels to ready the planes for inspections. The checks are expected to take 4-8 hours each, suggesting the airlines will be able to quickly restore services after grounding hundreds of flights.\n\nThe mishap occurred when a door-shaped panel ripped out as Alaska Airlines Flight 1282 climbed out of Portland, Oregon. The aircraft reached an altitude of about 16,000 feet before turning around and landing back in Portland about 20 minutes after takeoff. No one was seriously injured, an outcome National Transportation Safety Board chair Jennifer Homendy said was pure luck.\n\nIn a message to Boeing employees on Monday, Stan Deal, Boeing’s commercial airplanes chief, and Mike Delaney, the company’s chief safety officer, confirmed that the multi-operator message had been shared with airlines. They noted that the assembly of the door plug that’s being inspected is not found on other jets in the 737 Max family.\n\nStory continues\n\nAbout 171 aircraft are affected by the FAA grounding. Reuters reported earlier that the directive was shared around 3 a.m. Pacific time.\n\n(Updates with shares, background on accident from third paragraph)\n\nMost Read from Bloomberg Businessweek\n\nPrivate Equity’s Horrible, No-Good ’23 Set to Continue Into ’24 Can Biden Convince Americans His Brand of Populism Is Better Than Trump’s? Tropical Underworld: The Murder Case That Could Topple an Alleged Crime Empire Why America’s Car Buyers Are Rethinking EVs Eight Tech Products That Could Define 2024\n\n©2024 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/boeing-issues-max-9-inspection-163306393.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0.067, "neu": 0.851, "pos": 0.082}}, {"date": "2024-01-08T16:25:55+00:00", "title": "Boeing issues inspection instructions for 737 MAX 9 to airlines", "content": "WASHINGTON (Reuters) -Boeing early on Monday shared instructions with airlines for inspecting the 737 MAX 9 fleet, the company confirmed, after 171 MAX planes were grounded by U.S. regulators on Saturday following an accident where a cabin panel ripped off an Alaska Airlines jet while in mid-air.\n\nThe instructions, known formally as a multi-operator message, are a key step to allow airlines to complete or certify inspections have been conducted that comply with the Federal Aviation Administration's directive that would allow them to put planes back in service.\n\n\"We agree with and fully support the FAA’s decision to require immediate inspections of 737-9 MAX airplanes with the same configuration as the affected airplane,\" Boeing Commercial Airplanes head Stan Deal said in a letter to employees.\n\n\"Our teams have been working diligently – with thorough FAA review – to provide comprehensive, technical instructions to operators for the required inspections,\" he said. \"This morning, our team issued the instructions via a multi-operator message.\"\n\nThe message was delivered to airlines around 3 a.m. Pacific Time (1100 GMT), a source told Reuters, who was first to report that Boeing had sent the instructions.\n\nThe U.S. Federal Aviation Administration (FAA) did not immediately comment but a source said it signed off on Boeing's instructions to airlines.\n\nBoeing is \"working closely\" with MAX 9 customers and providing technical assistance, while staying in contact with the FAA, Deal said.\n\nBoeing plans to hold a \"short factory stand down\" during the Monday morning meetings at the Renton, Washington-facility that makes the MAX, Deal said. Boeing CEO Dave Calhoun will host an internal Boeing webcast for employees on Tuesday.\n\nAlaska Airlines did not immediately comment.\n\nThe FAA on Saturday ordered the temporary grounding of 171 Boeing MAX 9 jets after a door plug tore off from a brand-new MAX 9 shortly after it took off from Portland, Oregon.\n\nStory continues\n\nOn Sunday, the U.S. regulator said the affected fleet of Boeing MAX 9 planes, including those operated by other carriers such as United, would remain grounded until the regulator was satisfied they were safe.\n\nBoeing shares were down 6.6% in Monday trading, though off the day's lows.\n\n(Reporting by Valerie Insinna and David Shepardson; Editing by Chizu Nomiyama and Nick Zieminski)", "link": "https://finance.yahoo.com/news/boeing-issues-inspection-instructions-737-162555955.html", "symbols": ["ALK.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.938, "neg": 0.02, "neu": 0.916, "pos": 0.064}}, {"date": "2024-01-08T16:22:14+00:00", "title": "UPDATE 3-Boeing issues inspection instructions for 737 MAX 9 to airlines", "content": "(Adds details on Boeing message paragraphs 3-4, 7-8)\n\nBy Valerie Insinna\n\nWASHINGTON, Jan 8 (Reuters) -\n\nBoeing early on Monday shared instructions with airlines for inspecting the 737 MAX 9 fleet, the company confirmed, after 171 MAX planes were grounded by U.S. regulators on Saturday following an accident where a cabin panel ripped off an Alaska Airlines jet while in mid-air.\n\nThe instructions, known formally as a multi-operator message, are a key step to allow airlines to complete or certify inspections have been conducted that comply with the Federal Aviation Administration's directive that would allow them to put planes back in service.\n\n\"We agree with and fully support the FAA’s decision to require immediate inspections of 737-9 MAX airplanes with the same configuration as the affected airplane,\" Boeing Commercial Airplanes head Stan Deal said in a letter to employees.\n\n\"Our teams have been working diligently – with thorough FAA review – to provide comprehensive, technical instructions to operators for the required inspections,\" he said. \"This morning, our team issued the instructions via a multi-operator message.\"\n\nThe message was delivered to airlines around 3 a.m. Pacific Time (1100 GMT), a source told Reuters, who was first to report that Boeing had sent the instructions.\n\nThe U.S. Federal Aviation Administration (FAA) did not immediately comment but a source said it signed off on Boeing's instructions to airlines.\n\nBoeing is \"working closely\" with MAX 9 customers and providing technical assistance, while staying in contact with the FAA, Deal said.\n\nBoeing plans to hold a \"short factory stand down\" during the Monday morning meetings at the Renton, Washington-facility that makes the MAX, Deal said. Boeing CEO Dave Calhoun will host an internal Boeing webcast for employees on Tuesday.\n\nAlaska Airlines did not immediately comment.\n\nThe FAA on Saturday ordered the temporary grounding of 171 Boeing MAX 9 jets after a door plug tore off from a brand-new MAX 9 shortly after it took off from Portland, Oregon.\n\nStory continues\n\nOn Sunday, the U.S. regulator said the affected fleet of Boeing MAX 9 planes, including those operated by other carriers such as United, would remain grounded until the regulator was satisfied they were safe.\n\nBoeing shares were down 6.6% in Monday trading, though off the day's lows.\n\n(Reporting by Valerie Insinna and David Shepardson; Editing by Chizu Nomiyama and Nick Zieminski)", "link": "https://finance.yahoo.com/news/1-boeing-issues-inspection-instructions-162214778.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.938, "neg": 0.019, "neu": 0.919, "pos": 0.062}}, {"date": "2024-01-08T16:17:00+00:00", "title": "Wall Street Waits for Key Inflation Data", "content": "We start another new week of trading looking at a backloaded set of data: the consequential Consumer Price Index (CPI) comes out this Thursday, followed by the Producer Price Index (PPI) for Friday — both reflecting results from December. We’ll also see a slow trickle of quarterly earnings reports this week until the spigot opens Friday morning with Q4 results from some of the biggest Wall Street banks: JPMorgan JPM, Citigroup C, Bank of America BAC and Wells Fargo WFC.\r\n\r\nMarkets have moderated notably since the beginning of the year, but they’re no longer taking a nosedive. As of last Thursday, we’ve begun to see a flattening, which would suggest market participants were interested in taking a bit of air out of the valuation balloon overall; economic data is materializing of late that suggests a March interest rate cut from the Fed may be getting a bit ahead of ourselves; pricing in six or seven cuts throughout the year are being re-thunk, as well.\r\n\r\nThat said, December core CPI year over year is expected to come in sub-4% for the first time since early 2021, and well off the 6 1/2% core CPI year-over-year rates we were seeing as recently as the second half of 2022. This is one inflation metric where we do see clear results of high interest rates dissolving rampant inflation over time, and any downward surprises may put those projections for near-term cuts back on the table. However, non-core CPI numbers are expected to tick up.\r\n\r\nPPI results are projected to post the first positive results since September, coming off a 0.0% print for November. These numbers have been trending within a range of -0.4% to +0.7% since mid-2022. But just like with non-core CPI, PPI moving slightly higher is something worth keeping an eye on, including the rate of change month over month.\r\n\r\nBesides the Big Banks on Friday, we expect quarterly results for KB Home KBH on Wednesday and Delta Air Lines DAL on Friday. This morning, Boeing (BA) is taking the Dow more than -130 points lower following two incidents where pressurization in its cabin blew out an Alaskan Air ALK window and a Spirit Airline SAVE door in Boeing’s 737 MAX-9 planes. Recall the 737 MAX control panel difficulties which led to a year-plus grounding and no sales following two plane crashes overseas. This does not appear to be a re-emergence of prior issues, but another black eye for the model of which Boeing was looking to sell many units.\r\n\r\nThe S&P 500, meanwhile, is flat ahead of the opening bell. The Nasdaq is +25 points at this hour. Boeing shares are -7.7% currently.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nBank of America Corporation (BAC) : Free Stock Analysis Report\n\nWells Fargo & Company (WFC) : Free Stock Analysis Report\n\nJPMorgan Chase & Co. (JPM) : Free Stock Analysis Report\n\nCitigroup Inc. (C) : Free Stock Analysis Report\n\nDelta Air Lines, Inc. (DAL) : Free Stock Analysis Report\n\nKB Home (KBH) : Free Stock Analysis Report\n\nAlaska Air Group, Inc. (ALK) : Free Stock Analysis Report\n\nSpirit Airlines, Inc. (SAVE) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/wall-street-waits-key-inflation-161700414.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.032, "neu": 0.817, "pos": 0.151}}, {"date": "2024-01-08T15:43:02+00:00", "title": "Boeing, Spirit Aerosystems shares tank after 737 Max 9 incident", "content": "Shares of Boeing and parts supplier Spirit Aerosystems tanked Monday after the Federal Aviation regulators grounded certain Boeing 737 MAX 9 jets for further inspection after a piece of fuselage tore off the left side of an Alaska Airlines-operated aircraft on Friday, causing the airliner to make an emergency landing after the cabin depressurized. Shares of Alaska Airlines also fell.\n\nThe aircraft was approaching 16,000 feet of altitude when it experienced rapid depressurization after a panel that serves as a plug for an emergency exit door used on some variations of the Boeing 737 MAX 9 was torn off. The pilot immediately signaled the plane would have to land, and it safely returned to Portland, Oregon, with all 171 passengers and six crew members aboard.\n\nBOEING 737 MAX 9 JET, ALASKA AIRLINES INCIDENT: WHAT TO KNOW An Alaska Airlines Boeing 737 MAX 9 plane sits at a gate at Seattle-Tacoma International Airport on Jan. 6, 2024 in Seattle. Alaska Airlines grounded its 737 MAX 9 planes after part of a fuselage blew off during a flight from Portland, Oregon, to Ontario, California.\n\nNo serious injuries were reported in the incident, and nobody was sitting in the seats adjacent to where the door plug blew out, according to the airline. Parts of the seat next to the fuselage, including the headrest, were missing.\n\nCRITICAL PIECE OF BOEING 737 MAX 9 JET FOUND An investigation involving Alaska Airlines Flight 1282 on a Boeing 737-9 MAX in Portland, Oregon.\n\nDow member Boeing traded at a one-month low as tracked by Dow Jones Market Data Group.\n\nREAD ON THE FOX BUSINESS APP\n\nBoeing CEO Dave Calhoun called an all-employee safety meeting following the incident, according to the Seattle Times which obtained his memo and shared via X.\n\nFOX Business' Eric Revell contributed to this report.\n\nOriginal article source:Boeing, Spirit Aerosystems shares tank after 737 Max 9 incident", "link": "https://finance.yahoo.com/news/boeing-spirit-aerosystems-shares-tank-154302413.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.242, "neg": 0.064, "neu": 0.868, "pos": 0.067}}, {"date": "2024-01-08T15:15:00+00:00", "title": "Boeing Stock Dives on Latest 737 MAX Issue", "content": "It is going to take days, perhaps weeks, to sort through the latest 737 MAX problem. Only certain models have door plugs, meant for smaller-capacity flights.\n\nContinue reading", "link": "https://finance.yahoo.com/m/20e1bc43-f81b-3226-994b-279cc56a4282/boeing-stock-dives-on-latest.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": -0.153, "neg": 0.088, "neu": 0.844, "pos": 0.068}}, {"date": "2024-01-08T14:21:00+00:00", "title": "Vulcan Rocket Finally Launches, Kicking Off U.S. Moon Mission", "content": "A powerful rocket from United Launch Alliance blasted off Monday, taking with it a vehicle expected to make the first U.S. lunar landing in more than half a century.\n\nContinue reading", "link": "https://finance.yahoo.com/m/c261b576-5392-342f-a816-b67fb379fe80/vulcan-rocket-finally.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA"], "tags": [], "sentiment": {"polarity": 0.681, "neg": 0, "neu": 0.823, "pos": 0.177}}, {"date": "2024-01-08T11:47:08+00:00", "title": "Boeing shares tumble after hole blown out of plane mid-flight", "content": "A door was torn off the side of an Alaska Airlines Boeing 737 on Friday - Instagram/@strawberrvy\n\nShares in Boeing tumbled on Monday as airlines were forced to ground the aerospace giant’s 737 Max 9 planes following a mid-flight blowout.\n\nThe company’s stock was down 8.4pc in pre-market trading on Monday, as investigations into the incident three days earlier continued.\n\nA door was torn off the side of an Alaska Airlines 737 on Friday in a dramatic blow-out that depressurised the aircraft and forced the flight to turn back and land.\r\n\r\nOfficials discovered the door plug that was torn off behind a teacher’s house in Portland, Oregon, on Monday.\n\nIn the wake of the incident, the US Federal Aviation Administration has ordered airlines to temporarily ground all 171 of the 737 Max 9s currently operating in America, pending inspection.\r\n\r\nAnalysts said they did not expect the incident to lead to serious problems for Boeing but they were carefully watching the reactions of regulators including those in China, where deliveries of the 737 Max planes have been paused since 2019.\r\n\r\nNicolas Owens, an analyst at Morningstar, predicted no “material financial impact”, but added: “The dramatic nature of the flaw will have the effect of once again calling Boeing’s product governance into question by customers, regulators, and the flying public.”\n\nIn another note, analysts at JP Morgan said: “Perhaps the most consequential foreign regulator now is China, where the government has not yet allowed carriers to resume 737 Max deliveries.\r\n\r\n“Boeing has seemed on the cusp on resuming deliveries to China for some time, with positive signals in recent months.\r\n\r\n“Friday’s accident could delay this process, though Chinese carriers do not fly Max 9s and we are not aware they have ordered any.”\r\n\r\nBoeing said it was supporting the regulatory investigation and has stressed “safety is our top priority”.\r\n\r\nThe company is to host a video conference open to all employees on Tuesday to discuss how it is responding, hosted by president and chief executive Dave Calhoun.\r\n\r\nIn a statement on Sunday, Mr Calhoun said: “While we’ve made progress in strengthening our safety management and quality control systems and processes in the last few years, situations like this are a reminder that we must remain focused on continuing to improve every day.”\r\n\r\nThe incident is a fresh blow to Boeing’s 737 Max jets, the fourth generation of the company’s best-selling narrow-body plane that has endured a troubled history.\n\nAn earlier model of the Max was previously grounded worldwide, after two crashes in 2018 and 2019 killed 346 people in Indonesia and Ethiopia respectively.\r\n\r\nSubsequent investigations revealed that Boeing had failed to share information with regulators about problems with flight control software, which was found to have pushed down the noses of planes automatically.\r\n\r\nThis time, investigators have said their initial findings do not suggest the Alaska Airlines blowout was caused by any widespread flaw in the 737 Max 9 fleet.", "link": "https://uk.finance.yahoo.com/news/boeing-shares-tumble-hole-blown-114708730.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.836, "neg": 0.08, "neu": 0.83, "pos": 0.091}}, {"date": "2024-01-08T11:42:00+00:00", "title": "Boeing’s Woes Add to 2024 Market Gloom. It’s a Warning Sign for Investors.", "content": "Lawmakers return to tentative $1.59 trillion spending pact, CES 2024 Is coming amid focus on artificial intelligence, and other news to start your day.\n\nContinue reading", "link": "https://finance.yahoo.com/m/b71ce1b8-ddfd-32aa-ac7a-2485aff09d9c/boeing%E2%80%99s-woes-add-to-2024.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0, "neu": 0.89, "pos": 0.11}}, {"date": "2024-01-08T11:09:41+00:00", "title": "Futures under pressure as Boeing groundings drag airline stocks", "content": "(Reuters) - U.S. stock index futures slipped on Monday with Boeing tumbling after some of its jets were grounded following an incident, while uncertainty around interest-rate cuts remained an overhang.\n\nBoeing nosedived 8.7% in trading before the bell after the U.S. Federal Aviation Administration (FAA) ordered the temporary grounding of some 737 MAX 9 jets fitted with a panel that blew off an Alaska Air Group jet in midair on Friday.\n\nThe aircraft manufacturer could lose about $12.5 billion in value if losses hold through market open.\n\nAlaska Air Group slid 4.6% after the carrier canceled more than 200 flights following the FAA order, while other airlines like JetBlue Airways, Delta Air Lines and United Airlines lost between 1.4% and 3%.\n\n\"Boeing's reputation has been shattered after the incident last Friday involving one of its 737 MAX planes,\" said AJ Bell investment director Russ Mould.\n\n\"It is the latest in a string of problems for the company, which include the grounding of 737 MAX plans in 2019 after two crashes and subsequent delivery delays and production issues.\"\n\nOn Friday, the benchmark S&P 500 notched its worst week since late October as investors turned cautious and scaled back expectations on when the Federal Reserve could begin interest rate reductions.\n\nAdding to the uncertainty was hotter-than-expected employment numbers and soft services sector data last week that painted contrasting pictures about the health of the world's biggest economy.\n\nMoney markets currently expect with 64% certainty that the central bank could deliver at least a 25 basis point (bps) rate cut as early as March, down from over 85% in the final weeks of 2023, according to the CME FedWatch Tool.\n\nDallas Fed President Lorie Logan over the weekend warned that the U.S. central bank may need to resume raising its short-term policy rate to keep a recent decline in long-term bond yields from rekindling inflation.\n\nTraders will parse remarks by Atlanta Fed President Raphael Bostic, due at 12:30 p.m. ET, for his perspective on monetary policy easing. Bostic is a Federal Open Market Committee (FOMC) voting member this year.\n\nStory continues\n\nInvestors were also awaiting two December inflation reports later in the week and commentary by a slew of policymakers that could offer clues on the Fed's monetary policy trajectory.\n\nAt 5:34 a.m. ET, Dow e-minis were down 171 points, or 0.45%, S&P 500 e-minis were down 6.5 points, or 0.14%, and Nasdaq 100 e-minis were down 20 points, or 0.12%.\n\nAmong others, JPMorgan Chase dipped 0.1% and Citigroup shed 1.2%. The major lenders will kick off the reporting rush on Friday with hopes high for upbeat profits.\n\nHarpoon Therapeutics' shares more than doubled after a report over the weekend said Merck & Co was in advanced talks to buy the cancer drugmaker for around $700 million, citing people familiar with the matter.\n\nDell Technologies added 1.2% after J.P. Morgan upgraded the computer maker to \"overweight\" from \"neutral\".\n\n(Reporting by Johann M Cherian in Bengaluru; Editing by Devika Syamnath)", "link": "https://finance.yahoo.com/news/futures-under-pressure-boeing-groundings-110941155.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "GSPC.INDX"], "tags": [], "sentiment": {"polarity": -0.872, "neg": 0.066, "neu": 0.884, "pos": 0.049}}, {"date": "2024-01-08T11:07:00+00:00", "title": "U.S. Stock Futures Drop with Boeing in Spotlight", "content": "U.S. stock markets were headed for a negative open on Monday. Boeing will be facing attention again after one of its MAX 9 planes operated by Alaska Airlines had a structural failure Friday night, while investors looked ahead to inflation data later this week. S&P 500 futures fell 0.2% and Nasdaq 100 futures dropped 0.2%.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e3cdca3f-4e8d-3f4c-a467-09b2db99aa74/u.s.-stock-futures-drop-with.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX"], "tags": [], "sentiment": {"polarity": -0.791, "neg": 0.119, "neu": 0.881, "pos": 0}}, {"date": "2024-01-08T11:05:59+00:00", "title": "US STOCKS-Futures under pressure as Boeing groundings drag airline stocks", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nFutures off: Dow 0.45%, S&P 0.14%, Nasdaq 0.12%\n\nJan 8 (Reuters) - U.S. stock index futures slipped on Monday with Boeing tumbling after some of its jets were grounded following an incident, while uncertainty around interest-rate cuts remained an overhang.\n\nBoeing nosedived 8.7% in trading before the bell after the U.S. Federal Aviation Administration (FAA) ordered the temporary grounding of some 737 MAX 9 jets fitted with a panel that blew off an Alaska Air Group jet in midair on Friday.\n\nThe aircraft manufacturer could lose about $12.5 billion in value if losses hold through market open.\n\nAlaska Air Group slid 4.6% after the carrier canceled more than 200 flights following the FAA order, while other airlines like JetBlue Airways, Delta Air Lines and United Airlines lost between 1.4% and 3%.\n\n\"Boeing's reputation has been shattered after the incident last Friday involving one of its 737 MAX planes,\" said AJ Bell investment director Russ Mould.\n\n\"It is the latest in a string of problems for the company, which include the grounding of 737 MAX plans in 2019 after two crashes and subsequent delivery delays and production issues.\"\n\nOn Friday, the benchmark S&P 500 notched its worst week since late October as investors turned cautious and scaled back expectations on when the Federal Reserve could begin interest rate reductions.\n\nAdding to the uncertainty was hotter-than-expected employment numbers and soft services sector data last week that painted contrasting pictures about the health of the world's biggest economy.\n\nMoney markets currently expect with 64% certainty that the central bank could deliver at least a 25 basis point (bps) rate cut as early as March, down from over 85% in the final weeks of 2023, according to the CME FedWatch Tool.\n\nDallas Fed President Lorie Logan over the weekend warned that the U.S. central bank may need to resume raising its short-term policy rate to keep a recent decline in long-term bond yields from rekindling inflation.\n\nStory continues\n\nTraders will parse remarks by Atlanta Fed President Raphael Bostic, due at 12:30 p.m. ET, for his perspective on monetary policy easing. Bostic is a Federal Open Market Committee (FOMC) voting member this year.\n\nInvestors were also awaiting two December inflation reports later in the week and commentary by a slew of policymakers that could offer clues on the Fed's monetary policy trajectory.\n\nAt 5:34 a.m. ET, Dow e-minis were down 171 points, or 0.45%, S&P 500 e-minis were down 6.5 points, or 0.14%, and Nasdaq 100 e-minis were down 20 points, or 0.12%.\n\nAmong others, JPMorgan Chase dipped 0.1% and Citigroup shed 1.2%. The major lenders will kick off the reporting rush on Friday with hopes high for upbeat profits.\n\nHarpoon Therapeutics' shares more than doubled after a report over the weekend said Merck & Co was in advanced talks to buy the cancer drugmaker for around $700 million, citing people familiar with the matter.\n\nDell Technologies added 1.2% after J.P. Morgan upgraded the computer maker to \"overweight\" from \"neutral\". (Reporting by Johann M Cherian in Bengaluru; Editing by Devika Syamnath)", "link": "https://finance.yahoo.com/news/us-stocks-futures-under-pressure-110559853.html", "symbols": ["12DA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DELL.US", "GSPC.INDX"], "tags": [], "sentiment": {"polarity": -0.872, "neg": 0.063, "neu": 0.89, "pos": 0.047}}, {"date": "2024-01-08T10:44:34+00:00", "title": "Indonesia temporarily grounds three Boeing 737 MAX 9 planes - transport ministry", "content": "JAKARTA (Reuters) - Indonesia temporarily grounded three Boeing 737 MAX 9 planes on Jan. 6, operated by Lion Air, despite different configurations from the plane that had to make an emergency landing in the U.S. last week, the transport ministry said on Monday.\n\nThe U.S. Federal Aviation Administration (FAA) ordered the temporary grounding of 171 Boeing jets installed with the same panel that tore off an eight-week-old Alaska Airlines jet on Friday, forcing an emergency landing with a gap in the fuselage.\n\nThe door plug blew off the left side of the Alaska Airlines jet following takeoff from Portland, Oregon, en route to Ontario, California, forcing pilots to turn back and land safely with all 171 passengers and six crew on board.\n\nThree Boeing 737 MAX 9 planes, the only ones Indonesia had, were grounded starting from January 6 until further notice, said Adita Irawati, a transport ministry spokesperson.\n\nThe Lion Air planes had a \"mid cabin emergency exit door type II\" whereas the Alaska Airlines plane had a \"mid exit door plug,\" Adita said.\n\n\"This means the system in the mid-section of emergency doors were functional and could be used for evacuation,\" Adita added.\n\nThe ministry will coordinate with the FAA, Boeing and Lion Air to monitor the situation, adding that \"operational safety will be our priority.\"\n\nA Lion Air spokesperson said the airline is conducting further inspection of the planes to ensure the emergency door mechanism works normally.\n\n(Reporting by Stefanno Sulaiman and Stanley Widianto; Editing by Louise Heavens and Raju Gopalakrishnan)", "link": "https://ca.finance.yahoo.com/news/indonesia-temporarily-grounds-three-boeing-104434077.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.178, "neg": 0.05, "neu": 0.907, "pos": 0.043}}, {"date": "2024-01-08T10:41:03+00:00", "title": "UPDATE 2-Indonesia temporarily grounds three Boeing 737 MAX 9 planes - transport ministry", "content": "(Adds Lion Air statement in paragraph 8)\n\nJAKARTA, Jan 8 (Reuters) - Indonesia temporarily grounded three Boeing 737 MAX 9 planes on Jan. 6, operated by Lion Air, despite different configurations from the plane that had to make an emergency landing in the U.S. last week, the transport ministry said on Monday.\n\nThe U.S. Federal Aviation Administration (FAA) ordered the temporary grounding of 171 Boeing jets installed with the same panel that tore off an eight-week-old Alaska Airlines jet on Friday, forcing an emergency landing with a gap in the fuselage.\n\nThe door plug blew off the left side of the Alaska Airlines jet following takeoff from Portland, Oregon, en route to Ontario, California, forcing pilots to turn back and land safely with all 171 passengers and six crew on board.\n\nThree Boeing 737 MAX 9 planes, the only ones Indonesia had, were grounded starting from January 6 until further notice, said Adita Irawati, a transport ministry spokesperson.\n\nThe Lion Air planes had a \"mid cabin emergency exit door type II\" whereas the Alaska Airlines plane had a \"mid exit door plug,\" Adita said.\n\n\"This means the system in the mid-section of emergency doors were functional and could be used for evacuation,\" Adita added.\n\nThe ministry will coordinate with the FAA, Boeing and Lion Air to monitor the situation, adding that \"operational safety will be our priority.\"\n\nA Lion Air spokesperson said the airline is conducting further inspection of the planes to ensure the emergency door mechanism works normally. (Reporting by Stefanno Sulaiman and Stanley Widianto; Editing by Louise Heavens and Raju Gopalakrishnan)", "link": "https://finance.yahoo.com/news/1-indonesia-temporarily-grounds-three-104103911.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0.048, "neu": 0.899, "pos": 0.053}}, {"date": "2024-01-08T09:42:00+00:00", "title": "Boeing Stock Tumbles as Airbus Rises. The Latest 737 MAX Problem Looks Bad.", "content": "Shares of commercial aircraft maker Boeing were tumbling early Monday while its European rival Airbus was rising. A part of a Boeing -made Alaska Airlines plane blew off mid-air 10 minutes after takeoff from Portland, Oregon on Friday. No one was physically hurt in the incident, but it’s a bad look for Boeing, which has had problems with its 737 line in the past.\n\nContinue reading", "link": "https://finance.yahoo.com/m/20e1bc43-f81b-3226-994b-279cc56a4282/boeing-stock-tumbles-as.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": -0.889, "neg": 0.169, "neu": 0.809, "pos": 0.022}}, {"date": "2024-01-08T09:42:00+00:00", "title": "Boeing Shares Fall in Frankfurt After 737 MAX 9 Woes", "content": "Boeing shares in Frankfurt sfell around 7% after the FAA ordered a temporary grounding and immediate inspections of dozens of 737 MAX jets following an Alaska Airlines emergency landing.\n\nContinue reading", "link": "https://finance.yahoo.com/m/df25b38b-15fe-371d-ad67-161a2ab1b0a4/boeing-shares-fall-in.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.103, "neg": 0.079, "neu": 0.854, "pos": 0.067}}, {"date": "2024-01-08T09:35:40+00:00", "title": "These Stocks Are Moving the Most Today", "content": "Boeing slumps after the FAA orders the temporary grounding of 737 MAX 9 planes after a jet operated by Alaska Airlines lost a section of its fuselage midair, Apple shares extend their losing streak, and Tesla declines after The Wall Street Journal publishes an article on alleged illegal drug use by CEO Elon Musk.\n\nContinue reading", "link": "https://finance.yahoo.com/m/c26b82a8-2266-36ff-94a6-beec0acc3078/these-stocks-are-moving-the.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.681, "neg": 0.141, "neu": 0.795, "pos": 0.065}}, {"date": "2024-01-08T09:17:48+00:00", "title": "Key Piece of Boeing 737 Found in Hunt for Clues on Plane Blowout", "content": "(Bloomberg) -- US air-safety officials retrieved the fuselage panel that blew off during an Alaska Airlines flight on Jan. 5, as authorities begin piecing together evidence to learn what led to the sudden decompression on the almost-new Boeing Co. 737 Max 9 aircraft.\n\nMost Read from Bloomberg\n\nMusk’s Drug Use Concerns Tesla, SpaceX Leaders, WSJ Says Boeing Max Grounding Goes Global as Carriers Follow FAA Order China Says It Caught Foreign Consultant Spying for UK’s MI6\n\nThe finding will aid investigators examining what went wrong on Flight 1282, which was carrying 171 passengers from Portland, Oregon, when the accident forced pilots to turn back. Boeing slumped in premarket US trading as investors assess the effect on production and any long-term harm to the planemaker’s outlook and reputation.\n\nWhile no one was seriously injured, National Transportation Safety Board Chair Jennifer Homendy said only luck prevented a more disastrous outcome. The US Federal Aviation Administration has temporarily grounded the Max 9 for safety checks, affecting 171 aircraft around the world, most of which are in the US, where Alaska and United Airlines Holdings Inc. are the biggest operators.\n\nThe recovery of the door plug is an important breakthrough in the investigation, though the NTSB hasn’t been able to secure some other key evidence. The jet’s cockpit voice recorder, which has a two-hour recording time, was overridden and that data has been lost. Investigators will also look into the airline’s handling of several pressure warnings on previous flights, Homendy said.\n\nShares of Boeing fell 7.9% in premarket US trading, while supplier Spirit AeroSystems Holdings Inc., which makes the fuselage for the 737, slid 16%.\n\nRead More: Boeing CEO’s Comeback Plan for 2024 Takes a Hit Five Days In\n\nThe door plug on the aircraft, which had just entered service on Nov. 11, was found in the backyard of a Portland-based school teacher, Homendy said. Other areas of focus for the NTSB at Sunday night’s briefing were around the oxygen masks that were deployed and the state of the plane after the incident.\n\nStory continues\n\nFlight 1282’s auto pressurization fail light had lit up on three previous flights, most recently on Jan. 4, Homendy said. In those instances, crew had flipped the switch to “alt mode,” which is acceptable considering there’s a backup.\n\nThe NTSB chair said there was a decision by Alaska Airlines, after the light had come on, to put in place a restriction that prevents a plane from flying long distances, or in Alaska Airlines’ case, being flown to Hawaii over water. A maintenance check was ordered by the airline but hadn’t been carried out, she said.\n\n“I’m sure I will be asked if there is any correlation between the light that illuminated and the expulsion of the door plug,” Homendy said. “We don’t know that there was any correlation.”\n\nRegulators reacted swiftly to Friday’s incident, grounding 171 of the variant less than 24 hours after the incident, including the entire fleet of 737 Max 9s in the US. Airlines like Alaska Air, United and Aeromexico were among carriers that grounded all aircraft subsequently.\n\nHomendy said the circuit breaker for the plane’s cockpit voice recorder wasn’t pulled because while the maintenance team went out to get it, it was “right at about the two hour mark and it was completely overwritten at two hours.”\n\n“The NTSB has many times talked about the need to increase the time on CVRs from two hours to 25 hours, which is consistent with Europe and many other countries,” she said. “Because that information is key not just for our investigation, but for improving aviation safety.”\n\nHomendy also described the events that look place inside the plane after the huge bang and explosive cabin depressurization, noting the cockpit door flew open, hitting the lavatory door and sticking there. A checklist for the pilots to refer to in cases of emergency that was laminated to the cockpit in front of them also flew out of the plane and the first officer jolted forward, losing her headset in the process.\n\nThe captain quickly reached for a backup reference handbook in the seat beside him and both he and the first officer put on their oxygen masks and turned on the speaker so they could communicate again with the cabin crew.\n\n“I do want to emphasize that the actions of the flight crew were really incredible,” Homendy said, adding it would have been chaotic and violent, with the wind from the outside being very loud once the door plug was expelled out of the plane.\n\nThe fact there were no people sitting in seats 26A and 26B was just by chance. Seat 26A was twisted and the head rests on seats 25A and 26A were missing. The seat back on 26A was also gone as were some tray tables, although there was no structural damage to the outside of the plane whatsoever.\n\nAll the oxygen masks were also down and some close to the gaping hole had been sheared off. There was also a lot of damage to the interior panelling trim.\n\n“My impression when I saw that is it must have been a terrifying event to experience,” Homendy said.\n\n(Updates with premarket US trading)\n\nMost Read from Bloomberg Businessweek\n\nCan Biden Convince Americans His Brand of Populism Is Better Than Trump’s? Why America’s Car Buyers Are Rethinking EVs Eight Tech Products That Could Define 2024 Gen Zers Who Want the Buzz But Not the Hangover Are Fueling a Nonalcoholic Spirits Boom Private Equity’s Horrible, No-Good ’23 Set to Continue Into ’24\n\n©2024 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/blown-door-plug-alaska-air-091748804.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.968, "neg": 0.073, "neu": 0.871, "pos": 0.056}}, {"date": "2024-01-08T07:52:25+00:00", "title": "Boeing, Alaska Air, Spirit AeroSystems fall premarket; Nvidia, Moderna rise", "content": "Investing.com -- U.S. futures retreated Monday, with investors cautious ahead of the release of the key monthly inflation data later in the week, which could determine risk appetite going forward.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nBoeing (NYSE:BA) stock fell 7.5% after the Federal Aviation Administration ordered the temporary grounding of around 171 Boeing jets in the wake of a mid-air breach of a 737 Max jet last week.\n\nAlaska Air  (NYSE:ALK) stock slid 5.5% after the carrier canceled more than 200 flights following the FAA order, while fuselage maker Spirit AeroSystems (NYSE:SPR) stocks slumped 18%.\n\nRegeneron (NASDAQ:REGN) stock fell 2.8% after the company’s eye drug Eylea's fourth-quarter U.S. preliminary sales came below expectations, as its blockbuster product faced pressure from a rival.\n\nNvidia (NASDAQ:NVDA) stock rose 0.6% after Reuters reported that the chipmaker is aiming to begin mass production of an artificial intelligence chip specifically designed for the Chinese market in the second quarter of 2024.\n\nMerck (NYSE:MRK) stock fell 0.1% after the drugmaker said it would buy cancer drug developer Harpoon Therapeutics (NASDAQ:HARP), up more than 110%, for about $680 million, reinforcing its oncology portfolio with immunotherapies.\n\nModerna  (NASDAQ:MRNA) stock rose 1.5% after the drugmaker reported preliminary 2023 sales of $6.7 billion for its COVID vaccine, surpassing the lower end of its full-year forecast.\n\nAbercrombie & Fitch (NYSE:ANF) stock rose 0.3% after the clothing retailer raised its forecast for fourth-quarter and annual net sales, after strong demand for its apparel brands during the key holiday shopping period.\n\nShell (LON:SHEL) ADRs fell 0.9% after the oil major said that it would book an impairment charge of up to $4.5 billion in the fourth quarter.\n\nRelated Articles\n\nBoeing, Alaska Air, Spirit AeroSystems fall premarket; Nvidia, Moderna rise\n\nUS Supreme Court rejects challenge to California flavored tobacco ban\n\nBank of America to take non-cash charge of $1.6 billion in Q4 after cessation of a loan index", "link": "https://finance.yahoo.com/news/boeing-alaska-air-spirit-aerosystems-075225493.html", "symbols": ["0QF.F", "6MK.F", "6MK.XETRA", "AFT.F", "ALK.US", "ANF.US", "BA.US", "HARP.US", "MRCK34.SA", "MRK.MX", "MRK.US", "MRNA.US", "NVDA.US", "REGN.US", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0.06, "neu": 0.877, "pos": 0.062}}, {"date": "2024-01-08T07:27:59+00:00", "title": "Boeing shares slide in Frankfurt after FAA grounds some MAX 9s", "content": "LONDON (Reuters) -Boeing shares listed in Frankfurt fell almost 8% early on Monday after the U.S. Federal Aviation Administration ordered the temporary grounding of some Boeing 737 MAX 9 jets.\n\nA piece of fuselage tore off the left side of an Alaska Airlines jet on Friday as it climbed following takeoff from Portland, Oregon, forcing pilots to turn back and land safely with all 171 passengers and six crew on board.\n\nBoeing competes with Airbus, which has expanded its market share since two Boeing MAX crashes in 2018 and 2019 that killed nearly 350 people and led to the MAX's worldwide grounding for 20 months.\n\nAirbus shares rose 1.25% early on Monday. The company will announce this week that it delivered 735 planes last year, beating Boeing to remain the world's largest planemaker for the fifth year in a row, industry sources said. Airbus has declined to comment on its annual performance ahead of the commercial update on Jan. 11.\n\nBoeing's Frankfurt shares pared some early losses to stand 6.5% lower by 0835 GMT.\n\nJefferies said in a note that the latest Boeing incident could slow aircraft production if manufacturing and installation processes are subject to further regulatory probes.\n\nBoeing CEO Dave Calhoun on Sunday said the firm's response to the incident was its main focus right now as regulators carry out an investigation.\n\nThe planemaker also plans to hold a company-wide webcast on safety on Tuesday to address its response. It also cancelled a leadership summit for company vice presidents previously scheduled for Monday and Tuesday.\n\n(Reporting by Samuel Indyk, Joanna Plucinska and Tim Hepher; Editing by Amanda Cooper, Louise Heavens, Kirsten Donovan)", "link": "https://finance.yahoo.com/news/boeing-shares-slide-frankfurt-faa-072759840.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": 0.273, "neg": 0.05, "neu": 0.889, "pos": 0.061}}, {"date": "2024-01-08T07:27:59+00:00", "title": "Boeing shares fall in Frankfurt, US pre-market after MAX 9 groundings", "content": "By Joanna Plucinska, Abhijith Ganapavaram and Tim Hepher\n\nLONDON (Reuters) -Boeing shares listed in Frankfurt and in U.S. pre-market trading fell almost 8% early on Monday after the U.S. Federal Aviation Administration ordered the temporary grounding of some Boeing 737 MAX 9 jets.\n\nA piece of fuselage tore off an Alaska Airlines jet on Friday following takeoff from Portland, Oregon, forcing pilots to turn back.\n\nBoeing competes with Airbus, which has expanded its market share since two Boeing MAX crashes in 2018 and 2019 that killed nearly 350 people and led to the MAX's worldwide grounding for 20 months.\n\nAirbus shares were up more than 1% early on Monday. The company this week will announce that it delivered 735 planes last year, beating Boeing to remain the world's largest planemaker for the fifth year in a row, industry sources said.\n\nReuters last week reported that the number would reach the mid-730s, beating the company's target of 720.\n\nAirbus is also on course to beat industry records for gross and net orders, industry sources said last month. Airbus has declined any comment on its annual performance ahead of a commercial update it will present on Jan 11.\n\nAEROSPACE HIT\n\nBoeing's Frankfurt shares pared early losses to stand 7% lower by 0935 GMT.\n\nShares in its suppliers and customers could also take a hit as many airlines grounded their MAX jets following Friday's incident.\n\nSpirit Aero shares were down 15.9% in U.S. pre-market trading. Alaska Air shares fell 5% while United Airlines shares dropped 2.8%.\n\nJefferies said in a note that the latest Boeing incident could slow aircraft production if manufacturing and installation processes are subject to further regulatory probes.\n\n\"It highlights a history of quality escape problems, particularly at Spirit (Aero). Quality escapes are not acceptable in an industry in which single failures can have serious consequences,\" Bernstein analysts said in a note.\n\nBoeing CEO Dave Calhoun on Sunday said the firm's response to the incident was its main focus right now as regulators carry out an investigation.\n\nThe planemaker also plans to hold a company-wide webcast on safety on Tuesday to address its response. It cancelled a leadership summit for company vice presidents scheduled for Monday and Tuesday.\n\n(Reporting by Samuel Indyk, Joanna Plucinska, Abhijith G and Tim Hepher; editing by Kirsten Donovan and Jason Neely)", "link": "https://ca.finance.yahoo.com/news/boeing-shares-slide-frankfurt-faa-072759826.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.341, "neg": 0.071, "neu": 0.85, "pos": 0.079}}, {"date": "2024-01-08T07:24:03+00:00", "title": "Boeing-Lockheed JV's new Vulcan rocket sends privately-built Moon lander to space", "content": "WASHINGTON, Jan 8 (Reuters) - A robotic lander built by a private company was bound for the moon on Monday in an attempt to make the first U.S. lunar soft landing in more than half a century, after launching into space aboard a new Vulcan rocket debuted by a joint venture of Boeing and Lockheed Martin .\n\nSpace robotics firm Astrobotic's Peregrine lunar lander launched at 2:18 a.m. EST from Cape Canaveral, Florida on the first flight of Vulcan, a powerful rocket that had been under development for a decade by the Boeing-Lockheed venture United Launch Alliance (ULA). United Launch Alliance’s Vulcan rocket with Astrobotic Technology's lander onboard is launched from Cape Canaveral Space Force Station in Florida on Monday, Jan 8, 2024.(NASA via AP) (ASSOCIATED PRESS)\n\n\"Yee haw, I am so thrilled,\" ULA CEO Tory Bruno said in the company's launch control room. \"This has been years of hard work. So far this has been an absolutely beautiful mission.\"\n\nIf all goes well, Peregrine would mark the first U.S. soft landing on the moon since the final Apollo landing in 1972, and the first-ever lunar landing by a private company — a feat that has proved elusive in recent years.\n\n\"This is the moment we've been waiting for for 16 years,\" Astrobotic CEO John Thornton said. Applause roared in the launch control room when Peregrine was released from its booster stage, setting the golf cart-sized craft on its 46-day journey to the moon.\n\nThe mission is the latest in recent years among countries and private companies sprinting to the moon, a reemergent stage of international competition where scientists hope its water-bearing minerals can be exploited to sustain long-term astronaut missions.\n\nThe launch of Vulcan, a 200-foot (60-m) tall rocket with engines made by Jeff Bezos' Blue Origin, was a crucial first for ULA, which developed the rocket to replace its workhorse Atlas V rocket and rival the reusable Falcon 9 from Elon Musk's SpaceX in the satellite launch market.\n\nThe stakes were high for Vulcan. Boeing and Lockheed, which own ULA in a 50-50 split, have been seeking a sale of the business for roughly a year. And the launch was the first of two certification flights required by the U.S. Space Force before Vulcan can fly lucrative missions for the Pentagon, a key customer.\n\nStory continues\n\nPeregrine is set to land on the moon on Feb. 23 with 20 payloads aboard, most of which will seek to gather data about the lunar surface ahead of planned future human missions. It marks the first trek to the moon's surface as part of NASA's Artemis moon program.\n\nThat multibillion dollar program, involving various countries and relying heavily on private companies such as SpaceX, envisions astronaut missions to the moon later this decade. Small landers such as Peregrine will get there first.\n\nSecond private launch\n\nA second private U.S. company under the same NASA program expects to launch a lander of its own in February. Carrying similar NASA payloads and launching to space aboard a SpaceX Falcon 9 rocket, Houston-based Intuitive Machines' said its spacecraft could make a moon landing on Feb. 22, a day before Peregrine.\n\nIndia last year became the fourth country to achieve a soft lunar landing after Russia failed in an attempt the same month. The U.S., China and the former Soviet Union are the only other countries that have carried out successful soft lunar landings.\n\nPrivate companies with hopes of spurring a lunar marketplace have had harder times, with Japan's ispace and an Israeli company crash-landing on their first attempts.\n\n(Reporting by Joey Roulette; Editing by Rosalba O'Brien, Jacqueline Wong, William Maclean)", "link": "https://finance.yahoo.com/news/1-moon-lander-us-company-072403312.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA"], "tags": [], "sentiment": {"polarity": 0.966, "neg": 0.013, "neu": 0.932, "pos": 0.055}}, {"date": "2024-01-08T06:46:54+00:00", "title": "US stock futures lower; inflation data, banks' earnings due", "content": "Investing.com -- U.S. stock futures edged lower Monday, with investors nervous ahead of the release of crucial inflation data that could influence future Federal Reserve thinking over potential interest rate cuts.\n\nBy 06:50 ET (11:50 GMT), the Dow Futures contract was down 160 points, or 0.4%, S&P 500 Futures traded 4 points, or 0.1%, lower, while Nasdaq 100 Futures traded largely flat.\n\nWall Street suffered a disappointing start to the year last week, posting its first losing week in 10 as investors reassessed the chances of early rate cuts by the U.S. central bank in 2024.\n\nThe blue-chip Dow Jones Industrial Average dropped 1.5% last week, the broad-based S&P 500 slid 0.6%, and the tech-heavy Nasdaq Composite posted its worst weekly performance since September, falling 3.3% as Treasury yields rose.\n\nCPI release to offer rates clarity\n\nFriday’s monthly U.S. jobs report came in stronger than expected, and coupled with the minutes from the last Fed meeting, has elevated uncertainty over what the U.S. central bank intends to do with interest rates early in the new year.\n\nDallas Fed boss Lorie Logan even warned on Saturday that rates could even be lifted again.\n\n\"If we don't maintain sufficiently tight financial conditions, there is a risk that inflation will pick back up and reverse the progress we've made,\" she said. \"In light of the easing in financial conditions in recent months, we shouldn't take the possibility of another rate increase off the table just yet.\"\n\nThursday’s U.S. inflation data could offer greater clarity, with U.S. CPI seen rising by 0.2% month-on-month, an annual increase of 3.2%.\n\nThe crucial core figure is rising by 0.2% month-on-month, dragging the annual pace down to 3.8%, a level not seen since mid-2021.\n\nAtlanta Fed President Raphael Bostic is also due to speak later in Monday’s session, and his views will be studied carefully for his perspective on monetary policy easing.\n\nBoeing slumps after 737 Max groundings\n\nIn the corporate sector, Boeing (NYSE:BA) stock fell sharply in premarket trading after the Federal Aviation Administration ordered the temporary grounding of around 171 Boeing jets in the wake of a mid-air breach of a 737 Max jet last week.\n\nStory continues\n\nAdditionally, Alaska Air (NYSE:ALK) stock slid over 4% after the carrier canceled more than 200 flights following the FAA order.\n\nThe latest quarterly earnings season starts on Friday, with results from big banks Bank of America (NYSE:BAC), Citigroup (NYSE:C), JPMorgan Chase (NYSE:JPM) and Wells Fargo (NYSE:WFC) due.\n\nCrude on course for weekly gains\n\nOil prices fell Monday after Saudi Arabia slashed the prices of its Asian crude exports to over two-year lows, adding to the current narrative that global demand remains weak.\n\nBy 06:50 ET, the U.S. crude futures traded 2.9% lower at $71.68 a barrel, while the Brent contract dropped 2.7% to $76.62 a barrel.\n\nMajor crude exporter Saudi Arabia on Sunday cut the February official selling price of its flagship Arab Light crude to Asia to the lowest level in 27 months.\n\nYet, despite these worries over global economic activity, both benchmarks climbed more than 2% last week on rising geopolitical tensions in the Middle East following attacks by Yemeni Houthis on ships in the Red Sea, prompting disruptions in shipping activity in the region.\n\nAdditionally, gold futures fell 1.1% to $2,026.70/oz, while EUR/USD traded 0.1% lower at 1.0937.\n\n(Oliver Gray contributed to this article.)\n\nRelated Articles\n\nUS stock futures lower; inflation data, banks' earnings due\n\nAdvent Technologies secures $1.83 million for R&D project\n\nVicinity Motor Corp expands with Toronto EV dealership", "link": "https://finance.yahoo.com/news/us-stock-futures-lower-inflation-064654238.html", "symbols": ["ALK.US", "BA.US", "BAC.US", "C.US", "DJI.INDX", "IXIC.INDX", "JPM.US", "WFC.US"], "tags": [], "sentiment": {"polarity": -0.987, "neg": 0.12, "neu": 0.812, "pos": 0.068}}, {"date": "2024-01-08T06:38:48+00:00", "title": "PRESS DIGEST- New York Times business news - Jan 8", "content": "Jan 8 (Reuters) - The following are the top stories on the New York Times business pages. Reuters has not verified these stories and does not vouch for their accuracy.\n\n- Boeing's 737 MAX 9 jets remained grounded in the United States on Sunday as airlines awaited instructions from the plane maker and the Federal Aviation Administration on how to inspect the planes and resume service, two days after a harrowing flight raised concerns about the jet.\n\n- Top U.S. congressional leaders on Sunday said they had agreed to set the total amount of spending at nearly $1.66 trillion in a deal aimed at averting a partial government shutdown later this month.\n\n- United Launch Alliance, a joint venture between Boeing and Lockheed Martin, is preparing to launch its powerful Vulcan Rocket on Monday, in a mission that will be the first U.S. moon landing attempt in more than 50 years.\n\n- The Pentagon came under increased pressure Sunday to explain why senior Biden administration officials, congressional representatives and the President himself were not notified of the hospitalization of Defense Secretary Lloyd Austin until days later. (Compiled by Bengaluru newsroom)", "link": "https://finance.yahoo.com/news/press-digest-york-times-business-063848903.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.863, "neg": 0.018, "neu": 0.903, "pos": 0.08}}, {"date": "2024-01-08T06:33:00+00:00", "title": "A Key Clue in the Alaska Airlines Blowout Turns Up In a Backyard", "content": "Finding the door plug that blew off the plane in midair is expected to help investigators as they try to narrow down what went wrong on the flight.\n\nContinue reading", "link": "https://finance.yahoo.com/m/ffa7c087-e578-38f1-af7c-fd60fdf99a4b/a-key-clue-in-the-alaska.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US", "UAL.MX", "UAL.US", "UAL1.F"], "tags": [], "sentiment": {"polarity": -0.103, "neg": 0.092, "neu": 0.828, "pos": 0.08}}, {"date": "2024-01-08T05:40:02+00:00", "title": "Vulcan rocket set for debut launch with first US moon lander in decades", "content": "By Joey Roulette\n\nCAPE CANAVERAL, Florida, Jan 8 (Reuters) - United Launch Alliance, a joint venture of Boeing and Lockheed Martin , was poised for a debut launch of its powerful Vulcan rocket from Florida on Monday in a mission that will feature the first U.S. moon landing attempt in more than half a century.\n\nAboard Vulcan, a 200-foot (60-m) tall rocket with engines made by Jeff Bezos' Blue Origin, is the Peregrine lunar lander built by space robotics firm Astrobotic.\n\nThe launch is set to go ahead at Cape Canaveral, Florida, at 2:18 a.m. EST (0718 GMT) on Monday.\n\nIf all goes well, Peregrine would mark the first U.S. soft landing on the moon since the final Apollo landing in 1972, and the first ever lunar landing by a private company - a feat that has proved elusive in recent years.\n\nPeregrine is set to land on the moon on Feb. 23 with scientific payloads aboard that will seek to gather data about the lunar surface ahead of planned future human missions.\n\nThe launch is a crucial first for the United Launch Alliance (ULA). Vulcan, which rolled out to its pad on Friday, has spent roughly a decade in development to replace ULA's workhorse Atlas V rocket and rival the reusable Falcon 9 from Elon Musk's SpaceX in the satellite launch market.\n\n\"Now that is a beautiful sight,\" ULA CEO Tory Bruno said on social media platform X, alongside a photo of Vulcan.\n\nULA was formed in 2006 in a merger of Boeing's and Lockheed's rocket programs. The two aerospace giants own the company in a 50-50 split, though they have been seeking a sale of the business for roughly a year.\n\nThat raises the stakes for Vulcan's mission. And the U.S. Space Force, a key customer for Vulcan, sees the launch as the first of two verification flights required before it can put national security payloads aboard.\n\n\"It's really, really important for ULA's forward success... Everything is better for them if it goes well,\" George Sowers, ULA's former chief scientist and one of the architects of its Vulcan program, said of the mission. \"But it's certainly not the end of the world if it doesn't.\"\n\nStory continues\n\nULA's two operational rockets, the Atlas V and giant Delta IV Heavy, are set to retire in the coming years, leaving Vulcan the lone successor to carry on the company's perfect mission success rate. The new rocket already has a multibillion dollar backlog of some 80 missions.\n\nThe Atlas V's retirement was put in place when its Russian-made RD-180 engines - stemming from a partnership established in the 1990's post-Cold War detente - drew concern from U.S. lawmakers after Russia invaded Crimea in 2014.\n\nMeanwhile, SpaceX's insurgent Falcon 9, a reusable launcher offering cheaper rides into Earth's orbit, eroded ULA's monopoly on national security missions. That helped pave the way for Vulcan's development, whose mission price starts at roughly $110 million. (Reporting by Joey Roulette, Editing by Rosalba O'Brien)", "link": "https://finance.yahoo.com/news/vulcan-rocket-set-debut-launch-054002425.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA"], "tags": [], "sentiment": {"polarity": 0.983, "neg": 0.012, "neu": 0.905, "pos": 0.083}}, {"date": "2024-01-08T05:38:37+00:00", "title": "Investigators find blown-off Boeing door as US grounds 737 Max", "content": "WASHINGTON (Reuters) —The U.S. National Transportation Safety Board (NTSB) said late on Sunday the \"key missing component\" from the Boeing 737 MAX 9 jet involved in an Alaska Airlines emergency landing had been recovered from the backyard of a suburban home.\n\nThe plug door tore off the left side of an Alaska Airlines jet on Friday following takeoff from Portland, Oregon, en route to Ontario, California, depressurizing the plane and forcing pilots to turn back and land safely with all 171 passengers and six crew on board.\n\nThe Federal Aviation Administration (FAA) on Saturday ordered the temporary grounding of 171 Boeing MAX 9 jets installed with the same panel, which weighs about 60 pounds (27 kg) and covers an optional exit door mainly used by low-cost airlines.\n\nThe missing plug door was recovered on Sunday by a Portland school teacher identified only as \"Bob\" in the Cedar Hills neighborhood who found it in his backyard, NTSB Chair Jennifer Homendy said, saying she was \"very relieved\" it had been found.\n\nShe had earlier told reporters the aircraft part was a \"key missing component\" to determine why the accident occurred.\n\n\"Our structures team will want to look at everything on the door — all of the components on the door to see to look at witness marks, to look at any paint transfer, what shape the door was in when found. That can tell them a lot about what occurred,\" she said.\n\nThe force from the loss of the plug door was strong enough to blow open the cockpit door during flight, said Homendy, who said it must have been a \"terrifying event\" to experience.\n\n\"They heard a bang,\" Homendy said of the pilots, who were interviewed by investigators.\n\nA quick reference laminated checklist flew out the door, while the first officer lost her headset, she said. \"Communication was a serious issue... It was described as chaos.\"\n\nHomendy said the cockpit voice recorder did not capture any data because it had been overwritten and again called on regulators to mandate retrofitting existing planes with recorders that capture 25 hours of data, up from the two hours required at present.\n\nStory continues\n\nEarlier pressurization issues\n\nHomendy said the auto pressurization fail light illuminated on the same Alaska Airlines aircraft on Dec. 7, Jan. 3 and Jan. 4, but it was unclear if there was any connection between those incidents and the accident.\n\nAlaska Airlines made a decision after the warnings to restrict the aircraft from making long flights over water to Hawaii so that it could return quickly to an airport if needed, Homendy said.\n\nThe Seattle-based carrier said earlier in a response to questions about the warning lights that aircraft pressurization system write-ups were typical in commercial aviation operations with large planes.\n\nThe airline said \"in every case, the write up was fully evaluated and resolved per approved maintenance procedures and in full compliance with all applicable FAA regulations.\"\n\nAlaska Airlines added it has an internal policy to restrict aircraft with multiple maintenance write-ups on some systems from long flights over water that was not required by the FAA.\n\nPlanes grounded\n\nThe FAA said on Sunday the affected fleet of Boeing MAX 9 planes, including those operated by other carriers such as United Airlines, would remain grounded until the regulator was satisfied they were safe.\n\nThe FAA initially said on Saturday the required inspections would take four to eight hours, leading many in the industry to assume the planes could very quickly return to service.\n\nBut criteria for the checks have yet to be agreed between the FAA and Boeing, meaning airlines have yet to receive detailed instructions, people familiar with the matter said. NTSB investogator examines the fuselage plug area of Alaska Airlines Flight 1282 Boeing 737-9 MAX\n\nThe FAA must approve Boeing's inspection criteria before the checks can be completed and planes can resume flights. Alaska Airlines said late on Sunday it had still not received instructions from Boeing.\n\nAlaska Airlines canceled 170 flights on Sunday and a further 60 on Monday and said travel disruptions from the grounding were expected to last through at least midweek. United, which has grounded its 79 MAX 9s, canceled 230 flights on Sunday, or 8% of scheduled departures.\n\nThe accident has put Boeing back under scrutiny as it awaits certification of its smaller MAX 7 as well as the larger MAX 10, which is needed to compete with a key Airbus model.\n\nIn 2019, global authorities subjected all MAX planes to a wider grounding that lasted 20 months after crashes in Ethiopia and Indonesia linked to poorly designed cockpit software killed a total of 346 people.\n\n(Reporting by David Shepardson and Valerie Insinna in Washington and Tim Hepher in Paris; Editing by Christian Schmollinger and Jamie Freed)", "link": "https://finance.yahoo.com/news/alaska-airlines-jet-had-three-053837009.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.926, "neg": 0.065, "neu": 0.889, "pos": 0.046}}, {"date": "2024-01-08T05:24:58+00:00", "title": "REFILE-UPDATE 2-US investigators recover key part from Alaska Airlines 737 MAX jet", "content": "(Corrects phrasing in paragraph 16 to 'operated' and in paragraph 19 to 'receives')\n\nBy David Shepardson, Valerie Insinna and Tim Hepher\n\nWASHINGTON, Jan 8 (Reuters) - The U.S. National Transportation Safety Board (NTSB) said late on Sunday the \"key missing component\" from the Boeing 737 MAX 9 jet involved in an Alaska Airlines emergency landing had been recovered from the backyard of a suburban home.\n\nThe plug door tore off the left side of an Alaska Airlines jet on Friday following takeoff from Portland, Oregon, en route to Ontario, California, depressurizing the plane and forcing pilots to turn back and land safely with all 171 passengers and six crew on board.\n\nThe Federal Aviation Administration (FAA) on Saturday ordered the temporary grounding of 171 Boeing MAX 9 jets installed with the same panel, which weighs about 60 pounds (27 kg) and covers an optional exit door mainly used by low-cost airlines.\n\nThe missing plug door was recovered on Sunday by a Portland school teacher identified only as \"Bob\" in the Cedar Hills neighborhood who found it in his backyard, NTSB Chair Jennifer Homendy said, saying she was \"very relieved\" it had been found.\n\nShe had earlier told reporters the aircraft part was a \"key missing component\" to determine why the accident occurred.\n\n\"Our structures team will want to look at everything on the door - all of the components on the door to see to look at witness marks, to look at any paint transfer, what shape the door was in when found. That can tell them a lot about what occurred,\" she said.\n\nThe force from the loss of the plug door was strong enough to blow open the cockpit door during flight, said Homendy, who said it must have been a \"terrifying event\" to experience.\n\n\"They heard a bang,\" Homendy said of the pilots, who were interviewed by investigators.\n\nA quick reference laminated checklist flew out the door, while the first officer lost her headset, she said. \"Communication was a serious issue... It was described as chaos.\"\n\nStory continues\n\nHomendy said the cockpit voice recorder did not capture any data because it had been overwritten and again called on regulators to mandate retrofitting existing planes with recorders that capture 25 hours of data, up from the two hours required at present.\n\nEARLIER PRESSURIZATION ISSUES\n\nHomendy said the auto pressurization fail light illuminated on the same Alaska Airlines aircraft on Dec. 7, Jan. 3 and Jan. 4, but it was unclear if there was any connection between those incidents and the accident.\n\nAlaska Airlines made a decision after the warnings to restrict the aircraft from making long flights over water to Hawaii so that it could return quickly to an airport if needed, Homendy said.\n\nThe Seattle-based carrier said earlier in a response to questions about the warning lights that aircraft pressurization system write-ups were typical in commercial aviation operations with large planes.\n\nThe airline said \"in every case, the write up was fully evaluated and resolved per approved maintenance procedures and in full compliance with all applicable FAA regulations.\"\n\nAlaska Airlines added it has an internal policy to restrict aircraft with multiple maintenance write-ups on some systems from long flights over water that was not required by the FAA.\n\nPLANES GROUNDED\n\nThe FAA said on Sunday the affected fleet of Boeing MAX 9 planes, including those operated by other carriers such as United Airlines, would remain grounded until the regulator was satisfied they were safe.\n\nThe FAA initially said on Saturday the required inspections would take four to eight hours, leading many in the industry to assume the planes could very quickly return to service.\n\nBut criteria for the checks have yet to be agreed between the FAA and Boeing, meaning airlines have yet to receive detailed instructions, people familiar with the matter said.\n\nThe FAA must approve Boeing's inspection criteria before the checks can be completed and planes can resume flights. Alaska Airlines said late on Sunday it had still not received instructions from Boeing.\n\nAlaska Airlines canceled 170 flights on Sunday and a further 60 on Monday and said travel disruptions from the grounding were expected to last through at least midweek. United, which has grounded its 79 MAX 9s, canceled 230 flights on Sunday, or 8% of scheduled departures.\n\nThe accident has put Boeing back under scrutiny as it awaits certification of its smaller MAX 7 as well as the larger MAX 10, which is needed to compete with a key Airbus model.\n\nIn 2019, global authorities subjected all MAX planes to a wider grounding that lasted 20 months after crashes in Ethiopia and Indonesia linked to poorly designed cockpit software killed a total of 346 people.\n\n(Reporting by David Shepardson and Valerie Insinna in Washington and Tim Hepher in Paris; Editing by Christian Schmollinger and Jamie Freed)", "link": "https://finance.yahoo.com/news/1-alaska-airlines-jet-had-052458132.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.926, "neg": 0.064, "neu": 0.89, "pos": 0.046}}, {"date": "2024-01-08T04:14:17+00:00", "title": "What aerospace analysts are saying about Boeing's mid-air blowout", "content": "(Reuters) - A serious mid-air breach has landed planemaker Boeing in the regulatory crosshairs just as it was awaiting approval of new models of its best-selling MAX jet.\n\nInvestigators are still trying to determine what caused a door plug to fall off from the side of a 737 MAX 9 aircraft operated by Alaska Airlines on Friday, with 171 passengers on board.\n\nThis is what aerospace analysts are saying about the expected impact of the incident on Boeing:\n\nCAI VON RUMOHR, TD COWEN ANALYST:\n\n\"The check required by the FAA (Federal Aviation Administration) is expected to take 4-8 hours, which is far less than was the case with the recent issue with 737 aft pressure bulkhead, which is far more difficult to access.\n\n\"As a result, we think the checks will most likely be completed in several days; and once the NTSB (National Transportation Safety Board) determines the root cause of the Alaska Air incident, we think a fix should not be complicated and may be as straightforward as requiring more rigorous and extensive inspection of the exit door plugs at Spirit and Boeing.\n\n\"The question then is whether the FAA will require more frequent inspection of MAX 9 exit door plugs and whether it will require more extensive pre-delivery inspection of MAX 9’s at Boeing that would impact the pace of deliveries. Based on the FAA’s response to the 737’s aft pressure bulkhead and vertical stabilizer issue, which could have had equally serious consequences if not addressed, we think this is unlikely.\"\n\nNICOLAS OWENS, MORNINGSTAR ANALYST:\n\n\"At this point, we do not believe those inspections or any revision to how the 737 MAX-9 fuselages are made by Spirit Aero Systems as a supplier to Boeing will have a material financial impact on Boeing or its customers, and our $232 fair value estimate is unchanged. However, the dramatic nature of the flaw will have the effect of once again calling Boeing's product governance into question by customers, regulators, and the flying public.\"\n\nStory continues\n\nJPMORGAN ANALYSTS:\n\n\"Perhaps the most consequential foreign regulator now is China, where the government has not yet allowed carriers to resume 737 MAX deliveries, though China's entire fleet of nearly 100 MAXs was flying by the end of last year. Boeing has seemed on the cusp on resuming deliveries to China for some time, with positive signals in recent months. Friday's accident could delay this process, though Chinese carriers do not fly MAX 9s and we are not aware they have ordered any.\"\n\nJEFFERIES ANALYSTS:\n\n\"We currently see a low cost of compliance given the Federal Aviation Administration (FAA) has guided to a 4-8hr inspection per jet. In past, ADs (Airworthiness Directives) the FAA has used $85/hr as a cost est. for labor. Assuming inspection costs of $10K per unit (likely too high, but includes potential content costs), the cost would be $1.7MM across the 171 aircraft w/ BA/suppliers shouldering given typical 4-year warranty. Concession would not be contractual, but if we assume a baseline pause of 1 week, concessions could be 7 x $15K per day x 171 aircraft = $18MM.\"\n\n(Compiled by Anne Marie Roantree; Editing by Jamie Freed)", "link": "https://finance.yahoo.com/news/aerospace-analysts-saying-boeings-mid-041417535.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.004, "neg": 0.028, "neu": 0.948, "pos": 0.024}}, {"date": "2024-01-08T04:12:14+00:00", "title": "QUOTES-What aerospace analysts are saying about Boeing's mid-air blowout", "content": "Jan 8 (Reuters) - A serious mid-air breach has landed planemaker Boeing in the regulatory crosshairs just as it was awaiting approval of new models of its best-selling MAX jet.\n\nInvestigators are still trying to determine what caused a door plug to fall off from the side of a 737 MAX 9 aircraft operated by Alaska Airlines on Friday, with 171 passengers on board.\n\nThis is what aerospace analysts are saying about the expected impact of the incident on Boeing:\n\nCAI VON RUMOHR, TD COWEN ANALYST:\n\n\"The check required by the FAA (Federal Aviation Administration) is expected to take 4-8 hours, which is far less than was the case with the recent issue with 737 aft pressure bulkhead, which is far more difficult to access.\n\n\"As a result, we think the checks will most likely be completed in several days; and once the NTSB (National Transportation Safety Board) determines the root cause of the Alaska Air incident, we think a fix should not be complicated and may be as straightforward as requiring more rigorous and extensive inspection of the exit door plugs at Spirit and Boeing.\n\n\"The question then is whether the FAA will require more frequent inspection of MAX 9 exit door plugs and whether it will require more extensive pre-delivery inspection of MAX 9’s at Boeing that would impact the pace of deliveries. Based on the FAA’s response to the 737’s aft pressure bulkhead and vertical stabilizer issue, which could have had equally serious consequences if not addressed, we think this is unlikely.\"\n\nNICOLAS OWENS, MORNINGSTAR ANALYST:\n\n\"At this point, we do not believe those inspections or any revision to how the 737 MAX-9 fuselages are made by Spirit Aero Systems as a supplier to Boeing will have a material financial impact on Boeing or its customers, and our $232 fair value estimate is unchanged. However, the dramatic nature of the flaw will have the effect of once again calling Boeing's product governance into question by customers, regulators, and the flying public.\"\n\nStory continues\n\nJPMORGAN ANALYSTS:\n\n\"Perhaps the most consequential foreign regulator now is China, where the government has not yet allowed carriers to resume 737 MAX deliveries, though China's entire fleet of nearly 100 MAXs was flying by the end of last year. Boeing has seemed on the cusp on resuming deliveries to China for some time, with positive signals in recent months. Friday's accident could delay this process, though Chinese carriers do not fly MAX 9s and we are not aware they have ordered any.\"\n\nJEFFERIES ANALYSTS:\n\n\"We currently see a low cost of compliance given the Federal Aviation Administration (FAA) has guided to a 4-8hr inspection per jet. In past, ADs (Airworthiness Directives) the FAA has used $85/hr as a cost est. for labor. Assuming inspection costs of $10K per unit (likely too high, but includes potential content costs), the cost would be $1.7MM across the 171 aircraft w/ BA/suppliers shouldering given typical 4-year warranty. Concession would not be contractual, but if we assume a baseline pause of 1 week, concessions could be 7 x $15K per day x 171 aircraft = $18MM.\" (Compiled by Anne Marie Roantree; Editing by Jamie Freed)", "link": "https://finance.yahoo.com/news/quotes-aerospace-analysts-saying-boeings-041214929.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.004, "neg": 0.028, "neu": 0.949, "pos": 0.024}}, {"date": "2024-01-08T03:49:04+00:00", "title": "UPDATE 1-Alaska Airlines cancels more than 200 flights after FAA order", "content": "(Recasts headline and first paragraph with updated flight cancellations, adds background in paragraphs 3-5)\n\nJan 7 (Reuters) - Alaska Airlines said it had canceled 170 flights on Sunday and a further 60 on Monday, after the U.S. Federal Aviation Administration (FAA) ordered the grounding of 171 Boeing 737 MAX 9 airplanes to run inspections.\n\nThe airline said cancellations would continue through the first half of the week. The Sunday cancellations affected nearly 25,000 guests, added the Seattle-based carrier, which has 65 737 MAX 9 aircraft in its fleet.\n\nThe FAA on Saturday ordered the temporary grounding of 171 Boeing jets installed with the same panel after an eight-week-old Alaska Airlines jet was forced to make an emergency landing with a gap in the fuselage.\n\nThe door plug tore off the left side of the jet following takeoff from Portland, Oregon, en route to Ontario, California, forcing pilots to turn back and land safely with all 171 passengers and six crew on board.\n\n\"They will remain grounded until the FAA is satisfied that they are safe,\" the agency said of the affected 737 MAX 9 jets in a statement on Sunday. (Reporting by Anirudh Saligrama and Rishabh Jaiswal in Bengaluru; Editing by Diane Craft and Jamie Freed)", "link": "https://finance.yahoo.com/news/1-alaska-airlines-cancels-more-034904210.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.202, "neg": 0.043, "neu": 0.928, "pos": 0.029}}, {"date": "2024-01-08T03:06:19+00:00", "title": "European stocks mixed; caution ahead of important inflation data", "content": "Investing.com - European stock markets traded in a mixed fashion Monday, with risk appetite subdued at the start of a week that includes the release of key inflation data from the U.S., Japan and China.\n\nAt 03:05 ET (08:05 GMT), the DAX index in Germany traded 0.1% higher, while the CAC 40 in France traded down 0.1% and the FTSE 100 in the U.K. fell 0.3%.\n\nInflation data in focus this week\n\nEuropean equities retreated last week as investors reined in expectations of early interest rate cuts this year, primarily by the U.S. Federal Reserve, but also from the likes of the European Central Bank and the Bank of England.\n\nThis change in tone was bolstered by a surprise jump in U.S. nonfarm payrolls as well as eurozone inflation jumping to 2.9% in December from 2.4% in November, supporting the European Central Bank’s case to keep interest rates at record highs for some time.\n\nThere is more inflation data from Japan and China to digest this week, but the main event will be Thursday's U.S. CPI, with prices seen rising by just 0.2% month-on-month, an annual rise of 3.2%.\n\nWhatever the result, it will likely again shift expectations over where the Federal Reserve is heading in terms of interest rate movements.\n\nBack in Europe, German industrial orders rose less than expected in November, climbing by just 0.3% month-on-month, instead of the 1% expected, which represented a minor rebound from last month’s revised 3.8% slump.\n\nAirbus benefits from Boeing's problems\n\nIn the corporate sector, Airbus (EPA:AIR) stock rose 1% following the woes of rival plane manufacturer Boeing (NYSE:BA), as the U.S. Federal Aviation Administration ordered the temporary grounding of some of its 737 MAX 9 jets in the wake of a door tearing off an Alaska Airlines jet on Friday.\n\nThe new earnings season starts later this week, with the major U.S. banks, JPMorgan Chase (NYSE:JPM), Bank of America (NYSE:BAC) and Citigroup (NYSE:C), due to report fourth quarter and full-year results on Friday.\n\nStory continues\n\nCrude retreats after Saudi Arabia cuts prices\n\nOil prices fell Monday after Saudi Arabia slashed the prices of its Asian crude exports to over two-year lows, adding to the current narrative that global demand remains weak.\n\nBy 03:05 ET, the U.S. crude futures traded 1.2% lower at $72.96 a barrel, while the Brent contract dropped 1% to $77.97 a barrel.\n\nMajor crude exporter Saudi Arabia on Sunday cut the February official selling price of its flagship Arab Light crude to Asia to the lowest level in 27 months.\n\nYet, despite these worries over global economic activity, both benchmarks climbed more than 2% last week on rising geopolitical tensions in the Middle East following attacks by Yemeni Houthis on ships in the Red Sea, prompting disruptions in shipping activity in the region.\n\nAdditionally, gold futures fell 0.7% to $2,036.05/oz, while EUR/USD traded 0.1% lower at 1.0939.\n\nRelated Articles\n\nEuropean stocks mixed; caution ahead of important inflation data\n\nUS Treasury, Energy officials to testify at Senate EV incentive hearing\n\nAlaska 737 cockpit voice recorder data erasure renews industry safety debate", "link": "https://finance.yahoo.com/news/european-stocks-mixed-caution-ahead-030619757.html", "symbols": ["BA.US", "BAC.US", "C.US", "FCHI.INDX", "FTSE.INDX", "GDAXI.INDX", "JPM.US"], "tags": [], "sentiment": {"polarity": -0.984, "neg": 0.122, "neu": 0.803, "pos": 0.075}}, {"date": "2024-01-08T01:08:00+00:00", "title": "Alaska Airlines Accident Could Have Been Much Worse, Investigator Says", "content": "PORTLAND, Ore.—A federal probe into Friday’s Alaska Airlines flight has started with a focus on the door plug—still missing—that violently blew off the plane in midair, leaving a gaping hole in its side. Jennifer Homendy, chair of the National Transportation Safety Board, examined the stricken Boeing 737 MAX 9 jet after she arrived in Portland, Ore., on Saturday afternoon. At this point, the probe is zeroed in on the Alaska Airlines accident and not on a broader set of aircraft, such as separate versions of the 737 MAX or other planes that have similar door plugs.\n\nContinue reading", "link": "https://finance.yahoo.com/m/ffa7c087-e578-38f1-af7c-fd60fdf99a4b/alaska-airlines-accident.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US", "UAL.MX", "UAL.US", "UAL1.F"], "tags": [], "sentiment": {"polarity": -0.813, "neg": 0.099, "neu": 0.874, "pos": 0.027}}, {"date": "2024-01-08T00:03:26+00:00", "title": "PRESS DIGEST- Financial Times - Jan. 8", "content": "Jan 8 (Reuters) - The following are the top stories in the Financial Times. Reuters has not verified these stories and does not vouch for their accuracy.\n\nHeadlines\n\n- VinFast to build India EV plant in $2 bln investment in Tamil Nadu\n\n- Boeing faces more questions about its aircraft after fresh incident\n\n- London Underground strikes called off after late breakthrough in talks\n\n- Congress leaders reach $1.66 trln deal on US spending levels ahead of feared shutdown\n\nOverview\n\n- Vietnamese electric vehicle (EV) maker VinFast signed an agreement to set up its first manufacturing facilities in the Indian state of Tamil Nadu in an investment of up to $2 billion.\n\n- Boeing's most recent production error, a hazardous mid-air breach in the fuselage of a 737 Max, whether the manufacturer can continue to produce quality aircraft at the speed at which it is building them.\n\n- Strikes planned by rail union RMT members working for London Underground from Monday to Thursday have been called off after the union made progress in talks with operator Transport for London (TfL).\n\n- The top Democrat and Republican in the U.S. Congress reached a $1.66 trillion spending deal to pass the bills that would appropriate the money to avoid shut down.\n\n(Compiled by Bengaluru newsroom)", "link": "https://finance.yahoo.com/news/press-digest-financial-times-jan-000326554.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.248, "neg": 0.062, "neu": 0.871, "pos": 0.067}}, {"date": "2024-01-08T00:00:00+00:00", "title": "ALK Stock Falls After Alaska Air Flight Blowout", "content": "Both BA and ALK stocks are taking a beating after a door blew off an Alaska Airlines' Boeing 737 MAX 9 over the weekend.", "link": "https://investorplace.com/2024/01/alk-stock-falls-after-alaska-air-flight-blowout/", "symbols": ["ALK.US", "BA.US"], "tags": [], "sentiment": {"polarity": -0.459, "neg": 0.13, "neu": 0.87, "pos": 0}}, {"date": "2024-01-08T00:00:00+00:00", "title": "Why Is Spirit AeroSystems (SPR) Stock Down 14% Today?", "content": "Spirit AeroSystems stock is falling hard on Monday as investors in SPR react to a flight experiencing a mid-air blowout.", "link": "https://investorplace.com/2024/01/why-is-spirit-aerosystems-spr-stock-down-14-today/", "symbols": ["ALK.US", "BA.US", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.077, "neg": 0.152, "neu": 0.761, "pos": 0.086}}, {"date": "2024-01-08T00:00:00+00:00", "title": "5 Investors Betting Big on Boeing (BA) Stock", "content": "BA stock is down after one of its aircraft operated by Alaska Airlines experienced a malfunction. Here are BA stock's largest shareholders.", "link": "https://investorplace.com/2024/01/5-investors-betting-big-on-boeing-ba-stock/", "symbols": ["ALK.US", "BA.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-01-08T00:00:00+00:00", "title": "3 Space Exploration Stocks for Out-Of-This-World Returns", "content": "Space stocks are beginning to look increasingly more attractive. Here are three of the best that investors should consider.", "link": "https://investorplace.com/2024/01/3-space-exploration-stocks-for-out-of-this-world-returns/", "symbols": ["BA.US", "NOC.US", "SPCE.US"], "tags": [], "sentiment": {"polarity": 0.811, "neg": 0, "neu": 0.698, "pos": 0.302}}, {"date": "2024-01-08T00:00:00+00:00", "title": "Boeing and Key Supplier Spirit Hit Hard After Alaska Air Blowout", "content": "BA stock and SPR stock continue to fall after a Boeing 737-9 MAX lost a plug door and some fuselage mid-flight. ", "link": "https://investorplace.com/2024/01/boeing-and-key-supplier-spirit-hit-hard-after-alaska-air-blowout/", "symbols": ["ALK.US", "BA.US", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.318, "neg": 0.113, "neu": 0.887, "pos": 0}}, {"date": "2024-01-08T00:00:00+00:00", "title": "Can Boeing (BA) Stock Survive the Latest 737 Max 9 Issues?", "content": "Boeing (BA) stock is sinking after a panel fell off of one of its 737 Max 9 jets in the middle of a flight on Friday night.", "link": "https://investorplace.com/2024/01/can-boeing-ba-stock-survive-the-latest-737-max-9-issues/", "symbols": ["BA.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-01-07T23:53:01+00:00", "title": "Alaska, United cancel flights for Boeing 737 MAX 9 inspections", "content": "Alaska Airlines and United Airlines have canceled hundreds of flights this weekend that were scheduled to be flown using the Boeing 737 MAX 9, which has been grounded for inspections after a panel blew off the fuselage of a flight from Portland, Oregon, on Friday and caused a cabin depressurization.\n\nAlaska and United are the two main U.S. air carriers that operate the Boeing 737 MAX 9, one of which lost a door plug panel on an Alaska flight at about 16,000 feet of altitude after taking off from Portland on Friday en route to Ontario, California. The airlines combined to cancel about 600 flights throughout the weekend to allow their MAX 9 aircraft to be inspected.\n\nThe door plug panel is installed on MAX 9 aircraft for airlines that choose not to configure it to seat its maximum capacity of 220 people, which would require its use as an emergency exit. No serious injuries were reported in the incident, though some passengers were treated for injuries and medically. The aircraft safely returned to Portland after the blow out occurred. No passengers were in the seats closest to the blown-out plug door, and both chairs sustained damage.\n\nThe airlines and the Federal Aviation Administration (FAA) moved to ground the Boeing 737 MAX 9 airliners that have the plug door to allow for inspections of other aircraft with that configuration. The National Transportation Safety Board (NTSB) is also investigating the incident.\n\nWHAT TO KNOW ABOUT THE BOEING 737 MAX 9 PANEL THAT BLEW OFF IN MID-AIR United Airlines canceled about 270 flights over the weekend that involved 737 MAX 9 aircraft, while 145 were changed to use other aircraft.\n\nAlaska, which operates 65 737 MAX 9 aircraft in its fleet, canceled 170 flights on Sunday which the company said affected roughly 25,000 travelers a day after the Seattle-based airline canceled 160 flights on Saturday, which affected about 23,000 travelers. It added that it expects \"additional significant cancellations through the first half of the week.\"\n\nREAD ON THE FOX BUSINESS APP\n\n\"We are awaiting further information from both the FAA and Boeing to begin the required inspections on the door plug of our 737-9 MAX fleet and will share information as we’re able,\" Alaska added in a statement.\n\nStory continues\n\nAlaska had inspected and cleared 18 of its 737 MAX 9 aircraft earlier on Saturday before the FAA issued its emergency airworthiness directive, after which those aircraft were also grounded while awaiting word from the FAA and Boeing about any additional work needed.\n\nWATCH: ALASKA AIRLINES PASSENGER CAPTURES HORRIFYING MOMENTS AFTER PLANE PART BLEW OFF MID-AIR Alaska canceled about 330 flights involving its 737 MAX 9 fleet over the weekend following the blow out on Friday.\n\n\"Service on United’s Boeing 737 MAX 9 aircraft remains temporarily suspended while it conducts inspections required by the FAA,\" United Airlines told FOX Business in a statement. \"We’re continuing to work with the FAA to clarify the inspection process and requirements for returning all MAX 9 aircraft to service.\n\n\"We are working with customers to reaccommodate them on other flights and in some cases have been able to avoid cancellations by switching to other aircraft types,\" United added.\n\nUnited said that it has 79 Boeing 737 MAX 9 aircraft in its fleet. It had 273 flights scheduled for Saturday, of which 90 were canceled and nearly 60 were saved by using other aircraft; while it canceled about 180 of 265 flights scheduled for Sunday, with 85 saved through the use of other aircraft. A door plug panel on the fuselage of a Boeing 737 MAX 9 blew out on a flight from Portland, Oregon, to Ontario, California, which resulted in the grounding of Alaska and United's MAX 9 fleets to allow for inspections.\n\nThe airline has parked all of its MAX 9 aircraft and is beginning preliminary inspections while awaiting final instructions from the FAA and Boeing.\n\nOriginal article source:Alaska, United cancel flights for Boeing 737 MAX 9 inspections", "link": "https://finance.yahoo.com/news/alaska-united-cancel-flights-boeing-235301913.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "UAL.MX", "UAL.US", "UAL1.F"], "tags": [], "sentiment": {"polarity": 0.874, "neg": 0.051, "neu": 0.884, "pos": 0.065}}, {"date": "2024-01-07T23:37:02+00:00", "title": "Mid-air blowout puts Boeing back in the hot seat", "content": "By Valerie Insinna and Tim Hepher\n\nWASHINGTON (Reuters) - A mid-air blowout has put jetmaker Boeing in the exact place investors and management hoped it would avoid - back in the regulatory crosshairs just as it was awaiting approval of new models of its best-selling MAX jet.\n\nInvestigators say it is too early to determine what caused a so-called door plug to fall off from the side of an aircraft operated by one of Boeing's most loyal customers, Alaska Airlines, on Friday with 171 passengers on board.\n\nThe Federal Aviation Administration (FAA) said on Sunday that 171 Boeing MAX 9 airplanes BA.N would remain grounded until the agency is convinced they can safely operate.\n\nThe mishap comes as Boeing and supplier Spirit AeroSystems, which made the panel, are grappling with ongoing production setbacks that have hampered recovery from an earlier lengthy 737 MAX safety grounding and wider disruption from the pandemic.\n\nBoeing has been under pressure to expand the MAX portfolio and narrow a gap with rival Airbus, which has extended gains in market share since two Boeing MAX crashes in 2018 and 2019 that killed nearly 350 people and led to the MAX's worldwide grounding for 20 months.\n\nThe MAX's troubled history resulted in sweeping reforms of U.S. airplane regulation in 2020, and the Alaska incident could prompt regulators to take a tougher line on other outstanding issues.\n\nAirlines increasingly want to carry more passengers in single-aisle aircraft to take advantage of increases in performance and range while benefiting from their lower cost.\n\nAfter disappointing sales of the MAX 9, Boeing's largest narrowbody, the company was betting on its newest proposal, the larger-capacity MAX 10, to cut into runaway sales of Airbus's A321neo at the busiest end of the market. Analysts say a full rollout of the MAX line-up is crucial to help Boeing steady or improve its roughly 40% market share and generate enough cash to comfortably ride out the coming decade.\n\nStory continues\n\nBoeing, saddled with $39 billion in debt, has been reluctant to invest in an all-new plane until engine technology matures in the next decade. Delays to certification of the MAX 10 in particular could put Boeing's 2020s-bridging strategy under renewed pressure, analysts said.\n\nBoeing's struggles also come under the watchful eye of China, a key market broadly closed to the jetmaker in recent years as MAX safety concerns overlapped with trade tensions. Chinese officials sought updates on the Alaska incident on Saturday, sources said.\n\nBoth Boeing and Spirit declined comment.\n\nSince the 737 MAX was grounded in March 2019, Boeing shares have dropped by more than 40% while Airbus shares are up 25%.\n\nThe first clue to the fallout will be how regulators treat certification of the smallest and least-sold version, the MAX 7, which is next up for approval, said Jeff Guzzetti, a former U.S. air crash investigator.\n\nThe FAA is evaluating whether to grant an exemption that would allow the MAX 7 to attain certification before Boeing completes required design changes. The MAX 9 accident could \"swing the pendulum\" toward a rejection, he said.\n\n\"The FAA needs to be seen as strong and on top of things and strict when it comes to safety,\" Guzzetti said. \"The days of any kind of coziness are over.\"\n\nThe FAA said \"safety will determine the timeline\" of ongoing certification projects but declined further comment.\n\nQUALITY ISSUES\n\nAlthough it is too early to identify the cause of the blowout, experts said the investigation could rekindle a debate over recent quality problems if the a production issue was the root cause of the MAX 9 panel dislodging itself.\n\n\"How many production deficiencies and quality escapes do you need before you really start to consider how to wrap your hands around the whole process and cure all of it?\" said Guzzetti.\n\nAlthough Boeing's 737 manufacturing line has evolved, it was never intended to produce 750 aircraft a year, said Michel Merluzeau of AIR Strategic Advisory.\n\nBoeing has introduced robotic systems into 737 manufacturing but is targeting bolder digital reforms in future programs as part of a growing battle over production strategy with Airbus, while still tackling supply chain and labor issues.\n\nPast initiatives that put pressure on suppliers to cut costs, as well as a disconnect between top executives and engineering and manufacturing corps, have added to Boeing's difficulties, said Richard Aboulafia of AeroDynamic Advisories, a longstanding critic.\n\nRecent 737 production setbacks include loose or missing hardware on the rudder system of two MAX jets, improperly drilled holes made by Spirit, and the incorrect attachment of brackets joining the MAX's aft fuselage to its tail.\n\nIn February, Boeing was forced to pause 787 Dreamliner deliveries after a data analysis error was found - a problem Boeing said was unrelated to previous issues that stopped deliveries between 2021 and 2022.\n\nBoeing insists its patience is paying off.\n\n\"Our production system is poised for steady and efficient increases, but we won't push the system too fast and will ensure the supply base is in lockstep with us,\" CEO Dave Calhoun said in October.\n\n(This story has been refiled to remove an extraneous word in paragraph 1)\n\n(Reporting by Valerie Insinna in Washington and Tim Hepher in Paris; Editing by Sandra Maler)", "link": "https://finance.yahoo.com/news/analysis-mid-air-blowout-puts-233702222.html", "symbols": ["AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "EADSF.US", "EADSY.US"], "tags": [], "sentiment": {"polarity": -0.178, "neg": 0.072, "neu": 0.844, "pos": 0.084}}, {"date": "2024-01-07T21:40:30+00:00", "title": "Explainer: Missing door 'plug' may hold vital clues to how a gaping hole blew open on a jetliner", "content": "Investigators were searching Sunday for the piece of fuselage that blew off a Boeing airliner over Oregon on Friday, hoping to gain physical evidence of what went wrong.\n\nThe gaping hole in the side of the Alaska Airlines jet opened up where aircraft maker Boeing fits a “plug” to cover an emergency exit that the airline does not use.\n\nThe plugs are on most Boeing 737 Max 9 jets. The Federal Aviation Administration has temporarily grounded those planes until they undergo inspections of the area around the door plug.\n\nWHY THE PLUG IS THERE\n\nSome larger Boeing 737s have emergency exits on fuselages behind the wings to meet a federal requirement that planes be designed so passengers can evacuate within 90 seconds even if half the exits are blocked.\n\nThe more passenger seats there are on a plane, the more exits are required.\n\nSome carriers, including Indonesia's Lion Air and Corendon Dutch Airlines, cram more than 200 seats into their Max 9s, so they must have extra emergency exits. However, Alaska Airlines and United Airlines configure their 737 Max 9s to have fewer than 180 seats, so the planes don't need the two mid-cabin exits to comply with U.S. evacuation rules.\n\nOn Alaska and United, the only two U.S. airlines using the Max 9, those side exits near the back of the plane are replaced with a permanent plug the size of an exit door.\n\nARE THEY ONLY ON MAX 9s?\n\nNo. Boeing also makes bigger versions of its 737-900 — a predecessor to the Max — and the Max 8 with space for extra exits in the back. Buyers of those planes also may opt to have either exit doors or plugs installed.\n\nWHO INSTALLS THE PLUGS?\n\nA spokesman for Spirit AeroSystems — which is unrelated to Spirit Airlines — confirmed to The New York Times that the company installed door plugs on Max 9s, including the plug on the Alaska Airlines plane involved in Friday's incident. The Seattle Times reported that door plugs are assembled into 737 fuselages at Spirit's factory in Wichita, Kansas.\n\nStory continues\n\nSpirit AeroSystems declined to answer questions from The Associated Press. Boeing declined to comment on the issue.\n\nTHE BOEING SUPPLIER\n\nSpirit is Boeing's largest supplier for commercial planes and builds fuselages and other parts for Boeing Max jets. The company has been at the center of several recent problems with manufacturing quality on both the Max and a larger plane, the Boeing 787 Dreamliner. Last year, Boeing and Spirit AeroSystems discovered improperly drilled fastener holes in a bulkhead that keeps 737 Max jets pressurized at cruising altitude.\n\nTHE INVESTIGATION\n\nOfficials with the National Transportation Safety Board, led by the board's chair, Jennifer Homendy, arrived in Portland, Oregon, on Saturday to begin an investigation that is likely to last a year or longer. Homendy declined to discuss possible causes when she briefed reporters on Saturday night.\n\nThe NTSB team includes a metallurgist, and Homendy said investigators will look at the exit-door plug if they can find it, as well as its hinges and other parts.\n\nExamining the damage to the door will be crucial to the investigation, according to independent experts.\n\n“The good thing about metal is that metal paints a picture, metal tells a story,” said Anthony Brickhouse, who teaches accident investigation at Embry-Riddle Aeronautical University in Daytona Beach, Florida. \"I'm pretty confident they will find the piece that came off, and they will be able to speak to scientifically what happened to cause this failure.”\n\nBrickhouse said the exit doors, whether plugged or not, are not necessarily a weak point in the fuselage. He had never heard of an exit door plug falling off a plane before Alaska Airlines flight 1282.\n\nWERE THERE WARNINGS?\n\nAerospace analysts for the investment bank Jefferies wrote that the plane involved in Friday's incident experienced pressurization issues on two earlier flights. The NTSB has not commented on the plane's history, but Homendy said investigators would examine maintenance records even on such a new plane.\n\nOTHER FUSELAGE BLOWOUTS\n\nThere have been rare instances of holes opening in the fuselages of airliners. In most cases, they have been the result of metal fatigue in the plane's aluminum skin.\n\nIn the most horrific case, a flight attendant for Aloha Airlines was blown out of the cabin of a Boeing 737 over the Pacific Ocean in 1988 after an 18-foot-long chunk of the roof peeled away. Her body was never found. The tragedy led to tougher rules for airlines to inspect and repair microscopic fuselage cracks before they tear open in flight.\n\nIn 2009, a hole opened in the roof of a Southwest Boeing 737 flying 35,000 feet over West Virginia. And in 2011, a 5-foot-long gash unfurled in another Southwest Boeing 737, forcing pilots to make an emergency landing at a military base in Arizona. No one was injured in either of those cases, both of which were blamed on metal fatigue.", "link": "https://finance.yahoo.com/news/explainer-missing-door-plug-may-214030494.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.967, "neg": 0.055, "neu": 0.908, "pos": 0.037}}, {"date": "2024-01-07T20:53:16+00:00", "title": "What to know about the Boeing 737 MAX 9 panel that blew off in mid-air", "content": "Federal aviation regulators have grounded certain Boeing 737 MAX 9 jets for further inspection after a piece of fuselage tore off the left side of an Alaska Airlines-operated aircraft on Friday, causing the airliner to make an emergency landing after the cabin depressurized.\n\nAfter Alaska Air Flight 1282 took off from Portland, Oregon, en route to Ontario, California, it was at about 16,000 feet of altitude and climbing when it experienced rapid depressurization after a panel that serves as a plug for an emergency exit door used on some variations of the Boeing 737 MAX 9 was torn off. The pilot immediately signaled the plane would have to land, it safely returned to Portland with all 171 passengers and six crew members aboard.\n\nNo serious injuries were reported in the incident, though Alaska reported that some passengers experienced minor injuries that required medical attention – all of whom were medically cleared after receiving treatment. Nobody was sitting in the seats adjacent to where the door plug blew out according to the airline. Parts of the seat next to the fuselage, including the headrest, were missing.\n\nThe Federal Aviation Administration (FAA) issued a directive Saturday requiring safety inspections of 171 Boeing 737 MAX 9 aircraft operating worldwide. The National Transportation Safety Board (NTSB) dispatched a \"Go Team\" with experts in structures, operations and systems to investigate the incident.\n\nWATCH: ALASKA AIRLINES PASSENGER CAPTURES HORRIFYING MOMENTS AFTER PLANE PART BLEW OFF MIDAIR Certain Boeing 737 MAX 9 airliners have been grounded after a plug door blew off an Alaska flight from Portland, Oregon, to Ontario, California.\n\nThe 737 MAX 9 is Boeing’s largest single-aisle plane and can seat up to 220 people. It includes an optional extra door to allow for the approved number of evacuation paths in cases where carriers choose to install the maximum number of seats on the aircraft.\n\nREAD ON THE FOX BUSINESS APP\n\nPlanes that aren’t configured to maximize seating capacity can replace that emergency door with a panel, or plug. Door plugs have been used to adapt aircraft and offer flexible layouts across the industry for years.\n\nStory continues\n\nFAA TO TEMPORARILY GROUND CERTAIN BOEING PLANS AFTER ALASKA AIRLINES DOOR BLEW OFF IN MIDAIR\n\nThe fuselage for Boeing 737s is made by Kansas-based Spirit AeroSystems, which separated from Boeing in 2005. Spirit is one of two suppliers that makes the plug doors on the MAX 9, but Boeing also has a key role in the plug installation process, Reuters reported.\n\nThe installation is done in a two-part process involving manufacturing at Spirit’s fuselage plant in Wichita, Kansas, and a Boeing factory outside Seattle, sources told Reuters.\n\nSpirit sends the 737 fuselages by train with the special door assembly \"semi-rigged\" to Renton, Washington, where Boeing typically removes the pop-out doors while loading interiors, then puts the part back to complete installation according to the Reuters report. The hull is then pressurized to 150% to ensure everything is working properly. United and Alaska are the main U.S. air carriers that operate the Boeing 737 MAX 9.\n\nBoeing has delivered 200-plus Boeing 737 MAX 9 planes, of which 171 have a door plug panel instead of an emergency door. Before U.S. airlines can resume flying the planes, the FAA must agree to detailed inspection criteria proposed by Boeing, and it’s unclear if it will do so on Sunday.\n\nU.S. air carriers that use the panel on their 737 MAX 9 airliners are Alaska and United. Alaska halted the use of 18 of its MAX 9 planes on Saturday. On Sunday, it canceled 163 flights, or 21%, and said travel disruptions from the grounding are expected to last through at least mid-week. United canceled 230 flights on Sunday, or 8% of its scheduled departures.\n\nOther carriers that have grounded planes for inspection include Panama’s Copa Airlines, Aeromexico and Turkish Airlines.\n\nBoeing said in a statement shared with FOX Business: \"Safety is our top priority and we deeply regret the impact this event has had on our customers and their passengers. We agree with and fully support the FAA’s decision to require immediate inspections of 737-9 airplanes with the same configuration as the affected airplane. In addition, a Boeing technical team is supporting the NTSB’s into last night’s event. We will remain in close contact with our regulator and customers.\"\n\nAlaska Airlines said in a post on X, formerly, on Saturday: \"As of this morning, inspections on more than a quarter of our 737-9 fleet are complete with no concerning findings. Aircraft will return to service as their inspections are completed with our full confidence.\"\n\nBOEING, FAA URGE OPERATORS TO INSPECT 737 MAX JETS FOR LOOSE BOLT Alaska Airlines will ground its entire fleet of Boeing Co. 737 Max-9 aircraft after a fuselage section in the rear part of the brand-new jet blew out shortly after takeoff.\n\nNational Transportation Safety Bureau (NTSB) chair Jennifer Homendy spoke at a news conference Sunday and referred to what happened as \"an accident, not an incident,\"\n\n\"We are very, very fortunate here that this didn’t end up in something more tragic,\" Homendy said. \"With that said, I imagine this was a pretty terrifying event. We don’t often talk about psychological injury, but I’m sure that occurred here.\"\n\nHomendy declined to speculate about the cause of the accident but noted that the outcome could’ve been much worse if it had occurred once the aircraft reached its cruising altitude.\n\n\"Think about what happens when you’re in cruise. Everybody’s up and walking, folks don’t have seatbelts on. They’re going to restrooms. The flight attendants are providing service to passengers. We could have ended up with something so much more tragic,\" she said.\n\nHomendy also asked the public for help locating the missing door, saying it’s believed to be in the the west side of the Portland metro area near Oregon Route 217 and Barnes Road in the Cedar Mills suburb.\n\nFOX Business’ Landon Mion and Reuters contributed to this report.\n\nOriginal article source:What to know about the Boeing 737 MAX 9 panel that blew off in mid-air", "link": "https://finance.yahoo.com/news/know-boeing-737-max-9-205316359.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.942, "neg": 0.058, "neu": 0.863, "pos": 0.078}}, {"date": "2024-01-07T20:51:00+00:00", "title": "U.S. Probes Alaska Airlines Door Panel in Boeing Blowout", "content": "The investigation is in its early stages and for now focused on the flight-specific incident rather than a broad problem in the model of the Boeing jet.\n\nContinue reading", "link": "https://finance.yahoo.com/m/ffa7c087-e578-38f1-af7c-fd60fdf99a4b/u.s.-probes-alaska-airlines.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US", "UAL.MX", "UAL1.F"], "tags": [], "sentiment": {"polarity": -0.026, "neg": 0.086, "neu": 0.831, "pos": 0.083}}, {"date": "2024-01-07T20:22:30+00:00", "title": "What to know about the Alaska Airlines 737 Max 9 jet that suffered a blowout", "content": "NEW YORK (AP) — An emergency landing by an Alaska Airlines jetliner has prompted U.S. federal authorities to ground some Boeing 737 Max 9 aircraft, adding another episode to the troubled history of Boeing's Max lineup of jets.\n\nHere is what to know about the Max 9 plane involved, and what comes next.\n\nWHAT HAPPENED?\n\nAn Alaska Airlines jetliner blew out a portion of its fuselage seven minutes after takeoff 3 miles (4.8 kilometers) above Oregon Friday night, forcing the pilots to make an emergency landing. None of the 171 passengers or six crew were seriously injured but the rapid loss of cabin pressure caused oxygen masks to drop from the ceiling. National Transportation Safety Board Chair Jennifer Homendy said the two seats next to the part that tore off were unoccupied.\n\nHOW ARE FEDERAL AUTHORITIES RESPONDING?\n\nThe Federal Aviation Administration ordered the grounding of some Boeing Max 9 operated by U.S. airlines or flown into the country by foreign carriers until they are inspected. The emergency order affects about 171 planes worldwide.\n\nThe NTSB has begun an investigation that is likely to last months and focus on the paneled-over exit door that blew off. The so-called door plug is installed on some jets with fewer seats instead of an emergency exit panel. The jets ordered grounded by the FAA all have those panels installed.\n\nAuthorities are still searching for the door plug, which likely landed near Oregon Route 217 and Barnes Road in the Cedar Hills area west of Portland.\n\nHOW ARE AIRLINES RESPONDING?\n\nAlaska Airlines has grounded its entire fleet of 65 Max 9s for inspections and maintenance. The airline initially kept 18 of its Max 9s in service Saturday because they had received in-depth inspections as part of recent maintenance checks. But the airline pulled those jets from service Saturday night to comply with an FAA directive for all operators of Max9s to conduct specific inspections.\n\nUnited Airlines, the world's biggest operator of Max 9s, has grounded its entire fleet of 79 Max 9s.\n\nStory continues\n\nAlaska and United are the only two U.S. passenger airlines that operate Max 9 aircraft. The companies operate nearly two-thirds of the 215 Max 9 aircraft in service around the world, according to aviation analytics firm Cirium. Six other airlines use the Max 9: Panama's Copa Airlines, Aeromexico, Turkish airlines, Icelandair, flydubai, and SCAT Airlines in Kazakhstan, according to Cirium.\n\nCopa said it had temporarily suspended 21 Boeing 737 Max 9s to comply with the FAA's order.\n\nAlaska Airlines had canceled 163 flights on Sunday, or 21% of its schedule, according to Flightaware. United Airlines had canceled 247, about 9% of its scheduled flights. Not all of the cancelations were necessarily due to the Max 9 crisis.\n\nAlaska Airlines said the groundings had resulted in at least 160 flight cancelations by Saturday evening and disruptions will last through at least mid-week. United had said Saturday evening said the inspections will result in about 60 cancelations.\n\nAlaska Airlines has said affected passengers should go online to view rebooking options and can request a refund. The airline has said passengers whose flights are canceled will be moved the next available flight but they can also request a change or a refund without incurring fees under a flexible travel policy. United Airlines has not instituted a policy specific to the Max 9 inspections but the airline waives change fees for significant delays.\n\nHOW SAFE IS IT TO FLY ON ONE OF THESE PLANES?\n\nFederal officials and airline executives regularly tout the safety of air travel. There has not been a fatal crash of a U.S. airliner since 2009, when a Colgan Air plane operated for Continental crashed near Buffalo, New York, killing all 49 people on board and one on the ground.\n\nAfter arriving in Portland to investigate the Alaska Airlines incident, the NTSB's Homendy said the U.S. has “the safest aviation system in the world.” However, a surge in close calls between planes at U.S. airports in the past year prompted the FAA to convene a “safety summit” last year, in which officials encouraged airlines and pilots to redouble their attention to careful flying.\n\nThe incident has also renewed questions about the safety of Boeing's Max aircraft, which the newest version of the company's storied 737. There are two versions of the aircraft in service: the Max 8 and the Max 9, which is the larger of the two.\n\nRegulators around the world grounded Max 8 planes for nearly two years after a Lion Air flight crashed in Indonesia in 2018, and an Ethiopian Airlines Max 8 crashed in 2019. Boeing changed an automated flight control system implicated in the crashes.\n\nLast year, the FAA told pilots to limit use of an anti-ice system on the Max in dry conditions because of concern that inlets around the engines could overheat and break away, possibly striking the plane. And in December, Boeing told airlines to inspect the planes for a possible loose bolt in the rudder-control system.\n\nHowever, those past issues are unrelated to Friday's blowout, which is exceedingly rare in air travel, according to Anthony Brickhouse, a professor of aerospace safety at Embry-Riddle Aeronautical University. Brickhouse said fuselage panels sometimes tears off planes but he could not recall a previous incident that blew a gaping hole like the one that forced Friday's emergency landing.\n\nIn 2018, a passenger on a Southwest Airlines jet was killed in when a piece of engine housing blew off and shattered the window she was sitting next to. However, that incident involved an earlier version of the Boeing 737, not a Max.\n\nWHAT IS BOEING'S RESPONSE?\n\nThe company, based in Arlington, Virginia, issued a brief statement saying “we deeply regret the impact this event has had on our customers and their passengers.” Boeing said it supported the FAA’s decision to require immediate inspections and said it was providing technical help to the investigators. The company has declined to make an executive available for interviews.", "link": "https://finance.yahoo.com/news/know-alaska-airlines-737-max-202230623.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "UAL.MX", "UAL.US", "UAL1.F"], "tags": [], "sentiment": {"polarity": -0.866, "neg": 0.071, "neu": 0.868, "pos": 0.061}}, {"date": "2024-01-07T18:58:35+00:00", "title": "FAA: 171 Boeing MAX 9 airplanes to remain grounded until assured safe", "content": "WASHINGTON, Jan 7 (Reuters) - The Federal Aviation Administration (FAA) said on Sunday that 171 Boeing MAX 9 airplanes will remain grounded until the agency is convinced they can safely operate after a cabin panel blowout on Friday.\n\n\"We have grounded the affected airplanes, and they will remain grounded until the FAA is satisfied that they are safe,\" the FAA said Sunday. (Reporting by David Shepardson; Editing by Sandra Maler)", "link": "https://finance.yahoo.com/news/faa-171-boeing-max-9-185835191.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.796, "neg": 0.022, "neu": 0.858, "pos": 0.12}}, {"date": "2024-01-07T18:09:13+00:00", "title": "Alaska Airlines again grounds all Boeing 737 Max 9 jetliners as more maintenance may be needed", "content": "PORTLAND, Ore. (AP) — Alaska Airlines again grounded all of its Boeing 737 Max 9 jetliners on Sunday after federal officials indicated further maintenance might be required to assure that another inflight blowout like the one that damaged one of its planes doesn’t happen again.\n\nThe airline had returned 18 of its 65 737 Max 9 aircraft to service on Saturday following inspections that came less than 24 hours after a portion of one plane's fuselage blew out three miles above (4.8 kilometers) above Oregon on Friday night. The depressurized plane, which was carrying 171 passengers and six crew members, returned safely to Portland International Airport with no serious injuries.\n\nThe airline said in a statement that the decision was made after receiving a notice from the Federal Aviation Administration that additional work might be needed. Other versions of the 737 are not affected.\n\n“These aircraft have now also been pulled from service until details about possible additional maintenance work are confirmed with the FAA. We are in touch with the FAA to determine what, if any, further work is required before these aircraft are returned to service,” the airline said.\n\nThe FAA had ordered the grounding of some 737 Max 9s on Saturday until they could be inspected, a process that takes about four hours. The world’s airlines are currently operating about 171 737 Max 9s globally.\n\nThe aircraft make up about 20% of the Alaska Airlines’ fleet. As of midday, Alaska had canceled about a fifth of its Sunday flights, according to FlightAware.com. United Airlines, which also grounded its Max 9s, had about a 10% cancellation rate on Sunday.\n\nThe National Transportation Safety Board is investigating Friday's accident and is still looking for the door from the paneled-over exit that blew out. Some planes, due to smaller capacity, panel over what would have been an exit door.\n\nThe NTSB has a good idea of where it landed, near Oregon Route 217 and Barnes Road in the Cedar Hills area west of Portland, NTSB Chair Jennifer Homendy said at a news conference late Saturday.\n\nStory continues\n\n“If you find that, please, please contact local law enforcement,” she said.\n\nIt was extremely lucky that the airplane had not yet reached cruising altitude, when passengers and flight attendants might be walking around the cabin, Homendy said.\n\n“No one was seated in 26A and B where that door plug is, the aircraft was around 16,000 feet and only 10 minutes out from the airport when the door blew,” she said. The investigation is expected to take months.\n\nThere has not been a major crash involving a U.S. passenger carrier within the country since 2009 when a Colgan Air flight crashed near Buffalo, New York, killing all 49 people on board and one person on the ground. In 2013, an Asiana Airlines flight arriving from South Korea crashed at San Francisco International Airport, killing three of the 307 people on board.\n\nFlight 1282 took off from Portland at 5:07 p.m. Friday for a two-hour flight to Ontario, California. About six minutes later, the chunk of the fuselage blew out as the plane was at about 16,000 feet (4.8 kilometers). One of the pilots declared an emergency and asked for clearance to descend to 10,000 feet (3 kilometers), the altitude where the air would have enough oxygen to breathe safely.\n\nVideos posted by passengers online showed a gaping hole where the paneled-over exit had been and passengers wearing masks. They applauded when the plane landed safely about 13 minutes after the blowout. Firefighters then came down the aisle, asking passengers to remain in their seats as they treated the injured.\n\nThe aircraft involved rolled off the assembly line and received its certification two months ago, according to online FAA records. It had been on 145 flights since entering commercial service Nov. 11, said FlightRadar24, another tracking service. The flight from Portland was the aircraft’s third of the day.\n\nAviation experts were stunned that a piece would fly off a new aircraft. Anthony Brickhouse, a professor of aerospace safety at Embry-Riddle Aeronautical University, said he has seen panels of fuselage come off planes before, but couldn’t recall one where passengers “are looking at the lights of the city.”\n\nHe said the incident is a reminder for passengers to stay buckled in.\n\n“If there had been a passenger in that window seat who just happened to have their seat belt off, we’d be looking at a totally different news story.”\n\nThe Max is the newest version of Boeing’s venerable 737, a twin-engine, single-aisle plane frequently used on U.S. domestic flights. The plane went into service in May 2017.\n\nThe president of the union representing flight attendants at 19 airlines, including Alaska Airlines, commended the crew for keeping passengers safe.\n\n“Flight Attendants are trained for emergencies and we work every flight for aviation safety first and foremost,” Sara Nelson, president of the Association of Flight Attendants, said in a statement Saturday.\n\nTwo Max 8 jets crashed in 2018 and 2019, killing 346 people and leading to a near two-year worldwide grounding of all Max 8 and Max 9 planes. They returned to service only after Boeing made changes to an automated flight control system implicated in the crashes.\n\nLast year, the FAA told pilots to limit use of an anti-ice system on the Max in dry conditions because of concern that inlets around the engines could overheat and break away, possibly striking the plane.\n\nMax deliveries have been interrupted at times to fix manufacturing flaws. The company told airlines in December to inspect the planes for a possible loose bolt in the rudder-control system.\n\n___\n\nKoenig reported from Dallas. Bohrer reported from Juneau, Alaska. Associated Press reporters Terry Spencer in Fort Lauderdale, Florida, and Audrey McAvoy in Honolulu, Hawaii, contributed.", "link": "https://finance.yahoo.com/news/alaska-airlines-again-grounds-boeing-180913262.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.632, "neg": 0.032, "neu": 0.929, "pos": 0.039}}, {"date": "2024-01-07T17:11:57+00:00", "title": "Explainer-What is the panel that blew off a Boeing plane in mid-air?", "content": "(Reuters) - A piece of fuselage tore off the left side of an Alaska Airlines-operated Boeing 737 MAX 9 jet as it climbed following takeoff from Portland, Oregon, en route to Ontario, California, forcing pilots to turn back and land safely with all 171 passengers and six crew on board.\n\nThe panel that tore off is a plug put in place on some MAX 9s instead of an additional emergency exit, but not every plane is manufactured in such a way.\n\nWHAT HAPPENED?\n\nAs Alaska Air Flight 1282 reached just over 16,000 feet on Friday, the panel tore off from the side of the jet, leaving a neat, refrigerator-sized, rectangular hole in the aircraft. The pilot immediately signaled that the plane would have to land.\n\nWHY IS THIS PANEL THERE?\n\nThe 737 MAX 9, currently Boeing's largest single-aisle plane, can seat up to 220 people. It includes an optional extra door to allow for the approved number of evacuation paths whenever carriers opt to install the maximum number of seats.\n\nPlanes that do not opt for additional seating can replace that door with a panel, or plug. Door plugs have been used to adapt aircraft and offer flexible layouts across the industry for years.\n\nHOW MANY OF THESE PLANES ARE THERE?\n\nOf the 200-plus 737 MAX 9 planes Boeing has delivered, 171 have this panel in place of a door. In the United States, the carriers using that panel are United and Alaska. Other carriers that have grounded planes include Panama's Copa Airlines, Aeromexico and Turkish Airlines.\n\nWHO MAKES THIS PANEL? HOW IS IT MADE?\n\nThe fuselage for Boeing 737s is made by Kansas-based Spirit AeroSystems, which separated from Boeing in 2005. Spirit is one of two suppliers that makes the plug doors on the MAX 9, but Boeing also has a key role in the plug installation process.\n\nHOW COMPLEX IS THE PRODUCTION PROCESS?\n\nThe installation is a two-tier process involving both manufacturing at Spirit's giant fuselage plant in Wichita, Kansas, and a Boeing factory outside Seattle, the sources said.\n\nStory continues\n\nAs part of the production process, Spirit builds fuselages for 737s and sends them by train with the special door assembly “semi-rigged,” according to a source familiar with production.\n\nAt its Renton, Washington, plant, Boeing typically removes the pop-out door and uses the gap to load interiors. Then, the part is put back and the installation is completed. Finally, the hull is pressurized to 150% to make sure everything is working correctly.\n\nThe process means that finding out where any flaw was introduced during assembly may not be clear-cut, sources told Reuters.\n\n(Reporting by Valerie Insinna and David Gaffen; Editing by Leslie Adler)", "link": "https://finance.yahoo.com/news/explainer-panel-blew-off-boeing-171157608.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.988, "neg": 0.004, "neu": 0.906, "pos": 0.09}}, {"date": "2024-01-07T16:41:00+00:00", "title": "Europe’s Decision to Ground Boeing 737 MAX-9 Jets Tells Investors Something", "content": "The FAA ordered the temporary grounding of 737 MAX-9 jets on Saturday. On Sunday, the EU aviation regulator did the same thing.\n\nContinue reading", "link": "https://finance.yahoo.com/m/71fad86b-ad88-3614-96be-79176cccea31/europe%E2%80%99s-decision-to-ground.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-01-07T06:49:00+00:00", "title": "‘Pretty Terrifying’: Investigators Start Probe Into Blowout on Alaska Airlines Flight 1282", "content": "Officials from the National Transportation Safety Board have arrived in Portland to piece together why a gaping hole opened just after takeoff.\n\nContinue reading", "link": "https://finance.yahoo.com/m/ffa7c087-e578-38f1-af7c-fd60fdf99a4b/%E2%80%98pretty-terrifying%E2%80%99%3A.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0, "neu": 0.887, "pos": 0.113}}, {"date": "2024-01-07T05:35:32+00:00", "title": "Boeing checks hit paperwork snag; US investigators search for missing part", "content": "By David Shepardson, Valerie Insinna and Tim Hepher\n\n(Reuters) -Safety checks on some Boeing jets hit a snag over paperwork on Sunday, as U.S. authorities searched for a missing panel that blew off a new Boeing 737 MAX 9 jet in midair on Friday.\n\nThe Federal Aviation Administration on Saturday ordered the temporary grounding of 171 Boeing jets installed with the same panel after the eight-week-old Alaska Airlines jet was forced to make an emergency landing with a gap in the fuselage.\n\n\"They will remain grounded until the FAA is satisfied that they are safe,\" the agency said in a statement on Sunday.\n\nOn Saturday, the FAA initially said the required inspections would take four to eight hours, leading many in the industry to assume the planes could very quickly return to service.\n\nBut criteria for the checks have yet to be agreed between the FAA and Boeing, meaning airlines have yet to receive detailed instructions, people familiar with the matter said.\n\nThe FAA must approve Boeing's inspection criteria before inspections can be completed and planes can resume flights.\n\nOf the 171 planes covered by the order, 144 are operating in the United States, according to data from aviation analytics firm Cirium. Turkish Airlines, Panama's Copa Airlines and Aeromexico said they were grounding affected jets.\n\nTypically, whenever planemakers order routine maintenance checks, they get paperwork approved by regulators in advance.\n\nBut because the response to the unexpected Alaska incident was relatively swift, Boeing has not yet secured FAA approval to tell airlines how to carry out the regulator's order.\n\nThe FAA has the final word on how the order is implemented.\n\n\"While those steps are being completed, United has parked all of its 79 737 Max 9s,\" the airline said in a statement.\n\n\"We’ve begun steps such as removing the inner panel to access the emergency door, and begun preliminary inspections while awaiting final instructions,\" it said, adding:\n\nStory continues\n\n\"Inspections can be completed after final procedures are received from the FAA\".\n\nBoeing declined to comment on whether it had submitted its inspection criteria to the FAA, which had no further comment.\n\n'TERRIFYING'\n\nAlaska Airlines on Sunday canceled 163 flights, or 21%, and said travel disruptions from the grounding are expected to last through at least midweek. United canceled 230 flights on Sunday, or 8% of scheduled departures.\n\nThe door plug tore off the left side of an Alaska Airlines jet following takeoff from Portland, Oregon, en route to Ontario, California, forcing pilots to turn back and land safely with all 171 passengers and six crew on board.\n\n\"I imagine this was a pretty terrifying event. We don't often talk about psychological injuries, but I am sure that occurred here,\" National Transportation Safety Board (NTSB) Chair Jennifer Homendy told reporters on Saturday, adding that it was too early to say what caused the event.\n\nThe panel, put in place on some planes in lieu of an additional emergency exit, is likely to have landed somewhere in the western suburbs of Portland, but has not yet been found. Authorities have asked the public for help finding the panel.\n\nThe accident has put Boeing back under scrutiny as it awaits certification of its smaller MAX 7 as well as the larger MAX 10, which is needed to compete with a key Airbus model.\n\nIn 2019, global authorities subjected all MAX planes to a wider grounding that lasted 20 months after crashes in Ethiopia and Indonesia linked to poorly designed cockpit software killed a total of 346 people.\n\nBoeing has delivered 214 of the 737 MAX 9, or 15% of the more than 1,300 MAX aircraft in service, most of which can still fly.\n\n'VERY FORTUNATE'\n\nFriday's Alaska accident is the second to focus attention on the survivability of cabins coming within days of a collision at Tokyo's Haneda airport involving an Airbus A350 and a Japanese Coast Guard plane. No airline passengers were killed in either accident, though five crew on the Coast Guard turboprop died.\n\nIn the Alaska Airlines emergency, NTSB Chair Homendy said the two seats next to the portion of fuselage that blew out were unoccupied. There were some minor injuries, she said.\n\n\"We are very, very fortunate here that this didn't end up in something more tragic,\" Homendy said. Parts of the seat next to the fuselage, including the head rest, were missing.\n\nPortland police and fire departments did not respond to requests for comment on the search.\n\nThe extra exit door is typically installed by low-cost airlines using more seats that require additional evacuation routes. However, those doors are plugged on jets with fewer seats. To passengers, the area looks like a normal window seat.\n\nAirlines with ordinary doors instead of the special replacement panels can continue to fly the 737 MAX 9 jets.\n\nThe fuselage for Boeing 737s is made by Kansas-based Spirit AeroSystems, which also manufactured and installed the plug that suffered the blowout.\n\nBut sources familiar with the process said Boeing also has a potential role, since it typically removes the semi-fitted door panel after receiving the fuselages by rail from Spirit. It uses the gap to feed in cabin equipment and speed up production, before completing final installation.\n\nSpirit referred questions to Boeing, which did not respond to a request for comment on who carried out final installation.\n\nBoeing and Spirit have suffered a succession of production snags.\n\n(Reporting by David Shepardson, Valerie Insinna and Tim Hepher; Additional reporting by Lisa Barrington and Hannah Lang; Editing by Miral Fahmy, William Mallard, Bill Berkrot and Jonathan Oatis)", "link": "https://ca.finance.yahoo.com/news/ntsb-says-no-passengers-seated-053532932.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.956, "neg": 0.073, "neu": 0.864, "pos": 0.063}}, {"date": "2024-01-07T05:35:32+00:00", "title": "Boeing checks hit paperwork snag; US investigators search for missing part", "content": "By David Shepardson, Valerie Insinna and Tim Hepher\n\n(Reuters) - Safety checks on some Boeing jets hit a snag over paperwork on Sunday, as U.S. authorities searched for a missing panel that blew off a new Boeing 737 MAX 9 jet in midair on Friday.\n\nThe Federal Aviation Administration on Saturday ordered the temporary grounding of 171 Boeing jets installed with the same panel after the eight-week-old Alaska Airlines jet was forced to make an emergency landing with a gap in the fuselage.\n\n\"They will remain grounded until the FAA is satisfied that they are safe,\" the agency said in a statement on Sunday.\n\nOn Saturday, the FAA initially said the required inspections would take four to eight hours, leading many in the industry to assume the planes could very quickly return to service.\n\nBut criteria for the checks have yet to be agreed between the FAA and Boeing, meaning airlines have yet to receive detailed instructions, people familiar with the matter said.\n\nThe FAA must approve Boeing's inspection criteria before inspections can be completed and planes can resume flights.\n\nOf the 171 planes covered by the order, 144 are operating in the United States, according to data from aviation analytics firm Cirium. Turkish Airlines, Panama's Copa Airlines and Aeromexico said they were grounding affected jets.\n\nTypically, whenever planemakers order routine maintenance checks, they get paperwork approved by regulators in advance.\n\nBut because the response to the unexpected Alaska incident was relatively swift, Boeing has not yet secured FAA approval to tell airlines how to carry out the regulator's order.\n\nThe FAA has the final word on how the order is implemented.\n\n\"While those steps are being completed, United has parked all of its 79 737 Max 9s,\" the airline said in a statement.\n\n\"We’ve begun steps such as removing the inner panel to access the emergency door, and begun preliminary inspections while awaiting final instructions,\" it said, adding:\n\nStory continues\n\n\"Inspections can be completed after final procedures are received from the FAA\".\n\nBoeing declined to comment on whether it had submitted its inspection criteria to the FAA, which had no further comment.\n\n'TERRIFYING'\n\nAlaska Airlines on Sunday canceled 163 flights, or 21%, and said travel disruptions from the grounding are expected to last through at least midweek. United canceled 230 flights on Sunday, or 8% of scheduled departures.\n\nThe door plug tore off the left side of an Alaska Airlines jet following takeoff from Portland, Oregon, en route to Ontario, California, forcing pilots to turn back and land safely with all 171 passengers and six crew on board.\n\n\"I imagine this was a pretty terrifying event. We don't often talk about psychological injuries, but I am sure that occurred here,\" National Transportation Safety Board (NTSB) Chair Jennifer Homendy told reporters on Saturday, adding that it was too early to say what caused the event.\n\nThe panel, put in place on some planes in lieu of an additional emergency exit, is likely to have landed somewhere in the western suburbs of Portland, but has not yet been found. Authorities have asked the public for help finding the panel.\n\nThe accident has put Boeing back under scrutiny as it awaits certification of its smaller MAX 7 as well as the larger MAX 10, which is needed to compete with a key Airbus model.\n\nIn 2019, global authorities subjected all MAX planes to a wider grounding that lasted 20 months after crashes in Ethiopia and Indonesia linked to poorly designed cockpit software killed a total of 346 people.\n\nBoeing has delivered 214 of the 737 MAX 9, or 15% of the more than 1,300 MAX aircraft in service, most of which can still fly.\n\n'VERY FORTUNATE'\n\nFriday's Alaska accident is the second to focus attention on the survivability of cabins coming within days of a collision at Tokyo's Haneda airport involving an Airbus A350 and a Japanese Coast Guard plane. No airline passengers were killed in either accident, though five crew on the Coast Guard turboprop died.\n\nIn the Alaska Airlines emergency, NTSB Chair Homendy said the two seats next to the portion of fuselage that blew out were unoccupied. There were some minor injuries, she said.\n\n\"We are very, very fortunate here that this didn't end up in something more tragic,\" Homendy said. Parts of the seat next to the fuselage, including the head rest, were missing.\n\nPortland police and fire departments did not respond to requests for comment on the search.\n\nThe extra exit door is typically installed by low-cost airlines using more seats that require additional evacuation routes. However, those doors are plugged on jets with fewer seats. To passengers, the area looks like a normal window seat.\n\nAirlines with ordinary doors instead of the special replacement panels can continue to fly the 737 MAX 9 jets.\n\nThe fuselage for Boeing 737s is made by Kansas-based Spirit AeroSystems, which also manufactured and installed the plug that suffered the blowout.\n\nBut sources familiar with the process said Boeing also has a potential role, since it typically removes the semi-fitted door panel after receiving the fuselages by rail from Spirit. It uses the gap to feed in cabin equipment and speed up production, before completing final installation.\n\nSpirit referred questions to Boeing, which did not respond to a request for comment on who carried out final installation.\n\nBoeing and Spirit have suffered a succession of production snags.\n\n(Reporting by David Shepardson, Valerie Insinna and Tim Hepher; Additional reporting by Lisa Barrington and Hannah Lang; Editing by Miral Fahmy, William Mallard, Bill Berkrot and Jonathan Oatis)", "link": "https://finance.yahoo.com/news/boeing-checks-hit-paperwork-snag-053532645.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.956, "neg": 0.073, "neu": 0.864, "pos": 0.063}}, {"date": "2024-01-07T05:24:19+00:00", "title": "UPDATE 1-NTSB says no passengers seated near Boeing 737 MAX 9 fuselage that failed", "content": "(Adds details, quotes in paragraphs 2-3, 7-9)\n\nBy David Shepardson, Valerie Insinna and Tim Hepher\n\nJan 7 (Reuters - The head of the U.S. National Transportation Safety Board said no passengers were seated next to a cabin panel that blew out on an Alaska Airlines Boeing 737 MAX 9, forcing an emergency landing Friday in a potentially \"tragic\" incident.\n\nNTSB Chair Jennifer Homendy told a press conference late on Saturday the two seats next to the portion of fuselage that blew out were unoccupied.\n\n\"We are very, very fortunate here that this didn't end up in something more tragic,\" Homendy said. Parts of the seat next to the fuselage, including the head rest, were missing.\n\nThe Federal Aviation Administration (FAA) on Saturday grounded 171 Boeing 737 MAX 9 jetliners for safety checks after the emergency landing of the plane that had been in service for just eight weeks.\n\nA piece of fuselage tore off the left side of the jet as it climbed following takeoff from Portland, Oregon, en route to Ontario, California, forcing pilots to turn back and land safely with all 171 passengers and six crew on board. Some minor injuries were reported, Homendy said.\n\nThe FAA did not rule out further action as a probe began into the potential structural failure that left a rectangular hole in an area of fuselage reserved for an optional extra door but which is plugged and deactivated on Alaska Air's aircraft.\n\nInvestigators will look at maintenance records, the pressurization system and the door components. Homendy said. \"We'll go where the investigation takes us,\" she said, asking for the public's help in recovering the missing door plug believed to be in a suburb west of Portland.\n\nHomendy praised the FAA for swiftly grounding the MAX 9 to \"ensure continued safety.\"\n\nAlaska Air said it had halted flights by 18 of its MAX 9 planes that it had resumed using Saturday after recent in-depth inspections. The airline said it was in discussions with the FAA \"to determine what, if any, further work is required before these aircraft are returned to service.\" The FAA could announce inspection requirements as early as Sunday, officials said.\n\nStory continues\n\nThe Boeing 737 MAX 9s fitted with a special door replacement \"plug\" cannot fly until they are inspected and repaired if necessary, the FAA said.\n\nA section of the fuselage reserved for the optional door had vanished, leaving a neat door-shaped gap.\n\nThe extra door is typically installed by low-cost airlines using extra seats that require more paths for evacuation. However, those doors are permanently plugged, or deactivated, on jets with fewer seats, including those of Alaska Air.\n\nThe fuselage for Boeing 737s is made by Kansas-based Spirit AeroSystems, which separated from Boeing in 2005. Spirit manufactured and installed the particular plug door that suffered the blowout, a source told Reuters on Saturday.\n\nThe MAX 9 represents about 220 of the 1,400 MAX jets delivered so far and most of them have the deactivated door, meaning they are potentially covered by the order.\n\nBoeing said it supported the FAA decision.\n\nMAX planes were grounded worldwide for 20 months after crashes in Ethiopia and Indonesia, linked to poorly designed cockpit software, killed nearly 350 people about five years ago.\n\nALASKA, UNITED AFFECTED\n\nAlaska Air and United Airlines are the only U.S. carriers using the MAX 9. Alaska Air canceled 160 flights on Saturday, or 20% of scheduled trips, while United canceled 104 flights or 4% of departures.\n\nAlaska Air said the travel disruptions from the grounding were expected to last through at least mid-week.\n\nBoeing is awaiting certification of its smaller MAX 7 and larger MAX 10, which are needed to compete with the Airbus A321neo model.\n\nBoeing has suffered numerous production issues on the MAX planes in the years since the crashes. The manufacturer on Dec. 28 urged airlines to inspect all 737 MAX airplanes for a possible loose bolt in the rudder control system.\n\nFlight 1282 had reached just over 16,000 feet when the blowout happened, according to FlightRadar24. \"We'd like to get down,\" the pilot told air traffic control, according to a recording posted on liveatc.net.\n\n\"We are declaring an emergency. We do need to come down to 10,000,\" the pilot added, referring to the initial staging altitude for such emergencies, below which breathing is considered possible for healthy people without extra oxygen. (Reporting by David Shepardson, Valerie Insinna and Tim Hepher; Editing by Miral Fahmy and William Mallard)", "link": "https://finance.yahoo.com/news/1-ntsb-says-no-passengers-052419059.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.954, "neg": 0.05, "neu": 0.878, "pos": 0.073}}, {"date": "2024-01-07T02:02:33+00:00", "title": "Alaska halts flights by 18 additional MAX 9 planes after FAA directive", "content": "Jan 6 (Reuters) - Alaska Airlines said it had halted flights by 18 Boeing MAX 9 airplanes pending potential additional maintenance work that U.S. regulators may require.\n\nThe airline had resumed flights on 18 of its 65 MAX 9 planes that had received in-depth inspections as part of heavy maintenance checks.\n\nThe entire Alaska MAX 9 fleet was voluntarily grounded early on Saturday after one of its planes had been forced to make an emergency landing.\n\nAlaska Airlines said it was halting the use of MAX 9 planes after receiving an emergency directive from the Federal Aviation Administration and was \"in touch with the FAA to determine what, if any, further work is required before these aircraft are returned to service.\" (Reporting by David Shepardson; Editing by William Mallard)", "link": "https://finance.yahoo.com/news/faa-orders-temporary-grounding-boeing-175041275.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.802, "neg": 0.064, "neu": 0.936, "pos": 0}}, {"date": "2024-01-07T02:01:17+00:00", "title": "Spirit Aero made blowout part but Boeing has key role -sources", "content": "By Valerie Insinna, Tim Hepher and David Shepardson\n\nWASHINGTON (Reuters) - Aerospace supplier Spirit AeroSystems manufactured and initially installed the fuselage part on a brand-new Boeing 737 Max 9 jet that suffered a blowout on Friday, but Boeing also has a key role in the usual completion process, sources told Reuters.\n\nBecause of a complex, two-tier installation process, investigators are expected to examine whether any flaws occurred at Spirit's giant fuselage plant in Wichita, Kansas, or at the Boeing factory outside Seattle, the sources said.\n\nRegulators on Saturday grounded most Boeing 737 MAX 9s for safety checks after the eight-week-old Alaska Airlines plane, carrying 171 passengers and six crew, lost a door-replacement panel during a U.S. flight, before landing safely with a gaping hole in its side on Friday night.\n\nThe 737 MAX 9, currently Boeing's largest single-aisle, seating up to 220 people, includes an optional extra door to allow for the approved number of evacuation paths whenever carriers opt to install the maximum number of seats.\n\nBut most airlines using the jet have chosen a looser layout based on a smaller number of seats and do not need the surplus door, which adds weight and reduces flexibility in the cabin. Instead the door is deactivated before delivery, using a \"plug.\"\n\nOther optional doors or fill-in replacement structures were also offered on a predecessor model, the 737-900ER.\n\nAs part of the production process, Spirit builds fuselages for 737s and sends them by train with the special door assembly “semi-rigged,” one of the people said.\n\n“They are fitted but not completed,\" the person said.\n\nAt its Renton, Washington, plant, Boeing typically removes the pop-out, or non-functioning, door and uses the gap to load interiors. Then, the part is put back and the installation in completed. Finally, the hull is pressurized to 150% to make sure everything is working correctly, the person said.\n\nStory continues\n\nThe process means that finding out where any flaw was introduced during assembly may not be clear-cut, said the sources, who asked not to be named as details of the probe are confidential.\n\nDoor plugs have been used to adapt aircraft and offer flexible layouts across the industry for years.\n\nThe investigation will include structural experts to see whether design or manufacturing played a role in the accident.\n\n\"The assumption is that it was installed or rigged incorrectly,” one of the sources said.\n\nBoeing and Spirit declined comment on industrial processes.\n\n(Reporting by Valerie Insinna, Tim Hepher and David Shepardson; Editing by Chris Reese and Leslie Adler)", "link": "https://finance.yahoo.com/news/spirit-aero-made-blowout-part-020117732.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.971, "neg": 0.028, "neu": 0.88, "pos": 0.091}}, {"date": "2024-01-07T01:56:30+00:00", "title": "UPDATE 1-Spirit Aero made blowout part but Boeing has key role -sources", "content": "(Adds details of production process from paragraph 2)\n\nBy Valerie Insinna, Tim Hepher and David Shepardson\n\nWASHINGTON, Jan 6 (Reuters) - Aerospace supplier Spirit AeroSystems manufactured and initially installed the fuselage part on a brand-new Boeing 737 Max 9 jet that suffered a blowout on Friday, but Boeing also has a key role in the usual completion process, sources told Reuters.\n\nBecause of a complex, two-tier installation process, investigators are expected to examine whether any flaws occurred at Spirit's giant fuselage plant in Wichita, Kansas, or at the Boeing factory outside Seattle, the sources said.\n\nRegulators on Saturday\n\ngrounded most\n\nBoeing 737 MAX 9s for safety checks after the eight-week-old Alaska Airlines plane, carrying 171 passengers and six crew, lost a door-replacement panel during a U.S. flight, before landing safely with a gaping hole in its side on Friday night.\n\nThe 737 MAX 9, currently Boeing's largest single-aisle, seating up to 220 people, includes an optional extra door to allow for the approved number of evacuation paths whenever carriers opt to install the maximum number of seats.\n\nBut most airlines using the jet have chosen a looser layout based on a smaller number of seats and do not need the surplus door, which adds weight and reduces flexibility in the cabin. Instead the door is deactivated before delivery, using a \"plug.\"\n\nOther optional doors or fill-in replacement structures were also offered on a predecessor model, the 737-900ER.\n\nAs part of the production process, Spirit builds fuselages for 737s and sends them by train with the special door assembly “semi-rigged,” one of the people said.\n\n“They are fitted but not completed,\" the person said.\n\nAt its Renton, Washington, plant, Boeing typically removes the pop-out, or non-functioning, door and uses the gap to load interiors. Then, the part is put back and the installation in completed. Finally, the hull is pressurized to 150% to make sure everything is working correctly, the person said.\n\nStory continues\n\nThe process means that finding out where any flaw was introduced during assembly may not be clear-cut, said the sources, who asked not to be named as details of the probe are confidential.\n\nDoor plugs have been used to adapt aircraft and offer flexible layouts across the industry for years.\n\nThe investigation will include structural experts to see whether design or manufacturing played a role in the accident.\n\n\"The assumption is that it was installed or rigged incorrectly,” one of the sources said.\n\nBoeing and Spirit declined comment on industrial processes. (Reporting by Valerie Insinna, Tim Hepher and David Shepardson Editing by Chris Reese and Leslie Adler)", "link": "https://finance.yahoo.com/news/1-spirit-aero-made-blowout-015630099.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.971, "neg": 0.028, "neu": 0.883, "pos": 0.089}}, {"date": "2024-01-07T00:47:00+00:00", "title": "‘Is It OK if I Hold Your Hand?’: Inside the Cabin of Alaska Airlines Flight 1282", "content": "A Boeing 737 MAX 9 flight from Alaska Airlines made an emergency landing in Portland, Ore., after a section of the aircraft ripped away in midair on Friday. Passengers on Alaska Airlines flight 1282—which on Friday afternoon was en route to Ontario, Calif., from Portland International Airport—were fearful for their lives. The flight, however, landed back at the Portland airport less than 30 minutes after takeoff, with 171 passengers and six crew members aboard, all of them alive.\n\nContinue reading", "link": "https://finance.yahoo.com/m/41947545-ae95-375e-8d39-8a4764f719e2/%E2%80%98is-it-ok-if-i-hold-your.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.477, "neg": 0.07, "neu": 0.885, "pos": 0.045}}, {"date": "2024-01-06T22:49:52+00:00", "title": "Grounding of Boeing 737s is latest blow to business for aviation giant", "content": "A Boeing plane flown by Alaska Airlines suffered a safety failure on Saturday - Stephen Brashear/Getty Images\n\nThe decision by American regulators on Saturday night to temporarily ground several Boeing 737 jets is a massive blow to the US aircraft giant, as well as to the airlines that use its planes.\n\nFirst launched in 1967, the Boeing 737 is one of the most commercially successful aeroplanes ever produced.\n\nThe narrow-body airliners make up the majority of the aviation giant’s sales volumes with around 10,000 delivered since their inception.\n\nBut in 2018 and 2019, two fatal crashes claimed the lives of 346 passengers. This led to a 20-month grounding of the planes while significant changes were made.\n\nNow, after the fuselage of a brand new 737 Max 9 flown by Alaska Airlines aircraft blew out at 16,000 feet and left passengers clinging to their seats, the future of the brand has been called into question once again.\n\nAlaska Airlines grounded more than 60 737s in an immediate response to the safety failure on Saturday morning, while civil aviation authorities around the globe held talks on the incident.\n\nThe FAA said an investigation was under way, while the country’s National Transportation Safety Board sent a team to inspect the faulty plane.\n\nThe UK Civil Aviation Authority said there were no UK-registered 737 MAX 9 aircrafts but said they would have to be inspected before arriving in British airspace.\n\n“We have written to non-UK and foreign permit carriers to ask if inspections have been undertaken prior to operation in UK airspace,” it said on X, formerly known as Twitter.\n\nThe organisation said it was also monitoring the situation “very closely”, while Boeing said it “stood ready in support”.\n\nChina’s aviation regulator conducted an emergency meeting to consider a response to the incident, including a possible grounding of the Boeing Max fleet in the country, Bloomberg reported.\n\nChina was the first to ground Boeing’s 737 Max aircrafts after the 2018 and 2019 crashes.\n\nIt comes just a week after the FAA said it was “closely monitoring targeted inspections” of Boeing 737 Max models “to look for a possible loose bolt in the rudder control system”.\n\nStory continues\n\nFear that company’s value may be impacted\n\nAnalysts said inspections of Boeing’s 737 fleet could weigh heavily on the company and further delay the roll out of its Max 10 – of which Ryanair has made 150 orders.\n\nNick Cunningham, analyst at Agency Partners, said the valuation of Boeing’s stock rests on it eventually delivering 60 of these planes a month. Currently, it is delivering 20 new and 10 from its warehouse.\n\nMr Cunningham added: “Boeing looks fully valued even if it can pull off 60 of these planes a month, and implicitly therefore, overvalued if it can’t.\n\n“The company may need to re-inspect and modify lots of its 737 aircrafts [after the incident on Alaska Airlines]. This could even affect certification of its Max 10.\n\n“The Federal Aviation Administration has been ultra cautious on certification since the crashes. It now insists on signing off production where previously manufacturers would.”\n\nAirlines are currently waiting on Boeing for further instruction. Fly Dubai, which has three Boeing 737 Max 9 aircrafts in its fleet, said the planes “have a different configuration with ‘mid-aft’ cabin exits” and that it will follow any guidance issued by Boeing once more information is available – including carrying out any further inspections if required.\n\nUnited Airlines, which is understood to have the most Boeing 737 Max 9 aircrafts of any airline, did not respond to requests for comment. United has nearly 80 737 Max 9 planes in its fleet.\n\nAlaska Airlines said on Saturday night it had carried out inspections on more than a quarter of its “737-9 fleet with no concerning findings”, but said it agreed with and fully supported the FAA’s grounding decision.\n\nBoeing in a statement issued on X said: “Safety is our top priority and we deeply regret the impact this event has had on our customers and their passengers.\n\n“We agree with and fully support the FAA’s decision to require immediate inspections of 737-9 airplanes with the same configuration as the affected airplane.\n\n“In addition, a Boeing technical team is supporting the NTSB’s investigation into last night’s event.\n\n“We will remain in close contact with our regulator and customers.”", "link": "https://uk.finance.yahoo.com/news/grounding-boeing-737s-latest-blow-224952320.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.932, "neg": 0.048, "neu": 0.884, "pos": 0.068}}, {"date": "2024-01-06T22:15:00+00:00", "title": "Boeing Is Back in the Spotlight—This Time Over a MAX-9", "content": "The aircraft maker’s executives race to reassure airlines after latest incident, as FAA grounds 171 MAX-9 jets\n\nContinue reading", "link": "https://finance.yahoo.com/m/d56a2418-bb36-3eaa-a104-64adc7a385ad/boeing-is-back-in-the.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0, "neu": 0.882, "pos": 0.118}}, {"date": "2024-01-06T20:25:48+00:00", "title": "UPDATE 1-Vulcan rocket's space debut will be crucial for Boeing-Lockheed venture as sale talks loom", "content": "(Adds quote from ULA CEO)\n\nBy Joey Roulette\n\nWASHINGTON, Jan 6 (Reuters) - A lot is riding on the first launch of the new Vulcan rocket by the United Launch Alliance, a joint venture of Boeing and Lockheed Martin .\n\nA successful launch at Cape Canaveral next week would allow ULA to fulfill a deep backlog of missions worth hundreds of millions of dollars and establish a greater competitive footing with Elon Musk's SpaceX.\n\nAnd it could prove vital to plans by the two U.S. aerospace firms to sell their joint venture.\n\n\"It's a very nervous time for them,\" said George Sowers, ULA's former chief scientist, who was key to Vulcan's creation. \"It's really the future of their company.\"\n\nThe debut mission is a long-awaited milestone after months of various delays in the final stretch of Vulcan's development, and following a testing mishap last year with a Vulcan upper-stage booster. ULA CEO Tory Bruno has said that Vulcan has performed well during recent ground tests.\n\n\"That is an incredibly complicated machine, it's tremendously powerful. Everything has to work,\" Bruno said Saturday at Vulcan's launch pad. \"It is always inherently risky to fly a rocket. But what we're good at is managing that risk.\"\n\nThe mission checklist includes carrying a moon lander that is aiming to make the first U.S. lunar soft landing in half a century. The rocket will be using for the first time engines supplied by Jeff Bezos' space firm Blue Origin.\n\nVulcan's launch also comes as Boeing and Lockheed, which formed ULA in a 2006 merger of their rocket programs, are looking to sell the jointly owned venture, according to three people familiar with the talks.\n\nThe talks have been a complex, drawn-out process for which Vulcan's launch could have crucial implications, said the sources, who asked not to be identified.\n\nULA declined to comment on any potential deal talks. Bruno has previously said his company could be ripe for an acquisition.\n\nStory continues\n\nBoeing and Lockheed declined to comment.\n\nVulcan's debut launch, scheduled for 2:18 a.m. ET (0718 GMT) on Monday, is the culmination of a years-long development effort sprung largely from ULA's need to replace its current Atlas V rocket. That rocket's Russian-imported engines drew criticism from lawmakers that led to its planned retirement.\n\nThe retirement of Atlas - plus Vulcan's other rocket, Delta - will leave the 200-foot-tall (60-m) Vulcan to handle dozens of lucrative missions and serve as the company's sole challenger to SpaceX's reusable Falcon 9.\n\nVulcan's debut mission will send a privately built lander from space robotics firm Astrobotic to the moon. But the launch itself will also serve as the first of two certification flights required by the U.S. Space Force before Vulcan can fly Pentagon satellites.\n\nSpace Force is a core customer for Vulcan - the military branch in 2020 picked ULA's Vulcan and its retiring Atlas V to launch 60% of the Pentagon's missions through around 2027.\n\nPriced lower than its predecessors at roughly $110 million per launch, Vulcan will seek to reclaim market share from Falcon 9, which is priced at roughly $62 million per launch. SpaceX's cheaper flights have eroded ULA's dominance of government satellite launches in the past decade.\n\nVulcan will also compete with Blue Origin's forthcoming New Glenn rocket, which uses the same engines as Vulcan.\n\nACQUISITION TALKS\n\nAcquisition talks for ULA have been underway for more than a year, with dozens of firms, including Blue Origin, having expressed interest, the sources said.\n\nBlue Origin did not respond to a request for comment.\n\nBoeing's and Lockheed's rationale and timing for selling ULA are unclear. But there have been significant changes to the U.S. space industry since ULA's formation in 2006, when it was created to dominate government launches and clinch some commercial demand from the then-nascent satellite market.\n\nGrowth of the commercial market was slower than expected, said Richard McKinney, an aerospace consultant and former director of the Air Force's space acquisition unit until 2007. \"But it looks like we're about there now.\"\n\nAmazon's planned Kuiper network is set to bring in crucial launch revenue for ULA. That has helped provide Vulcan with a multibillion-dollar backlog of roughly 70 missions split somewhat evenly between government and commercial customers, Bruno has said.\n\nVulcan's development and ULA's shift away from its Atlas and Delta rockets have made estimates of the company's valuation hard to pin down, but analysts speculate it could be $2 billion to $3 billion.\n\nBoeing and Lockheed each have their own competing space units. Lockheed, among other pursuits, has ventured into building moon rovers and made strategic investments in ABL Space, a small-launch startup with plans to build larger rockets in the future.\n\nBoeing's space program has struggled, primarily with its long-delayed Starliner astronaut capsule that rivals SpaceX's more established Crew Dragon. Troubles with Starliner development have cost Boeing some $1.5 billion since 2014.\n\nNew ownership could allow ULA to innovate beyond the launch sector in ways its corporate parents were unwilling to allow, former ULA chief scientist Sowers said.\n\n\"The charter of the company was fixed, and it was very limiting,\" he said. \"They're always competing and they couldn't agree on anything. We were not allowed to innovate.\" (Reporting by Joey Roulette; editing by Ben Klayman, Rosalba O'Brien and Leslie Adler)", "link": "https://finance.yahoo.com/news/1-vulcan-rockets-space-debut-202548180.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA"], "tags": [], "sentiment": {"polarity": 0.932, "neg": 0.025, "neu": 0.927, "pos": 0.048}}, {"date": "2024-01-06T20:05:00+00:00", "title": "Alaska Airlines Incident Is Another Blow for Boeing", "content": "The incident is just the latest in a long string of safety issues for Boeing’s 737 MAX, among them two fatal crashes in 2018 and 2019.\n\nContinue reading", "link": "https://finance.yahoo.com/m/7a968f1e-ff67-3932-a55d-3b924ad5cf2c/alaska-airlines-incident-is.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.178, "neg": 0.112, "neu": 0.799, "pos": 0.089}}, {"date": "2024-01-06T19:32:00+00:00", "title": "FAA Orders Temporary Grounding of Many Boeing 737 MAX-9s", "content": "Alaska Air Flight 1282 was able to return to the Portland airport after losing a portion of its fuselage shortly after takeoff.\n\nContinue reading", "link": "https://finance.yahoo.com/m/ccdd3f45-14b1-3232-9e71-2d1c07186e98/faa-orders-temporary.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.382, "neg": 0.106, "neu": 0.894, "pos": 0}}, {"date": "2024-01-06T19:07:50+00:00", "title": "Boeing supports US regulators' order for inspections after Alaska Air incident", "content": "Jan 6 (Reuters) - Boeing said on Saturday it fully supports the U.S. Federal Aviation Administration's decision to require inspections of Max 737-9 planes \"with the same configuration\" as the aircraft that was forced to land late Friday after a cabin panel blowout.\n\nU.S. regulators ordered temporary grounding of 171 Boeing 737 MAX 9 aircraft for safety checks after the blowout on a plane operated by Alaska Airlines.\n\nBoeing also said a technical team is supporting the U.S. National Transportation Safety Board's investigation. (Reporting By David Gaffen Editing by Chris Reese)", "link": "https://finance.yahoo.com/news/boeing-supports-us-regulators-order-190750731.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.806, "neg": 0.032, "neu": 0.849, "pos": 0.119}}, {"date": "2024-01-06T19:00:21+00:00", "title": "FAA Grounds Boeing 737 MAX After Portland Incident. Eyes On Spirit.", "content": "Boeing and Spirit AeroSystems face another 737 Max defect question after a close call for Alaska Airlines.\n\nContinue reading", "link": "https://finance.yahoo.com/m/0cb7d3f3-f79f-3795-9359-a61474b982bc/faa-grounds-boeing-737-max.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.178, "neg": 0.119, "neu": 0.796, "pos": 0.085}}, {"date": "2024-01-06T18:44:38+00:00", "title": "FAA requiring inspections before some Boeing 737 MAX 9 flights can resume", "content": "By David Shepardson\n\nWASHINGTON (Reuters) -The Federal Aviation Administration issued a directive on Saturday temporarily grounding certain Boeing 737 MAX 9 airplanes until inspections are performed after an Alaska Airlines flight on Friday made an emergency landing following a cabin panel blowout.\n\nThe directive covers 171 airplanes, but leaves open questions about how recently inspections must have occurred before further flights can take place or detail the precise inspection requirements.\n\nThe FAA said the potential in-flight loss of a mid-cabin door plug \"could result in injury to passengers and crew, the door impacting the airplane, and/or loss of control of the airplane.\"\n\nFriday's structural failure of the Alaska Airline-operated plane left a rectangular hole in an area of fuselage reserved for an optional extra door, but which is disactivated on Alaska's aircraft and fitted with a special door replacement \"plug.\"\n\nThe FAA's emergency airworthiness directive requires operators to inspect aircraft before further flight that do not meet the required inspection cycles, but it does not detail the precise figure.\n\nThe FAA must approve any inspection requirements that Boeing proposes.\n\nRequired inspections will take around four to eight hours per aircraft, the FAA said.\n\nAlaska Airlines said that after it had voluntarily temporarily grounded its fleet of 65 737 MAX 9 aircraft early Saturday, \"it was determined that 18 had in-depth and thorough plug door inspections performed as part of a recent heavy maintenance visit. These 18 aircraft were cleared to return to service today.\"\n\nUnited Airlines, the only other U.S. airline that operates Boeing's 737 MAX 9 jets, said it temporarily suspended service of 45 737 MAX 9 aircraft but would continue to operate 33 that have already received the necessary inspection that is required by the FAA.\n\nAlaska canceled about 140 flights on Saturday, or 18% of scheduled operations, according to FlightAware, while United said it expected to cancel 60 flights because of the service issue.\n\nStory continues\n\nThe president of the Association of Flight Attendants-CWA, Sara Nelson, said the union \"supports the FAA's quick and decisive action to ground certain 737 MAX 9 Fleet that do not meet the inspection cycles specified in the Emergency Airworthiness Directive.\"\n\nLawmakers called for quick action if any issues are discovered. \"The NTSB (National Transporation Safety Board) and FAA must thoroughly investigate this incident to address an alarming breach of safety,\" said Senator Ted Cruz, the top Republican on the committee overseeing the FAA.\n\n(Reporting by David Shepardson; Editing by Daniel Wallis and Chris Reese)", "link": "https://finance.yahoo.com/news/faa-requiring-inspections-boeing-737-184438254.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.178, "neg": 0.07, "neu": 0.859, "pos": 0.071}}, {"date": "2024-01-06T18:40:10+00:00", "title": "FAA Orders Temporary Grounding of Certain Boeing 737 Maxes", "content": "The Federal Aviation Administration said Saturday it would temporarily ground certain Boeing 737 Max aircraft and require immediate inspections, after a section of one aircraft blew off during an Alaska Airlines flight on Friday.\n\n“The FAA is requiring immediate inspections of certain Boeing 737 Max 9 planes before they can return to flight,” FAA Administrator Mike Whitaker said Saturday. The inspections are estimated to take 4-8 hours per aircraft.\n\nFollowing the FAA’s order, United Airlines joined Alaska in temporarily grounding certain 737-9 aircraft. The Chicago-based carrier operates 79 737-9s, and has already inspected 33 planes. It anticipates roughly 60 flight cancellations on Saturday due to the temporary grounding.\n\nThe FAA’s order also affects any 737-9s flying to the U.S. Aeromexico, Copa Airlines, and Icelandair fly the plane on U.S. routes, Cirium Diio schedules show.\n\nBoeing said Saturday they “agree with and fully support” the FAA’s decision to mandate inspections of certain 737-9 aircraft. The planemaker has sent a technical team to aid with the investigation into the Alaska incident.\n\nThe temporary grounding is the latest blow to the 737 Max after the type was grounded for nearly two years after two fatal crashes in Ethiopia and Indonesia. The plane, including the -8 and -9 variants, was recertified by the FAA for passenger flights in November 2020.\n\nThere have been no notable incidents with Maxes in the three years since it was recertifed, and Boeing has sold hundreds of the planes to airlines around the world.\n\nIn an unrelated issue in late December, Boeing discovered a nut that was not properly tightened in an undelivered aircraft after an international operator discovered a bolt with a missing nut in a rudder-control system. Boeing recommended that airlines inspect their 737 MAX airplanes.\n\nThe FAA’s move follows the sudden decompression of a two-month old 737-9 on Friday. Alaska flight AS1282 was flying from Portland, Ore., to Ontario, Calif., when a section of the plane’s fuselage blew off shortly after takeoff and caused a sudden decompression on board.\n\nStory continues\n\nThe plane was able to land safely back at Portland International Airport and no one was seriously injured.\n\nThe incident prompted Alaska to temporarily ground its fleet of 65 737-9s for inspection. Alaska said it had completed thorough inspections for 18 of the 65 aircraft, and those were now back in service. The carrier added it expected to complete the inspections for the fleet within the next few days.\n\nThe National Transportation Safety Board is investigating the Alaska Airlines incident.\n\nGet breaking travel news and exclusive hotel, airline, and tourism research and insights at Skift.com.", "link": "https://finance.yahoo.com/news/faa-orders-temporary-grounding-certain-184010184.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.612, "neg": 0.033, "neu": 0.92, "pos": 0.047}}, {"date": "2024-01-06T18:32:58+00:00", "title": "UPDATE 2-FAA requiring inspections before some Boeing 737 MAX 9 flights can resume", "content": "(Recasts with FAA issuing directive; adds United statement, senator's comment)\n\nBy David Shepardson\n\nWASHINGTON, Jan 6 (Reuters) - The Federal Aviation Administration issued a directive on Saturday temporarily grounding certain Boeing 737 MAX 9 airplanes until inspections are performed after an Alaska Airlines flight on Friday made an emergency landing following a cabin panel blowout.\n\nThe directive covers 171 airplanes, but leaves open questions about how recently inspections must have occurred before further flights can take place or detail the precise inspection requirements.\n\nThe FAA said the potential in-flight loss of a mid-cabin door plug \"could result in injury to passengers and crew, the door impacting the airplane, and/or loss of control of the airplane.\"\n\nFriday's structural failure\n\nof the Alaska Airline-operated plane left a rectangular hole in an area of fuselage reserved for an optional extra door, but which is disactivated on Alaska's aircraft and fitted with a special door replacement \"plug.\"\n\nThe FAA's emergency airworthiness directive requires operators to inspect aircraft before further flight that do not meet the required inspection cycles, but it does not detail the precise figure.\n\nThe FAA must approve any inspection requirements that Boeing proposes.\n\nRequired inspections will take around four to eight hours per aircraft, the FAA said.\n\nAlaska Airlines said that after it had voluntarily temporarily grounded its fleet of 65 737 MAX 9 aircraft early Saturday, \"it was determined that 18 had in-depth and thorough plug door inspections performed as part of a recent heavy maintenance visit. These 18 aircraft were cleared to return to service today.\"\n\nUnited Airlines, the only other U.S. airline that operates Boeing's 737 MAX 9 jets, said it temporarily suspended service of 45 737 MAX 9 aircraft but would continue to operate 33 that have already received the necessary inspection that is required by the FAA.\n\nStory continues\n\nAlaska canceled about 140 flights on Saturday, or 18% of scheduled operations, according to FlightAware, while United said it expected to cancel 60 flights because of the service issue.\n\nThe president of the Association of Flight Attendants-CWA, Sara Nelson, said the union \"supports the FAA's quick and decisive action to ground certain 737 MAX 9 Fleet that do not meet the inspection cycles specified in the Emergency Airworthiness Directive.\"\n\nLawmakers called for quick action if any issues are discovered. \"The NTSB (National Transporation Safety Board) and FAA must thoroughly investigate this incident to address an alarming breach of safety,\" said Senator Ted Cruz, the top Republican on the committee overseeing the FAA. (Reporting by David Shepardson; Editing by Daniel Wallis and Chris Reese)", "link": "https://finance.yahoo.com/news/1-faa-requiring-inspections-boeing-183258132.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0.068, "neu": 0.859, "pos": 0.073}}, {"date": "2024-01-06T18:07:00+00:00", "title": "FAA Orders Grounding of Some Boeing 737 MAX-9 Jets After Emergency Landing", "content": "A Boeing 737 MAX-9 flight from Alaska Airlines made an emergency landing in Portland, Ore., after a section of the aircraft ripped away in midair on Friday. The Federal Aviation Administration ordered a temporary grounding and immediate inspections of some Boeing 737 MAX jets, after an emergency landing when a section of one of the jets ripped away in midair. The FAA said its order would affect about 171 of the Boeing MAX-9 jets, which is a bigger variant of the Boeing 737 MAX-8 that was involved in two fatal accidents.\n\nContinue reading", "link": "https://finance.yahoo.com/m/83540f5f-a9b1-3c55-847b-35e66d58b77b/faa-orders-grounding-of-some.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.875, "neg": 0.116, "neu": 0.884, "pos": 0}}, {"date": "2024-01-06T17:38:30+00:00", "title": "After Boeing 737 Max planes crashed and killed hundreds of people about five years ago, one just lost a chunk of its fuselage in midair", "content": "With Alaska Airlines temporarily grounding all of its Boeing 737 Max 9 aircraft late Friday after a terrifying incident earlier in the day, memories of aviation disasters involving the 737 Max in 2018 and 2019 are being rekindled.\n\nFortunately, nobody died yesterday when a section of fuselage blew out for reasons still under investigation. The seat next to the gaping hole had been unoccupied, and other passengers in the row had their seatbelts on. The plane made an emergency landing in Portland, Ore., where it had departed from en route to the Los Angeles area.\n\nThe incident appears to be unrelated to the earlier disasters, which led to the 737 Max being grounded worldwide from March 2019 to December 2020, aviation expert John Strickland told BBC News.\n\n\"While we know little evidence of why this section of the fuselage has come out,” he said, “this has nothing to do with the aircraft being grounded for 18 months.”\n\nThe Federal Aviation Administration (FAA) said Saturday it will order the temporary grounding and inspections of certain 737 Max 9 aircraft.\n\nA Boeing spokesperson told Fortune: “Safety is our top priority and we deeply regret the impact this event has had on our customers and their passengers. We agree with and fully support the FAA’s decision to require immediate inspections of 737-9 airplanes with the same configuration as the affected airplane. In addition, a Boeing technical team is supporting the NTSB’s investigation into last night’s event. We will remain in close contact with our regulator and customers.”\n\nAlaska Airlines posted to X on Saturday: \"As of this morning, inspections on more than a quarter of our 737-9 fleet are complete with no concerning findings. Aircraft will return to service as their inspections are completed with our full confidence.\"\n\nIn response, one X user wrote that \"an overnight 'inspection' of your MAX fleet gives us no confidence,\" while another asked whether it was Alaska or Boeing that completed the inspection, to which another replied: \"Excellent question given what we know about Lion Air crash.\"\n\nStory continues\n\n737 Max disasters\n\nIn October 2018, a Lion Air 737 Max departing from Jakarta, Indonesia, crashed into the Java Sea shortly after takeoff, killing all 189 people aboard. Then in March 2019, an Ethiopian Airlines 737 Max crashed minutes after taking off from Addis Ababa, killing all 157 passengers and crew.\n\nThe worldwide grounding followed the FAA receiving evidence of similarities between the two accidents. Attention soon turned to a recurring failure in the Maneuvering Characteristics Augmentation System (MCAS), leading to pilot commands being overridden. Investigations later pointed to lapses in certification by the FAA, which was last major aviation authority to ground the aircraft.\n\nAfter mandating changes in design and training, the agency cleared the 737 Max to return to service in November 2020, with other authorities later following suit.\n\nBoeing, in a settlement with the Justice Department in 2021, agreed to pay $2.5 billion to resolve a charge that it had conspired to defraud the FAA. The company later estimated the crisis had cost it about $20 billion.\n\nWith yesterday’s incident, according to Reuters, passenger photos suggest the section of fuselage torn away is sometimes used for an optional rear door—usually by budget airlines that require more evacuation paths due to having more seats. In the case of Alaska Airlines, it said, those doors are permanently plugged.\n\nThere are 215 of the 737 Max 9 in service around the world, according to the New York Times, citing aviation analytics firm Cirium. United Airlines has 79 of them in service, more than any other airline, and United and Alaska Airlines together have about a third of them.\n\nThis story was originally featured on Fortune.com", "link": "https://finance.yahoo.com/news/boeing-737-max-planes-crashed-173830446.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.969, "neg": 0.079, "neu": 0.87, "pos": 0.051}}, {"date": "2024-01-06T17:31:00+00:00", "title": "Alaska Air Grounds Boeing 737 MAX-9 Fleet After Midair Incident", "content": "Alaska Air Flight 1282 was able to return to the Portland airport after losing a portion of its fuselage shortly after takeoff.\n\nContinue reading", "link": "https://finance.yahoo.com/m/ccdd3f45-14b1-3232-9e71-2d1c07186e98/alaska-air-grounds-boeing-737.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.382, "neg": 0.106, "neu": 0.894, "pos": 0}}, {"date": "2024-01-06T17:13:47+00:00", "title": "Boeing faces new questions about the 737 Max after a plane suffers a gaping hole in its side", "content": "The emergency landing of a Boeing 737 Max jetliner with a gaping hole in its side and the airline's decision to ground identical planes is renewing questions about the safety of Boeing's best-selling plane — one that was involved in two deadly crashes.\n\nA window panel blew out on an Alaska Airlines Boeing 737-9 Max seven minutes after takeoff from Portland, Oregon, on Friday. The rapid loss of cabin pressure pulled the clothes off a child and caused oxygen masks to drop from the ceiling, but miraculously none of the 174 passengers and six members were injured. Pilots made a safe emergency landing.\n\nHours after the terrifying incident, Alaska Airlines announced that it would ground its entire fleet of 65 Max 9s for inspections and maintenance. CEO Ben Minicucci said Alaska expects the inspections to be completed “in the next few days.”\n\nEven a short grounding will pose significant problems for the airline and its passengers — the Max 9 accounts for more than one-fourth of Alaska's fleet. On Saturday, Alaska canceled about 100 flights, or 13% of its schedule, by midmorning on the West Coast, according to FlightAware.\n\nUnited Airlines also operates a large fleet of 737-9 Max jets. A United spokesman said Saturday the airline had nothing yet to announce about its Max fleet.\n\nPhotos showed a hole in the Alaska jet where an emergency exit is installed when planes are configured to carry a maximum number of passengers. Alaska plugs those doors because its 737-9 Max jets don't have enough seats to trigger the requirement for another emergency exit.\n\nIndia's aviation watchdog told its airlines to immediately inspect emergency exits of all Boeing 737-8 Max planes, a slightly smaller model than the 737-9 Max. The country's aviation authority complained about a lack of guidance from Boeing.\n\nThe Federal Aviation Administration and the National Transportation Safety Board said they would investigate Friday's incident.\n\nStory continues\n\nBoeing has offered only a brief statement.\n\n“We are aware of the incident involving Alaska Airlines Flight 1282,\" the company said Friday night. \"We are working to gather more information and are in contact with our airline customer. A Boeing technical team stands ready to support the investigation.”\n\nThe plane involved is brand-new — it began carrying passengers in November and has made only 145 flights, according to Flightradar24, a flight-tracking service.\n\nThe Max — there are currently three versions: the 8, 9 and 10, which differ mainly in size — is the newest version of Boeing’s venerable 737, a twin-engine, single-aisle plane frequently used on U.S. domestic flights.\n\nMore than a decade ago, Boeing considered designing and building an entirely new plane to replace the 737. But afraid of losing sales to European rival Airbus, which was marketing a more fuel-efficient version of its similarly sized A320, Boeing decided to take the shorter path of tweaking the 737 — and the Max was born.\n\nA Max 8 jet operated by Lion Air crashed in Indonesia in 2018, and an Ethiopian Airlines Max 8 crashed in 2019. Regulators around the world grounded the planes for nearly two years while Boeing changed an automated flight control system implicated in the crashes.\n\nFederal prosecutors and Congress questioned whether Boeing had cut corners in its rush to get the Max approved quickly, and with a minimum of training required for pilots. In 2021, Boeing settled a criminal investigation by agreeing to pay $2.5 billion, including a $244 million fine. The company blamed two relatively low-level employees for deceiving the Federal Aviation Administration about flaws in the flight-control system.\n\nBoeing has estimated in financial reports that fallout from the two fatal crashes has cost it more than $20 billion. It has reached confidential settlements with most of the families of passengers who died in the crashes.\n\nAfter a pause following the crashes, airlines resumed buying the Max. But the plane has been plagued by problems unrelated to Friday's blowout.\n\nQuestions about components from suppliers have held up deliveries at times. Last year, the FAA told pilots to limit use of an anti-ice system on the Max in dry conditions because of concern that inlets around the engines could overheat and break away, possibly striking the plane. And in December, Boeing told airlines to inspect the planes for a possible loose bolt in the rudder-control system.\n\nA passenger on a Southwest Airlines jet was killed in 2018 when a piece of engine housing blew off and shattered the window she was sitting next to. However, that incident involved an earlier version of the Boeing 737, not a Max.", "link": "https://finance.yahoo.com/news/boeing-faces-questions-737-max-171347314.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.994, "neg": 0.106, "neu": 0.845, "pos": 0.048}}, {"date": "2024-01-06T17:10:00+00:00", "title": "What Fliers Need to Know About the 737 MAX Grounding", "content": "An Alaska Airlines flight forced to make an emergency landing has halted dozens of the carrier’s flights.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f3c1737d-8118-3a46-9ce7-37dd05026fc6/what-fliers-need-to-know.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "UAL.MX", "UAL.US", "UAL1.F"], "tags": [], "sentiment": {"polarity": -0.681, "neg": 0.248, "neu": 0.752, "pos": 0}}, {"date": "2024-01-06T16:03:00+00:00", "title": "Indian regulator orders aircraft inspections following Alaska Airlines incident - ANI", "content": "NEW DELHI, Jan 6 (Reuters) - India's aviation regulator on Saturday ordered an inspection of all Boeing 737-8 Max aircraft owned by domestic operators after a cabin panel blowout forced a new Alaska Airlines airplane to make an emergency landing in the United States, news agency ANI reported.\n\nThe California-bound Boeing 737-9 Max aircraft operated by Alaska Airlines had to make an emergency landing on Friday as it climbed out of Portland, Oregon.\n\nThere were no immediate indications of the cause of the apparent structural failure nor any reports of injuries.\n\nWhile none of India's air operators have the Boeing 737-9 Max model in their fleets, the country's Directorate General of Civil Aviation (DGCA) has directed a \"one-time inspection of the emergency exits immediately on all Boeing 737-8 Max aircraft currently operating as part of their fleet,\" ANI said in a post on social media platform X.\n\nThe Alaska Airlines flight, with 171 passengers and six crew, landed safely after the loss of a cabin panel. The airline has grounded 65 similar planes that would return to service only after precautionary maintenance and safety inspections.\n\nThe U.S. National Transportation Safety Board is investigating the incident.\n\nBoeing has said it is looking into the incident.\n\n\"We are working to gather more information and are in contact with our airline customer,\" Boeing said. (Reporting by Nikunj Ohri in New Delhi; Editing by Mike Harrison)", "link": "https://finance.yahoo.com/news/indian-regulator-orders-aircraft-inspections-160300370.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.718, "neg": 0.076, "neu": 0.876, "pos": 0.048}}, {"date": "2024-01-06T16:00:00+00:00", "title": "Alaska Airlines Flight Makes Emergency Landing After Part of Plane Rips Away", "content": "A Boeing 737 MAX-9 flight from Alaska Airlines made an emergency landing in Portland, Ore., after a section of the aircraft ripped away in midair on Friday. The FAA and the National Transportation Safety Board both said they are investigating. Photo: Kyle Rinker/Reuters", "link": "https://finance.yahoo.com/video/alaska-airlines-flight-makes-emergency-160000163.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0.059, "neu": 0.878, "pos": 0.063}}, {"date": "2024-01-06T15:40:21+00:00", "title": "Boeing 737 MAX Loses Emergency Door In Flight. Eyes Turn To Spirit.", "content": "Boeing and Spirit AeroSystems face another 737 Max defect question after a close call for Alaska Airlines.\n\nContinue reading", "link": "https://finance.yahoo.com/m/0cb7d3f3-f79f-3795-9359-a61474b982bc/boeing-737-max-loses.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "S9Q.F", "SPR.US"], "tags": [], "sentiment": {"polarity": -0.178, "neg": 0.119, "neu": 0.796, "pos": 0.085}}, {"date": "2024-01-06T11:20:44+00:00", "title": "Vulcan rocket's space debut will be crucial for Boeing-Lockheed venture as sale talks loom", "content": "By Joey Roulette\n\nWASHINGTON (Reuters) - A lot is riding on the first launch of the new Vulcan rocket by the United Launch Alliance, a joint venture of Boeing and Lockheed Martin.\n\nA successful launch at Cape Canaveral next week will allow ULA to fulfill a deep backlog of missions worth hundreds of millions of dollars and establish a competitive footing with Elon Musk's SpaceX.\n\nAnd it could prove vital to plans by the two U.S. aerospace firms to sell their joint venture.\n\n\"It's a very nervous time for them,\" said George Sowers, ULA's former chief scientist, who was key to Vulcan's creation. \"It's really the future of their company.\"\n\nThe debut mission is a long-awaited milestone after months of various delays in the final stretch of Vulcan's development, and following a testing mishap last year with a Vulcan upper-stage booster. ULA CEO Tory Bruno has said Vulcan has performed well during recent ground tests.\n\nThe mission checklist includes carrying a moon lander that is aiming to make the first U.S. lunar soft landing in half a century. The rocket will be using for the first time engines supplied by Jeff Bezos' space firm Blue Origin.\n\nVulcan's launch also comes at a time when Boeing and Lockheed, which formed ULA in a 2006 merger of their rocket programs, are looking to sell the jointly-owned venture, according to three people familiar with the talks.\n\nThose talks have been a complex, drawn-out process for which Vulcan's launch could have crucial implications, said the sources, who asked not to be identified.\n\nULA declined to comment on any potential deal talks, though Bruno has previously said his company could be ripe for an acquisition.\n\nBoeing and Lockheed declined to comment.\n\nVulcan's debut launch, scheduled for 2:18 a.m. ET (0718 GMT) on Monday, is the culmination of a years-long development effort sprung largely from ULA's need to replace its current Atlas V rocket. That rocket's Russian-imported engines drew criticism from lawmakers that led to its planned retirement.\n\nStory continues\n\nThe retirement of Atlas - plus Vulcan's other rocket, Delta - will leave the 200-foot (60-m) tall Vulcan to handle dozens of lucrative missions and serve as the company's sole challenger to SpaceX's reusable Falcon 9.\n\nVulcan's debut mission will send a privately-built lander from space robotics firm Astrobotic to the moon. But the launch itself will also serve as the first of two certification flights required by the U.S. Space Force before Vulcan can fly Pentagon satellites.\n\nSpace Force is a core customer for Vulcan - the military branch in 2020 picked ULA's Vulcan and its retiring Atlas V to launch 60% of the Pentagon's missions through around 2027.\n\nPriced lower than its predecessors at roughly $110 million per launch, Vulcan will seek to reclaim market share from Falcon 9, which is priced at roughly $62 million per launch. SpaceX's cheaper flights have eroded ULA's dominance of government satellite launches in the past decade.\n\nVulcan will also compete with Blue Origin's forthcoming New Glenn rocket, which uses the same engines as Vulcan.\n\nACQUISITION TALKS\n\nAcquisition talks for ULA have been underway for more than a year, with dozens of firms, including Blue Origin, having expressed interest, the sources said.\n\nBlue Origin did not respond to a request for comment.\n\nBoeing's and Lockheed's rationale and timing for selling ULA is unclear. But there have been significant changes to the U.S. space industry since ULA's formation in 2006, when it was created to dominate government launches and clinch some commercial demand from the then-nascent satellite market.\n\nGrowth of the commercial market was slower than expected, said Richard McKinney, an aerospace consultant and former director of the Air Force's space acquisition unit until 2007. \"But it looks like we're about there now.\"\n\nAmazon's planned Kuiper network is set to bring in crucial launch revenue for ULA.\n\nThat has helped provide Vulcan with a multibillion-dollar backlog of roughly 80 missions split somewhat evenly between government and commercial customers, Bruno has said.\n\nVulcan's development and ULA's shift away from its Atlas and Delta rockets have made estimates of the company's valuation hard to pin down, but analysts speculate it could be between $2 billion to $3 billion.\n\nBoeing and Lockheed each have their own competing space units. Lockheed, among other pursuits, has ventured into building moon rovers and made strategic investments in ABL Space, a small-launch startup with plans to build larger rockets in the future.\n\nBoeing's space program has struggled, primarily with its long-delayed Starliner astronaut capsule that rivals SpaceX's more established Crew Dragon. Troubles with Starliner development have cost Boeing some $1.5 billion since 2014.\n\nNew ownership could allow ULA to innovate beyond the launch sector in ways its corporate parents were unwilling to allow, former ULA chief scientist Sowers said.\n\n\"The charter of the company was fixed, and it was very limiting,\" he said. \"They're always competing and they couldn't agree on anything. We were not allowed to innovate.\"\n\n(Reporting by Joey Roulette, editing by Ben Klayman and Rosalba O'Brien)", "link": "https://ca.finance.yahoo.com/news/vulcan-rockets-space-debut-crucial-112044176.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA"], "tags": [], "sentiment": {"polarity": 0.891, "neg": 0.024, "neu": 0.931, "pos": 0.044}}, {"date": "2024-01-06T11:20:44+00:00", "title": "Vulcan rocket's space debut will be crucial for Boeing-Lockheed venture as sale talks loom", "content": "By Joey Roulette\n\nWASHINGTON (Reuters) -A lot is riding on the first launch of the new Vulcan rocket by the United Launch Alliance, a joint venture of Boeing and Lockheed Martin.\n\nA successful launch at Cape Canaveral next week would allow ULA to fulfill a deep backlog of missions worth hundreds of millions of dollars and establish a greater competitive footing with Elon Musk's SpaceX.\n\nAnd it could prove vital to plans by the two U.S. aerospace firms to sell their joint venture.\n\n\"It's a very nervous time for them,\" said George Sowers, ULA's former chief scientist, who was key to Vulcan's creation. \"It's really the future of their company.\"\n\nThe debut mission is a long-awaited milestone after months of various delays in the final stretch of Vulcan's development, and following a testing mishap last year with a Vulcan upper-stage booster. ULA CEO Tory Bruno has said that Vulcan has performed well during recent ground tests.\n\n\"That is an incredibly complicated machine, it's tremendously powerful. Everything has to work,\" Bruno said Saturday at Vulcan's launch pad. \"It is always inherently risky to fly a rocket. But what we're good at is managing that risk.\"\n\nThe mission checklist includes carrying a moon lander that is aiming to make the first U.S. lunar soft landing in half a century. The rocket will be using for the first time engines supplied by Jeff Bezos' space firm Blue Origin.\n\nVulcan's launch also comes as Boeing and Lockheed, which formed ULA in a 2006 merger of their rocket programs, are looking to sell the jointly owned venture, according to three people familiar with the talks.\n\nThe talks have been a complex, drawn-out process for which Vulcan's launch could have crucial implications, said the sources, who asked not to be identified.\n\nULA declined to comment on any potential deal talks. Bruno has previously said his company could be ripe for an acquisition.\n\nStory continues\n\nBoeing and Lockheed declined to comment.\n\nVulcan's debut launch, scheduled for 2:18 a.m. ET (0718 GMT) on Monday, is the culmination of a years-long development effort sprung largely from ULA's need to replace its current Atlas V rocket. That rocket's Russian-imported engines drew criticism from lawmakers that led to its planned retirement.\n\nThe retirement of Atlas - plus Vulcan's other rocket, Delta - will leave the 200-foot-tall (60-m) Vulcan to handle dozens of lucrative missions and serve as the company's sole challenger to SpaceX's reusable Falcon 9.\n\nVulcan's debut mission will send a privately built lander from space robotics firm Astrobotic to the moon. But the launch itself will also serve as the first of two certification flights required by the U.S. Space Force before Vulcan can fly Pentagon satellites.\n\nSpace Force is a core customer for Vulcan - the military branch in 2020 picked ULA's Vulcan and its retiring Atlas V to launch 60% of the Pentagon's missions through around 2027.\n\nPriced lower than its predecessors at roughly $110 million per launch, Vulcan will seek to reclaim market share from Falcon 9, which is priced at roughly $62 million per launch. SpaceX's cheaper flights have eroded ULA's dominance of government satellite launches in the past decade.\n\nVulcan will also compete with Blue Origin's forthcoming New Glenn rocket, which uses the same engines as Vulcan.\n\nACQUISITION TALKS\n\nAcquisition talks for ULA have been underway for more than a year, with dozens of firms, including Blue Origin, having expressed interest, the sources said.\n\nBlue Origin did not respond to a request for comment.\n\nBoeing's and Lockheed's rationale and timing for selling ULA are unclear. But there have been significant changes to the U.S. space industry since ULA's formation in 2006, when it was created to dominate government launches and clinch some commercial demand from the then-nascent satellite market.\n\nGrowth of the commercial market was slower than expected, said Richard McKinney, an aerospace consultant and former director of the Air Force's space acquisition unit until 2007. \"But it looks like we're about there now.\"\n\nAmazon's planned Kuiper network is set to bring in crucial launch revenue for ULA. That has helped provide Vulcan with a multibillion-dollar backlog of roughly 70 missions split somewhat evenly between government and commercial customers, Bruno has said.\n\nVulcan's development and ULA's shift away from its Atlas and Delta rockets have made estimates of the company's valuation hard to pin down, but analysts speculate it could be $2 billion to $3 billion.\n\nBoeing and Lockheed each have their own competing space units. Lockheed, among other pursuits, has ventured into building moon rovers and made strategic investments in ABL Space, a small-launch startup with plans to build larger rockets in the future.\n\nBoeing's space program has struggled, primarily with its long-delayed Starliner astronaut capsule that rivals SpaceX's more established Crew Dragon. Troubles with Starliner development have cost Boeing some $1.5 billion since 2014.\n\nNew ownership could allow ULA to innovate beyond the launch sector in ways its corporate parents were unwilling to allow, former ULA chief scientist Sowers said.\n\n\"The charter of the company was fixed, and it was very limiting,\" he said. \"They're always competing and they couldn't agree on anything. We were not allowed to innovate.\"\n\n(Reporting by Joey Roulette; editing by Ben Klayman, Rosalba O'Brien and Leslie Adler)", "link": "https://finance.yahoo.com/news/vulcan-rockets-space-debut-crucial-112044680.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA"], "tags": [], "sentiment": {"polarity": 0.932, "neg": 0.025, "neu": 0.926, "pos": 0.049}}, {"date": "2024-01-06T08:17:00+00:00", "title": "Alaska Airlines Grounds 65 Boeing 737 MAX Jets After Emergency Landing", "content": "Passengers on the aborted flight from Portland, Ore., posted images of a gaping hole in the plane and oxygen masks dangling down after what flight attendants called an “explosive” decompression.\n\nContinue reading", "link": "https://finance.yahoo.com/m/83540f5f-a9b1-3c55-847b-35e66d58b77b/alaska-airlines-grounds-65.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-01-06T04:51:13+00:00", "title": "UPDATE 3-U.S. safety board investigating Alaska Airlines Boeing 737 MAX 9 emergency landing", "content": "(Adds details about aircraft configuration in paragraphs 10-12)\n\nBy David Shepardson and Valerie Insinna\n\nJan 5 (Reuters) - The National Transportation Safety Board said late Friday it was investigating a depressurization incident that forced an Alaska Airlines Boeing 737 MAX 9 to make an emergency landing shortly after taking off from Portland, Oregon.\n\nAlaska Airlines Flight 1282, which had been bound for Ontario, California, suffered the depressurization soon after departing at 5:06 p.m. Pacific Time and landed safely back at Portland at 5:26 p.m. with 171 passengers and six crew, according to the airline and Flightradar24 data.\n\nThe Federal Aviation Administration said that the crew reported a pressurization issue, and that it would investigate.\n\nThe new MAX 9 was delivered in late October to Alaska Airlines and certified in early November, according to FAA data.\n\n\"While this type of occurrence is rare, our flight crew was trained and prepared to safely manage the situation,\" Alaska said in a statement. \"We are investigating what happened and will share more information as it becomes available.\"\n\nBoeing said in a statement that it was looking into the emergency landing.\n\n“We are aware of the incident involving Alaska Airlines Flight 1282,\" the company said in a statement. \"We are working to gather more information and are in contact with our airline customer. A Boeing technical team stands ready to support the investigation.”\n\nSocial media posts showed a window and portion of a side wall missing on the airplane and oxygen masks deployed.\n\nExterior photos of the aircraft appeared to show that the rear mid-cabin exit door separated from the aircraft during the flight, Flightradar24 said in a post on its website.\n\nThe MAX 9 features a rear cabin door behind the wings of the aircraft that can be \"activated\" in dense seating configurations to meet evacuation requirements, Flightradar24 said. However, they are permanently \"plugged,\" or deactivated, on Alaska Airlines jets.\n\nStory continues\n\nBoeing and Alaska Airlines did not immediately respond to a request for comment about the door.\n\nThe aircraft reached a maximum altitude of 16,325 feet during the flight, data show. \"Whenever you have a rapid decompression such as this, it's a major safety event,\" said Anthony Brickhouse, an air safety expert at Embry-Riddle Aeronautical University. \"I can't imagine what these passengers experienced. It would have been loud. The wind would be rushing through that cabin. It was a probably pretty violent situation and definitely a scary situation.\"\n\nThe incident shows the importance of passengers' keeping their seatbelts buckled while seated in an airplane, even if the fasten seatbelt light is off, Brickhouse said, noting that the oxygen mask system appeared to have functioned properly.\n\n\"This is a very, very serious situation and it could have been a lot worse,\" he said. \"If someone had been sitting in that seat, and they weren't buckled in, it would have been a different situation.\"\n\nLast week, Boeing said it was urging airlines to inspect all 737 MAX airplanes for a possible loose bolt in the rudder control system.\n\nThe FAA said it was closely monitoring Boeing 737 MAX inspections and would consider additional action if more loose or missing hardware was found.\n\nThe 737 MAX was grounded for 20 months worldwide after two fatal crashes in 2018 and 2019 killed 346 people in Ethiopia and Indonesia. Boeing is awaiting certification of its smaller 737 MAX 7 and larger MAX 10.\n\nThe FAA has carefully scrutinized the MAX for years. The FAA in 2021 said it was tracking all 737 MAX airplanes using satellite data.\n\n(Reporting by David Shepardson and Valerie Insinna; Editing by Gerry Doyle)", "link": "https://finance.yahoo.com/news/1-u-safety-board-investigating-045113315.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.727, "neg": 0.065, "neu": 0.878, "pos": 0.057}}, {"date": "2024-01-06T04:33:18+00:00", "title": "U.S. safety board investigating Alaska Airlines Boeing 737 MAX 9 emergency landing", "content": "By David Shepardson and Valerie Insinna\n\n(Reuters) -The National Transportation Safety Board said late Friday it was investigating a depressurization incident that forced an Alaska Airlines Boeing 737 MAX 9 to make an emergency landing shortly after taking off from Portland, Oregon.\n\nAlaska Airlines Flight 1282, which had been bound for Ontario, California, suffered the depressurization soon after departing at 5:06 p.m. Pacific Time and landed safely back at Portland at 5:26 p.m. with 171 passengers and six crew, according to the airline and Flightradar24 data.\n\nThe Federal Aviation Administration said that the crew reported a pressurization issue, and that it would investigate.\n\nThe new MAX 9 was delivered in late October to Alaska Airlines and certified in early November, according to FAA data.\n\n\"While this type of occurrence is rare, our flight crew was trained and prepared to safely manage the situation,\" Alaska said in a statement. \"We are investigating what happened and will share more information as it becomes available.\"\n\nBoeing said in a statement that it was looking into the emergency landing.\n\n“We are aware of the incident involving Alaska Airlines Flight 1282,\" the company said in a statement. \"We are working to gather more information and are in contact with our airline customer. A Boeing technical team stands ready to support the investigation.”\n\nSocial media posts showed a window and portion of a side wall missing on the airplane and oxygen masks deployed.\n\nExterior photos of the aircraft appeared to show that the rear mid-cabin exit door separated from the aircraft during the flight, Flightradar24 said in a post on its website.\n\nThe MAX 9 features a rear cabin door behind the wings of the aircraft that can be \"activated\" in dense seating configurations to meet evacuation requirements, Flightradar24 said. However, they are permanently \"plugged,\" or deactivated, on Alaska Airlines jets.\n\nStory continues\n\nBoeing and Alaska Airlines did not immediately respond to a request for comment about the door.\n\nThe aircraft reached a maximum altitude of 16,325 feet during the flight, data show.\n\n\"Whenever you have a rapid decompression such as this, it's a major safety event,\" said Anthony Brickhouse, an air safety expert at Embry-Riddle Aeronautical University. \"I can't imagine what these passengers experienced. It would have been loud. The wind would be rushing through that cabin. It was a probably pretty violent situation and definitely a scary situation.\"\n\nThe incident shows the importance of passengers' keeping their seatbelts buckled while seated in an airplane, even if the fasten seatbelt light is off, Brickhouse said, noting that the oxygen mask system appeared to have functioned properly.\n\n\"This is a very, very serious situation and it could have been a lot worse,\" he said. \"If someone had been sitting in that seat, and they weren't buckled in, it would have been a different situation.\"\n\nLast week, Boeing said it was urging airlines to inspect all 737 MAX airplanes for a possible loose bolt in the rudder control system.\n\nThe FAA said it was closely monitoring Boeing 737 MAX inspections and would consider additional action if more loose or missing hardware was found.\n\nThe 737 MAX was grounded for 20 months worldwide after two fatal crashes in 2018 and 2019 killed 346 people in Ethiopia and Indonesia. Boeing is awaiting certification of its smaller 737 MAX 7 and larger MAX 10.\n\nThe FAA has carefully scrutinized the MAX for years. The FAA in 2021 said it was tracking all 737 MAX airplanes using satellite data.\n\n(Reporting by David Shepardson and Valerie Insinna; Editing by Gerry Doyle)", "link": "https://finance.yahoo.com/news/u-safety-board-investigating-alaska-043318398.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.727, "neg": 0.066, "neu": 0.876, "pos": 0.058}}, {"date": "2024-01-06T03:53:12+00:00", "title": "Alaska Airlines grounds 737-9 aircraft after midair window blowout on flight from Portland, Oregon", "content": "Alaska Airlines grounded all of its Boeing 737-9 aircraft late Friday, hours after a window and piece of fuselage on one such plane blew out in midair and forced an emergency landing in Portland, Oregon. No one was seriously hurt.\n\nThe incident occurred shortly after takeoff and the gaping hole caused the cabin to depressurize. Flight data showed the plane climbed to 16,000 feet (4,876 meters) before returning to Portland International Airport. The airline said the plane landed safely with 174 passengers and six crew members.\n\n“Following tonight’s event on Flight 1282, we have decided to take the precautionary step of temporarily grounding our fleet of 65 Boeing 737-9 aircraft.” Alaska Airlines CEO Ben Minicucci said in a statement. “My heart goes out to those who were on this flight – I am so sorry for what you experienced.\"\n\nEach of the aircraft will be returned to service after full maintenance and safety inspections, which Minicucci said the airline anticipated completing within days.\n\n\"We are working with Boeing and regulators to understand what occurred tonight, and will share updates as more information is available,\" he said.\n\nThe airline provided no immediate information about injuries. However, KPTV reported that according to the Port of Portland, the fire department responded and treated minor injuries at the scene. One person was taken for more treatment but wasn't seriously hurt.\n\nThe plane was diverted about about six minutes after taking off at 5:07 p.m., according to flight tracking data from the FlightAware website. It landed at 5:26 p.m. The pilot told Portland air traffic controllers the plane had an emergency, was depressurized and needed to return to the airport, according to a recording made by the website LiveATC.net.\n\nA passenger sent KATU-TV a photo showing the hole in the side of the airplane next to passenger seats. Video shared with the station showed people wearing oxygen masks and passengers clapping as the plane landed.\n\nStory continues\n\nPassenger Evan Smith was on the flight and described the moment the blowout occurred.\n\n“You heard a big loud bang to the left rear. A whooshing sound and all the oxygen masks deployed instantly and everyone got those on,” he told KATU.\n\nSmith said a boy and his mother were sitting in the row where the window blew out. The boy's shirt was sucked off him and out of the plane, he said.\n\nThe National Transportation Safety Board and Federal Aviation Administration said they will investigate the incident.\n\nThe plane involved rolled off the assembly line and received its certification just two months ago, according to online FAA records. The plane had been on 145 flights since entering commercial service on Nov. 11, said FlightRadar24, another tracking service. The flight from Portland was the aircraft's third of the day.\n\nBoeing said it was aware of the incident, working to gather more information and ready to support the investigation.\n\nThe Max is the newest version of Boeing’s venerable 737, a twin-engine, single-aisle plane frequently used on U.S. domestic flights. The plane went into service in May 2017.\n\nTwo Max 8 jets crashed in 2018 and 2019, killing 346 people and leading to a near two-year worldwide grounding of all Max 8 and Max 9 planes. The planes returned to service only after Boeing made changes to an automated flight control system implicated in the crashes.\n\nLast year, the FAA told pilots to limit use of an anti-ice system on the Max in dry conditions because of concern that inlets around the engines could overheat and break away, possibly striking the plane.\n\nMax deliveries have been interrupted at times to fix manufacturing flaws. The company told airlines in December to inspect the planes for a possible loose bolt in the rudder-control system.\n\n___\n\nAssociated Press reporter David Koenig in Dallas contributed to this report.", "link": "https://finance.yahoo.com/news/alaska-airlines-flight-makes-emergency-035312343.html", "symbols": ["ALK.F", "ALK.US", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA"], "tags": [], "sentiment": {"polarity": -0.765, "neg": 0.052, "neu": 0.909, "pos": 0.039}}]