[{"date": "2023-08-02T23:49:03+00:00", "title": "Asian stocks fall as risk-off persists after U.S. rating cut", "content": "Investing.com -- Most Asian stocks fell on Thursday, tracking overnight losses on Wall Street after Fitch’s downgrade of the U.S. sovereign rating somewhat dented sentiment, while strong payrolls data also pushed up concerns over rising interest rates.\n\nFitch had earlier this week downgraded its rating for the U.S. government to AA+ from AAA, citing concerns over fiscal spending and increased clashes between the Democrats and Republicans.\n\nWhile analysts downplayed the direct impact of the downgrade, the move still triggered a wave of selling across global stock markets, as investors locked in profits after a strong run through June and July.\n\nTechnology stocks see extended profit taking, strong payrolls data weighs\n\nTech stocks, which had seen strong gains over the past two months, bore the brunt of selling pressure, with South Korea’s KOSPI and Hong Kong’s Hang Seng index falling 0.8% and 0.6%, respectively.\n\nStocks were also rattled by stronger-than-expected U.S. private payrolls data on Wednesday, which boosted the dollar and Treasury yields as markets positioned for a similar reading from official nonfarm payrolls data due on Friday.\n\nResilience in the U.S. economy - particularly in the labor market - gives the Federal Reserve more headroom to keep raising interest rates, which bodes poorly for risk-driven stock markets.\n\nTech stockholders were also on edge ahead of earnings reports from Apple Inc (NASDAQ:AAPL) and Amazon.com Inc (NASDAQ:AMZN).\n\nBroader Asian markets retreated. Japanese stocks were among the worst performers for the day, with the Nikkei 225 index sliding 1.6%, while the broader TOPIX fell 1.2%. Local stocks were hit by a mix of profit taking, as well as uncertainty over the Bank of Japan’s stance on its ultra-dovish monetary policy.\n\nAustralia’s ASX 200 fell 0.5% as data showed that the country’s trade surplus remained steady in June. Australian retail sales also fell less than expected in the second quarter.\n\nFutures for India’s Nifty 50 index pointed to a slightly positive open, after the index plummeted from record highs this week. High weightage of technology stocks weighed heavily on the Nifty and the BSE Sensex 30 in recent sessions.\n\nStory continues\n\nChinese stocks limit losses as PMI data signals some strength\n\nChina’s Shanghai Shenzhen CSI 300 and Shanghai Composite indexes fell less than their peers on Thursday, as a private survey showed that the country’s services sector grew more than expected in July.\n\nThe reading indicated that steady retail spending and services demand was still keeping some facets of Chinese business activity afloat, and could help support a bigger economic recovery this year, especially if the government rolls out more stimulus measures.\n\nBut investors appear to have somewhat soured on the prospect of more Chinese stimulus, given that officials have offered up few details on how the measures will be carried out. The country's biggest economic engines - manufacturing and real estate - are also struggling despite promises of more support.\n\nRelated Articles\n\nAsian stocks fall as risk-off persists after U.S. rating cut\n\nBMW sees solid revenue growth in first half\n\nSingapore bank DBS' Q2 profit beats estimates; expects record year", "link": "https://finance.yahoo.com/news/asian-stocks-fall-risk-off-234903648.html", "symbols": ["AAPL.US", "AMZN.US", "HSI.INDX"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.046, "neu": 0.826, "pos": 0.127}}, {"date": "2023-08-02T21:35:50+00:00", "title": "Could Apple and the Pac-12 be teaming up?", "content": "Pac-12 commissioner George Kliavkoff presented leaders of Pac-12 schools with an exclusive streaming deal with Apple, according to ESPN. Yahoo Finance Live discusses the potential deal's impact on Pac-12 and Apple.\n\nVideo Transcript\n\nJOSH SCHAFER: I do want to move on to a different last frontier when we're talking about another tech company that's also reporting earnings tomorrow. So we have Apple earnings out tomorrow. And in my opinion, at least in the streaming space, the last frontier for Apple is sports. And we got a new headline out in the last 24 hours, Pete Thamel over ESPN saying that the Pac-12 has now presented. So President George-- Commissioner George Kulikov has now presented a deal to the Pac-12 teams that would allow them to be the-- Apple be the exclusive streamer when they resign their deal after this year.\n\nNow, this comes as the Pac-12 has been losing teams. USC, UCLA, major name brand schools are going to be gone in a year. Oregon might be leaving. Colorado has left already and announced that they're leaving. So Pac-12, a little bit looking for something some good news here. But it'd be interesting, Seana, to me, to see Apple pair up with a college conference and a smaller college conference at that. It reminds me more of that MLS deal. They're not getting the SEC. You get Pac-12 football. You know, a little bit of a smaller audience, you can sort of test things out, see how football goes for you.\n\nSEANA SMITH: Yeah. And you know, you kind of took the words out of my mouth, because I was going to draw that exact same comparison, right? They're getting into college football. They're getting that exposure. They're going for a smaller league, not one that's going to cost them nearly as much. So they get their footprint. They get some exposure there.\n\nWhether or not it's a good deal for Pac-12, that's also been debated out there, although we don't have to go all the way in to college football here. But when it comes to Apple's play into sports, clearly, if they're looking at college football, we can see that they envisioned sports becoming a bigger part of their streaming offering. And where that goes from here in terms of professional sports, other larger college conferences, that's going to be the thing to watch.\n\nStory continues\n\nBROOKE DIPALMA: Yeah. And speaking of that impact on Pac-12, if I read this right, Josh, I mean, Apple does not produce the games. So what does this ultimately mean for the cost to Pac-12? ? Will this investment, you know, this partnership be worth it to them at the end of the day? Or will it end up eating into their bottom line? I mean--\n\nJOSH SCHAFER: It'd be interesting to see how it plays out, right? I think that really what it would probably do hopefully, at least for Apple, would be just get more subscribers, right? It's just getting more premium subscribers. And then I think when you think about the overall vision for Apple, and one thing I'm excited to maybe hear about on that earnings call tomorrow, is what happens with the Vision Pro headset and what the full vision is there, because it's been really interesting to me to hear Bob Iger talk about that Vision Pro headset.\n\nAnd Bob Iger is looking for things to do with ESPN. And you've talked about watching an NBA game on that Vision Pro headset. When you start to get broadcast deals, you can do alternative broadcasts. You can play with that headset. If you're going to sell a VR headset, VR/AR headset for $3,500, put me on the field. Let's do something cool with it.\n\nAnd I don't think that they're necessarily going to talk about that tomorrow, right? But they are going to talk about the future of Vision Pro and where they're going with it. And I think to see them build out that streaming product and have more pieces of content to put in the headset is part of the story.", "link": "https://finance.yahoo.com/video/could-apple-pac-12-teaming-213550169.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0.009, "neu": 0.914, "pos": 0.077}}, {"date": "2023-08-02T19:54:02+00:00", "title": "Dow futures lift, Paypal dips 6.8% after earnings", "content": "Investing.com - U.S. stock futures were trading higher during Wednesday's evening deals, following a negative session among major benchmark indices as Fitch's recent long-term credit downgrade of the United States soured sentiment.\n\nBy 7:15pm ET (11:15pm GMT) Dow Jones Futures and Nasdaq 100 Futures were up 0.2% while S&P 500 Futures ticked 0.1% higher.\n\nIn extended deals, PayPal (NASDAQ:PYPL) lost 6.8% after the company reported Q2 EPS of $1.16 versus $1.15 expected, while revenues were reported at $7.29B versus estimates of $7.27B. PayPal also forecasted Q3 2023 EPS in the range of $1.22-$1.24 versus $1.22 expected and revenues of $7.4 billion versus $7.32 billion expected.\n\nUpwork Inc. (NASDAQ:UPWK) popped 19.4%, reporting Q2 EPS of $0.10 versus $0.00 expected. while quarterly revenue came in at $168.61 million versus $162.53 million expected.\n\nDoorDash Inc (NYSE:DASH) added 4.9% after reporting Q2 losses of $0.44 per share versus expected losses of $0.41 per share. Revenue was reported at $2.13 billion versus $2.06 billion.\n\nQualcomm (NASDAQ:QCOM) dropped 7.1%, reporting Q3 EPS of $1.87 versus $1.81 expected, with revenue reported at $8.44 billion versus $8.51 billion expected. Qualcomm forecasted Q4 2023 EPS in the range of $1.80-$2.00 versus $1.91 expcted, while revenues are expected in the range of $8.1-8.9 billion versus $8.7 billion expected.\n\nEtsy (NASDAQ:ETSY) lost 6.1% after the company reported Q2 EPS of $0.45 versus $0.42 expected. Revenues came in at $628.9 million versus $618.62 million expected.\n\nAhead in Thursday's trade, investors will be closely monitoring weekly jobless claims, preliminarly nonfarm productivity as well as the Markit and ISM services PMIs.\n\nOn the earnings front, major companies reporting quarterly results include Apple Inc (NASDAQ:AAPL), Amazon.com Inc (NASDAQ:AMZN), ConocoPhillips (NYSE:COP), Airbnb Inc (NASDAQ:ABNB), and Booking Holdings Inc (NASDAQ:BKNG).\n\nStay ahead of the curve this earnings season with InvestingPro.\n\nStory continues\n\nDuring Wednesday's regular session, the Dow Jones Industrial Average dipped 348.2 points or 1% to 35,282.5, the S&P 500 slipped 63.3 points or 1.4% to 4,513.4 and the NASDAQ Composite lost 310.5 points or 2.2% to 13,973.5.\n\nAmong data releases, ADP nonfarm employment change data came in well above expectations at 324K, while falling from the previous month's reading of 455K.\n\nOn the bond markets, United States 10-Year rates were at 4.088%.\n\nRelated Articles\n\nDow futures lift, Paypal dips 6.8% after earnings\n\nSingapore bank DBS' Q2 profit beats estimates; expects record year\n\nPhillips 66 joins rival refiners with sharp profit drop on lower margins", "link": "https://finance.yahoo.com/news/dow-futures-lift-paypal-dips-195402258.html", "symbols": ["2PP.F", "2PP.XETRA", "3E2.F", "AAPL.US", "ABNB.US", "AMZN.US", "BKNG.US", "COP.US", "DASH.US", "DJI.INDX", "ETSY.US", "IXIC.INDX", "PYPL.US", "PYPL34.SA", "QCI.F", "QCI.XETRA", "QCOM.MX", "QCOM.US"], "tags": [], "sentiment": {"polarity": -0.273, "neg": 0.058, "neu": 0.889, "pos": 0.053}}, {"date": "2023-08-02T19:47:00+00:00", "title": "Top Apple Analyst Dan Ives Thinks Earnings Will Be a 'Flex the Muscles Moment' For Company", "content": "The largest company in the world is set to report earnings after the bell Wednesday. Analysts are a little divided as to how the tech giant will perform.\n\nContinue reading", "link": "https://finance.yahoo.com/m/93687e38-1582-3d6f-aecc-8b4991f8fe0b/top-apple-analyst-dan-ives.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-02T19:27:00+00:00", "title": "Tech Stocks Slide on Fear Over Rates. It’s Just Like 2022.", "content": "Few technology companies were left out of the selloff, but some of this year's tech laggards gained ground.\n\nContinue reading", "link": "https://finance.yahoo.com/m/51686a94-02c1-357d-a2dc-be1911afe71c/tech-stocks-slide-on-fear.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.527, "neg": 0, "neu": 0.848, "pos": 0.152}}, {"date": "2023-08-02T17:28:31+00:00", "title": "Best Long-Term Investment Stocks to Buy", "content": "Some of the best long-term investment stocks include companies that are in good financial standing, have a low valuation and pay consistent dividends.\n\nFolks seeking out the best long-term investment stocks to buy have a few ways to approach the task. One is to follow the advice of Ben Graham, the father of value investing, using his classic book, The Intelligent Investor.\n\nGraham suggests that a defensive investor should buy stocks of large, conservatively financed companies with good earnings power. The companies should also be some of the best dividend stocks, with consistent histories of payouts, and have low valuations.\n\nHowever, in today's world, many tech stocks don't pay dividends. Instead, they often return capital to shareholders through large stock buybacks.\n\nTherefore, applying Graham's criteria today, the idea is to find the best stocks to buy that return large amounts of capital to shareholders either through dividends and/or stock buybacks.\n\nThis allows a company to increase its earnings and dividends on a per-share basis. Moreover, the remaining shareholder's stakes rise over time. Both of these factors can push the stock higher.\n\nAnother Graham criteria is to find stocks with a low valuation. The S&P 500 has a relatively high price-to-earnings (P/E) ratio of 31.4 times over the last 10 years. This article will focus on stocks with price-to-earnings ratios that are lower than the broad market.\n\nLastly, we will stick with stocks that have market caps of $100 billion or higher. They must also have low debt ratios and enough cash flow to reduce their debt, as well as pay dividends and/or buybacks.\n\nWith this in mind, here are the nine of the best long-term investment stocks to buy now.\n\nWhat Is a Stock Buyback?\n\nData is as of Aug. 1. Dividend yields are calculated by annualizing the most recent payout and dividing by the share price.\n\nMarket value: $3.08 trillion Dividend yield: 0.5%\n\nApple (AAPL, $195.60) is the $3 trillion maker of iPhone smartphones, Mac computers, iPads and numerous other products and services.\n\nStory continues\n\niPhones still represent over half of the company's sales, but recently services, which includes the App Store, have started to increase as well. For example, in its latest quarter ending April 1, Apple's services revenue came in at $20.9 billion, or 22% of its $94.8 billion in sales. That is up from 20% a year ago and 18.9% two years ago.\n\nSo, this massive tech products company is slowly shedding its overreliance on the iPhone, whose models are all very highly priced. While this will take time, the market so far approves of this plan.\n\nAnd why not? The company is generating massive amounts of free cash flow (FCF), which is the money left over after a company covers expenses to run, maintain and expand the business. Last quarter, Apple said it generated strong operating cash flow of $28.6 billion, while returning over $23 billion to shareholders.\n\nApple pays a small dividend, which it recently raised by 4% to 96 cents annually. That gives the stock a low 0.5% dividend yield. However, this cost the company just $3.7 billion, or 13% of its operating flow.\n\nThe rest of the $23 billion \"returned\" to shareholders was through stock buybacks. In fact, Apple raised the amount it says it will spend this year on share repurchases to $90 billion. That represents over 3.3% of its total market value.\n\nThis will benefit long-term shareholders in Apple stock. First, it will raise AAPL's earnings per share over time through having a lower number of shares outstanding for the income it produces.\n\nBut in addition, the dividend per share can rise faster than it would otherwise since the dividend payments will be spread over fewer number of shares outstanding. And a third effect will be the soaking up of shares traded in the market – effectively acting as a buying source in the market, pushing the blue chip stock higher.\n\nKeep in mind that APPL stock is not overly cheap at the moment, at 28.7 times forward earnings – above its five-year average of 23.7, according to Morningstar. However, it is about below the S&P 500's average, as mentioned earlier.\n\nNevertheless, Apple remains one of the best long-term investment stocks due to its consistent and powerful cash flow, dividends and buybacks.\n\nBest Dividend ETFs to Buy Now\n\nMarket value: $2.50 trillion Dividend yield: 0.8%\n\nMicrosoft (MSFT, $336.34) operates in every key software arena: operating systems, cloud, gaming, application software, and even artificial intelligence (AI) with its new Bing chatbot.\n\nMSFT meets all the necessary qualities for being one of the best long-term investment stocks as it has consistent earnings, is conservatively financed and generates large amounts of free cash flow. Moreover, it pays a dividend and spends most of its FCF on share buybacks.\n\nJust like Apple, however, MSFT stock is not necessarily cheap on a relative or even historical basis. For example, Microsoft is trading at 30.4 times forward earnings, which is above its five-year average of 28.6. Still, it's below the S&P 500's long-term average.\n\nAnd long-term investors are likely to do quite well with MSFT. The reasons are quite simple: The company's massive cash flow, its products ubiquity and acceptance, and its shareholder rewards are all working in the stock's favor.\n\nFor example, Microsoft recently reported a 21% year-over-year increase in fiscal fourth-quarter earnings per share, while revenue was up 8%. Plus, free cash flow was up 12% from the year prior.\n\nBut more importantly, the company has plenty of room to increase its shareholder-friendly initiatives over time. This is because it spends just about half its free cash flow on dividends and buybacks. It plows the rest back into the company, reducing debt and making investments and acquisitions.\n\nSo, in the long run, Microsoft shareholders can expect the company to typically grow profits and cash flow, while consistently hiking its dividends and buybacks. In fact, Microsoft has had 18 consecutive years of raising its dividend. That alone, not counting its buybacks and earnings power, makes the Dow Jones stock worthy of holding as a long-term investment.\n\nHow to Invest in AI\n\nMarket value: $303.4 billion Dividend yield: 3.7%\n\nChevron (CVX, $162.30) is an integrated energy and chemicals company with both upstream and downstream operations in the U.S. and around the world.\n\nCVX meets the criteria for a good long-term investment as it is conservatively financed, produces good profits and pays an attractive dividend it can afford. Moreover, CVX stock is not expensive and the company is actively buying back shares, helping to push it higher.\n\nFor example, analysts expect Chevron to make $11.94 per share in fiscal 2023, which has the energy stock trading at 13.6 times forward earnings. This is well below the five-year average of 37.9 times.\n\nMoreover, Chevron has 36 years of annual dividend hikes under its belt. This is because despite vicissitudes in the prices of oil and gas and chemical industry cycles, the company has consistently produced large amounts of free cash flow.\n\nFor example, in Q2, Chevron generated $9.4 billion in operating cash flow before working capital changes, and $2.5 billion in free cash flow. The company spent $2.8 billion on dividends and $4.4 billion on share buybacks, for a record $7.2 billion in total shareholder returns.\n\nThis shows how Chevron manages a fair balance between investing in the future, as well as rewarding its own shareholders now with its cash flow. And it underscores why CVX is the kind of stock that long-term investors want to have in their portfolio.\n\nStocks With the Highest Dividend Yields in the S&P 500\n\nMarket value: $116.7 billion Dividend yield: 3.2%\n\nMedtronic (MDT, $87.68) is a $117 billion medical device and therapies company that originally invented the pacemaker. That is probably relatable to people who are looking for the best retirement stocks. Moreover, the company is extremely profitable, which allows it to pay generous dividends and do large share buybacks.\n\nRight now, MDT stock has a 3.2% dividend yield. And this yield will likely continue to rise, given the company has reliably raised its dividend for 46 straight years – including a 1.5% hike in May.\n\nMoreover, in fiscal 2023, which ended on April 28, Medtronic bought back $645 million of its shares. That works out to be about 55% of one percent of its $117 billion market cap.\n\nThat is not much, but every little bit helps towards allowing the company to keep raising its dividend.\n\nIn addition, at just 17.1 times forward earnings, the stock is inexpensive. What's more, this is well below MDT's five-year average of 19.1 times, according to Morningstar.\n\nMeanwhile, Medtronic has about $17 billion in net debt on its balance sheet. This is well below its $52 billion in shareholders' equity. Its cash flow should continue to recover from supply chain issues we've seen in the past few years. That will allow Medtronic to reduce its debt reliance over time.\n\nAnd given its powerful cash flow and shareholder returns, MDT is one of the best long-term investment stocks.\n\nBull Markets vs Bear Markets: The Differences Explained\n\nMarket value: $119.6 billion Dividend yield: 1.5%\n\nCharles Schwab (SCHW, $65.72) is a well-known discount brokerage firm and investment banking company with which many baby boomers are familiar.\n\nSCHW meets all the best criteria for a long-term investment value strategy. For example, it is conservatively financed, pays a consistent dividend with a 1.5% yield, and has a low valuation.\n\nAs for that dividend, Schwab has had 34 years of consistently paying its dividend each year. That is well over the 10-year average of the median in its sector.\n\nMoreover, Schwab recently reported that its return on equity was 20% in the six months ended June 30, up from 15% in the year-ago period. This indicates a substantial rebound in its earnings power. It also allays concerns that the bank might have been hurt by investors worried about a potential recession.\n\nMeanwhile, the financial stock is trading at 17.2 times forward earnings, well below its five-year average of 18.6.\n\nWhile the company did recently decide to pause its share buyback program in light of uncertainty in the financial sector following the spring banking crisis. This is likely to reverse once the Federal Reserve stops pushing interest rates higher, which could act as a major catalyst.\n\nInvesting Jargon, Explained\n\nMarket value: $212.5 billion Dividend yield: 2.1%\n\nMcDonald's (MCD, $291.07) is a company that just about every investor knows well, especially if they have children. But few realize that it is actually quite a good long-term investment stock to buy as well.\n\nThe main reason is that the company generates large amounts of free cash flow. For example, in the last 12 months (LTM) ending March 31, MCD produced $5.7 billion in FCF. That represents 2.7% of its $212 billion market capitalization.\n\nMCD uses its free cash flow to pay a very ample dividend, which now yields 2.1%. In addition, it bought back almost $3 billion of its shares over the last year.\n\nWhile some folks might not like MCD's quick service restaurant food, plenty of others do. They love its menu, buy McDonald's fries and hamburgers and generally can't get enough of its food.\n\nMoreover, it is conservatively financed as its $37 billion in long-term debt, $33.3 billion after cash, is well-managed by the company's ongoing FCF generation.\n\nIn addition, shareholders have benefited by its history of annually raising its dividend over the last 46 years.\n\nAlong with its buybacks, MCD stock is attractively valued. For example, it trades for just 26.8 times earnings. While certainly not cheap, this is below its five-year average\n\nThe bottom line – everyone is \"lovin\" MCD stock for the long term.\n\nStock Picks That Billionaires Love\n\nMarket value: $368.3 billion Dividend yield: 2.4%\n\nProcter & Gamble (PG, $156.25) is a nearly $370 billion consumer products giant with many iconic brand names – including Downy detergent, Mr. Clean cleaning supplies and Head & Shoulders shampoo – that produce large amounts of cash flow for the company.\n\nMost everyone knows Procter & Gamble's brands and are familiar with their solid reputations. But few realize how incredibly profitable the company actually is and why PG is one of the best long-term investment stocks to buy.\n\nFor example, in the last 12 months ended June 30, PG generated $15.2 billion in operating cash and after $3.0 billion in capex spending, $12.2 billion in free cash flow.\n\nThe FCF represents a massive 15% of P&G's $81 billion LTM sales, which is a very high free cash flow margin for a consumer products company. In fact, some software companies don't even make those kinds of margins.\n\nMoreover, this FCF also funds massive dividends and buybacks for shareholders. The company has raised its dividend annually for the last 66 years. Moreover, in its recent earnings call, Procter and Gamble management said it expects to buy back $5 billion to $6 billion in common stock this fiscal year. That represents about 1.5% of its market capitalization.\n\nNevertheless, PG is not expensive relative to its historical valuation. It trades for just 26.5 times earnings, which is well below its five-year average of 35.0.\n\nIn other words, Procter & Gamble is reasonably priced, generates large amounts of cash flow from its brands and is working diligently to return value to shareholders. That makes it one of the best long-term investments value buyers can make.\n\nBest Defensive ETFs to Protect Your Portfolio\n\nMarket value: $61.0 billion Dividend yield: 5.4%\n\n3M (MMM, $110.56) is a $61 billion industrial conglomerate that operates in four sectors: safety and industrial; transportation and electronics; healthcare; and consumer. The company's mission is to apply science to improve people's lives daily.\n\nBut MMM is also one of the best long-term investment stocks for folks to own. For example, 3M generated $1.5 billion in free cash flow in the second quarter, and returned $800 million to shareholders via dividends.\n\nOn top of that, 3M buys back its common stock, with the company repurchasing $1.4 billion of its own shares in 2022.\n\nGiven its free cash flow, investors can take comfort in knowing that MMM's $6.00 annual dividend, which yields an attractive 5.4%, is probably secure.\n\nPlus, 3M stock is cheap, trading at just 11.6 times forward earnings, well below its five-year average of 16.6.\n\nMoreover, 3M is conservatively financed. The company reported $11.7 billion in net debt at the end of Q2, which was down 12% on a year-over-year basis.\n\nGiven its strong cash flow, dividends, buybacks, low valuation and financing, the industrial stock looks like a good long-term investment for value buyers.\n\nStocks Warren Buffett Is Buying and Selling\n\nMarket value: $267.1 billion Dividend yield: 3.0%\n\nCoca-Cola (KO, $61.77) is an iconic beverage company that generates large amounts of cash flow for its shareholders with its well-known brands such as Coke, Diet Coke, Fanta, Powerade and Minute Maid.\n\nThat makes it one of the best long term investments a value buyer can make – just ask Warren Buffett, whose Berkshire Hathaway (BRK.B) holding company is KO's top shareholder. What makes KO so attractive is that it is one of the best dividend stocks on Wall Street, having increased its payouts consistently for the last 60 years straight. Most recently, Coca-Cola in February hiked its dividend by nearly 5%.\n\nToday, KO stock yields an attractive 3%, and investors can expect the dividend rate to keep increasing.\n\nOn top of that, Coca-Cola has a strong common stock buyback program. For example, in the last 12 months ended June 30, it spent $872 million on share repurchases. That represents 33% of 1.0% of its $267 billion market value.\n\nKO's dividends and share buybacks are more than covered by $9.5 billion in FCF that management expects to generate during 2023.\n\nOn top of that, the consumer staples stock is trading at 25.6 times earnings, well below its five-year average of 32.1.\n\nSo, for the long term-investor, KO stock looks like a good investment, given its strong cash flows and shareholder-friendly initiatives.", "link": "https://finance.yahoo.com/news/best-long-term-investment-stocks-172831591.html", "symbols": ["2M6.F", "2M6.XETRA", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "CHV.F", "CHV.XETRA", "CVX.MX", "CVX.US", "MCD.MX", "MCD.US", "MCDC34.SA", "MDO.F", "MDO.XETRA", "MDT.US", "MSF.F", "MSF.XETRA", "MSFT.MX"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.023, "neu": 0.805, "pos": 0.172}}, {"date": "2023-08-02T16:45:05+00:00", "title": "Jim Rogers’s Latest Predictions and Investments", "content": "In this piece, we will take a look at Jim Rogers's latest predictions and investments. If you want to see more predictions and investments in this selection, check out Jim Rogers's 5 Latest Predictions and Investments.\n\nThe stock market has been on an impressive run, depicted by the Nasdaq and the S&P 500 posting double-digit gains and recouping all the losses accrued last year. The remarkable run comes after the market suffered a bear run in 2022 fueled by inflationary pressures, deteriorating economic conditions, and Federal Reserve's aggressive push to hike interest rates. According to legendary investor Jim Rogers who co-founded Quantum Fund with George Soros, investors should be extremely cautious as the next downturn could be more painful.\n\nWhile the market appears to be in a bull run, everything always comes to an end, as equities cannot move up forever. The fact that the current bull run appears to be fueled by a small clique of tech giants, including Meta Platforms, Inc. (NASDAQ:META), Alphabet Inc. (NASDAQ:GOOGL), NVIDIA Corporation (NASDAQ:NVDA), Apple Inc. (NASDAQ:AAPL), Amazon.com, Inc. (NASDAQ:AMZN), and Microsoft Corporation (NASDAQ:MSFT), also raises serious concerns about the sustainability of the bull run.\n\nOne of the factors likely to trigger a correction into the bear territory is the extreme debt levels. According to the legendary investor, too much debt does not bode well with investors.\n\n\"[In] 2008, we had a bear market because of too much debt,\" he said. \"Look out the window since 2008, debt everywhere has skyrocketed,” said Rogers in an interview with real Vision\n\nWhile not as popular as George Soros, Jim Rogers rose to prominence as he helped steer Quantum Fund into generating 4,200% returns between 1973 and 1980 outperforming S&P 500's 47% gains. He retired at the age of 37 after making so much money that he would never need to work again. After parting ways with Soros in 1980, Rogers spent most of his time travelling on a motorcycle around the world covering over 160,000 km over six contents.\n\nStory continues\n\nAfter retiring with abundant wealth, he pursued diverse interests, becoming an educator, traveling the world, and authoring several best-selling books. Rogers' investment approach involves focusing on specific countries, commodities, or themes he believes hold profit potential. While his current holdings are not publicly disclosed, he has expressed caution in buying new assets and has mentioned owning commodities, particularly gold and silver.\n\nJim Roger’s net worth is believed to stand at about $300 million. He has been investing privately since leaving Quantum Fund in 1980 but does not disclose his holdings. Despite being out of the limelight for many years his experience and insights about the markets is always looked upon. Jim Rogers, often dubbed the Indiana Jones of the investing world, has a penchant for globetrotting in search of cost-effective investment opportunities.\n\nRogers, now living in Singapore with his family, made it clear that he was not buying anything as he expects bad times at the start of the year. According to the legendary investor, the next bear market will be the worst in the lifetime, exacerbated by debt that has increased too much over the past 15 years. The remarks draw up parrels to the economic conditions leading up to the devastating 2009 financial crisis. Jim Rogers's Latest Predictions and Investments\n\nTo support the predictions, the 80-year-old investors draw parallels from the inflationary crisis of 1980. Following that crisis, policymakers pursued a vigorous tightening of monetary policy, implementing substantial interest rate hikes, raising them to 21%, and pushing treasury yields to astronomical levels in an effort to counter high inflation. The outcome was the United States economy being thrust into a recession, causing significant turmoil in the stock market.\n\nWith the scenario unfolding in today’s financial markets, investors ought to be extremely cautious even as the market appears to be in a strong uptrend. Rogers is already predicting trouble across all the markets, from property to stocks to bonds and currencies.\n\nJim Rogers' warning of a bear market cannot be taken lightly, given his experience in leveraging market volatility as his advantage. In partnership with George Soros, he founded Quantum Funds in 1973 and navigated the fund through multiple market downturns and economic crises.\n\nOur Methodology\n\nRogers believes it is high time investors and individuals remain vigilant and assess the risk exposure. The high debt levels and resemblance to previous crises should always be a stark reminder that market conditions can deteriorate instantly. Likewise, we have compiled Rogers biggest predictions and investment ideas from multiple sources.\n\n10. Biggest Bear Market Run of a lifetime\n\nPrediction: June 2022\n\nBest known for his contrarian investment strategy that emphasizes long-term trends, Rogers believes the world is staring at the ferocious bear run of a lifetime. In June of 2022 Rogers made that claim that the prevailing economic conditions resembled the period leading to the great financial crisis of 2008.\n\nUnlike in the past crisis, the current situation is exacerbated by extreme debt levels following the massive stimulus packages at the height of the COVID-19 pandemic. The debt levels have already fueled a stubborn inflationary pressure that refuses to go away. With the FED insisting on hiking interest rates until inflation tanks below 2%, it spells more doom for an economy trying to bounce back from the COVID-19-fueled slowdown.\n\n“Since 2008, the debt everywhere has skyrocketed. Gigantic increases in debt … So, I think it’s a simple statement that the next bear market will be the worst in my lifetime. Because the debt has gone up by such staggering amounts in the past 14 years,” Jim Rogers said in a statement.\n\n9. Governments Exacerbate Crypto Risks\n\nPrediction: August 2022\n\nAccording to the legendary investor, the biggest risk to cryptocurrencies is the government. The government wants to control everything, so they will always do everything within its power to ensure cryptocurrencies don’t succeed. In August of 2022, Rogers reiterated that he will not invest in crypto even though  his wife was a big fan and had invested in then.\n\n“If and when all our money is on our computer, it’s going to be government money,” he said in a recent interview with Bloomberg Crypto. “That’s not the way bureaucrats think. That’s not the way politicians think. They want control. They want to regulate everything.”\n\nRogers does not expect the world to convert to Bitcoin or adopt cryptocurrencies as it has been touted in many circles. Even though digital assets live in the computer, it will always be government computer money, given the kind of regulations always in play.\n\nThe remarks echo the stringent regulatory scrutiny that has seen many governments try to curtail the mining and trading of cryptocurrencies. China has been at the forefront of regulations significantly hurting cryptos' sentiments and prospects.\n\nLikewise, the governments have sought to foster the development of central bank-powered decentralized cryptocurrencies that they will always be in a position to control, unlike normal cryptocurrencies.\n\n8. Inflation Will Persist for Long\n\nPrediction: September 2022\n\nThe US Federal Reserve has hiked interest rates at the fastest pace to highs of 5.5%. In the process, they have succeeded in pushing inflation from four-decade highs of 9.2% to about 3%. In September if last year Rogers reiterated inflationary pressures are far from over, even as the FED embarked on aggressive monetary tightening.\n\nAccording to Rogers inflation problem will only go away partially because governments have printed so much money in recent years. Therefore, even if it has come down significantly, it still needs to be finished.\n\nThe legendary investor has warned that a move by the central banks to hike interest rates in the race to address the inflation problem could end up being catastrophic. For starters, it could be the trigger that will end up tipping the economy into recession.\n\n7. Recession is Inevitable and going to be Bad\n\nPrediction: October 2022\n\nDue to the high inflation environment, the economy will not avoid recession, according to Jim Rogers. The fact that it has been the longest time in history that the US has struggled with serious problems heightens the prospect of the economy plunging into recession.\n\nWhile the recession might have already started, according to Rogers, it’s not been bad because there have been some good things along the way. However, things are likely to turn out for the worst as debt has gone up so much over the past 15 years.\n\n6. Agriculture Key to Fighting Inflation and Recession\n\nPrediction: October 2022\n\nWhile the focus has been on emerging technologies such as artificial intelligence, blockchain, and cryptocurrencies, Rogers insists that agriculture will always be key. While agriculture might not seem as exciting as revolutionary technologies, it will always be an essential part of the economy and society.\n\nTherefore, Rogers believes agriculture is yet to gain the traction it deserves in the global economy, therefore, providing interesting and significant investment opportunities.\n\n\"Agriculture has been a disaster for years,\" he said. \"And usually, if you buy a disaster, things turn out OK.\"\n\nGiven the consistent demand for food, even on soaring inflation or recession, agriculture will always provide opportunities for growth and diversification of investment portfolios. In addition, rogers believe investors should always pay close watch to housing since food and shelter are part of basic human needs.\n\nClick to continue reading and see Jim Rogers's 5 Latest Predictions and Investments.\n\nSuggested articles:\n\n10 Best Rated Penny Stocks to Buy According to Analysts Billionaire Jeff Vinik's Stock Picks and 10-Year Performance 10 Stock Market Forecasts Next 6 Months\n\nDisclosure: None. Jim Rogers's Latest Predictions and Investments is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/jim-rogers-latest-predictions-investments-164505980.html", "symbols": ["AAPL.US", "AMZN.US", "GOOGL.US", "GSPC.INDX", "META.US", "MSFT.US", "NVDA.US"], "tags": [], "sentiment": {"polarity": -0.997, "neg": 0.119, "neu": 0.798, "pos": 0.083}}, {"date": "2023-08-02T15:54:00+00:00", "title": "Will Slowing Services Growth Hurt Apple's (AAPL) Q3 Earnings?", "content": "Apple’s AAPL third-quarter fiscal 2023 results, to be reported on Aug 3, are expected to reflect the impacts of the sluggishness in the Services business.\r\n\r\nThe segment, which includes revenues from the App Store, Apple Music, iCloud, Apple Arcade, Apple TV+, Apple News+ and Apple Card, accounted for 22% of sales in second-quarter fiscal 2023.\r\n\r\nAlthough Apple’s business primarily runs around its flagship iPhone, the Services portfolio has emerged as the company’s new cash cow.\r\n\r\nApple had more than 975 million paid subscribers across its Services portfolio at the end of the fiscal second quarter. This is expected to have increased in the to-be-reported quarter thanks to the growing installed base of Apple’s devices.\r\n\r\nThe App Store has been continuing to draw the attention of prominent developers from around the world, helping the company offer appealing apps to drive the App Store traffic, thereby expanding the subscriber base.\n\nApple Inc. Revenue (TTM) Apple Inc. Revenue (TTM)\n\nApple Inc. revenue-ttm | Apple Inc. Quote\n\nThe company expects Services revenue growth to be negatively impacted by challenging macroeconomic conditions, unfavorable forex, as well as weakness in digital advertising and gaming. Services revenues grew 5.5% year over year to $20.91 billion in the fiscal second quarter.\r\n\r\nOur model estimates for Services revenues are pegged at $20.98 billion, indicating 7% growth from the figure reported in the year-ago quarter.\r\n\r\nClick here to know how Apple’s overall fiscal third-quarter results are likely to be.\n\nApple’s Non-iPhone Revenues to Decline in Q3\n\nApple’s non-iPhone portfolio, which comprises Mac, iPad and Wearables, is expected to have declined in the fiscal third quarter.\r\n\r\nThis Zacks Rank #3 (Hold) company expects Mac and iPad revenues to decline double digits on a year-over-year basis due to challenging comparisons and macroeconomic headwinds. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nMac revenues are expected to have suffered from weak PC demand. Per Gartner’s latest report, 59.7 million PCs were shipped in the second quarter (June-end) of 2023, down 16.6% from the year-ago period. Shipments from Lenovo LNVGY, HP HPQ and Dell Technologies DELL declined 20.8%, 0.9% and 21.8%, respectively. Apple witnessed a 0.3% decline, much better than Lenovo, HP and Dell’s figures.\r\n\r\nOverall, Lenovo remained the top vendor, with a market share of 24%. HP holds the second spot, with a market share of 22.5% in worldwide PC shipments. Dell’s market share was 17.4% in the second quarter of 2023.\r\n\r\nApple’s market share increased from 7.4% in second-quarter 2022 to 8.9% in second-quarter 2023.\r\n\r\nOur model estimate for Mac revenues for the fiscal third quarter is pegged at $5.60 billion, implying a 24.1% decline from the figure reported in the year-ago quarter.\r\n\r\nMoreover, for iPad our model suggests $5.58 billion, suggesting a 22.8% decline from the figure reported in the year-ago quarter.\r\n\r\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nApple Inc. (AAPL) : Free Stock Analysis Report\n\nHP Inc. (HPQ) : Free Stock Analysis Report\n\nDell Technologies Inc. (DELL) : Free Stock Analysis Report\n\nLenovo Group Ltd. (LNVGY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/slowing-services-growth-hurt-apples-155400213.html", "symbols": ["0992.HK", "12DA.F", "7HP.F", "7HP.STU", "7HP.XETRA", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "DELL.US", "HPQ.MX", "HPQ.US", "LHL.F", "LHL1.F", "LHL1.STU", "LNVGF.US", "LNVGY.US"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.018, "neu": 0.877, "pos": 0.106}}, {"date": "2023-08-02T15:50:12+00:00", "title": "Apple earnings, Amazon.com reports, Anheuser Busch: 3 things to watch", "content": "Investing.com -- Stocks were sinking on Wednesday after an unexpected U.S. credit downgrade by Fitch Ratings spooked investors and sent the tech sector lower.\n\nTech stocks have been rallying all year on the prospect of easing conditions for interest rates. Fitch downgraded the U.S. on Tuesday night, citing increased polarity in Washington over debt ceiling and other negotiations that point to a deterioration in governance standards. The Treasury Department pushed back at the firm's assertions.\n\nStill, it was enough to weigh on markets amid a deluge of corporate earnings reports this week.\n\nAfter raising interest rates by a quarter of a percentage point in July, the Fed could be at or near the end of its rate hiking plans. It doesn't meet again about interest rates until September, and futures traders are not unanimous on when or whether another rate hike could come. Some see rates rising another quarter of a percentage point in September, some see it in November.\n\nFed officials meet later this month for their annual conference at Jackson Hole, Wyo., where top policy makers could provide some details on where they see the economy headed in the second half of the year.\n\nHere are three things that could affect markets tomorrow:\n\n1. Apple earnings\n\nTech giant Apple Inc (NASDAQ:AAPL) is expected to report earnings per share of $1.19 on revenue of $81.7 billion. Analysts will be listening for any details on new product launches and what is down the road.\n\n2. Amazon.com reports\n\nE-commerce giant Amazon.com Inc (NASDAQ:AMZN) is expected to report earnings per share of 35 cents on revenue of $131.4B.\n\n3. Anheuser Busch InBev\n\nBrewing giant Anheuser Busch Inbev (EBR:ABI) NV ADR (NYSE:BUD) is expected to report earnings per share of 67 cents on revenue of $15.4B.\n\nRelated Articles\n\nApple earnings, Amazon.com reports, Anheuser Busch: 3 things to watch\n\nDoorDash lifts core profit target for second time on higher orders\n\nC.H. Robinson sales and profit miss estimates on muted freight demand", "link": "https://finance.yahoo.com/news/apple-earnings-amazon-com-reports-155012196.html", "symbols": ["1NBA.F", "1NBA.XETRA", "AAPL.MX", "AAPL.US", "AAPL34.SA", "ABI.BR", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "ANH.JSE", "APC.F", "APC.XETRA", "BUD.US", "BUDFF.US", "ITKA.F"], "tags": [], "sentiment": {"polarity": 0.972, "neg": 0.023, "neu": 0.879, "pos": 0.098}}, {"date": "2023-08-02T15:39:13+00:00", "title": "20 Countries With the Highest Starting Salaries for Graduates", "content": "In this article, we will be covering the 20 countries with the highest starting salaries for graduates. This article will cover recent employment and labor market trends and look at highly rewarding companies that recruit fresh graduates. If you want to skip our detailed analysis, go directly to the 5 Countries with the Highest Starting Salaries for Graduates.\n\nThe Global Labor Market: An Overview\n\nThe COVID-19 pandemic not only brought distress to the physical health of the global population, but it left the world with a financial burden to recover from. Labor shortages, rising global inflation rates and unemployment rates, productivity constraints, and declining quality of work are some of the pandemic-induced crises. The International Labor Organization suggests that the global employment rate will only increase by 1% in 2023. The report further states that young adults and fresh graduates are increasingly finding it difficult to settle for a job. Over 1 of every 5 young adults are neither employed nor in education.\n\nExperts also raise eyebrows about the declining productivity and quality of work. According to the World Economic Forum, as of 2022, three in ten manufacturing and service companies in Europe reported declining productivity. The United States reported 70% of the job openings as unfilled in retail and wholesale, 55% in manufacturing, and 45% in the leisure and hospitality industry.\n\nWhile COVID-19 shook global economic roots, the pandemic fueled the otherwise steadily growing technology industry. Big data analytics and artificial intelligence have been one of the fastest-growing industries globally.\n\nAccording to a report by Fortune Business Insights, the global big data analytics industry was valued at $271.83 billion in 2022. The global big data analytics industry is expected to reach a valuation of $745.15 billion by 2030 at a compound annual growth rate (CAGR) of 13.5%. The big data analytics industry is dominated by North American companies, followed by countries in the Asia Pacific notably China, India, South Korea, Singapore, and Japan. Major players in the industry are International Business Machines Corporation (NYSE:IBM), SAP SE (NYSE:SAP), and Microsoft Corporation (NASDAQ:MSFT).\n\nStory continues\n\nAccording to a report by Fortune Business Insights, the Global artificial intelligence (AI) industry was valued at $428 billion in 2022. The Global Artificial Intelligence (AI) industry is expected to grow to a valuation of $2.025 trillion by 2030, at a compound annual growth rate (CAGR) of 21.6%.\n\nAs of November 2022, ChatGPT, the popular AI software gained over a million users in just five days after its official launch. Moreover, as of February 2023, Baidu, Inc. (NASDAQ:BIDU), a Chinese multinational technology company, launched its official AI chatbot. Additionally, big data giants like International Business Machines Corporation (NYSE:IBM) acquired Dialexa, a product engineering services firm, in September 2022. The acquiring company, International Business Machines Corporation (NYSE:IBM),  intended to integrate the use of technology to automate operations and enhance customer service. Such showcases the need to integrate technology and automate business solutions to compete globally.\n\nArtificial intelligence is used mostly within retail, IT, telecom, healthcare, advertising and media, manufacturing, and the automotive industry. North America dominates the artificial intelligence industry. As per the report, almost 80% of businesses based in the United States were optimistic and enthusiastic about the integration of AI in their businesses.\n\nWhile North America dominated the market share of the global AI industry in 2022, the Asia Pacific region is forecasted to grow at the fastest rate over the coming years, followed by emerging markets including Europe, Latin America, the Middle East, and Africa.\n\nIs AI Expected to Take Over the Labor Market?\n\nAccording to the World Economic Forum, 75% of companies are leaping through technological advancements. Big data, cloud computing, and artificial intelligence are notable technologies altering the economic landscape by enabling digital trade and e-commerce. Within the next five years, 86% of companies worldwide are expected to integrate digital platforms and apps into their business operations. Additionally, 74.9% of companies are expected to adapt to artificial intelligence by 2027.\n\nThe incidence of artificial intelligence alters the labor market landscape entirely. Artificial intelligence is changing how jobs are being done, and how people create content for their businesses and sell their commodities. According to the World Economic Forum report we cited above, thanks to generative AI, 19% of the workforce could have 50% of their workload automated. Moreover, 34% of human tasks in organizations are already being performed by machines or robots.\n\nOne can argue that the existence of AI may cost millions of people their jobs and household income. However, the key takeaway with AI being able to perform tasks could be the ability to set up businesses from the comfort of your homes without having to employ an army of workers. The real question stands, is AI stealing jobs or is it changing the economic landscape of the world for good?\n\nNotable Companies Popular Amongst Graduates\n\nLanding a well-paying job as a fresh graduate is a daunting experience. However, some companies have student and fresh graduate-friendly policies. Some of these companies are Alphabet Inc. (NASDAQ:GOOG), Apple Inc. (NASDAQ:AAPL), and Oracle Corporation (NYSE:ORCL).\n\nAlphabet Inc. (NASDAQ:GOOG), popularly known as Google, is one of the leading attractions for the workforce. A friendly work environment coupled with impressive employee benefits, tends to influence youngsters and Gen-Z to work at companies like Alphabet Inc. (NASDAQ:GOOG). The company owns a range of products to its name, including cloud-based software, google workspace, and Google-based tools. The company currently boasts a market cap of $1.679 trillion as of August 1, 2023.\n\nA report by Business Today stated that an Indian non-engineering graduate recently bagged a job at Alphabet Inc. (NASDAQ:GOOG) with a salary package of $60753/annum. The news comes as a surprise to the incoming labor force. While it is true that big names like Alphabet Inc. (NASDAQ:GOOG) hire fresh graduates, there has been little information on the internet about the company hiring non-engineering students for a level 1 job at the company. Such explains the attraction towards working at Alphabet Inc. (NASDAQ:GOOG) by students from all industries.\n\nApple Inc. (NASDAQ:AAPL) is another huge name in the global industry. This company is open to hiring fresh graduates and runs a variety of internship and graduate programs for students trying to launch their careers in the best way possible. As of August 1, 2023, the company boasted a market cap of $3.088 trillion. The company offers a range of full-time and part-time positions to fresh grads with little to no technical experience required.\n\nOracle Corporation (NYSE:ORCL), is an information technology enterprise based in the United States. As of August 1, 2023, the company boasted a market cap of $319.523 billion. The company is a leading name in the tech industry, offering a range of products including cloud-based enterprise resource planning services (ERP), cloud-based supply chain management services, and cloud-based customer management services. Oracle is one of the few companies that take the lead in hiring fresh graduates with their extensive graduate and internship programs. They offer programs to students with different academic backgrounds including engineering, software development, sales, marketing, consulting, and management. 20 Countries With the Highest Starting Salaries for Graduates\n\nCopyright: zimmytws / 123RF Stock Photo\n\nOur methodology\n\nWe shortlisted the 20 countries with the highest starting salaries using data from OECD, Indeed, and Glassdoor. Our process commenced with finding the global average annual salaries from the Organization for Economic Co-operation and Development (OECD). Using the data we developed a hypothesis stating that the rankings for the global annual average salaries are proportionate to the rankings for the highest starting salaries. Following our hypothesis, the preliminary data helped us shortlist the top 50 countries.\n\nNext, we moved toward finding the starting salaries for entry-level jobs for the shortlisted 50 countries. We then sorted our data in ascending order to compile the 20 countries with the highest starting salaries for graduates in the list below. All the salaries mentioned below are on a per/annum basis.\n\n20 Countries With the Highest Starting Salaries for Graduates\n\n20. Norway\n\nStarting Salary for Entry-Level Jobs: $15,155\n\nNorway is amongst the top 20 countries with the highest starting salaries for graduates. Norway is an attractive choice for students to study and work especially, because of its high salaries, relatively lower cost of living, and acclaimed work-life balance. Currently, the nursing and healthcare industry in Norway offers the highest number of jobs to its domestic and international prospective applicants. As of January 1, 2023, the employment rate in Norway is 69.7%.\n\nSome of the companies making leaps in technological integration for businesses are Alphabet Inc. (NASDAQ:GOOG), Apple Inc. (NASDAQ:AAPL), and Oracle Corporation (NYSE:ORCL).\n\n19. Japan\n\nStarting Salary for Entry-Level Jobs: $17,672\n\nJapan is amongst the top 20 countries offering high starting salaries for graduates. The Japanese market heavily invests in technology and therefore the most in-demand job as of 2023 is the position of a software engineer. These engineers are needed to keep up with global technological trends and therefore highly paid. As of January 1, 2023, the employment rate in Japan is 60.7%. While the employment rate is reasonable, there are rising concerns over labor shortages due to a lack of working women.\n\n18. Netherlands\n\nStarting Salary for Entry-Level Jobs: $24,609\n\nWith an average starting salary of $24609 per annum for entry-level jobs, the Netherlands is amongst the top 20 countries offering high starting salaries to graduates. As of 2023, jobs in the green sector, retail sector, construction sector, and IT sector are in high demand. According to the European Commission, the health and welfare sector is the largest sector in the Netherlands, offering 1.5 million jobs, followed by the retail and manufacturing industry accounting for 10% of the total jobs.\n\n17. Singapore\n\nStarting Salary for Entry-Level Jobs: $27,040\n\nSingapore is a highly attractive spot for its high salaries at an entry-level. While the cost of living is significantly higher compared to other countries, the general population still enjoys a luxurious standard of living. The average cost of living for a single person without rent is $1,165.7 per month. As of August 2023, the average consumer prices including rent and rent prices in Singapore are reported to be 7.8% and 20.7% higher than in Boston, United States, respectively. Popular jobs with a high number of reported vacancies available include customer service representatives, e-commerce specialists, teachers, and sales executives.\n\n16. Ireland\n\nStarting Salary for Entry-Level Jobs: $27,599\n\nLike most countries, Ireland also invests heavily in the technology and IT industry. Henceforth, the highly demanded jobs also lie within the technological sector. Other popular and in-demand jobs lie within the accountancy, construction, engineering, human resources industry, and healthcare industry. As of April 2023, the reported employment rate in Ireland increased to 73.6% from 73.2% in 2022.\n\n15. Spain\n\nStarting Salary for Entry-Level Jobs: $29,782\n\nSpain is not only a popular tourist attraction, but it is also a top choice for the global workforce. The company boasts a starting salary of $29782 per annum for entry-level jobs. However, to be able to work in Spain, one needs to be heavily skilled in their occupation. Some of the in-demand skills revolve around jobs in the sales, engineering, IT, and marketing sector. However, as of March 2o23, the unemployment rate in Spain rose to 13.3% with average monthly earnings at $2351.\n\n14. Belgium\n\nStarting Salary for Entry-Level Jobs: $30,809\n\nBelgium is a popular choice not only for the domestic labor market but also for the global labor market. The company has one of the most expat-friendly regulations. The country has advertised a range of skills they require in the country, these job openings are available to domestic and international workers alike. Most of the jobs are in the construction and IT sector.\n\n13. Canada\n\nStarting Salary for Entry-Level Jobs: $31,462\n\nCanada has one of the highest immigration rates in the world, primarily because of their extremely friendly expat regulations. Canada offers a range of immigration plans for people across the globe. In-demand jobs lie in the following industries: healthcare, management and technology, engineering and development, and software. Canada boasts a high starting salary for fresh graduates, primarily because of the highly educated workforce. According to a report, 58% of Canadians have a post-secondary education.\n\n12. New Zealand\n\nStarting Salary for Entry-Level Jobs: $35,239\n\nNew Zealand is home to 5.1 million people (2021), therefore, the country offers a long list of vacancies for people across the globe to choose from. Popular skills and jobs in high demand include customer service jobs, project management jobs, nursing jobs, and creative design jobs. As of March 2023, the employment rate in New Zealand stood at 69.5%.\n\n11. Italy\n\nStarting Salary for Entry-Level Jobs: $35,239\n\nItaly is amongst the economic powers in Europe, in terms of standard of living and employment opportunities. The country is amongst the top 20 countries with the highest starting salaries for graduates. Qualified workers with business, economics, statistics, IT, medicine, and engineering degrees are in high demand. Moreover, the country is also in need of manual workers, drivers, and waiters. As of June 2023, the employment rate in Italy was reported at 61.5%.\n\n10. United Arab Emirates\n\nStarting Salary for Entry-Level Jobs: $37,570\n\nPeople residing in the United Arab Emirates are known to have very luxurious lifestyles. The starting salary for entry-level jobs can testify to the fact that the UAE enjoys a particularly high standard of living. In-demand jobs in UAE relate to the healthcare industry, the data science industry, the digital marketing industry, and the sales industry.\n\n9. United States\n\nStarting Salary for Entry-Level Jobs: $37,670\n\nThe United States, particularly North America, is home to one of the largest information technology industries. With the startup culture on the rise, more and more software is being developed and employed, and integrated by companies across the country. Therefore, the most popular jobs involve employees skilled in cloud computing, Artificial intelligence, and sales leadership.\n\n8. United Kingdom\n\nStarting Salary for Entry-Level Jobs: $38,690\n\nSkills shortages have deeply impacted the United Kingdom as well. The United Kingdom ranks eighth amongst the top 20 countries with the highest starting salaries for graduates. Popular in-demand job roles include programmers, software developers, cyber security specialists, health care service providers, and architects.\n\n7. Australia\n\nStarting Salary for Entry-Level Jobs: $41,832\n\nWith the booming IT industry, jobs for software and programmers are in high demand. Moreover, with the aging population, there are an immense amount of vacancies for aged and disabled carers and registered nurses.\n\n6. Germany\n\nStarting Salary for Entry-Level Jobs: $43,944\n\nGermany is a technology hub in Europe, hence the demand for software developers and IT professionals. Other in-demand jobs include healthcare professionals, marketing professionals, and financial professionals. The employment rate in Germany decreased to 77.2% in the first quarter of 2023, from 77.3% as of 2022.\n\nIn addition to Alphabet Inc. (NASDAQ:GOOG), Apple Inc. (NASDAQ:AAPL) and Oracle Corporation (NYSE:ORCL) are also among the biggest companies that don't shy away from recruiting fresh graduates.\n\nClick to continue reading and see the 5 Countries With the Highest Starting Salaries for Graduates.\n\nSuggested articles:\n\n20 Countries with the Highest Minimum Wage in the World 25 Best Summer Jobs for College Students Average Salary in Each State in the US\n\nDisclosure: None. 20 Countries With the Highest Starting Salaries for Graduates is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/20-countries-highest-starting-salaries-153913940.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "APC.F", "APC.XETRA", "BIDU.US", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "IBM.US", "MSFT.US", "ORC.F"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.019, "neu": 0.862, "pos": 0.119}}, {"date": "2023-08-02T14:26:00+00:00", "title": "Apple, Amazon and 3 Other Key Earnings Charts", "content": "It’s another extremely busy earnings week with over 1,000 companies expected to report second quarter results. But there are several “big” earnings reports that everyone will be tuning into, including two of the Magnificent 7, Amazon and Apple.\n\nApple, Amazon and these 3 other companies are among the most popularly held by investors. All 5 have seen big rallies in 2023. None are “cheap” by a forward P/E basis but do investors care? It seems like valuation is irrelevant in 2023.\n\nIn addition, several of these stocks have great earnings surprise track records. Will another beat provide a catalyst to push these stocks even higher?\n\nApple, Amazon and 3 Other Key Earnings Charts\n\n1. Apple Inc. (AAPL) has an outstanding earnings surprise track record with just 1 miss in the last 5 years. It happened in early 2023 but that didn’t stop shares of Apple from rallying throughout 2023. Apple has hit new all-time highs this year and is up 50.6%. Apple is expensive, from what it has traded at historically. It has a forward P/E of 32.6. Does its valuation keep you out of Apple?\n\n2. Amazon.com, Inc. (AMZN) has put together 2 big beats in a row but has always had a hit-or-miss earnings surprise track record. Shares of Amazon have rallied big, gaining 57% year-to-date. Amazon is not cheap. It trades at 85.4x. But it has never been cheap, even after big sell-offs like last year. Is Amazon still undervalued?\n\n3. Booking Holdings, Inc. (BKNG) has beat 10 quarters in a row. That’s an impressive record for a travel company during the pandemic. Shares of Booking are up 44.6% year-to-date. It’s the cheapest of these 5 companies with a forward P/E of 22. Booking is trading near its all-time highs. Will Booking break out on this report?\n\n4. Airbnb, Inc. (ABNB) has beat 8 quarters in a row. If you recall, Airbnb was a pandemic IPO. It went public in late 2020. Shares of Airbnb have rallied this year, gaining 74%. Airbnb isn’t cheap either, with a forward P/E of 44.3. With travel so hot, should Airbnb be on your shortlist?\n\nStory continues\n\n5. DraftKings Inc. (DKNG) is coming off a miss last quarter, but prior to that miss, it had beat 5 quarters in a row. Shares of DraftKings have soared 179% year-to-date. DraftKings doesn’t have a P/E because it’s expected to lose $1.81 per share this year but that is an improvement from its loss of $3.16 last year. Will this earnings report be a further catalyst for DraftKings’ shares?\n\n[In full disclosure, Tracey owns shares of AMZN and BKNG in her personal portfolio.]\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\n\nApple Inc. (AAPL) : Free Stock Analysis Report\n\nBooking Holdings Inc. (BKNG) : Free Stock Analysis Report\n\nDraftKings Inc. (DKNG) : Free Stock Analysis Report\n\nAirbnb, Inc. (ABNB) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/apple-amazon-3-other-key-142600169.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABNB.US", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "DKNG.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.026, "neu": 0.781, "pos": 0.193}}, {"date": "2023-08-02T14:05:00+00:00", "title": "Apple, Amazon to Report Earnings: ETFs in Spotlight", "content": "The two of the world's largest corporations — Apple AAPL and Amazon AMZN — are in the spotlight as both are set to release earnings on Aug 3.\r\n\r\nApple stock has soared nearly 50% this year, recently breaching $3 trillion in market cap and is trading near an all-time high. Meanwhile, Amazon has climbed about 57% this year. The movement of the stocks over the next few days will depend on their earnings. Let’s delve into them (read: Take a Bite of These ETFs on Historic Apple's $3T Valuation).\r\n\r\nAccording to our methodology, the combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the chances of an earnings beat. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nApple\n\nApple has an Earnings ESP of +0.66% and a Zacks Rank #3. Apple saw positive earnings estimate revision of a penny over the past 30 days for the fiscal third quarter. Analysts raising estimates right before earnings — with the most up-to-date information possible — is a good indicator for the stock. The iPhone maker has a strong track record of positive earnings surprise. It delivered an average earnings surprise of 2.65% in the trailing four quarters.\r\n\r\nHowever, the Zacks Consensus Estimate indicates a modest year-over-year decrease of 0.8% for earnings and 2% for revenues (see: all the Technology ETFs here).\r\n\r\nThe stock belongs to a top-ranked Zacks Industry (top 43%) and has a solid Growth Score of B. The Zacks Consensus Estimate for the average target price is $197.22, with nearly 76% of the analysts giving a Strong Buy or a Buy rating ahead of the company’s earnings.\r\n\r\nAmazon\r\n\r\nAmazon has an Earnings ESP of +2.99% and a Zacks Rank #3. The stock saw no earnings estimate revision over the past 30 days for the second quarter. The Zacks Consensus Estimate indicates whopping year-over-year earnings growth of 240% and substantial revenue growth of 8.5% for the to-be-reported quarter.\r\n\r\nAdditionally, Amazon’s earnings surprise history is unimpressive, with a negative surprise of 11.30%, on average, in the last four quarters. The stock has a solid Growth Score of A but falls under a bottom-ranked Zacks industry (bottom 27%).\r\n\r\nThe Zacks Consensus Estimate for the average target price is $147.14, with nearly 97% of the analysts giving a Strong Buy or a Buy rating ahead of the company’s earnings.\n\nStory continues\n\nETFs to Tap\n\nGiven this, investors may want to play these stocks with the help of ETFs. Below, we have highlighted five ETFs having the largest exposure to these giants.\r\n\r\nVanguard Mega Cap Growth ETF (MGK)\r\n\r\nVanguard Mega Cap Growth ETF tracks the CRSP US Mega Cap Growth Index. It holds 96 securities in its basket, with the in-focus two firms collectively accounting for 22.5% of the total assets. It has key holdings in technology and consumer discretionary that account for double-digit exposure each (read: 5 Growth ETFs at New Highs to Start 2H).\r\n\r\nVanguard Mega Cap Growth ETF charges 7 basis points in annual fees and trades in a good volume of around 281,000 shares a day on average. The fund has AUM of $14.4 billion and a Zacks ETF Rank #2 (Buy).\r\n\r\nRoundhill BIG Tech ETF (BIGT)\r\n\r\nRoundhill BIG Tech ETF is the first-ever FAAMG ETF offering investors concentrated exposure to five mega-cap technology companies known as the “FAAMG” stocks. The three in-focus firms account for a combined 24% share in the basket.\r\n\r\nRoundhill BIG Tech ETF has amassed $3.8 million in its asset base and charges 29 bps in fees per year. It trades in an average daily volume of 5,000 shares.\r\n\r\nMicroSectors FANG+ ETN (FNGS)\r\n\r\nThis ETN is linked to the performance of the NYSE FANG+ Index, which is equal-dollar weighted and designed to provide exposure to a group of highly traded growth stocks of next-generation technology and tech-enabled companies. The note accounts for a 10% share in each of the two stocks (read: Best & Worst ETF Areas of First Half 2023).\r\n\r\nMicroSectors FANG+ ETN has accumulated $138.9 million in its asset base and charges 58 bps in annual fees. It trades in a moderate volume of 178,000 shares a day on average and has a Zacks ETF Rank #3 (Hold).\r\n\r\nInvesco QQQ Trust (QQQ)\r\n\r\nInvesco QQQ Trust provides exposure to the 101 largest domestic and international non-financial companies listed on the Nasdaq by tracking the Nasdaq 100 Index. Apple and Amazon take the combined 16.8% share in the basket.\r\n\r\nInvesco QQQ is one of the largest and most popular ETFs in the large-cap space, with AUM of $213.3 billion and an average daily volume of 49 million shares. QQQ charges investors 20 bps in annual fees and has a Zacks ETF Rank #2 with a Medium risk outlook.\n\nSingle-Stock ETFs\n\nSingle-stock ETFs have also been gaining immense popularity this year. Unlike traditional ETFs, which typically track a broad index or sector, single-stock ETFs provide exposure to the performance of one specific company by using derivatives. This allows investors to gain exposure to a particular stock without having to buy the stock directly (read: Guide to Single-Stock ETF Investing).\r\n\r\nDirexion Daily AAPL Bull 1.5X Shares (AAPU)\r\n\r\nDirexion Daily AAPL Bull 1.5X Shares tracks the 1.5 times the performance of the stock of Apple It charges 95 bps in annual fees and trades in an average daily volume of 134,000 shares. AAPU has AUM of $39.7 million.\r\n\r\nGraniteShares 1.75x Long AAPL Daily ETF (AAPB)\r\n\r\nGraniteShares 1.75x Long AAPL Daily ETF tracks the 1.5 times the performance of the stock of Apple. It charges 1.15% in annual fees and trades in an average daily volume of 14,000 shares. AAPB has gathered $4.1 million in its asset base.\r\n\r\nDirexion Daily AMZN Bull 1.5X Shares ETF (AMZU)\r\n\r\nDirexion Daily AMZN Bull 1.5X Shares ETF tracks the 1.5 times the performance of the shares of Amazon charging 95 bps in annual fees. It trades in volume of 157,000 shares a day on average and has accumulated assets worth $37.9 million.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\n\nApple Inc. (AAPL) : Free Stock Analysis Report\n\nInvesco QQQ (QQQ): ETF Research Reports\n\nVanguard Mega Cap Growth ETF (MGK): ETF Research Reports\n\nMicroSectors FANG+ ETN (FNGS): ETF Research Reports\n\nGraniteShares 1.75x Long AAPL Daily ETF (AAPB): ETF Research Reports\n\nDirexion Daily AAPL Bull 1.5X Shares (AAPU): ETF Research Reports\n\nDirexion Daily AMZN Bull 1.5X Shares (AMZU): ETF Research Reports\n\nRoundhill BIG Tech ETF (BIGT): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/apple-amazon-report-earnings-etfs-140500485.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.024, "neu": 0.81, "pos": 0.166}}, {"date": "2023-08-02T12:34:00+00:00", "title": "Why Apple (AAPL) Might Surprise This Earnings Season", "content": "Investors are always looking for stocks that are poised to beat at earnings season and Apple Inc. AAPL may be one such company. The firm has earnings coming up pretty soon, and events are shaping up quite nicely for their report.\n\nThat is because Apple is seeing favorable earnings estimate revision activity as of late, which is generally a precursor to an earnings beat. After all, analysts raising estimates right before earnings — with the most up-to-date information possible — is a pretty good indicator of some favorable trends underneath the surface for AAPL in this report.\n\nIn fact, the Most Accurate Estimate for the current quarter is currently higher than the broader Zacks Consensus Estimate of $1.19 per share. This suggests that analysts have very recently bumped up their estimates for AAPL, giving the stock a Zacks Earnings ESP of +0.66% heading into earnings season.\n\nApple Inc. Price and EPS Surprise Apple Inc. Price and EPS Surprise\n\nApple Inc. price-eps-surprise | Apple Inc. Quote\n\nWhy is this Important?\n\nA positive reading for the Zacks Earnings ESP has proven to be very powerful in producing both positive surprises, and outperforming the market. Our recent 10-year backtest shows that stocks that have a positive Earnings ESP and a Zacks Rank #3 (Hold) or better show a positive surprise nearly 70% of the time, and have returned over 28% on average in annual returns (see more Top Earnings ESP stocks here).\n\nGiven that AAPL has a Zacks Rank #3 and an ESP in positive territory, investors might want to consider this stock ahead of earnings. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nClearly, recent earnings estimate revisions suggest that good things are ahead for Apple, and that a beat might be in the cards for the upcoming report.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nApple Inc. (AAPL) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/why-apple-aapl-might-surprise-123400723.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0, "neu": 0.812, "pos": 0.188}}, {"date": "2023-08-02T11:19:00+00:00", "title": "3 Things About Apple That Smart Investors Know", "content": "As the world's most valuable company with a market cap of over $3 trillion, it might feel like the best time to buy Apple's (NASDAQ: AAPL) stock has long passed. Meanwhile, Apple has a solid outlook thanks to its increasing smartphone market share and growing prospects in the future of artificial intelligence (AI). Here are three things about Apple that smart investors know.\n\nContinue reading", "link": "https://finance.yahoo.com/m/172c8a7b-908a-3673-bee1-c29819e46bc8/3-things-about-apple-that.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.973, "neg": 0, "neu": 0.667, "pos": 0.333}}, {"date": "2023-08-02T10:41:00+00:00", "title": "Zacks Investment Ideas feature highlights: AT&amp;T, Apple, Verizon and Occidental Petroleum", "content": "For Immediate Release\n\nChicago, IL – August 2, 2023 – Today, Zacks Investment Ideas feature highlights AT&T T, Apple AAPL, Verizon VZ and Occidental Petroleum OXY.\n\n3 Tips on How to Steer Clear of \"Value Traps\"\n\nWhat is a \"Value Trap\"?\n\nIn Wall Street circles, a \"value trap\" refers to a situation where investors are drawn to a particular stock because its price appears to be very low, often with seemingly attractive metrics such as a low price-to-earnings (P/E) ratio or price-to-book (P/B) ratio. However, more times than not, many amateur investors fail to understand that there is often a good reason for the low price, such as poor fundamentals or slowing earnings growth.\n\nIn a value trap, though the price seems low already, the fundamental issues continue to erode value over time, though they once appeared to be a bargain. Avoiding value traps requires an investor to look beyond a low valuation ratio and consider other factors.\n\nHere are signs you may be in a value trap:\n\nThe Company Has \"Caretaker Management\"\n\nWhen a company has a long and successful past, management may fall into the \"caretaker\" trap. In other words, the company has so much cash on hand, and executives get paid such large salaries that there is little motivation to grow the business. For example, in 2022, AT&T CEO John Stankey hauled in more than $20 million in total compensation. Meanwhile, AT&T's EPS fell from 2.63 to 2.57 per share during the same time. In fact, AT&T's earnings have stagnated for years.\n\nStick to companies that are constantly innovating, such as Apple. Though Apple is a massive company, management is always searching for opportunities. Since 2016, AAPL has nearly tripled its annual EPS by innovating and unveiling new products such as the Apple Watch and the wildly popular AirPods. In the long run, the price of a stock is directly correlated to earnings growth.\n\nDividends May Lure You In\n\nStocks like Verizon pay healthy dividends (7.7%). While a 7.7% dividend may be attractive to income-focused investors, investors need to remember that dividends are not paid out in a vacuum. In other words, if a stock is plummeting, even a high dividend will not lead you to profitability. For example, though Verizon's dividend has increased over the past five years, the stock is down 42%.\n\nStory continues\n\nNot only would you be lagging if you were in a stock like VZ over that period, you would also have the added insult of injury of opportunity cost. For instance, the Nasdaq 100 is up 44.3% over the same time.\n\nGARP Is the Solution\n\nA GARP (Growth at a Reasonable Price) Strategy can help investors avoid value traps by balancing growth potential and valuation. Warren Buffett holding Occidental Petroleum is a great example – the company has a history of strong earnings growth and a reasonable valuation.\n\nConclusion\n\nSometimes, when you pay for a \"cheap stock,\" you get what you pay for. Caretaker management, slow growth, and the wrong environment could mean you're in a classic \"value trap.\" Use a GARP strategy to balance growth and value and get the best of both worlds.\n\nWhy Haven't You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performancefor information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAT&T Inc. (T) : Free Stock Analysis Report\n\nApple Inc. (AAPL) : Free Stock Analysis Report\n\nVerizon Communications Inc. (VZ) : Free Stock Analysis Report\n\nOccidental Petroleum Corporation (OXY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/zacks-investment-ideas-feature-highlights-104100978.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "BAC.F", "BAC.XETRA", "OPC.F", "OPC.XETRA", "OXY.US", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.059, "neu": 0.78, "pos": 0.16}}, {"date": "2023-08-02T09:50:41+00:00", "title": "Here’s Choice Equities Views on Apple (AAPL)’s Surge to Reach $3T in Market Cap", "content": "Choice Equities Capital Management, a hedge fund manager, released its second-quarter 2023 investor letter recently. You can view it here. In the second quarter, the fund returned +8.0% on a net basis which brought the year-to-date net performance to +9.0%. This compares to Russell 2000’s +5.2% gain for Q2 and +8.1% year-to-date. In addition, please check the fund’s top five holdings to know its best picks in 2023.\n\nChoice Equities Capital Management highlighted stocks like Apple Inc. (NASDAQ:AAPL) in the second quarter 2023 investor letter. Headquartered in Cupertino, California, Apple Inc. (NASDAQ:AAPL) is a multinational technology company that designs and manufactures smartphones, personal computers, tablets, wearables, and accessories. On August 1, 2023, Apple Inc. (NASDAQ:AAPL) stock closed at $195.60 per share. One-month return of Apple Inc. (NASDAQ:AAPL) was 2.23%, and its shares gained 17.74% of their value over the last 52 weeks. Apple Inc. (NASDAQ:AAPL) has a market capitalization of $3.077 trillion.\n\nChoice Equities Capital Management made the following comment about Apple Inc. (NASDAQ:AAPL) in its second quarter 2023 investor letter:\n\n\"Dramatic valuation differences across market cap sizes continue. This has been the case for some time now. Perhaps I have spent too much time discussing these dichotomies, as generally, I feel like if we pick the right stocks and manage market exposures thoughtfully, our equities- oriented portfolio will prosper across various market cycles. However, when markets become as lopsided as they have lately, I feel additional discussion on the market environment is worthwhile, if only to help highlight the opportunities that are available and the likely path forward. I expect future discussions to soon be focused again on our moderately concentrated portfolio. But for now, let’s take one last in-depth look at how far reaching these valuation dichotomies have again become.(Please note: charts that accompany the following can be found in the Appendix.)\n\nTake Apple Inc. (NASDAQ:AAPL) for example. It is the largest stock by market cap, and fairly considered one of the best companies in the world. The company has been extraordinarily successful and improved standards of living everywhere in the process with their ubiquitous products. Along the way, shareholders have been richly rewarded, with shares increasing nearly fourteen-fold over the last ten years while generating an annualized total shareholder return of 31%, including dividends.\n\nOn the back of another big quarter for large cap tech, it is now the first stock to surpass the $3T market cap threshold. This makes its weighting in the ~$37T market cap of the S&P 500, ~8%. It also means this one stock’s market cap is larger than that of the entire ~$2.98T market cap of the Russell 2000 index, the first time in history a single stock has outweighed the Russell 2000 – aside from two brief days in September 2020 when Apple’s market cap then accomplished the same...\" (Click here to read the full text)\n\nStory continues\n\nApple Inc. (NASDAQ:AAPL) is in 8th position on our list of 30 Most Popular Stocks Among Hedge Funds. As per our database, 131 hedge fund portfolios held Apple Inc. (NASDAQ:AAPL) at the end of first quarter which was 135 in the previous quarter.\n\nWe discussed Apple Inc. (NASDAQ:AAPL) in another article and shared the list of biggest green tech companies in the world. In addition, please check out our hedge fund investor letters Q2 2023 page for more investor letters from hedge funds and other leading investors.\n\nSuggested Articles:\n\n20 Countries That Produce the Most Sugar 25 Most Popular Spirits in the World I am 50 Years Old and Have No Retirement Savings\n\nDisclosure: None. This article is originally published at Insider Monkey.", "link": "https://finance.yahoo.com/news/choice-equities-views-apple-aapl-095041512.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "RUT.INDX"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.003, "neu": 0.877, "pos": 0.12}}, {"date": "2023-08-02T09:15:00+00:00", "title": "3 Top Tech Stocks to Buy in August", "content": "The tech market has been in recovery mode this year after an economic downturn caused a sell-off in 2022. Easing inflation and advances in technology, such as artificial intelligence (AI), have Wall Street particularly bullish. As a result, now is an excellent time to consider expanding your tech holdings before it's too late.\n\nContinue reading", "link": "https://finance.yahoo.com/m/bddb90ed-ca3c-3dc6-bdd0-e4d756a59fc4/3-top-tech-stocks-to-buy-in.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.832, "neg": 0, "neu": 0.85, "pos": 0.15}}, {"date": "2023-08-02T07:51:15+00:00", "title": "Apple's Blueprint: Indian Government Suggests Tesla Adopt Similar Strategy For Chinese Suppliers", "content": "This story was first published on the Benzinga India portal.\n\nIndian government officials suggested Tesla Inc (NASDAQ: TSLA) – currently discussing setting up a plant in India – partner with local firms to work with any Chinese suppliers the electric carmaker is currently involved with.\n\nWhat Happened? Officials from Tesla told the Indian government that they’d like some of their Chinese suppliers to establish operations in India to bolster the supply chain.\n\nAccording to sources speaking to Reuters, Indian authorities proposed that Tesla adopt Apple Inc’s (NASDAQ: AAPL) method, which involved gaining approvals for Chinese suppliers through local joint-venture partners. Direct approval for wholly-owned Chinese companies can prove challenging due to the intense scrutiny they’ve faced since the 2020 border disputes between India and China on their Himalayan border.\n\nWhy it matters? India’s tense relationship with China, following the 2020 border clashes, complicates Tesla’s plans to utilize crucial Chinese suppliers for parts that India lacks locally. This problem isn’t unique to Tesla; even the local Tata Motors sources battery cells from China.\n\nIn recent months, the Indian government has accepted some joint-venture partnerships between Chinese suppliers and Indian firms on a case-by-case basis. However, they remain cautious about Chinese companies expanding in India, particularly automakers.\n\nChinese car manufacturer BYD recently dropped a $1 billion investment plan for electric vehicles in India due to stringent scrutiny.\n\nRead next: BYD in Hot Water Over Alleged Tax Underpayment in India: Report\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Apple's Blueprint: Indian Government Suggests Tesla Adopt Similar Strategy For Chinese Suppliers originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/apples-blueprint-indian-government-suggests-075115445.html", "symbols": ["AAPL.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.961, "neg": 0.028, "neu": 0.867, "pos": 0.105}}, {"date": "2023-08-01T21:37:11+00:00", "title": "15 Most Popular Music Streaming Services", "content": "In this article, we’ll discuss the 15 Most popular music streaming services. If you want to skip our detailed analysis of the music industry and recent trends, then go directly to the 5 Most Popular Music Streaming Services.\n\nIn recent years, the music industry has undergone significant changes, and music streaming services have emerged as the dominant global format. Currently, global recorded music revenue is projected to grow at a rate of 7.5% in 2023, with a compound annual growth rate of 8.6% spanning from 2023 to 2030. This trend holds true for the United States as well, where streaming plays a crucial role in the overall music industry revenue, encompassing both physical and digital music sales. In fact, music streaming contributes a staggering 84% of the revenue in the U.S. music industry.\n\nGoldman Sachs Research suggests potential solutions to headwinds in the industry, such as pricing power, superfans monetization, and reevaluating the payment structure between streaming services and music labels. Lisa Yang, head of the European Media and Internet Research team, points out the current streaming practices and says,\n\n“Listening to a 31-second song by an independent artist, a full 3-minute song by a popular artist, and 5 minutes of the sound of rain are all treated equally.”\n\nThe team's projections indicate that monetizing superfans could generate an additional $2 billion in revenue for streaming platforms by 2027 and a significant $4 billion by 2030, thereby contributing a notable 16% boost to paid streaming revenues.\n\nThe music industry has also experienced a significant increase in investment companies acquiring music rights, with millions of dollars paid for music catalogs. This surge is driven by the belief that music rights can serve as a valuable asset class, capable of generating long-term income through royalties and licensing deals. Universal Music Group, Sony Music Entertainment, and Warner Music Group Corp. (NASDAQ:WMG)'s dominance in the industry positions them as the primary buyers of music rights.\n\nStory continues\n\nJustin Bieber recently made headlines with his music rights sale, fetching over $200 million from Hipgnosis Songs Capital, marking the most substantial deal among artists of his generation. This sale encompasses Bieber's entire back catalog, consisting of 290 songs released before December 31, 2021. Investment companies see the purchase of music rights as a strategic move, anticipating long-term income through licensing deals and royalty payments, particularly for works from beloved artists.\n\nNumerous prominent musicians, such as Bruce Springsteen, Mariah Carey, Pink Floyd, Adele, Shakira, and Taylor Swift, have made significant deals by selling their music catalogs to investment companies. In November 2021, Bruce Springsteen sold his music rights to Sony Music for approximately $500 million, as reported by The Conversation.\n\nSimilarly, Adele sold half of her music publishing rights to Sony Music for an estimated $130 million in 2021, while Shakira sold her entire music catalog to Hipgnosis Songs Fund for around $300 million in the same year. As the music industry continues to evolve, it is likely that more musicians will follow this trend and sell their music catalogs to investment companies.\n\nGiven the multitude of music streaming services available, you might think about which music streaming service has the best audio quality. When considering the best audio quality among music streaming services, it depends on the user's preference. Apple Inc. (NASDAQ:APPL) Music provides Lossless audio quality, surpassing Spotify Technology S.A. (NYSE:SPOT)'s high quality, but requires compatible devices and headphones to fully appreciate the difference. On the other hand, Amazon.com, Inc. (NASDAQ:AMZN) Music offers the highest quality with High Definition. But Amazon.com, Inc. (NASDAQ:AMZN) Music also requires compatible equipment to enjoy it fully.\n\nLet’s now explore more about the most popular music streaming services.  15 Most Popular Music Streaming Services\n\nPhoto by Tanner Boriack on Unsplash\n\nOur Methodology\n\nFor our list of the 15 most popular music streaming services, we based our ranking on the average number of users. We collect the data from reliable and up-to-date sources such as Business of Apps and Visual Capitalist. Data Note: The term \"music services\" encompasses both free and paid platforms utilized for music consumption in any format. On the other hand, \"music listeners\", in this context, refers to individuals aged 18 and above who dedicate any amount of time to listening to music. We selected services from various regions and platforms. The primary ranking criterion will be the number of active users for each music streaming service. We ordered the lists in ascending order of higher number of users.\n\nIf you’re interested, also check out 10 Best Music Stocks to Buy Now.\n\nHere is the list of the 15 most popular music streaming services.\n\n15. LiveOne\n\nAverage Number of Users: 2.23 Million\n\nLiveOne, previously known as LiveXLive powered by Slacker, is a music streaming service that seamlessly blends audio and video content. It offers a diverse range of content, including live streams of concerts and festivals, curated radio stations, podcasts, and live performances. Users can enjoy the platform on the web and through mobile apps, creating and sharing personalized music stations. LiveOne provides both free ad-supported access and subscription options that remove ads and offer additional features.\n\n14. Tidal\n\nAverage Number of Users: 4.2 Million\n\nLaunched in 2014, Tidal is a Norwegian-American music streaming service that prioritizes artists and fans, aiming to provide high-quality audio to the global music community. With over 100 million songs available in HiFi sound quality, including exclusives, podcasts, music videos, live concert recordings, and curated playlists, Tidal stands out from other platforms with its emphasis on artist ownership and control. Despite facing challenges and criticism, particularly regarding its high subscription fees, Tidal remains appealing to users who appreciate its focus on audio quality and artist-centric approach.\n\n13. Deezer\n\nAverage Number of Users: 12 Million\n\nDeezer is a French music streaming platform that provides a vast collection of more than 73 million tracks for its users. Despite experiencing robust revenue growth from 2021 to 2022, the reported user count experienced a slight decline. Nevertheless, Deezer remains present in over 180 countries and offers diverse subscription plans, including a free ad-supported version, while maintaining a loyal user base.\n\n12. MixCloud\n\nAverage Number of Users: 18 Million\n\nMixcloud was founded in 2008 by Nikhil Shah and Nico Perez during their time at the University of Cambridge. It is an online music streaming service catering to the listening and distribution of radio shows, DJ mixes, and podcasts. With its innovative approach, Mixcloud allows registered users to upload radio shows and podcasts through crowdsourcing. It has over 18 million active users and more than one million registered Facebook application users. Mixcloud's availability spans over 190 countries and includes partnerships with major labels, independent labels, and artists, ensuring a diverse array of music and audio content.\n\n11. SiriusXM\n\nAverage Number of Users: 46.7 Million\n\nSirius XM Holdings Inc. (NASDAQ:SIRI), another popular music streaming company in North America, offers a wide range of audio products, such as music, talk, news, comedy, entertainment, and podcasts. Sirius XM Holdings Inc. (NASDAQ:SIRI) provides monthly subscription packages with over 150 channels featuring music, news, entertainment, talk shows, and live sports. While Sirius XM Holdings Inc. (NASDAQ:SIRI) enjoys popularity among listeners who prefer terrestrial radio stations, it may not match the overall usage and subscriber numbers of Spotify Technology S.A. (NYSE:SPOT), Apple Inc. (NASDAQ:APPL) Music, and YouTube Music.\n\n10. Pandora\n\nAverage Number of Users: 56 million\n\nPandora is a subscription-based music streaming service. It holds the distinction of being the largest ad-supported audio entertainment streaming platform in the U.S. With 56 million monthly active users, Pandora originally started as an internet radio service, curating personalized channels based on musical traits and individual preferences. Expanding its offerings, the platform introduced Pandora Premium, an on-demand version of the service.\n\n9. SoundCloud\n\nAverage Number of Users: 64 Million\n\nSoundCloud is a German music streaming service. It empowers its users to upload, promote, and share audio content with others. Founded in 2007 by Alexander Ljung and Eric Wahlforss, the platform has a global presence and is considered among the most popular music streaming services. It is accessible in 190 countries and territories. SoundCloud has a vast community of over 64 million active monthly users, with a staggering collection of more than 200 million audio tracks available. But SoundCloud is still behind music streaming giants like Spotify Technology S.A. (NYSE:SPOT), Amazon.com, Inc. (NASDAQ:AMZN) Music, and Apple Inc. (NASDAQ:APPL) Music. To cater to a wider audience, SoundCloud provides both free and paid membership options, catering to users across mobile, desktop, and Xbox devices.\n\n8. TuneIn\n\nAverage Number of users: 75 Million\n\nTuneIn is a global audio streaming service that grants users access to a diverse array of content, including live news, radio, sports, music, and podcasts. With over 100,000 real radio stations worldwide, users can listen to various formats like AM/FM, HD, LP, digital, and internet stations. Sporting a user base of over 75 million monthly active users, TuneIn can be accessed through the TuneIn Radio app, website, and supported devices, including smart speakers. The platform also offers premium subscription options like TuneIn Live, delivering play-by-play calls from live sporting events and access to premium news stations. Though TuneIn enjoys a substantial user base, its popularity may vary depending on individual preferences and geographic regions.\n\n7. Gaana\n\nAverage Number of Users: 80 Million\n\nGaana, owned by Times Internet, stands as one of India's largest and most popular music streaming platforms. It has 80 million monthly users. Its vast catalog encompasses Hindi songs, Punjabi songs, regional languages, and devotional music. The platform's ambitious goal is to expand its user base to 500 million by 2023 while achieving three times revenue growth. With free, unlimited access to over 30 million Hindi songs, Gaana offers both free and premium subscription options. Despite the challenges in converting free users to paid subscribers, Gaana remains a popular choice among Indian music enthusiasts.\n\n6. Youtube Music\n\nAverage Number of Users: 80 Million\n\nYouTube Music was introduced in 2020 as a successor to Google Play Music and now stands as a music streaming service offering an extensive collection of songs, artists, and genres. Setting itself apart, YouTube Music not only provides official singles, new albums, top tracks, and the latest music videos but also offers personalized music mixes tailored to individual users. A distinctive feature of the platform is its greenlight for users to enjoy accompanying music videos while streaming their favorite tunes. With an impressive user base of million worldwide, YouTube Music holds the title of the most popular music streaming service concerning overall usage. However, in terms of subscribers, it follows behind industry giants Spotify and Apple Music.\n\nClick to continue reading and see the 5 Most Popular Music Streaming Services.\n\nSuggested Articles:\n\n11 Biggest Music Festivals in the World 12 Countries That Produce the Best Music 15 Best AI Tools for Education in 2023\n\nDisclosure: None. 15 Most Popular Music Streaming Services. is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/15-most-popular-music-streaming-213711428.html", "symbols": ["639.F", "639.XETRA", "AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "APPL.US", "RDO.F", "SIRI.US", "SPOT.US", "WA4.F"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.005, "neu": 0.832, "pos": 0.163}}, {"date": "2023-08-01T19:53:36+00:00", "title": "Apple heads for largest Q3 revenue drop since 2016 as iPhone sales slow", "content": "By Yuvraj Malik\n\n(Reuters) - Apple is likely to report a dip in iPhone sales in the April-June quarter as shoppers held out for a new model in a slow economy, making it important for the company to detail how it is using artificial intelligence to augment growth, analysts said.\n\nThe world's most valuable firm will wrap up Big Tech earnings on Thursday, with a likely 1.6% drop in total quarterly revenue, according to Refinitiv - its steepest drop in third-quarter revenue since 2016.\n\nIPhone sales likely fell more than 2% in the period, according to 24 analysts polled by Visible Alpha, compared with a near 3% increase a year earlier and a 1.5% rise in the quarter ended March.\n\nThe quarterly report could mark a break from an upbeat earnings season for the likes of Meta Platforms, Alphabet and Microsoft that have shown resilience in their cloud businesses and an uptick in digital ad sales.\n\n\"Apple is not immune to general macroeconomic trends and will continue to set the pace (for the smartphone industry) for quite some time,\" said Bob O'Donnell, founder of TECHnalysis Research.\n\nWith details about the new iPhone 15 expected next month - which could sport the more universally accepted USB-C port on some models - iPhone sales could get a small nudge in the July-September quarter, said analysts, who predicted a mixed bag of results for the period.\n\nApple traditionally does not provide quarterly outlook, but analysts expect the company may elaborate how it is using AI to improve its upcoming products.\n\nThe company has so far avoided buzzwords like AI at its events, in a contrast with tech giants including Alphabet and Microsoft. Last month, Bloomberg News reported Apple has quietly built its own framework to create large language models known as \"Ajax\".\n\n\"We expect Apple's updated comments on its AI aspirations to be a focus,\" analysts at Well Fargo wrote in a research note, adding that any commentary around the technology could boost the stock.\n\nStory continues\n\nApple's shares have gained more than 50% so far this year, compared with a nearly 37% increase in the tech-heavy Nasdaq Composite.\n\nIPHONE SLOWDOWN\n\nMuch of the weakness in iPhone sales is expected to come from the Americas, where revenue is set to fall 6%, analysts said. Sales from China - Apple's third-largest market - are expected to be flat due to an uneven economic recovery, though the company has fared better than Android rivals in the country.\n\nOverall smartphone shipments to China declined 2.1% in the second quarter, according to market research firm International Data Corp.\n\n\"Most investors feel a soft China could pose a risk to the numbers and further commentary, but Apple's position in China is on a solid footing and the company is likely to see only a small, if any, decline in iPhone sales,\" Piper Sandler analysts said.\n\n\"If there is any sales weakness from China, it is likely to be easily offset by strong sales momentum in India,\" they added.\n\nMac and iPad sales are expected to fall by 10.6% and 11.2%, respectively, according to Refinitiv data.\n\nBut the services business - home to Apple's App Store and audio and video streaming services - could be a bright spot thanks to an uptick in the ad market, some analysts said.\n\nThe business, which accounts for roughly a quarter of Apple's total revenue, is expected to grow 5.7% as it also benefits from price increases for iCloud subscriptions, though the pace is broadly similar to that in the preceding three quarters.\n\n(Reporting by Yuvraj Malik in Bengaluru; Editing by Sayantani Ghosh and Maju Samuel)", "link": "https://finance.yahoo.com/news/apple-heads-largest-q3-revenue-195336996.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.023, "neu": 0.873, "pos": 0.104}}, {"date": "2023-08-01T19:28:00+00:00", "title": "Apple Earnings Are Soon, and Analysts See the Stock Going Higher and Higher", "content": "For the fiscal third quarter, analysts expect Apple to report sales of $81.9 billion, down about 1% from the year-earlier quarter.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e83636e3-29fa-35d8-864b-a910efa70e49/apple-earnings-are-soon%2C-and.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-08-01T18:32:00+00:00", "title": "Amazon &amp; Apple Earnings: What to Expect", "content": "Earnings season continues to chug along, with the period kicking into a much higher gear this week. So far, the Q2 cycle has been positive, helping reassure investors and boosting overall sentiment within the market.\n\nAnd this week, we have many notable companies slated to report, including Amazon AMZN and Apple AAPL. Both companies will report after the market’s close on Thursday, August 3rd. Both stocks have staged big rebounds year-to-date, outperforming the general market handily.\n\nBut how do expectations stack up heading into their respective releases? Let’s take a closer look.\n\nAmazon\n\nAnalysts have kept their earnings expectations muted for the quarter to be reported over the last several months, with the $0.34 per share estimate unchanged. The market heavyweight is expected to see a solid recovery, with the value reflecting a 240% improvement in earnings from the year-ago quarter. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nAmazon’s top line is also forecasted to see growth; the Zacks Consensus Sales Estimate for the release presently stands at $131.5 billion, 8.5% higher year-over-year. It’s worth noting that the quarterly estimate is up a fractional 0.3% since the end of May.\n\nInvestors will wisely monitor Amazon Web Services (AWS) results. The Zacks Consensus Estimate for AWS net sales stands at $21.5 billion, indicating a 9% improvement from year-ago sales of $19.7 billion and reflecting a slight slowdown relative to prior year-over-year growth rates.\n\nThe company exceeded the consensus expectation for AWS net sales in its latest release, snapping a streak of back-to-back misses. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nIt’s worth noting that Amazon has posted sizable EPS beats in back-to-back releases, exceeding expectations by 47% and 40%. Below is a chart illustrating the share reaction to each of the company’s previous three prints. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nApple\n\nApple’s $1.19 per share estimate for the upcoming release is up a small 0.8% over the last 60 days, reflecting slight bullishness. The company’s earnings are forecasted to retract a modest 1% from the year-ago quarter.\n\nStory continues Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nThe tech titan is expected to post $81.3 billion in quarterly revenue, which reflects a modest 2% decline from year-ago sales of $83.0 billion. The quarterly estimate is down a fractional 0.1% since the end of May, reflecting neutrality among analysts.\n\nWhile iPhone revenue remains important, Apple’s Services results (cloud services, App Store, Apple Music, Apple Pay, and others) will also be closely monitored, as it’s quickly become a new source of growth for the company.\n\nThe Zacks Consensus Estimate for Services revenue resides at $20.8 billion, 6% higher than the year-ago quarter. In its latest release, Services revenue of $20.9 billion reflected a quarterly record.\n\nAnd to top it off, our expectation for quarterly iPhone revenue stands at $40.1 billion, 1.4% lower than the year-ago quarter. The technology titan exceeded iPhone revenue expectations by 4% in its last quarter.\n\nApple posted results above estimates in its latest release, with shares reacting favorably post-earnings. Below is a chart illustrating the share reaction to each of the company’s previous three prints. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nBottom Line\n\nWith an extensive list of companies scheduled to unveil quarterly results this week, investors will have more than plenty to remain busy with. So far, earnings have been better than expected, helping us avoid the ‘earnings apocalypse’ many had feared.\n\nOn Thursday, after the market’s close, we’ll hear from heavyweights Apple AAPL and Amazon AMZN.\n\nAnalysts have primarily left their top and bottom line expectations unchanged for both companies over the last several months, with investors likely to focus on Amazon’s AWS and Apple’s Services results.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\n\nApple Inc. (AAPL) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/amazon-apple-earnings-expect-183200325.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.015, "neu": 0.865, "pos": 0.12}}, {"date": "2023-08-01T17:30:00+00:00", "title": "Top 25 S&amp;P 500 Stocks by Index Weight for August 2023", "content": "The Standard & Poor's 500 Index, or simply the S&P 500, is a market-capitalization-weighted index of roughly 500 large-cap U.S. stocks. The index accounts for 80% of the market value of the U.S. equities market.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f823889c-6f93-3ac8-a6cb-75d502320a8f/top-25-s%26p-500-stocks-by.html", "symbols": ["4AB.F", "4AB.XETRA", "AAPL.MX", "AAPL.US", "AAPL34.SA", "ABBV.MX", "ABBV.US", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "AVGO.US", "AVGO34.SA"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0, "neu": 0.934, "pos": 0.066}}, {"date": "2023-08-01T16:00:00+00:00", "title": "Apple (AAPL) to Report Q3 Earnings: What's in the Offing?", "content": "Apple AAPL is set to report its third-quarter fiscal 2023 results on Aug 3.\r\n\r\nThe company expects the to-be-reported quarter’s year-over-year revenue growth to be similar to that of the March quarter due to unfavorable forex.\r\n\r\nThe Zacks Consensus Estimate for revenues is currently pegged at $81.26 billion, indicating a decline of 2.05% from the year-ago quarter’s reported figure.\r\n\r\nThe consensus mark for earnings is currently pegged at $1.19 per share, up by a penny over the past 30 days and indicating a 0.83% decrease from the figure reported in the year-ago quarter.\n\nApple’s earnings beat the Zacks Consensus Estimate in three of the trailing four quarters, the earnings surprise being 2.65% on average.\n\nApple Inc. Price and EPS Surprise Apple Inc. Price and EPS Surprise\n\nApple Inc. price-eps-surprise | Apple Inc. Quote\n\nLet’s see how things have shaped up for the upcoming announcement.\n\niPhone Revenues to Suffer From Low Demand\n\nApple’s fortunes are heavily reliant on the iPhone, which is by far its biggest revenue contributor. The device accounted for 54.1% of net sales in the last reported quarter, wherein sales increased 1.5% year over year to $51.33 billion.\r\n\r\nOur model estimates for fiscal third-quarter iPhone net sales are pegged at $39.97 billion, down 1.7% year over year.\r\n\r\nApple is expected to have shipped roughly 44 million iPhones in the third quarter of fiscal 2023, per our model.\r\n\r\nPer the latest Canalys report on worldwide smartphone shipments, Apple’s market share was unchanged year-over-year at 17% in second-quarter 2023, lagging Samsung’s 21%.\n\nServices Growth to Slow Down in Q3\n\nFor the fiscal third quarter, Services revenues are expected to grow year over year (similar March quarter) despite challenging macroeconomic conditions, as well as weakness in digital advertising and gaming.\r\n\r\nIn the fiscal second quarter, Services revenues grew 5.5% from the year-ago quarter to $20.91 billion and accounted for 22% of sales.\r\n\r\nNevertheless, an expanding paid subscriber base has been a key catalyst for the Services business, which is riding on the increasing popularity of the App Store and an expanding installed base of devices.\r\n\r\nApple has more than 975 million paid subscribers across its Services portfolio. App Store continues to grab the attention of prominent developers from around the world, helping the company to offer exciting new apps that drive traffic.\r\n\r\nServices like Apple TV+, Apple Arcade, Apple News+, Apple Card, Apple Fitness+ and Apple One bundle are expected to have contributed to overall growth.\r\n\r\nApple TV+ has been gaining recognition due to award-winning shows like Ted Lasso. Apple TV+ landed a record-breaking 54 Emmy Award nominations across its original titles this year.\r\n\r\nThe company’s animated movie, The Boy, the Mole, the Fox and the Horse, won an Oscar for Best Animated Short Film.\r\n\r\nApple’s impressive run at the award shows (Emmy, as well as Oscars) has been instrumental in driving recognition of Apple TV+ in the saturated streaming market currently dominated by the likes of Amazon AMZN prime video, Netflix NFLX and Disney’s DIS Disney+.\r\n\r\nHowever, that has not essentially turned into a market share gain for Apple TV+. According to 9TO5Mac, which cited a JustWatch report, Amazon prime video was #1 in terms of market share (21%) in the United States, trailed by Netflix (20%). Max, Disney+ and Hulu had 15%,13% and 11% market share, respectively. Apple TV+ maintained its market share of 6%.\r\n\r\nNevertheless, Apple has been keeping no stone unturned to make the TV+ service a success. At a much more affordable price of $4.99, Apple TV+ has been benefiting from quality content with its strong portfolio of original shows and movies.\r\n\r\nOur estimate for fiscal third-quarter Services net sales is pegged at $20.98 billion, up 7% year over year.\r\n\r\nCurrently, Apple has a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\n\nApple Inc. (AAPL) : Free Stock Analysis Report\n\nNetflix, Inc. (NFLX) : Free Stock Analysis Report\n\nThe Walt Disney Company (DIS) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/apple-aapl-report-q3-earnings-160000542.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.02, "neu": 0.83, "pos": 0.151}}, {"date": "2023-08-01T15:52:45+00:00", "title": "Qualcomm earnings, Shopify reports, CVS Health: 3 things to watch", "content": "Investing.com -- Stocks wobbled on Tuesday as investors took in a deluge of reports from S&P 500 companies as they await July's jobs report on Friday.\n\nIt's the busiest week of earnings, with reports due out later from Apple (NASDAQ:AAPL) and Amazon.com (NASDAQ:AMZN) among big tech names. Pharmaceutical giants Merck & Company Inc (NYSE:MRK)and Pfizer (NYSE:PFE) reported mixed results on Tuesday.\n\nBut investors are keenly focused on Friday's jobs report, which is expected to show the economy added 200,000 jobs, slightly cooling from the prior month, while unemployment is expected to remain at record-lows near 3.6%. The Federal Reserve is looking for signs that the tight labor market has shown some softening without sparking big job losses as it tries to balance its fight against inflation with its efforts to guide the economy to a soft landing.\n\nThe Fed doesn't meet to decide on interest rates again until September. Futures traders see the probability of the Fed remaining at current rate levels when it does meet then, while some see a 30% probability of it raising rates another quarter of a point in November.\n\nThe idea that the Fed could be at the end of its rate hikes is lifting tech stocks, pulling the Nasdaq higher by 37% so far this year.\n\nHere are three things that could affect markets tomorrow:\n\n1. Qualcomm earnings\n\nChip maker Qualcomm Incorporated (NASDAQ:QCOM) is expected to report earnings per share of $1.81 on revenue of $8.5 billion.\n\n2. Shopify reports\n\nThe website platform Shopify Inc (NYSE:SHOP) is expected to report earnings per share of 7 cents on revenue of $1.6B.\n\n3. CVS Health\n\nPharmacy chain and health provider CVS Health Corp (NYSE:CVS) is expected to report earnings per share of $2.13 on revenue of $86.4B.\n\nRelated Articles\n\nQualcomm earnings, Shopify reports, CVS Health: 3 things to watch\n\nLumen Technologies shares slide after posting loss of nearly $9 billion\n\nVF Corp cuts annual revenue forecast on cooling North America demand", "link": "https://finance.yahoo.com/news/qualcomm-earnings-shopify-reports-cvs-155245637.html", "symbols": ["307.F", "AAPL.US", "AMZN.US", "CVS.F", "CVS.MX", "CVS.US", "CVSH34.SA", "MRK.US", "PFE.US", "QCI.F", "QCI.XETRA", "QCOM.MX", "QCOM.US", "SHOP.TO", "SHOP.US"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0.042, "neu": 0.905, "pos": 0.053}}, {"date": "2023-08-01T15:51:00+00:00", "title": "Apple Could Return to Growth Later This Year", "content": "Scheduled to report fiscal third-quarter results on Thursday, investors will be watching to see if Apple (NASDAQ: AAPL) inches closer to a return to revenue growth. More importantly, investors will likely look to Apple's quarterly results to see if any trends or commentary from management point to a possible return to top-line growth later this year. Returning to growth during such a tough macroeconomic environment would make a great case for the resilience of Apple's business.\n\nContinue reading", "link": "https://finance.yahoo.com/m/97586655-98d1-31b5-b3b5-05117723a9ab/apple-could-return-to-growth.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.918, "neg": 0.018, "neu": 0.81, "pos": 0.172}}, {"date": "2023-08-01T15:50:52+00:00", "title": "Here's How Apple Could Win Big From AI", "content": "The tech giant reportedly developed an AI model, and that could be good news for investors in the long run.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f558c5e7-c0de-3ae5-bfa0-94cbf3db2cf7/here%27s-how-apple-could-win.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA"], "tags": [], "sentiment": {"polarity": 0.44, "neg": 0, "neu": 0.879, "pos": 0.121}}, {"date": "2023-08-01T15:31:55+00:00", "title": "3 Stocks That Need to Follow Elon Musk’s Rebranding Moves", "content": "I don’t know if you’ve been following the Elon Musk rebranding of Twitter. He’s now calling it “X” and plans to turn the social media platform into a super app where you can do just about everything.\n\n“In the months to come, we will add comprehensive communications and the ability to conduct your entire financial world. The Twitter name does not make sense in that context, so we must bid adieu to the bird,” Musk stated in a July 24 post.\n\nTime will tell if the eccentric billionaire made the right call.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nIn the meantime, it’s important to note that corporate rebranding is risky because you potentially alienate your core customer. Twitter/X is already losing hundreds of millions of dollars. Alienating customers further would be a death sentence for the social media platform.\n\nHowever, the impact of rebranding on stocks can be positive for shareholders. Investopedia pointed out that in 2007 Steve Jobs changed the name of the iPhone maker from Apple Computers to Apple (NASDAQ:AAPL) to reflect that the company was more than just computers. Oh, how right he was.\n\nHere are three companies that ought to be following Musk’s lead.\n\nGap (GPS) A close-up view of a Gap (GPS) sign in the window of a Los Angeles, California mall.\n\nSource: Alex Millauer / Shutterstock.com\n\nI can name at least three companies that have changed their corporate name to reflect the diversity of their holdings: Capri Holdings (NYSE:CPRI), Tapestry (NYSE:TPR), and Driven Brand Holdings (NASDAQ:DRVN). They haven’t suffered by changing their name to reflect their multi-brand status.\n\nYet, Gap (NYSE:GPS) continues to go by its legacy brand, even though other brands in the company are better growth vehicles. Rather than continue to remind investors how much of a disaster the Gap brand has become, it should create a name that implies a future with authentic growth brands.\n\nThat’s it: Retail Growth Brands Inc., or RGB, just like the late, great Supreme Court Justice Ruth Bader Ginsburg.\n\nHow bad has it gotten at the Gap group of companies?\n\nStory continues\n\nThey replaced former Chief Executive Officer (CEO) Sonya Syngal with Richard Dickson, the former president and CEO of Mattel (NYSE:MAT) and the man behind Barbie’s revival. At Athleta, its once-promising athleisure brand, it hired Chris Blakeslee, the former president of Alo Yoga.\n\nGiven how many women work at the four major Gap brands, it’s beyond crazy the board couldn’t find a qualified woman to lead the entire company.\n\nThat tells you all you need to know about the dysfunction at Gap. No wonder it’s traded under $20 for the past 20 months.\n\nRollins (ROL) pest control spray ROL stock dividend stocks\n\nSource: Shutterstock\n\nRollins (NYSE:ROL) is a company I’ve recommended to readers over the past few years. In 2016, I included the pest control company in a group of 10 stocks I thought every retirement portfolio should have.\n\n“Over the long haul, it hasn’t disappointed delivering 18 consecutive years of earnings growth and 14 consecutive years of dividend increases averaging 12%,” I wrote in May of that year.\n\nThe stock is up around 235% in the years since. However, its stock’s become much more volatile since the pandemic started in early 2020. Year-to-date, it’s up 11.7%, trailing the S&P 500 by over 800 basis points. One thing to remember about that lack of performance: Most of the index’s gains are from the “Magnificent 7,” the tech stocks all benefiting from artificial intelligence.\n\nTake out the Mag 7, and Rollins’ returns look just fine.\n\nOn July 26, the company reported healthy top and bottom line growth. Its revenues were $821 million, 14.9% higher than a year earlier. Excluding acquisitions, its revenues were up 7.7% year-over-year. In terms of net income, it earned $114 million on an adjusted basis, 12.2% higher than Q2 2022.\n\nWith industry-leading brand names such as Orkin and Critter Control, the Rollins name says little about those businesses.\n\nGameStop (GME) GameStop (GME) sign on side of building in blue early morning light\n\nSource: shutterstock.com/EchoVisuals\n\nGameStop (NYSE:GME) and AMC Entertainment (NYSE:AMC) are two meme stocks that I will not recommend to any investors. They are ridiculously overvalued and represent everything bad about the current investment environment.\n\nHowever, I don’t have a problem recommending that the video game retailer rebrand to something other than GameStop. This legacy name is like a chain around its neck, constantly dragging it down. Serious investors will continue to keep it off their watchlists.\n\nIt doesn’t help that the Chewy (NYSE:CHWY) co-founder and GameStop savior, Ryan Cohen, keeps mowing through senior management. CEO Matt Furlong was shown the door in June after two years in the top job. On July 27, former chief financial officer (CFO) Diana Saadeh-Jajeh resigned after just a year.\n\nGamesIndustry.biz managing editor Brendan Sinclair wrote a scathing piece about GameStop in June. If you’ve got any thoughts on buying GME stock, do yourself a favor and read his article. It’s spot on.\n\nSinclair’s strongest point is that the company has known for years that its days selling video games through brick-and-mortar stores were done. Digital was the only way. Yet, it continues to sputter on that front.\n\n“But the idea that Cohen has a brilliant plan to fix everything in one fell swoop is simply not credible. He’s essentially been in charge for years now, the fundamental business is still the same, and the user experience online or in-store is not meaningfully better. Bafflingly, it may actually be worse.” Sinclair wrote on June 9.\n\nWith $1.3 billion in cash on its balance sheet, it’s got plenty to do a full-scale rebrand. Unfortunately, as Sinclair pointed out, it’s likely far too late.\n\nOn the date of publication, Will Ashworth did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nWill Ashworth has written about investments full-time since 2008. Publications where he’s appeared include InvestorPlace, The Motley Fool Canada, Investopedia, Kiplinger, and several others in both the U.S. and Canada. He particularly enjoys creating model portfolios that stand the test of time. He lives in Halifax, Nova Scotia.\n\nMore From InvestorPlace\n\nThe #1 AI Name for 2023 Could Be About to Ignite This $20.6 Trillion Wealth Shift Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The $1 Investment You MUST Take Advantage of Right Now The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 3 Stocks That Need to Follow Elon Musk’s Rebranding Moves appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-stocks-elon-musk-rebranding-153155462.html", "symbols": ["AAPL.US", "AMC.US", "CHWY.US", "CPRI.US", "DRVN.US", "GAP.F", "GME.US", "GPS.MX", "GPS.US", "GS2C.F", "MAT.US", "RLS.F", "ROL.US", "TPR.US"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.044, "neu": 0.873, "pos": 0.082}}, {"date": "2023-08-01T12:05:00+00:00", "title": "3 Stocks That Are Fantastic Deals Right Now", "content": "The Nasdaq has risen nearly 40% since the beginning of the year as investors warmed up to higher-growth tech stocks again. However, many investors might be reluctant to chase that rally as interest rates stay elevated.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a2a0da50-e186-348a-bb51-5e8413ca2f4b/3-stocks-that-are-fantastic.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "APC.F", "APC.XETRA", "FB2A.F", "FB2A.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0.048, "neu": 0.831, "pos": 0.121}}, {"date": "2023-08-01T11:45:00+00:00", "title": "Apple Stock: Headed to $220?", "content": "One analyst thinks China and India sales could be a bright spot in Apple's fiscal third-quarter earnings report this week.\n\nContinue reading", "link": "https://finance.yahoo.com/m/aca2940f-07d7-3693-aeaf-a6d47ae48ced/apple-stock%3A-headed-to-%24220%3F.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.44, "neg": 0, "neu": 0.873, "pos": 0.127}}, {"date": "2023-08-01T10:17:52+00:00", "title": "Apple, Microsoft remain world's top 2 companies by market cap", "content": "Tech giants Apple and Microsoft remained the top two global companies by market capitalisation at the end of July after riding this year's rally in technology shares.\n\nApple last month became the first company in the world to reach a market value of $3 trillion, buoyed by hopes over its expansion in new markets and expectations for more moderate U.S. interest rate hikes.\n\nStrong quarterly earnings from companies such as Alphabet, Meta Platforms, chipmaker Intel and chip equipment maker Lam Research lifted overall market sentiment last month.\n\nFacebook-owner Meta's market cap jumped more than 10% in July, thanks to the company's rosy revenue forecast and robust ad revenue growth in the second quarter.\n\nBeat Wall Street estimates\n\nMicrosoft also beat Wall Street estimates for its fiscal fourth-quarter revenue, driven by growth in its cloud computing and office software businesses, although its share price slipped back 1.4% in July after it also laid out an aggressive spending plan to meet demand for artificial intelligence services.\n\nIts market cap stood at $2.49 trillion at the end of July.\n\nApple earnings due\n\nApple is due to announce its earnings for the April-June quarter on Thursday.\n\n\"We continue to strongly believe a new tech bull market has started this year, and we believe the AI Gold Rush is a \"1995 Moment\" akin to the start of the Internet and NOT a 1999/2000 Bubble Moment,\" said Wedbush analyst Dan Ives in a note last week.\n\nIn the financial sector, JP Morgan Chase's market cap grew about 8.6% last month, as the largest U.S. lender earned more from borrowers' interest payments and benefited from the purchase of First Republic Bank.\n\nRefinitiv data shows 69% of large- and mid-cap U.S. companies have surpassed analysts' Q2 earnings estimates so far, with the tech sector accounting for 82% of these positive surprises.\n\n(Reporting By Patturaja Murugaboopathy and Gaurav Dogra in Bengaluru; Editing by Susan Fenton)", "link": "https://finance.yahoo.com/news/apple-microsoft-remain-worlds-top-101752148.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA"], "tags": [], "sentiment": {"polarity": 0.99, "neg": 0.009, "neu": 0.855, "pos": 0.136}}, {"date": "2023-08-01T10:00:08+00:00", "title": "7 Growth Stocks That Are Still Great Buys Even as Interest Rates Peak", "content": "The Federal Reserve recently lifted interest rates to their highest level in 22 years. The fed funds target rate now sits at 5.25% to 5.5%. This was the fourth rate hike this year and 11th since the central bank began raising rates in March 2020 in an effort to tamp down inflation. And while a rising rate environment is typically bad news for growth stocks, 2023 has been a banner year thus far for high-return growth stocks.\n\nIn addition to the rally in technology stocks this year, largely fueled by excitement over the promise of artificial intelligence (AI), growth stocks are benefitting from a brighter-than-expected economic picture and the belief that the Fed is either done or very close to finished hiking rates.\n\nIf this is true, the rally in high-potential growth investments is likely just getting started. Here are seven stable growth stock picks in anticipation of a rate peak.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nEntegris (ENTG) a machine manufactures semiconductor chips in a factory setting. AI Semiconductor Stocks\n\nSource: Shutterstock\n\nMassachusetts-based Entegris (NASDAQ:ENTG) supplies advanced materials and systems used in the semiconductor device fabrication process, as well as other high-tech industries like life sciences. Shares are up 67% so far in 2023 as money flowed back into the tech sector.\n\nENTG’s advance has accelerated in the past three months, following the release of the company’s first-quarter results. Revenue surged 42% year over year to $922.4 million. That was better than expected, as were adjusted earnings of 65 cents per share.\n\nIn May, Entegris announced the opening of a state-of-the-art manufacturing facility in Taiwan that is designed to boost the company’s production capabilities of critical semiconductor materials while reducing waste.\n\nRoughly half of the world’s semiconductor chips are made in Taiwan, and Entegris has a longstanding relationship with Taiwan Semiconductor Manufacturing (NYSE:TSM), one of the world’s top chipmakers. Further, Taiwan is only increasing in importance as a chip hub as tensions between the U.S. and China rise.\n\nStory continues\n\n“Our investment is just a sign of the conviction we have in the future of the semiconductor industry in Taiwan,” Entegris Chief Executive Officer (CEO) Bertrand Loy told Nikkei Asia.\n\nAdobe (ADBE) Adobe logo on the smartphone screen is placed on the Apple macbook keyboard on red desk background. ADBE stock.\n\nSource: Tattoboo / Shutterstock\n\nAdobe (NASDAQ:ADBE), one of the best-known software makers, is up 62% year to date. That performance puts it on par with some of the “Magnificent Seven.”\n\nThe company is clearly riding the AI wave higher, having invested heavily in the technology. Its AI-powered tools include Adobe Firefly, which allows users to create images and transform text, and Adobe Sensei, which has been integrated with programs such as Photoshop and Lightroom to improve functionality and efficiency.\n\nAdobe posted better-than-expected quarterly results in mid-June. Revenue was up 10% year over year to $4.82 billion, exceeding the $4.77 billion analysts expected. And adjusted earnings per share of $3.91 easily topped the consensus estimate of $3.79 a share.\n\nChief Financial Officer (CFO) Dan Durn told Barron’s that generative AI should drive revenue and profit growth for decades to come. And Morgan Stanley analyst Keith Weiss cited the company’s AI push as the reason for raising his price target on the stock to $660, which is more than 20% above the current price.\n\nThe combination of AI and the potential end to the latest interest-rate-hike cycle could prove very powerful for ADBE.\n\nApple (AAPL) Apple (AAPL) logo on an Apple store in Santa Monica, California.\n\nSource: View Apart / Shutterstock.com\n\nApple (NASDAQ:AAPL) stock has powered higher this year, rising 53%. This is despite the tech giant reporting fiscal Q2 results in May that showed the company’s second consecutive quarter of declining year-over-year sales. Still, earnings beat estimates in the most recent quarter on stronger-than-expected iPhones sales, and investors continued to pile into shares.\n\nApple is set to report fiscal third-quarter results this week. Investors will be watching the report closely. According to Barron’s, analysts at Piper Sandler and Wedbush are telling investors to buy shares even if management’s forecast comes with a warning of a tough smartphone market. Both firms now have a $220 price target on the stock, implying upside of 12%.\n\nApple has plenty going for it. While Mac sales are slumping, services revenue is growing at an impressive clip. The company is looking to India as an opportunity for expanding its consumer and manufacturing base. Additionally, Apple is expected to release its AR/VR headset in 2024, which could create a new product revenue stream for the company. Finally, Apple recently announced it has entered the AI chatbot race.\n\nAll told, AAPL stock is probably one of the most stable growth stock picks you could have in your portfolio\n\nSnowflake (SNOW)  Snowflake symbol and logo at the company corporate headquarters in Silicon Valley. SNOW stock.\n\nSource: Sundry Photography / Shutterstock\n\nCloud-based data warehouse company Snowflake (NASDAQ:SNOW) is up 24% year to date, beating the S&P 500’s 19% return but not by as much as most of the other high-potential growth investments on today’s list.\n\nThe company reported better-than-expected revenue and earnings for its fiscal first quarter on May 24. Revenue jumped an impressive 48% year over year, albeit much slower than the 85% growth of the comparable year-ago quarter. Adjusted earnings of 15 cents per share beat the 5-cent estimate, and adjusted free cash flow rose 58% year over year to $287 million. But investors got spooked when management’s forecast for the current quarter and full year came in light.\n\nYet, the company maintains its long-term forecast of hitting $10 billion in product revenue by fiscal 2029, as a Scotiabankanalyst notes. Moreover, the analyst “is confident Snowflake will benefit from a new product cycle in 2024 and 2025, including new offerings targeting artificial intelligence and data science applications,” Barron’s reports.\n\nThis prompted Scotiabank to upgrade SNOW stock to “outperform” and raise its target price to $212 from $137. The new target is 19% above where shares currently trade.\n\nACM Research (ACMR)  a magnifying glass enlarges the ACM logo on a website\n\nSource: Pavel Kapysh / Shutterstock.com\n\nACM Research (NASDAQ:ACMR) predominantly provides cleaning equipment for semiconductor wafers, but it is expanding into other areas of high-end semiconductor equipment. Shares of the small-cap growth stock are up 70% on a year-to-date basis.\n\nACM Research reported first-quarter results on May 5. Shipments of $89 million were up 33% from a year ago, while revenue increased 76% to $74.3 million. Net income of $7.15 million compared very favorably to a loss of $5.79 million a year ago.\n\nAccording to Gurufocus, the company’s three-year revenue growth rate stands at 47%, better than 94% of its peers. And analysts are forecasting revenue will increase more than 40% this year.\n\nAnalysts are bullish on the stock, with seven rating it a “buy” and just one “hold.” Their average price target of $21.59 is 65% above the current price.\n\nAdvanced Micro Devices (AMD)  Sign of AMD office in Markham, Ontario, Canada. Advanced Micro Devices, Inc. is an American multinational semiconductor company.\n\nSource: JHVEPhoto / Shutterstock.com\n\nSemiconductor stocks have performed very well in 2023, and Advanced Micro Devices (NASDAQ:AMD) is no exception, rising 77%. That’s more than double the return of competitor Intel (NASDAQ:INTC) but far less than Nvidia’s (NASDAQ:NVDA) 200%-plus surge. This puts AMD in a sort of sweet spot that could mean big returns for growth investors.\n\nWhile Nvidia makes the most-powerful chips that are used to power AI-related technologies, AMD isn’t too far behind. In fact, according to MosaicML, AMD’s AI chips are about 80% as fast as the ones Nvidia makes.\n\n“Hanlin Tang, chief technology officer of MosaicML, said that the company believes that further software updates from AMD that are in the works should help its MI250 chip match the performance of Nvidia’s A100,” Reuters reports.\n\nFor those who feel they’ve missed the run-up in NVDA stock, AMD shares could offer a second chance.\n\nYum China (YUMC) YUM stock: the yum logo on the side of a building\n\nSource: JHVEPhoto / Shutterstock.com\n\nYum China (NYSE:YUMC) operates many of the Yum Brands (NYSE:YUM) chains that U.S. diners are familiar with but in China, including KFC, Pizza Hut and Taco Bell. It also includes local restaurants like Huang Ji Huang and Littel Sheep that specialize in Chinese cuisine. Collectively, Yum China is the largest restaurant firm in China with more than 13,000 locations.\n\nWhile shares are only up 12% year to date, underperforming the broader market, the growth stock remains attractive due to its size and massive customer base.\n\nYum China just reported second-quarter results that beat estimates on the top and bottom lines. Revenue increased 24% to $2.65 billion, while adjusted earnings per share of 47 cents beat by 8 cents. The company opened 422 net new stores during the quarter, and operating profit more than tripled on a year-over-year basis to $257 million.\n\nWall Street analysts currently have an average price target of $73.23 on shares, implying upside of around 20%. Yet, upgrades could start rolling in after the latest earnings report, as the company’s growth metrics and market penetration are difficult to ignore.\n\nOn the date of publication, Alex Sirois did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nAlex Sirois is a freelance contributor to InvestorPlace whose personal stock investing style is focused on long-term, buy-and-hold, wealth-building stock picks. Having worked in several industries from e-commerce to translation to education and utilizing his MBA from George Washington University, he brings a diverse set of skills through which he filters his writing.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live Wall Street Titan: Here’s My #1 Stock for 2023 The $1 Investment You MUST Take Advantage of Right Now It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 7 Growth Stocks That Are Still Great Buys Even as Interest Rates Peak appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-growth-stocks-still-great-100008044.html", "symbols": ["0YU.F", "AAPL.US", "ACMR.US", "ADB.F", "ADBE.US", "ADBE34.SA", "AMD.US", "ENQ.F", "ENTG.US", "INTC.US", "NVDA.US", "SNOW.US", "TSM.US", "YUM.US", "YUMC.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.016, "neu": 0.869, "pos": 0.115}}, {"date": "2023-08-01T09:17:00+00:00", "title": "3 Growth Stocks to Buy Before the Big Bull Rally", "content": "The improving economy sets the stage for bullishness. These companies -- and their stocks -- will benefit more than most.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9cbac106-753e-3537-b4c3-046bb9f805f1/3-growth-stocks-to-buy-before.html", "symbols": ["3E2.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "ETSY.US"], "tags": [], "sentiment": {"polarity": 0.7, "neg": 0, "neu": 0.775, "pos": 0.225}}, {"date": "2023-08-01T05:23:20+00:00", "title": "Busy earnings day, Meta reportedly prepares AI chatbot - what's moving markets", "content": "Investing.com -- Investors are preparing to sift through a deluge of corporate results on Tuesday from big-name brands like Merck, Starbucks and Caterpillar . Meanwhile, Facebook-owner Meta Platforms is reportedly gearing up to launch a new artificial intelligence chatbot that can take on the personas of different characters. Elsewhere, a bright pulsating sign on the roof of the headquarters of Elon Musk's newly-renamed social media group X is taken down after sparking controversy with local residents.\n\n1. Futures inch lower\n\nU.S. stock futures edged under the flatline on Tuesday as a new month of trading begins with a stream of corporate earnings set to be released.\n\nBy 05:16 ET (09:16 GMT), the Dow futures contract slipped by 97 points or 0.27%, S&P futures lost 12 points or 0.25%, and Nasdaq 100 futures dipped by 48 points or 0.30%.\n\nThe main indices closed out July in the green, with the benchmark S&P 500 jumping by 3.1% during the month after the close of dealmaking on Monday. It was the index's fifth straight month of gains - the longest such streak since 2021. The Dow Jones Industrial Average also climbed by more than 3% in July, while the tech-heavy Nasdaq Composite added around 4.1%.\n\nEmerging signs of cooling inflation, resilient economic activity, and expectations that the Federal Reserve may soon back away from an aggressive campaign of interest rate hikes have combined to help underpin a wide-spread rally in stocks. The second-quarter earnings season, meanwhile, has featured stronger-than-expected results from a host of major companies.\n\n2. Busy earnings week kicks into gear\n\nA rush of corporate returns is due out on Tuesday, accelerating the pace of a busy week that will see more than 160 S&P constituent firms report their latest quarterly earnings.\n\nHeadlining Tuesday's releases before the start of U.S. trading are pharmaceutical companies Merck (NYSE:MRK) and Pfizer (NYSE:PFE), as well as construction equipment giant - and economic bellwether - Caterpillar (NYSE:CAT). Chipmaker AMD (NASDAQ:AMD) and coffee chain Starbucks (NASDAQ:SBUX) will also unveil results after the bell.\n\nStory continues\n\nLater in the week, tech giants Amazon (NASDAQ:AMZN) and Apple (NASDAQ:AAPL) are scheduled to deliver their latest earnings.\n\nMore than half of the companies in the S&P 500 index have already reported. According to FactSet data cited by CNBC, four-fifths of these businesses have posted earnings that topped Wall Street estimates.\n\n3. Meta preparing to launch AI chatbots - FT\n\nMeta Platforms (NASDAQ:META) is preparing to release new artificial intelligence-powered chatbots that have different personalities, according to a report in the Financial Times, as the Facebook parent attempts to boost user engagement.\n\nCiting people familiar with the matter, the paper said Meta is working on prototypes that can carry on humanlike conversations. Some versions of the AI, known internally as \"personas,\" can take on various characters, the FT added. Sources also told the paper that Meta is exploring one chatbot that speaks like Abraham Lincoln or another that gives travel advice in the style of a surfer.\n\nThe chatbots, which the FT said could be launched as soon as September, are being designed to create a new search function and offer recommendations.\n\nMeta declined to comment to the FT.\n\nThe report comes as the Menlo Park, California-based tech giant has been facing fierce competition to attract users and keep them engaged with its platforms. Like other Silicon Valley players, Meta is also in a race to develop -- and ultimately profit from -- AI technology.\n\n4. Controversial X sign dismantled\n\nA large glowing X on the roof of the San Francisco headquarters of X - the short-text messaging company formerly known as Twitter - has been removed following a string of complaints from neighbors.\n\nThe flashing sign had been placed on top of the firm's Market Street high-rise offices last Friday. Over the weekend, 24 complaints about the X were filed with the city's building department, Reuters reported. Locals had been taking videos showing the pulsating light, criticizing it as an intrusive presence in the area.\n\nA spokesperson from San Francisco's Department of Building Inspection told Reuters that inspectors had observed the structure being dismantled on Monday, adding that the property owners will be fined for the \"unpermitted installation of the illuminated structure.”\n\nX, meanwhile, claimed the sign was taken down voluntarily.\n\nThe controversy comes as X's owner Elon Musk is attempting to overhaul the social media group and turn it into a so-called \"everything app\" that includes everything from payments to ride hailing. Musk has also said he would keep X in San Francisco despite what he described as a \"doom spiral\" of businesses leaving the city.\n\n5. Oil drifts lower\n\nOil prices slipped on Tuesday in a sign of potential profit-taking following a July rally that was supported by tightening global supplies and hopes for a rebound in demand in the second half of the year.\n\nBy 05:17 ET, U.S. crude futures traded 0.37% lower at $81.50 per barrel, while the Brent contract dropped 0.29% to $85.18 a barrel.\n\nAnalysts cited by Reuters argued that oil prices may be correcting after being overbought in recent months. Meanwhile, sentiment was dented by a private survey that suggested further weakness in the Chinese economy, the world's biggest crude importer.\n\nHowever, both U.S. crude and Brent settled at their highest levels since April on Monday, boosted in part by the prospect of output cuts by Saudi Arabia and Russia this month. Riyadh is also reportedly expected to extend its reductions into September at a meeting this Friday of the Organization of Petroleum Exporting Countries and allies.\n\nMeanwhile, investors are becoming more confident that the Federal Reserve may be able to bring down inflation without causing a wider collapse of the U.S. economy. According to analysts, such a scenario, which has been dubbed a \"soft landing,\" could help bolster fuel demand later this year in the U.S., the world's biggest oil consumer.\n\nRelated Articles\n\nBusy earnings day, Meta reportedly prepares AI chatbot - what's moving markets\n\nFactbox-China's measures to slow yuan depreciation\n\nExclusive-China asks some banks to reduce or delay dollar buying -sources", "link": "https://finance.yahoo.com/news/busy-earnings-day-meta-reportedly-052320050.html", "symbols": ["AAPL.US", "AMD.US", "AMZN.US", "CAT.US", "DJI.INDX", "FB2A.F", "FB2A.XETRA", "IXIC.INDX", "META.US", "MRK.US", "PFE.US", "SBUX.US"], "tags": [], "sentiment": {"polarity": 0.944, "neg": 0.045, "neu": 0.89, "pos": 0.065}}, {"date": "2023-08-01T03:22:48+00:00", "title": "Apple Supplier Foxconn Plans $500 Million Component Plants in India", "content": "(Bloomberg) -- Apple Inc.’s main supplier, Foxconn Technology Group, plans to increase its investments to more than $1.2 billion in southern India’s Karnataka state and add two component factories there, expanding a steady diversification from China to mitigate the risks of US economic and technology sanctions.\n\nMost Read from Bloomberg\n\nUS, Europe Growing Alarmed by China’s Rush Into Legacy Chips Charles Koch-Tied Group Seeks to Block Trump From GOP Nomination Asia’s Richest Families Fuel Race for Lucrative Finance Jobs Myanmar Junta Pardons Aung San Suu Kyi on Some Charges Singapore PM to Address Political Scandals in Parliament\n\nAt least one of the factories that the Taiwanese company plans to construct in Karnataka will produce Apple parts, including for iPhones, people familiar with the matter said. A formal announcement is expected as early as this week, the people said, declining to be named as the matter isn’t public. The second plant will also be in Karnataka, but their exact location has yet to be decided.\n\nFoxconn is spending $500 million on these two complexes on top of a $700 million facility it aims to build on a 300-acre site close to the airport in Bengaluru, the capital of Karnataka, Bloomberg News previously reported. That plant is likely to assemble iPhones and expected to create about 100,000 jobs.\n\nThe additional sites will bring the Apple partner’s envisioned new spending for India north of $1.2 billion, a big outlay for a Taiwanese company that traditionally assembles the vast majority of devices for Apple and other US brands from central and southern China.\n\nFoxconn’s moves in India highlight how the South Asian nation has fast become a popular destination for manufacturers scouting for an alternative to China amid growing tensions between Washington and Beijing. It’s also the result of a shift in the global supply chain that accelerated during the Covid-19 pandemic and war in Ukraine, and could reshape the way electronics are made.\n\nStory continues\n\nApple didn’t reply to a request for comment. Foxconn didn’t respond to an email for comment. The Karnataka state government didn’t respond to a request for comment outside of business hours.\n\nApple suppliers such as Foxconn have ramped up business in India over the past few years thanks to Prime Minister Narendra Modi’s incentives to boost local manufacturing. Foxconn and smaller Taiwanese rival Pegatron Corp. now both operate iPhone assembly facilities in the southern state of Tamil Nadu. Other states such as Karnataka have also wooed companies with quick decision-making, cutting down on red tape and throwing in subsidies.\n\nSeparately, a Foxconn subsidiary also signed an initial agreement with the southern Tamil Nadu government to set up its own components plant with an investment of 16 billion rupees ($195 million), the state’s industries ministry said Monday. The project is likely to generate about 6,000 jobs.\n\nRead: Biden and Modi Announce Defense, Chips Deals at White House\n\nFoxconn’s decision suggests suppliers may move capacity out of China far faster than expected and is a coup for Modi’s government, which sees an opportunity to close India’s tech gap with China as Western investors and corporations sour on Beijing’s volatile regulations, slowing economy and US trading restrictions.\n\nFoxconn’s sprawling iPhone assembly complex in the Chinese city of Zhengzhou — currently the world’s biggest source of Apple’s marquee gadget — employs some 200,000, though that number surges during peak production season.\n\nOutput at the Zhengzhou plant plunged ahead of the year-end 2022 holidays due to Covid-related disruptions, one of several factors spurring Apple to re-examine its China-reliant supply chain.\n\n--With assistance from Debby Wu and Mark Gurman.\n\nMost Read from Bloomberg Businessweek\n\nInfluencers Built Up This Wellness Startup—Until They Started Getting Sick AI in Hollywood Has Gone From Contract Sticking Point to Existential Crisis The Stainless-Steel Boom Is Tearing a South African Mining Region Apart What China’s Real Estate Market Will Look Like in Five Years How a Farmhouse Renovation Inspired a Hotel-Decor Venture\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/apple-supplier-foxconn-plans-500-032248797.html", "symbols": ["2317.TW", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "HHP2.F", "HNHAF.US", "HNHPF.US"], "tags": [], "sentiment": {"polarity": 0.969, "neg": 0.047, "neu": 0.869, "pos": 0.084}}, {"date": "2023-07-31T23:54:16+00:00", "title": "Asian stocks push higher on tech strength, China lags", "content": "Investing.com -- Most Asian stocks rose on Tuesday, buoyed by strength in technology stocks as markets awaited major U.S. earnings this week, although Chinese markets lagged on more weak economic signals.\n\nRegional markets took positive cues from a strong overnight finish on Wall Street, although focus remained chiefly on upcoming earnings reports from Apple Inc (NASDAQ:AAPL) and Amazon.com Inc (NASDAQ:AMZN). But strong results from tech heavyweights Microsoft Corporation (NASDAQ:MSFT), Meta Platforms Inc (NASDAQ:META), and Alphabet Inc (NASDAQ:GOOGL) last week set a positive tone for the upcoming earnings.\n\nOptimism over improving global economic prospects - amid easing inflation and resilient growth in major economies - also spurred flows into risk-heavy stocks.\n\nTech-heavy indexes lead gains\n\nSouth Korea’s KOSPI was the best performer for the day, up over 1% on strength in heavyweight chipmaking stocks. Samsung Electronics Co Ltd (KS:005930) rose 1.2% after U.S. memory chip making peer Western Digital Corporation (NASDAQ:WDC) said that the worst for the industry was over, even as the firm forecast a bigger-than-expected quarterly loss and revenue drop.\n\nStrength in internet giants Alibaba Group Holding Ltd (HK:9988) (NYSE:BABA), Tencent Holdings Ltd (HK:0700), and Baidu Inc (HK:9888) (NASDAQ:BIDU) kept the Hang Seng index in positive territory, even as other sectors on the index logged steep losses. Property developer Country Garden (HK:2007) slid over 5% after it scrapped a $300 million capital raise.\n\nThe Taiwan Weighted index logged small gains, while Japan’s Nikkei 225 rose 0.6% on strong automobile and tech stocks.\n\nSentiment towards Japanese stocks was also aided by emergency bond buying by the Bank of Japan, which pushed up bets that the bank was in no hurry to tighten policy immediately.\n\nFutures for India’s Nifty 50 index pointed to a flat open, although both indexes were close to hitting record highs on strength in heavyweight tech stocks.\n\nStory continues\n\nStill, gains in most markets were limited as investors remained wary of key U.S. nonfarm payrolls data this week. Mixed economic cues from China also dented sentiment.\n\nAustralia’s ASX 200 rose 0.3% ahead of a closely-watched Reserve Bank decision later in the day. Markets are split over whether the bank will hike rates further.\n\nChinese stocks lag on weak PMIs, stimulus in focus\n\nChina’s Shanghai Shenzhen CSI 300 index rose just 0.1%, while the Shanghai Composite fell slightly as a private survey showed on Tuesday that the country’s manufacturing sector unexpectedly shrank in July.\n\nThe reading follows a dismal official survey for July, and shows that China’s biggest economic engines are seeing little signs of recovery this year.\n\nThe reading spurred more expectations of stimulus measures from the country, with officials promising more policies to boost domestic consumption and activity. But they have so far offered no clear specifics on the policies, which has left investors somewhat wary of local stocks.\n\nWhile the prospect of more Chinese stimulus had spurred strong gains in local stocks over the past week, the momentum now appears to be slowing.\n\nRelated Articles\n\nAsian stocks push higher on tech strength, China lags\n\nDaimler Truck post 15% revenue growth in second quarter\n\nYum China sticks to plan to open up to 1,300 new stores this year -CEO", "link": "https://finance.yahoo.com/news/asian-stocks-push-higher-tech-235416906.html", "symbols": ["0700.HK", "2007.HK", "9888.HK", "9988.HK", "AAPL.US", "AMZN.US", "BABA.US", "BIDU.US", "GOOGL.US", "HSI.INDX", "META.US", "MSFT.US", "WDC.US"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.066, "neu": 0.794, "pos": 0.14}}, {"date": "2023-07-31T21:07:35+00:00", "title": "Dow Jones Futures: Microsoft, Tesla At Key Support Levels; 5 Big Earnings Movers", "content": "Dow Jones futures: Microsoft and Tesla stock could soon offer new buy points. Big earnings movers late include Arista Networks.", "link": "https://finance.yahoo.com/m/f19e2eed-9631-3b48-812d-30f600ff1064/dow-jones-futures%3A-microsoft%2C.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ALGM.US", "APC.F", "APC.XETRA", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "SKAA.F", "SKX.US", "TL0.F"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-07-31T21:01:39+00:00", "title": "The 2023 stock market rally got a lot healthier in June and July", "content": "July has come and gone for investors, bringing with it a continuation and a new twist on the blistering stock market gains seen in the first half of this year.\n\nThe Tech sector (XLK), along with some of last year's biggest losers like Communication Services (XLC) and Consumer Discretionary (XLY), powered the market's rally through May.\n\nBut over the last two months, one of the biggest concerns among market bears — that the rally had become too concentrated — has been addressed with all 11 sectors in the S&P 500 (^GSPC) logging gains between June and July.\n\nAnd while the aforementioned stars of this year's rally are still playing a leading role, a surge in oil prices has brought Energy (XLE) into the fold with cyclical sectors like Materials (XLB) and Industrials (XLI) also sitting on gains north of 14% since June as optimism about the economy abounds.\n\nThis has left all sectors with the exception of Health Care (XLV) and Utilities (XLU) sitting on year-to-date gains through July.\n\nCombine this broad strength with the bullish year-to-date seasonality stats we've been compiling and the final five months of the year have some powerful tailwinds. Notable, however, that Tuesday brings us into August, which has been the weakest month of the year over the last 25 years. S&P 500 Sectors Were All Green from June to July 2023\n\nIn the table above, we can see that the three leading sectors until May were those that house the so-called 'Magnificent Seven' stocks, as well as the growthier names that tend to be less cyclical.\n\nThe Tech sector is home to much of the artificial intelligence trade, including Microsoft (MSFT) and Nvidia (NVDA). Apple (AAPL) which is up some 50% so far this year, is also a member of the Tech sector, too.\n\nAlphabet (GOOGL, GOOG), along with Meta Technologies (META), is a member of the Communication Services sector.\n\nAnd even with the rally broadening in recent months, we can see Tech is still doing a lot of the heavy lifting. It may not be a surprise, then, to learn that both Apple and Meta have been positive each month this year. (For Meta, the streak of monthly wins extends all the way back to November 2022.)\n\nStory continues\n\nThrough May, Amazon (AMZN) and other e-commerce plays were primarily responsible for boosting gains in the Consumer Discretionary sector.\n\nIn the two months since, brick and mortar stalwarts like Kohl's (KSS) and Nordstrom (JWN) have joined the rally, with each up over 50% since the end of May. A sign hangs above the entrance of a Kohl's store on March 01, 2023 in Lincolnwood, Illinois. (Photo by Scott Olson/Getty Images)\n\nCyclical names — whose fortunes vary more alongside the state of the economy — dominate the components of the Dow Jones Industrial Average (^DJI).\n\nAnd inside the index we can also see the game of catch-up taking place.\n\nThe latest returns from June to July are reflected on the x-axis in the chart below, while prior gains through May are expressed vertically on the y-axis.\n\nIndustrial giant Caterpillar (CAT) is alone at the right edge of the chart — up 29% the last two months after sinking 14% earlier this year. Caterpillar will report earnings on Tuesday.\n\n3M (MMM) and Boeing (BA) are also among top recent returns, while rounding out the top five are banking giant JPMorgan (JPM) and retail leader Home Depot (HD).\n\nAlso noteworthy are the few laggards that haven't mustered much the entire year and are camping out in the lower left of the chart.\n\nConsumer Staples (XLP) company Walgreens (WBA) happens to be dead last on the year-to-date list, down 20%. Telecom company Verizon (VZ) and pharmaceutical giant Merck (MRK) are also toward the bottom.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/the-2023-stock-market-rally-got-a-lot-healthier-in-june-and-july-210139678.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "FB2A.F", "FB2A.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MI", "GOOG.MX"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.026, "neu": 0.88, "pos": 0.094}}, {"date": "2023-07-31T21:01:27+00:00", "title": "Apple, Amazon: 'The setup is perfect for Big Tech earnings,' analyst says", "content": "Big Tech companies Apple and Amazon are due to report earnings this week. Santosh Rao, Manhattan Venture Partners Head of Research, explains the positive backdrop for the tech giants after positive earnings showings from competitors. China persists to be \"a lingering threat\" for Apple as \"political winds are blowing hard,\" but Rao anticipates the iPhone maker's geopolitical relationships to be smoothed before seeing any major disruptions. On the other hand, Rao believes Amazon's AWS \"growth engine is sputtering\" but does not anticipate slowdowns to show up in this quarter's earnings.\n\nVideo Transcript\n\nSEANA SMITH: Let's talk about one of the big stories of this week. And that's big tech, the focus continuing here. And this week, we're going to hear from Apple and Amazon. Both stocks showing gains of over 50% so far this year. Analysts adjusting some of their price targets ahead of the results that we got. When it comes to Amazon, Credit Suisse, Wedbush, both boosting their price targets, while Citi keeping the tech giant as one of their top picks across the internet sector.\n\nWell, here to discuss what we could expect, we want to bring in Santosh Rao, Manhattan Venture Partners Head of Research. Santosh, it's great to see you again. So just give me a sense first before we get into the look-ahead for what we're going to hear from this week. Last week, we heard from Meta, from Google, from Microsoft. What's your sense just about where these tech giants stand and whether or not the fundamentals hold up to their current valuations?\n\nSANTOSH RAO: Yeah. Thanks for having me. I think last week's earnings were very good. They showed that digital advertising is doing great. There's a lot of demand. AIs, of course, the big kicker for both of them, for most of them, and for also going forward.\n\nBut in general, the setup is perfect for the big tech companies. And there they sit in the sweet spot of where the spending is and where it's going to be down the road. So definitely a good setup for Apple and Amazon reporting on Thursday. So I think, overall, the setup is good. The tailwind is good. So we saw good earnings from both of them, good reports from both of them. And we'll continue to see them this Thursday as well.\n\nStory continues\n\nDIANE KING HALL: But Santosh, I want to ask you specifically about Apple. What are your expectations with regard to the company and particularly when you think about just smartphone sales and some of the sluggishness that we've seen there?\n\nSANTOSH RAO: Yeah. So having said that, having said that both companies are good, I like both of them. I like Apple more than Amazon. I think Apple has many things going for it. Right now, July is seasonally a slow quarter. September is a big quarter. The iPhone 15 is going to come out. But there are some issues this time around, because there were some the slowdown in production and shipments and then push out of some premium models.\n\nSo I think you're going to see a little bit of disruption of sorts in the September quarter. So you might see weakness there. But overall, it's plus or minus here and there, net on a secular basis, Apple is still strong. It has a number of levers to pull. The services business is doing very well. It will continue to grow, continue to execute. And as more people come on board, you're going to see the services revenues go up and up more and more.\n\nSo I think Apple has a lot of-- and then you have China. China is opening up very well. I think from some data show that they took some market share in China. And-- and then India is a bright spot. That's the next growth frontier for them. So there are a lot of things to look forward to. They deserve the benefit of doubt. You don't bet against Apple, because they always come through. Yes, they have run up quite a bit, 50% according to, I think, the last special. So it's pretty strong. I think it's time-- It can take a pause. In no way is the story broken. It's a long way to go. Apple will continue to execute and will do well.\n\nSEANA SMITH: Santosh, you mentioned China there. Curious, how do you see or do you see the souring relations between Washington and Beijing? How big of a risk or what does that impact potentially look like for Apple?\n\nSANTOSH RAO: Yes, I think that is a big issue. And hopefully, it'll be resolved well. And that's why they are diversifying. They opened in India. They're going to produce the iPhones there. So they are diversifying. They're spreading their bets. And so they're not totally focused. But they are pretty deeply entrenched in China. So it's going to take a long time to get out of that. So they have to walk a delicate balance and hope that the relations stay, and we don't break away, break off badly.\n\nBut at this point, looks like the business relationship is still going on. The political winds are blowing hot, really hot. But I think it hasn't come to a point where it's going to totally disrupt their business in China. So yes, it's a threat. It's a lingering threat, has been there for a while. The stock is still traded up despite that. But there's something to be-- there's something that needs to be watched going forward.\n\nDIANE KING HALL: Santosh, I want to quickly ask you about Amazon. What are you expecting when it reports this week, particularly when we look at AWS?\n\nSANTOSH RAO: Yeah. I think that is the biggest issue with the Amazon. That's the story. I mean, the growth engine is sputtering. And that is a big issue with Amazon. It was really driving, that was the crown jewel for this time. So let's see where that goes. And it's definitely going to slow down.\n\nAnd both companies are going to be in line numbers. And their earnings reports are going to be in line. So that's not going to be a surprise. But there is going to be slowdown in terms of the mix. AWS is now going to be 10% year-over-year growth as opposed to well over 30% a while back or 16%. So I think it's definitely sequentially coming down. And that's a concern.\n\nBut the ad business is growing. And with Amazon, the big concern is the consumer. The discretionary spending is soft. To the extent, things slow down in the second half. If we have the recession that people talk about, hopefully, it's not that deep. It's short and shallow. But if it slows down things and spending goes down, I think that has an impact on Amazon. So there are some issues.\n\nBut I also think Amazon is a work in progress in many ways. They're still rationalizing their costs. They're bringing everything under control. So it's still going on that side of the business, the cost side of the business. On the revenue side, they need to still work on that. There are some headwinds that they need to work through. But I think they took their cuts before-- they took their hits before. So now, they're coming up. So they might go a little bit here and there. But overall, the trend is going to be up, because these are great companies.\n\nSEANA SMITH: Santosh, how realistic do you think the Street is being right now about AI and the immediate capabilities? Because we did see some of that concern reflected in Microsoft after they reported, when they came out and said that their rollout of the capabilities, it's going to be gradual. Do you think the Street has realistic expectations?\n\nSANTOSH RAO: The Street is betting on the future. We haven't seen any material revenues as such. It's going to take some time. But we know the potential. It's going to be great. And every company across the board is investing in that. So you will to see the benefits down the road. But by the time you see the benefits, the stocks might have run up already. So I think it's time to take a call at this point.\n\nWe know the potential. We know what it's going to do, how disruptive it's going to be, the creative destruction it's going to cause across the board. I think that's in there. So now, unless you have a strategy-- and that's one thing against Apple. They still haven't really clarified what their AI strategy is, generative strategy is, so to speak. And Amazon also to some extent is a laggard there. So you need to have a clear vision. The Street will reward you, because that is the future, whichever way you see.\n\nBut so far, we haven't seen it in the numbers. It's down the road. It's the potential that you're betting on. And let's see. I mean, the early signs are that the technology is great. It's going to have wonders on the productivity side, which is what they need in the face of wages going up and labor shortages and all that stuff. Anything that will help productivity, and AI will. AI will help in productivity.\n\nDIANE KING HALL: Well, hopefully-- definitely, yes, will help with productivity. Hopefully, we all get to keep our jobs in light of that. Santosh Rao, thank you so much. Thank you for joining us.\n\nSANTOSH RAO: Yes. Thank you.", "link": "https://finance.yahoo.com/video/apple-amazon-setup-perfect-big-210127338.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.032, "neu": 0.794, "pos": 0.174}}, {"date": "2023-07-31T20:52:44+00:00", "title": "S&amp;P 500, Nasdaq rise for fifth month in a row", "content": "Both the S&P 500 and the Nasdaq Composite closed higher on Monday. The indices also closed higher for the month of July, making it five-straight months of gains for both. Yahoo Finance Markets Reporter Jared Blikre breaks down what drove the market action.", "link": "https://finance.yahoo.com/video/p-500-nasdaq-rise-fifth-205244503.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "DJI.INDX", "FB2A.F", "FB2A.XETRA", "IXIC.INDX"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0, "neu": 0.946, "pos": 0.054}}, {"date": "2023-07-31T20:45:15+00:00", "title": "AAPL Stock Today: How To Trade The Upcoming Earnings With Options", "content": "In total, the combination of the two trades in AAPL stock generates $195 in premium per set of contracts.\n\nContinue reading", "link": "https://finance.yahoo.com/m/b1eebaf7-2179-317e-a8b3-db03d8bccf44/aapl-stock-today%3A-how-to.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-07-31T20:24:28+00:00", "title": "Apple, Meta Hot Streaks Fuel Nasdaq 100’s July Rally", "content": "(Bloomberg) -- Major technology and internet stocks have rallied throughout this year, with July the latest in a lengthy streak of monthly gains.\n\nMost Read from Bloomberg\n\nAsia’s Richest Families Fuel Race for Lucrative Finance Jobs US, Europe Are Growing Alarmed by China’s Rush Into Legacy Chips Lots of US Homeowners Want to Move. They Just Have Nowhere to Go Charles Koch-Tied Group Seeks to Block Trump From GOP Nomination A 5% US Mortgage Rate Is Seen as Tipping Point to Unlock Supply\n\nThe Nasdaq 100 Index rose 3.8% this month, its fifth straight monthly gain. This represents its longest such stretch since August 2020. It has risen 44% in 2023, with excitement surrounding artificial intelligence a primary driver behind the gains.\n\nThe index is heavily weighted toward megacap internet and technology stocks, which have led the market higher over the year. Quarterly results out of the sector — including from stocks like Alphabet Inc. and Meta Platforms Inc. — have underlined how big tech continues to offer robust fundamentals.\n\n“We continue to expect global tech earnings growth to turn more positive in the second half and potentially grow by low teens next year,” wrote Solita Marcelli, chief investment officer Americas at UBS Global Wealth Management. However, she adds that “given the strong year-to-date performance and elevated valuations in global tech, we expect volatility in tech stocks to remain elevated in the near term.”\n\nApple Inc. is the biggest component of the Nasdaq 100, comprising nearly 12% of the index weight. The iPhone maker rose 1.3% over the month of July, making for its seventh straight positive month, its longest since 2014. The stock is up more than 50% this year.\n\nThe next test for Apple will come later this week, when it reports its third-quarter results on Aug. 3. Amazon.com Inc. is also due to report on the same day. The e-commerce and cloud-computing company is another megacap that has been on a lengthy streak. Shares of Amazon rose 2.6% this month, its fifth straight monthly gain and longest since 2018.\n\nThe stock has risen nearly 60% in 2023.\n\nPerhaps most notably, Meta Platforms rose 11% in July, in its ninth straight positive month. This is the longest streak of monthly gains on record for the Facebook parent, which last week reported strong quarterly results and gave a bullish forecast.\n\nThe gains haven’t been limited to US stocks. The Nasdaq Golden Dragon China Index rose 20% this month, with July its biggest monthly gain since November. Among major gainers, PDD Holdings rose 30% this month while JD.com Inc. rose 21%; the pair represent the two biggest percentage gainers among Nasdaq 100 components in July.\n\n(Updates to market close.)\n\nMost Read from Bloomberg Businessweek\n\nInfluencers Built Up This Wellness Startup—Until They Started Getting Sick AI in Hollywood Has Gone From Contract Sticking Point to Existential Crisis The Stainless-Steel Boom Is Tearing a South African Mining Region Apart How a Farmhouse Renovation Inspired a Hotel-Decor Venture What China’s Real Estate Market Will Look Like in Five Years\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/apple-meta-hot-streaks-fuel-202428701.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "FB2A.F", "FB2A.XETRA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.03, "neu": 0.826, "pos": 0.144}}, {"date": "2023-07-31T17:30:00+00:00", "title": "The Candidates For ESPN's Next Partner Include Some of the Largest Tech Giants", "content": "ESPN's strategic partner is likely going to be one of the world's largest tech companies. According to a report by The New York Post, major tech companies like Apple, Amazon, Google, Microsoft, Verizon, and T-Mobile are some of the candidates to become the strategic partner of ESPN. This comes just a few weeks after The Walt Disney Co. CEO Bob Iger told CNBC earlier in the month that the company was looking for partners for the sports network.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d312e0d3-741d-3bc8-8eb6-f2769cd109b5/the-candidates-for-espn%27s.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "DIS.MX", "DIS.US", "DISB34.SA", "WDP.F", "WDP.XETRA"], "tags": [], "sentiment": {"polarity": 0.494, "neg": 0, "neu": 0.948, "pos": 0.052}}, {"date": "2023-07-31T17:22:10+00:00", "title": "25 Richest Women in the World", "content": "In this article, we will be taking a look at the 25 richest women in the world. To skip our detailed analysis of the trends and dynamics of women's businesses, head directly to see the 5 Richest Women in the World.\n\nWomen’s Wealth\n\nA lot of the richest people in the world have had to lose their wealth in 2022. According to Forbes World’s Richest List 2023, the total number of billionaires dropped from 2,668 in 2022 to 2,640 in 2023. Overall, the world’s billionaires have lost $500 billion of net worth from $12.7 trillion in March 2022 to $12.2 trillion in March 2023. An interesting fact to note is that the number of female billionaires is on the rise. Among the top richest people in the world, there are 337 women billionaires, up from 327 in 2022.\n\nWomen have started to step up and take the initiative of starting their businesses. As we mentioned earlier, almost half of all women-owned businesses are from three sectors that include healthcare and social assistance, beauty and pet care, and scientific and technical services. Women-owned businesses in the U.S. have performed significantly well. First Round Capital claims that the companies it invested in with female founders outperformed all-male founding companies by 63%. Additionally, as we discussed previously, Kauffman Fellows found women-led teams produced 35% better return on investment compared to all-male teams.\n\nWomen Kept Under Shadows for Years\n\nWomen have faced gender discrimination for centuries in politics, in the workplace, and at home. In some countries, women are legally restricted to work in certain professions while in other economies, they are discriminated against by pay gaps. These are a few problems that have kept women under the shadow for many years. Developed economies have made major changes in their laws and frameworks to implement gender equality across all phases of life.\n\nFeminists have been vocal about the interests of women in all fields of life. According to Pacific University, in 1848 the first wave of modern feminism took place at the Seneca Falls Convention. Elizabeth Cady Stanton introduced and drafted the Seneca Falls Declaration highlighting the ideology and political aspects of the movement. The second movement in the 1960s focused on social equality with equal rights regardless of sex. The movement continued once again in the 1990s, proving the point that women can play an equal and as important role as men.\n\nStory continues\n\nTechnology Paving Ways for Women\n\nOne of the major things that have played a big role in women’s equality is technology. Modern technology has created awareness across the globe and women have explored their potential in the best way possible. For instance, women entrepreneurs have made the best use of e-commerce. The e-commerce marketplace has allowed women to capitalize in one of the largest markets in the world.\n\nThe biggest e-commerce company, Amazon.com, Inc. (NASDAQ:AMZN), has around 9.7 million sellers worldwide, and 1.9 million are active on the platform. On June 19, SellerApp shared the Amazon.com seller statistics showing that women account for 33% of the retailer's sellers, which is a sublime development for women entrepreneurs.\n\nCompanies Led by Female CEOs\n\nWe have entered a new era as more than 10% of women now lead Fortune 500 companies. The Fortune 500 ranks the largest U.S. public companies by revenue. These companies accumulate around $18 trillion in revenue, representing more than two-thirds of the U.S. GDP. For many decades, the big companies were dominated by male executives. Now we have 53 female CEOs leading Fortune 500 companies, which enlightens gender diversity in executive leadership to another level. Women now have a more important role to play as executives, making massive decisions at the top level.\n\nSome of the Fortune 500 companies which are led by female CEOs include Advanced Micro Devices, Inc. (NASDAQ:AMD), CVS Health Corp. (NYSE:CVS), General Motors Co. (NYSE:GM), Walgreens Boots Alliance Inc. (NASDAQ:WBA), and Elevance Health Inc. (NYSE:ELV). These five Fortune 500 companies are led by CEOs Lisa Su, Karen Lynch, Mary Barra, Rosalind Brewer, and Gail Koziara Boudreaux, respectively. The female CEOs are putting in a great effort to take these companies to new heights. Advanced Micro Devices, Inc. (NASDAQ:AMD) is one of the largest companies on the Fortune 500 list. On June 14, Advanced Micro Devices, Inc. (NASDAQ:AMD) unveiled its next-generation chip called MI-300 at its product reveal event, which is being considered a potential alternative to NVIDIA Corp. (NASDAQ:NVDA)'s AI chips. The company is using AI to be its next big tool for GPUs, CPUs, and adaptive computing solutions. The CEO of Advanced Micro Devices, Inc. (NASDAQ:AMD), Lisa Su, during the launch event, highlighted AI as \"AMD's largest and most strategic long term growth opportunity.\" Shortly after the event, Lisa Su, appeared in an interview on CNBC to discuss the development of their new AI chip, M1-300. AMD has entered into a new phase of chipmaking with the announcement of its newest generation chip. Su added that everyone is talking about Chatgpt and large language models, and MI-300 is designed for these use cases. Here are some of the comments from Su:\n\n\"AI is the defining megatrend for the technology right now. Like, everybody is talking about AI, we have been working on this roadmap for many many years. MI-300 is our newest generation chip and frankly, it’s incredible and I mean, the amount of technology we have on this, a 153 billion transistors. Our customers are super excited about this and we are working closely with them. We will sample in the third quarter and will be in production by the end of the year.\n\nWhat we see is there is a tremendous demand for GPUs in AI space, for both training and inference. We work with all of the largest cloud manufacturers and many of the largest enterprise guys. So, the key is to get these products to market as fast as possible. It is an incredible time for technology. AI has kinda changed the way we perceive what we’re doing in every industry and every market for all of our productivity and business applications.\n\nWe have developed a really comprehensive software capability that is optimized for hardware. We call that the ROCm ecosystem, but on top of that we’ve all these folks in the market that are really developing these frameworks, and the purpose of these frameworks is actually to make it fairly easy and transparent to move different hardware ecosystems.\"\n\nAccording to Su, the total addressable market for AI GPUs is around $30 billion right now and it is going to grow more than 50% each year over the next three to four years. \"We see like $150 billion by the time we get to 2027,\" added Su. 25 Richest Women in the World\n\nRawpixel.com/Shutterstock.com\n\nOur Methodology\n\nTo find the list of the 25 richest women in the world, we took the data from Forbes’ Real-time Billionaire List. We also cross-checked the list with Bloomberg Billionaires Index. We then narrowed down our list to women that had the highest net worth. The list is ranked in ascending order of the aforementioned metric. Here is the list of the 25 richest women in the world.\n\n25 Richest Women in the World\n\n25. Victoria Mars\n\nNet Worth: $9.9 Billion\n\nVictoria Mars is an American billionaire, who is a former chairwoman of her family business Mars, Incorporated. Currently, Victoria is a chair of Salzburg Global Seminar, a non-profit organization. Victoria along with her sisters owns an 8% inherited stake in the company. Victoria’s great-grandfather Frank Mars incorporated the candy business back in 1911. With a net worth of $9.9 billion, Victoria Mars is the joint-richest woman in the world along with her three sisters including Pamela Mars, Valerie Mars, and Marijke Mars.\n\nFemale business women are leading some of the top Fortune 500 companies including Advanced Micro Devices, Inc. (NASDAQ:AMD), CVS Health Corp. (NYSE:CVS), General Motors Co. (NYSE:GM), Walgreens Boots Alliance Inc. (NASDAQ:WBA), and Elevance Health Inc. (NYSE:ELV).\n\n24. Valerie Mars\n\nNet Worth: $9.9 Billion\n\nValerie Mars started working at Mars, Incorporated in 1992. Currently, Valerie is the vice president of the company’s corporate development and is also part of the board of directors. Along with her other sisters, Valerie Mars makes it to our list of the richest women in the world.\n\n23. Pamela Mars\n\nNet Worth: $9.9 Billion\n\nPamela Mars is one of the richest women in the world with a net worth equal to her other sisters including Victoria Mars, Valerie Mars, and Marijke Mars. Pamela joined Mars, Incorporated in 1986, taking over her first job. At present, she serves as an ambassador to the company’s pet care division. In 2017, Pamela acquired VCA Animal Hospital. Later in 2018, she also acquired the animal hospital chain AniCura and the U.K. vet chain Linnaeus.\n\n22. Judy Love & Family\n\nNet Worth: $10.2 Billion\n\nJudy Love is the owner of the famous truck stop and convenience store chain Love's Travel Stops & Country Stores. Judy along with her husband Tom Love founded their business in 1964. Judy runs the company with her sons Greg and Frank as her husband died on March 7, 2023. Judy Love’s net worth of $10.2 billion makes her one of the richest women in the world.\n\n21. Christy Walton\n\nNet Worth: $11.3 Billion\n\nChristy Walton married John Walton who founded Walmart Inc. (NYSE:WMT). Walton was handed over one-sixth of her husband’s property after he died in 2005. Walmart’s Walton clan is one of the richest families in the world. Christy Walton lives a private life in Jackson, Wyoming, and ranks among the richest women in the world.\n\n20. Trudy Cathy White\n\nNet Worth: $11.4 Billion\n\nTrudy Cathy White’s father Truett Cathy founded the fried chicken chain Chick-fil-A. Cathay White heirs the business ownership as an only daughter and serves as an ambassador at the company. Cathay White’s brothers Dan and Bubba Cathy manage the company’s operations as chairman and executive vice president, respectively. Trudy Cathy White has a net worth of $11.4 billion and is one of the richest women in the world.\n\n19. Kwong Siu-hing\n\nNet Worth: $13.6 Billion\n\nKwong Siu-hing is the biggest shareholder in Sun Hung Kai Properties, which was co-founded by her husband Kwok Tak-seng. Kwong served the company as chairman from 2008 to 2011. Kwong Siu-hing with a net worth of $13.6 billion makes it to the list of the richest women in the world.\n\n18. Laurene Powell Jobs & Family\n\nNet Worth: $14.2 Billion\n\nLaurene Powell Jobs inherited her fortune from her late husband Steve Jobs, Apple Inc. (NASDAQ:AAPL)’s co-founder. In 2021, Powell Jobs launched the Waverley Street Foundation to support organizations fighting against climate change. In 2017, Powell Jobs acquired The Atlantic and has invested in several media outlets including Axios, ProPublica, and The Athletic. Laurene Powell Jobs is one of the most active female billionaires and the richest woman in the world.\n\n17. Charlene de Carvalho-Heineken & Family\n\nNet Worth: $15.1 Billion\n\nCharlene de Carvalho-Heineken has almost a 23% stake in famous beer producer Heineken. In 2002, Carvalho-Heineken inherited a stake in the company from her father and CEO of the company, Freddy Heineken. Carvalho-Heineken is also part of Heineken’s board. Owning the beer giant makes Charlene de Carvalho-Heineken one of the richest women in the world.\n\n16. Diane Hendricks\n\nNet Worth: $16.1 Billion\n\nIn 1982, Diane Hendricks co-founded ABC Supply along with her late husband, Ken Hendricks. Since her husband died in 2007, Diane continues to chair the company. Diane led the company to make the two biggest acquisitions in ABC’s history, buying rival Bradco in 2010 and building materials distributor L&W Supply in 2016. Diane Hendricks has a net worth of $16.1 billion and ranks among the richest women in the world.\n\n15. Renata Kellnerova & Family\n\nNet Worth: $16.9 Billion\n\nRenata Kellnerova was married to the richest person in the Czech Republic, Petr Kellner, at the time. After Kellner’s passing in March 2021, Kellnerova was handed over to the PFF Group, the business that offers financial, media, and real estate services. She also chairs The Kellner Family Foundation, which looks after education. Renata Kellnerova with family assets worth $16.9 billion ranks among the richest women in the world.\n\n14. Beate Heister\n\nNet Worth: $17.8 Billion\n\nBeate Heister is a heiress to the Aldi retail fortune. Hesiter’s fortune comes from her family business which her father, Karl Albrecht Sr., expanded after the ownership split between him and his brother, Theo Sr. With a net worth of $17.8 billion, Beate Heister is one of the richest women in the world.\n\n13. Vicky Safra & Family\n\nNet Worth: $18.4 Billion\n\nVicky Safra inherited her husband Joseph Safra's fortune along with her four children. Owning the Safra banking empire, Vicky Safra has a net worth of $18.4 billion and ranks among the richest women in the world.\n\n12. Savitri Jindal & Family\n\nNet Worth: $20.3 Billion\n\nSavitri Jindal's net worth is $20.3 billion, thanks to her stake in the Jindal Group which Savitri inherited from her husband Om Prakash Jindal. Jindal Group specializes in steel, cement, power, and infrastructure. Savitri chairs the company while her sons Sajjan Jindal and Naveen Jindal manage JSW Steel and Jindal Steel & Power, respectively. Savitri Jindal makes it to the list of the richest women in the world.\n\n11. Abigail Johnson\n\nNet Worth: $22.9 Billion\n\nAbigail Johnson took over her father’s mutual fund business Fidelity Investments. Johnson has served the company as CEO since 2014. Johnson first started at Fidelity during summers through college and later joined as an analyst in 1988 after completing her MBA from Harvard. With an estimated 24.5% stake in the company, Abigail Johnson is one of the richest women in the world.\n\n10. Iris Fontbona & Family\n\nNet Worth: $24.9 Billion\n\nIris Fontbona controls Antofagasta Plc (LON:ANTO), which trades on the London Stock Exchange. Fontbona is the widow of Andrónico Luksic, who left behind the company to Fontbona and his children. Fontbona, along with running Antofagasta Plc, owns a majority stake in Quiñenco, which specializes in banking, beer, and manufacturing. Iris Fontbona has a net worth of $24.9 billion, which makes her one of the richest women in the world.\n\n9. Susanne Klatten\n\nNet Worth: $25.8 Billion\n\nSusanne Klatten is one of the richest women in the world, thanks to her 19% stake in BMW. Klatten is the daughter of famous German industrialist Herbert Quandt who saved BMW from bankruptcy. In addition, Klatten has transformed her grandfather's Altana AG into a top-level specialty chemical corporation and she is the sole owner of the company. She also had stakes in Entrust, a company that provides digital identity and data security. Being an active businesswoman, Susanne Klatten is one of the richest women in the world.\n\n8. Gina Rinehart\n\nNet Worth: $27.5 Billion\n\nGina Rinehart is Australia’s richest person with a net worth of around $27.5 billion. Rinehart is the daughter of iron-ore explorer Lang Hancock and she has taken the iron-ore business to the next level. Rinehart has investments in the gas sector and rare earth minerals. Such massive wealth with a diversified portfolio makes Gina Rinehart one of the richest women in the world.\n\n7. Rafaela Aponte-Diamant\n\nNet Worth: $30.8 Billion\n\nRafaela Aponte-Diamant owns 50% stakes in the world's largest shipping line, the Mediterranean Shipping Company. Rafaela’s husband Gianluigi Aponte founded the company in 1970 and also has a 50% stake in it. MSC is led by Gianluigi who is the executive chairman of MSC and Rafaela looks after the decoration operations for MSC Cruises. Rafaela Aponte-Diamant with a net worth of $30.8 billion ranks among the richest women in the world.\n\n6. MacKenzie Scott\n\nNet Worth: $34.7 Billion\n\nMacKenzie Scott’s divorce from Jeff Bezos in 2019 gave her a 4% stake in Amazon, Inc. (NASDAQ:AMZN). Scott is also a philanthropist and author, and lives a simple lifestyle. With a net worth of around $34.7 billion, MacKenzie Scott is one of the richest women in the world.\n\nSome of the most prominent companies led by female CEOs include Advanced Micro Devices, Inc. (NASDAQ:AMD), CVS Health Corp. (NYSE:CVS), General Motors Co. (NYSE:GM), Walgreens Boots Alliance Inc. (NASDAQ:WBA), and Elevance Health Inc. (NYSE:ELV).\n\nClick to continue reading and see 5 Richest Women in the World.\n\nSuggested articles:\n\nTop 50 Countries with the Most Beautiful Women in the World 30 Best Excuses to Get Out of Work Provided By AI Chatbots 26 Biggest Marijuana Companies in the World\n\nDisclosure: None. 25 Richest Women in the World is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/25-richest-women-world-172210169.html", "symbols": ["8GM.F", "A1MD34.SA", "A58.F", "AAPL.US", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "AMZN.US", "CVS.US", "ELV.US", "GM.MX", "GM.US", "GMCO34.SA", "NVDA.US", "W8A.F", "WBA.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.012, "neu": 0.857, "pos": 0.131}}, {"date": "2023-07-31T17:18:49+00:00", "title": "AI 'driving' valuation growth for Big Tech stocks: Analyst", "content": "Tech companies like AMD, Qualcomm, and NVIDIA are set to report earnings in August. Constellation Research Principal Analyst and Founder R \"Ray\" Wang joins Yahoo Finance Live to talk about what he calls \"MATANA\" stocks, also known as Microsoft, Apple, Tesla, Alphabet, NVIDIA, and Amazon. Wang explains how \"AI is driving the valuation growth\" and how \"there was pre-Chat GPT and then post-Chat GPT,\" for these tech stocks.\n\nVideo Transcript\n\nRACHELLE AKUFFO: So still confident in the MATANA stocks here. But as we talk about generative AI, what are the key differentiators in how these companies are mentioning and using it?\n\nR \"RAY\" WANG: Yeah. There's a great difference between the folks that are actually using it, the folks that are actually producing it, and the folks that are supplying the tools to make it happen, right? And the tool makers, of course, are the Nvidia's of the world with the GBUs and of course, Google in the future with TPUs and then Microsoft if they get into the chip game. And then of course, we've got the companies that are actually doing the processing, which is in the cloud.\n\nSo you see that with Google, Amazon, Microsoft leading that way, and then you've got companies that are using it like Adobe, Oracle, ServiceNow and C3. Those are the ones that are creating this AI empire. And we do see that. AI is driving the valuation growth. We were dead in November 2022. There was pre-ChatGPT and then post ChatGPT. You could see the tech starts starting to grow. So that's the big thing.\n\nBut the second thing we discovered was ads are back for the few companies that are left and the ones that are actually growing, of course-- here's where Meta comes into play, Google comes into play, and what we'll be looking for is Amazon and Apple. Apple doesn't break out its advertising revenues, but Amazon is now the third largest digital ad player in the market.\n\nRACHELLE AKUFFO: And we knew that there was this pull back in ad spending. Why do you think people are honing back into some of these stalwarts when it comes to eyes for consumers and ads?\n\nStory continues\n\nR \"RAY\" WANG: Rachelle, it's a great question. I think what happens is if you've got the network, you've got the power to reach out to folks, and there are very few mass marketing capabilities left. And so Amazon has amazing reach because of commerce, Google has amazing reach because of search, and of course, Alphabet or-- Alphabet has amazing reach because of search.\n\nAnd then of course, we're seeing what's going on with Facebook because of the network effects on Meta. Now that also means other companies like Spotify, who are showing some growth. Yes, music isn't going to carry you all the way. Netflix subscriptions aren't going to carry all the way and you need to have multiple monetization models to be able to survive.\n\nRACHELLE AKUFFO: And of course, we have to talk about the cloud, especially as we look at what happened with Microsoft's drop in cloud growth here. What is the story there? And how temporary is? Is this part of a new normal? A shift that we should expect when it comes to cloud.\n\nR \"RAY\" WANG: Well, the reason I say it's cloudy times ahead is because we're seeing some interesting usage of the cloud. A lot of companies just took their stuff and put it onto the cloud and hoped it was going to get cheaper, but now a new class of CIOs are doing something different. They're taking cloud hosting costs and cloud operating costs from maybe $1,000 a month and getting it down to $100 a month.\n\nAnd so we're about to see some rationalization and cloud usage just as of AI is picking up. And so we've got to see what happens if cloud contracts are coming down or if cloud usage is going to go down. And so Microsoft got through that. Amazon, we're going to watch very carefully on what their numbers are on August 3, and that will give us an indicator of what's going on. But Google didn't do too bad. They are flat at 28%. It is the summer, and we're going to see more pickup usually in the fall.\n\nRACHELLE AKUFFO: And of course, we have to talk Apple whether it's becoming that $3 trillion stock or whether it's-- what they're doing with their own sort of chip making there. What are your expectations and have they really outperformed the way that you thought they would?\n\nR \"RAY\" WANG: No, they've done really well given where the market is. There's an expectation that revenues are going to decline again in this quarter. It's been two quarters of decline, but we're still in a supercycle of refresh for iPhones, and it's not about the number of iPhone sales, and we won't see iPhone 15 sales if they make that announcement in the future. What this is about is how much can be made per iPhone. It's about the services revenue and Apple's story around that is very important. It's because they've been able to grow the revenue per device, and that's an important number to look at.\n\nRACHELLE AKUFFO: And I want to talk Amazon as well because we've talked about cloud, especially when it comes to Microsoft there. But what about Amazon as well and the growth story there? Because I mean, we're hearing bits and bobs about their AI plans as well but not really as-- it's not really a big topic of conversation to the extent that we would have expected.\n\nR \"RAY\" WANG: Yeah, so here's the interesting thing. There's been a lot of cost cutting at core Amazon. They've actually rejiggered their supply chains and their capacity and their warehouses, but they've improved the automation and what they're able to do now is deliver at a package or deliver any kind of parcel at a cost lower than anybody else, more automated than anyone else, and more track than anyone else, which means they can start using AI machine learning internally to drive down the cost.\n\nAnd then the second piece is where is AWS growth? And AWS, right now, is actually winning among partner mindshares. Large partners are actually being embraced by AWS, which wasn't the case in the past, and they're seeing that level of growth that's very, very different than some of the other partnerships that we've seen in the cloud. So we're looking at those two factors-- core Amazon performance, and of course, what's going on with AWS.", "link": "https://finance.yahoo.com/video/ai-driving-valuation-growth-big-171849913.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MI", "GOOG.MX", "GOOG.US", "GOOGL.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.012, "neu": 0.874, "pos": 0.115}}, {"date": "2023-07-31T16:35:01+00:00", "title": "Read This Before You Pick Your Favorite Artificial Intelligence Stocks", "content": "Investors have piled into some of the biggest tech stocks in the market, wagering that they will benefit from the artificial intelligence boom. + That's compared with 20 times the projecting earnings for the broader index, according to Goldman Sachs. \"The [dot-com] experience of the late 1990s is worth remembering because some telecom companies that spent mightily to install miles of dark fiber never generated a return sufficient to cover their cost of capital,\" Goldman analysts wrote in a note to clients today.", "link": "https://finance.yahoo.com/m/47267356-037f-349a-9d1f-7604bac303e9/read-this-before-you-pick.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MI", "GOOG.MX", "GOOG.US", "GOOGL.US"], "tags": [], "sentiment": {"polarity": 0.791, "neg": 0, "neu": 0.906, "pos": 0.094}}, {"date": "2023-07-31T16:13:59+00:00", "title": "Trucking Firm Yellow Ceases Operations, Walmart Buys Out Tiger Global's Stake, Former Disney Executives Join As Advisers To CEO Bob Iger: Today's Top Stories", "content": "Benzinga\n\nItalian Competition Authority Closes Investigation into Google's Alleged Abuse of Dominance, Commits to Enhancing Data Portability\n\nThe Italian Competition Authority has ended its probe into the alleged abuse of its position by Alphabet Inc's (NASDAQ: GOOG) (NASDAQ: GOOGL) Google LLC, Google Ireland Limited, and Google Italy S.r.l (Google) by making the proposed commitments binding. The Alphabet and Google group's dominant position in several markets enabled it to acquire large amounts of data through its services (Gmail, Google Maps, Android). In 2022, it achieved a turnover of $282.8 billion.\n\nToyota Ramps Up Local EV Tech Development In China\n\nToyota Motor Corp (NYSE: TM) said it will work towards strengthening its local development of intelligence and electrification technology in China. The automaker's statement comes as it looks to gain a market share in the intensely competitive Chinese market. To achieve multi-pathway-based carbon neutrality, Toyota will strengthen the local development of all electrified vehicles (BEV, PHEV, HEV, FCEV).\n\nJ.B. Hunt Buys 13 Zero-Emission Trucks From Nikola, Focuses On Greener Future\n\nJ.B. Hunt Transport Services, Inc (NASDAQ: JBHT) subsidiary plans to buy 13 zero-emission Class 8 trucks from Nikola Corp (NASDAQ: NKLA). The acquisition is at par with J.B. Hunt's goal to reduce carbon emission intensity by 32% by 2034 (with a 2019 baseline). The initial truck order comprises ten battery-electric and three hydrogen fuel-cell electric vehicles, with the first vehicles expected to be delivered in August 2023.\n\nBT Group Names Allison Kirkby As CEO\n\nBritain's telecoms giant, BT Group PLC (OTC: BTGOF), disclosed the appointment of Allison Kirkby as Chief Executive, effective the end of January 2024 at the latest. Allison Kirkby has served Telia Company AB (OTC: TLSNF) (OTC: TLSNY) as the president and CEO since early 2020. Before that, she worked at several well-known telecommunication companies. Allison Kirkby has been a Non-Executive Director at BT Group since 2019.\n\nStory continues\n\nFinancial Times\n\nFormer Disney Executives Appointed As Advisers To CEO Bob Iger\n\nWalt Disney Co (NYSE: DIS) stock is trading higher Monday amid reports of the company engaging former executives Kevin Mayer and Tom Staggs as advisors to current CEO Bob Iger to deal with the company's legacy television businesses, including ESPN. Mayer and Staggs were once considered potential successors to Bob Iger during his first stint as CEO but departed as their chances of getting the top job wilted.\n\nReuters\n\nApple Supplier Foxconn Expands in India with $195M Investment\n\nA Hon Hai Precision Industry Co Ltd (OTC: HNHPF) Foxconn unit will ink a deal on Monday with India's Tamil Nadu state to build a new facility for electronic components likely to create 6,000 new jobs. The Apple Inc (NASDAQ: AAPL) supplier subsidiary, Foxconn Industrial Internet, looks to invest ₹16 billion ($194.45 million) to build a campus in Kancheepuram district, near the state's capital of Chennai.\n\nNovo Nordisk's Weight-Loss Drug Wegovy In Germany: Patients To Pay Out-of-Pocket\n\nNovo Nordisk A/S's (NYSE: NVO) revolutionary weight-loss medication, Wegovy, has hit the German market, its premier substantial European destination. The medication is already available in the U.S. and only in Norway and Denmark within Europe. There are concerns about supply constraints due to non-obese individuals seeking prescriptions for vanity purposes, leading Novo to urge doctors to \"prescribe responsibly\" in a mid-July statement. The pharmaceutical company anticipates that German consumers will willingly cover the drug's expenses as public health insurance is currently unable to cover it.\n\nWall Street Journal\n\nWalmart Buys Out Tiger Global's Stake, Adds Another $1.4B To Its Bet On India's Flipkart\n\nRetail giant Walmart Inc (NYSE: WMT) recently spent $1.4 billion (INR 115.15 billion) to purchase the remaining Flipkart shares from Tiger Global, boosting its stake in the Indian e-commerce startup. This transaction has allowed New York-based hedge fund Tiger Global to make a $3.5 billion (INR 287.8 billion) profit from an initial investment of $1.2 billion (INR 98.71 billion). Tiger Global has now mostly cashed out its Flipkart shares.\n\nTrucking Firm Yellow Ceases Operations, Risking 30,000 Jobs\n\nYellow Corporation (NASDAQ: YELL) reportedly terminated its operations after grappling with multiple issues, including mergers that left it burdened with debt and a conundrum with the Teamsters Union. The shutdown endangers the employment of nearly 30,000 people. The Teamsters Union said it was served legal notice today that Yellow Corp. is ceasing operations and filing for bankruptcy.\n\nEarnings\n\nPanasonic Q1 Highlights: Profits Surge Significantly, Raises FY24 Net Profit Outlook\n\nPanasonic Holdings Corp (OTC: PCRFY) reported a Q1 FY24 sales growth of 3% Y/Y to ¥2.03 trillion on higher sales in Automotive, Connect, and automotive batteries and favorable currency translation. In USD, sales of $14.80 billion missed the consensus of $15.07 billion. EPS of ¥86.06 was considerably higher than ¥20.97 a year ago.\n\nHeineken H1 Beer Volumes Dips On Weakness In Vietnam & Nigeria, Cuts 2023 Outlook\n\nHeineken NV (OTC: HEINY) clocked revenue growth of 6.3% Y/Y in H1 2023 to €17.44 billion. Beer volume declined 5.6% Y/Y organically, with weak performance across Vietnam and continued socio-economic volatility in Nigeria. 2023 Outlook: Heineken revised the operating profit growth outlook to be stable to mid-single-digit organic growth (from mid- to high-single digits earlier).\n\nON Semiconductor Stock Jumps After Q2 Earnings - Here's How It Performed\n\nON Semiconductor Corp (NASDAQ: ON) stock gained Monday after it reported flat second-quarter FY23 revenue growth year-on-year at $2.09 billion, beating the consensus of $2.02 billion. Non-GAAP EPS of $1.33 beat the consensus of $1.21. Outlook: ON Semiconductor expects third-quarter adjusted revenue of $2.095 billion - $2.195 billion, above the consensus of $2.07 billion. The company sees non-GAAP EPS of $1.27 - $1.41 above the consensus of $1.21.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Trucking Firm Yellow Ceases Operations, Walmart Buys Out Tiger Global's Stake, Former Disney Executives Join As Advisers To CEO Bob Iger: Today's Top Stories originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/trucking-firm-yellow-ceases-operations-161359892.html", "symbols": ["AAPL.US", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "DIS.US", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "JBHT.US", "NKLA.US", "NVO.US", "ON.US", "TM.US", "WMT.US", "YELL.US"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.035, "neu": 0.86, "pos": 0.105}}, {"date": "2023-07-31T16:11:22+00:00", "title": "Stock market today: Dow wraps up second monthly gain in July as energy jumps", "content": "Investing.com -- The Dow closed higher Monday to wrap up a second-straight positive month for July after shrugging off a dip in health care as energy stocks racked up gains.\n\nThe Dow Jones Industrial Average rose 0.3%, or 100 points, closing out the month with a 3.2% gain. The Nasdaq was up 0.2%, and the S&P 500 was up 0.2%.\n\nEnergy stocks rally as Chevron receives upgrade\n\nEnergy stocks were led higher by a more than 3% surge in Chevron (NYSE:CVX) after the oil major was upgraded by Goldman Sachs, citing potential for strong growth.\n\nEnergy stocks were also led higher by climbing oil prices to multi-month highs on bets of tightening global supply and rising demand.\n\nJohnson and Johnson leads health care lower as bankruptcy plan rejected\n\nJohnson & Johnson (NYSE:JNJ) fell 4% after the judge on Friday rejected the company’s plan to place its subsidiary LTL Management into bankruptcy, known as a Texas two-step strategy, to deal with tens of thousands of legal claims alleging its talc caused cancer.\n\nDexCom Inc (NASDAQ:DXCM) was also a drag on health care, falling 6% giving up its recent gains despite raising its annual revenue forecast last week.\n\nCSX, Salesforce stumble on analyst downgrades\n\nCSX (NASDAQ:CSX) fell more than 1% after RBC downgraded its rating on the railroad company to Sector Perform from Underperform, citing coal volume headwinds.\n\nCoal, which makes up nearly a fifth of revenues at CSX, is expected to fall by 20% in 2024, according to a recent forecast from the Energy Information Administration. That is likely to lead to downward earnings revisions, RBC said.\n\nSalesforce (NYSE:CRM) was downgraded by Morgan Stanley to Equal-Weight from Overweigh but losses were kept in check as the latter also lifted its price target on the stock to $278 from $251.\n\nHasbro takes Wall St. plaudits ahead of earnings\n\nHasbro (NASDAQ:HAS) was up more than 4% after Bank of America upgraded the shares to Buy from Neutral on optimism that the toymaker is likely to deliver better-than-expected earnings on Thursday.\n\nStory continues\n\nBig tech remains in focus ahead of Apple, Amazon\n\nBig tech is set to remain in the headlines this week as Apple Inc (NASDAQ:AAPL) and Amazon.com Inc (NASDAQ:AMZN) are to deliver reports later this week following better-than-expected quarterly results from Microsoft (NASDAQ:MSFT), Meta Platforms Inc (NASDAQ:META), and Alphabet Inc (NASDAQ:GOOGL).\n\nTupperware continues to bask in meme stock fever\n\nTupperware Brands (NYSE:TUP) rose 40%, taking its gains in July to over 450%, a move that many believe is driven by the meme stock craze that took hold with OG-meme stocks like GameStop Corp (NYSE:GME).\n\nAbout 27.00% of Tupperware Brands' shares are currently sold short.\n\nRelated Articles\n\nStock market today: Dow wraps up second monthly gain in July as energy jumps\n\n'Barbenheimer' box office sales keep rolling in second weekend\n\nExxon Mobil in talks with Tesla, Ford to supply lithium - Bloomberg Law", "link": "https://finance.yahoo.com/news/stock-market-today-dow-wraps-161122620.html", "symbols": ["AAPL.US", "AMZN.US", "CHV.F", "CHV.XETRA", "CRM.US", "CSX.US", "CVX.MX", "CVX.US", "DJI.INDX", "DXCM.US", "GME.US", "GOOGL.US", "HAS.US", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA"], "tags": [], "sentiment": {"polarity": 0.985, "neg": 0.035, "neu": 0.857, "pos": 0.108}}, {"date": "2023-07-31T15:45:00+00:00", "title": "These 2 Stocks Will Move the Market This Week", "content": "The stock market has been performing well in recent months, and it now appears as if new all-time highs for some popular market benchmarks could be within reach. Despite persistent worries about the economy, market participants have started to appreciate that inflation rates are lower than in the past and that consumers are holding up better than many had expected. In the long run, the stock market's performance depends on companies having strong businesses, and plenty of companies will release their financial results to tell shareholders how they're doing on that front this week.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1bf70fbb-6e08-320f-936d-289dc5899ee3/these-2-stocks-will-move-the.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.905, "neg": 0.021, "neu": 0.825, "pos": 0.154}}, {"date": "2023-07-31T15:44:12+00:00", "title": "AMD earnings, Uber Technologies, Pfizer reports: 3 things to watch", "content": "Investing.com -- Stocks were muted on Monday as a deluge of megacap earnings started to hit this week, and as investors await this week's jobs report for July.\n\nThis week's reports include earnings from Apple (NASDAQ:AAPL) and Amazon.com (NASDAQ:AMZN), which follow positive earnings reports from Meta Platforms and Alphabet (NASDAQ:GOOGL) last week. Strong earnings have helped boost stocks, which have already been rising this year on the prospect of the Federal Reserve nearing the end of its interest rate increases.\n\nThe Nasdaq is up nearly 37% this year so far, also fueled by hopes for the growth of artificial intelligence.\n\nFriday's jobs report for last month is expected to show the economy added jobs, though at a slower pace than in June, but still record-low unemployment. Minneapolis Fed President Neel Kashkari said over the weekend that the U.S. economy has been surprisingly resilient, and that even if unemployment rose to 4% it could still achieve a soft landing, which means no recession, as the Fed pushes inflation back to its 2% target.\n\nThe Fed won't meet to decide on rates again until September, but it has its annual conference in Jackson Hole, Wyo., later this month, where policy makers could speak about the outlook for rates and the economy.\n\nHere are three things that could affect markets tomorrow:\n\n1. AMD earnings\n\nChip maker Advanced Micro Devices Inc (NASDAQ:AMD) is expected to report earnings per share of 57 cents on revenue of $5.3 billion.\n\n2. Uber reports\n\nThe ride-hailing firm Uber Technologies Inc (NYSE:UBER) is expected to report a 1 cent a share loss on revenue of $9.3B.\n\n3. Pfizer earnings\n\nDrug maker Pfizer Inc (NYSE:PFE) is expected to report earnings per share of 57 cents on revenue of $13.4B.\n\nRelated Articles\n\nAMD earnings, Uber Technologies, Pfizer reports: 3 things to watch\n\nExxon Mobil in talks with Tesla, Ford to supply lithium - Bloomberg Law\n\nWestern Digital's first-quarter forecast disappoints as weak cloud demand weighs", "link": "https://finance.yahoo.com/news/amd-earnings-uber-technologies-pfizer-154412116.html", "symbols": ["A1MD34.SA", "AAPL.US", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GOOGL.US", "PFE.F", "PFE.MX", "PFE.US", "PFE.XETRA", "PFIZ34.SA"], "tags": [], "sentiment": {"polarity": -0.382, "neg": 0.075, "neu": 0.838, "pos": 0.087}}, {"date": "2023-07-31T15:04:03+00:00", "title": "S&amp;P 500 stutters on final day of trade for July", "content": "Investing.com -- The S&P 500 was largely unchanged Monday as falling health care stocks capped upside momentum on the final day of trade in July ahead of another wave of earnings this week.\n\nThe S&P 500 was flat, the Dow Jones Industrial Average rose 0.1%, or 24 points, and the Nasdaq was up 0.1%.\n\nJohnson and Johnson leads health care lower as bankruptcy plan rejected\n\nJohnson & Johnson (NYSE:JNJ) fell more than 4% after the judge on Friday rejected the company’s plan to place its subsidiary LTL Management into bankruptcy, known as a Texas two-step strategy, to deal with tens of thousands of legal claims alleging its talc caused cancer.\n\nDexCom Inc (NASDAQ:DXCM) was also a drag on health care, falling more than 6% giving up its recent gains despite raising its annual revenue forecast last week.\n\nCSX, Salesforce stumble on analyst downgrades\n\nCSX (NASDAQ:CSX) fell nearly 2% after RBC downgraded its rating on the railroad company to Sector Perform from Underperform, citing coal volume headwinds.\n\nCoal, which makes up nearly a fifth of revenues at CSX, is expected to fall by 20% in 2024, according to a recent forecast from the Energy Information Administration. That is likely to lead to downward earnings revisions, RBC said.\n\nSalesforce (NYSE:CRM) was downgraded by Morgan Stanley to Equal-Weight from Overweigh but losses were kept in check as the latter also lifted its price target on the stock to $278 from $251.\n\nHasbro takes Wall St. plaudits ahead of earnings\n\nHasbro (NASDAQ:HAS) was up more than 1% after Bank of America upgraded the shares to Buy from Neutral on optimism that the toymaker is likely to deliver better-than-expected earnings on Thursday.\n\nBig tech remains in focus ahead of Apple, Amazon\n\nBig tech is set to remain in the headlines this week as Apple Inc (NASDAQ:AAPL) and Amazon.com Inc (NASDAQ:AMZN) are to deliver reports later this week following better-than-expected quarterly from Microsoft (NASDAQ:MSFT), Meta Platforms Inc (NASDAQ:META), and Alphabet Inc (NASDAQ:GOOGL).\n\nStory continues\n\nTupperware continues to bask in meme stock fever\n\nTupperware Brands (NYSE:TUP) rose nearly 40%, taking its gains in July to over 450%, a move that many believe is driven by the meme stock craze that took hold with OG-meme stocks like GameStop Corp (NYSE:GME).\n\nAbout 27.00% of Tupperware Brands' shares are currently sold short.\n\nRelated Articles\n\nWall St finishes strong month on upbeat company earnings\n\nAvis Q2 earnings top estimates, driven by 'robust' summer demand", "link": "https://finance.yahoo.com/news/p-500-stutters-final-day-150403132.html", "symbols": ["AAPL.US", "AMZN.US", "CRM.US", "CSX.US", "DXCM.US", "GME.US", "GOOGL.US", "HAS.US", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "META.US", "MSFT.US", "TUP.F", "TUP.US"], "tags": [], "sentiment": {"polarity": 0.96, "neg": 0.046, "neu": 0.865, "pos": 0.089}}, {"date": "2023-07-31T15:02:00+00:00", "title": "Why Wall Street Has a Lot Riding on Apple Earnings", "content": "The Street will be focused on CEO Tim Cook's outlook given Apple's unique perch and perspective around global consumer demand and what this means looking forward, says Wedbush analyst Dan Ives.", "link": "https://finance.yahoo.com/m/7f90caf5-9f18-3b5b-8e04-c7b7b5162fa1/why-wall-street-has-a-lot.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.273, "neg": 0.045, "neu": 0.876, "pos": 0.079}}, {"date": "2023-07-31T14:44:56+00:00", "title": "Apple Supplier Foxconn Expands in India with $195M Investment", "content": "A Hon Hai Precision Industry Co Ltd (OTC: HNHPF) Foxconn unit will ink a deal on Monday with India's Tamil Nadu state to build a new facility for electronic components likely to create 6,000 new jobs.\n\nThe Apple Inc (NASDAQ: AAPL) supplier subsidiary, Foxconn Industrial Internet (FII), looks to invest ₹16 billion ($194.45 million) to build a campus in Kancheepuram district, near the state's capital of Chennai, Reuters cites familiar sources.\n\nAlso Read:Foxconn Withdraws from $19.5B Semiconductor Joint Venture with Vedanta, Hindering India's Chipmaking Plans\n\nThe facility will be separate from the current sprawling campus near Chennai, where Foxconn assembles Apple's iPhones and employs more than 35,000 people.\n\nThe Foxconn subsidiary was in discussions with Tamil Nadu about the investment aiming for the plant's completion in 2024.\n\nFoxconn's FII makes electronic devices, cloud service equipment, and industrial robots.\n\nFoxconn chairman Young Liu has been in India to attend the federal government's semiconductor conference. The company plans to quadruple the workforce at its iPhone factory in Tamil Nadu by late 2024.\n\nThe move marks the famous Apple supplier's diversification of operations to reduce its exposure to China, whose strict pandemic regulations disrupted the semiconductor supply chains.\n\nFoxconn proposed to invest $500 million to set up manufacturing plants in the southern Indian state of Telangana, likely to create 25,000 jobs in the first phase.\n\nFoxconn, which already manufactures iPhones in India, bagged a deal to manufacture the AirPods in India in 2023. It also bought land worth $37 million in Bengaluru in May.\n\nPhoto via Wikimedia Commons\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Apple Supplier Foxconn Expands in India with $195M Investment originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/apple-supplier-foxconn-expands-india-144456439.html", "symbols": ["2317.TW", "601138.SHG", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "HHP2.F", "HNHAF.US", "HNHPF.US"], "tags": [], "sentiment": {"polarity": 0.959, "neg": 0, "neu": 0.927, "pos": 0.073}}, {"date": "2023-07-31T14:22:00+00:00", "title": "Apple Is Grappling With a Weak Smartphone Market. These Analysts Say to Buy the Stock Anyway.", "content": "Wedbush's Daniel Ives suggests looking past iPhone sales and backing Apple stock on a likely acceleration in services revenue in 2024.", "link": "https://finance.yahoo.com/m/709f2c40-a937-3838-8975-38b4f57d035d/apple-is-grappling-with-a.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.026, "neg": 0, "neu": 0.945, "pos": 0.055}}, {"date": "2023-07-31T13:50:10+00:00", "title": "Do Big Tech trades still have legs this earnings season?", "content": "As Amazon and Apple are due to report earnings later this week, investors remain bullish on tech stock trades. Edward Jones Senior Investment Strategist Mona Mahajan breaks down the biggest takeaways from tech earnings this quarter, calling the \"secular bull market in generative AI\" as a speculative \"cherry on top\" to tech valuations. Mahajan goes on to evaluate core themes in the tech sector, outlining the importance of small-cap stock exposures while tech leadership may continue to broaden out.", "link": "https://finance.yahoo.com/video/big-tech-trades-still-legs-135010423.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.66, "neg": 0, "neu": 0.909, "pos": 0.091}}, {"date": "2023-07-31T13:33:37+00:00", "title": "Dow Jones Falls In Final Day Of July; 6 Best Stocks To Buy And Watch", "content": "The Dow Jones Industrial Average fell Monday, with the stock market set to end July with gains. Best stocks to buy and watch include Dow Jones giant Boeing.", "link": "https://finance.yahoo.com/m/e78d84fa-0991-3daf-a414-109d1864bf7d/dow-jones-falls-in-final-day.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ALGM.US", "APC.F", "APC.XETRA", "AVGO.US", "AVGO34.SA", "BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "SKAA.F", "SKX.US", "TL0.F", "TL0.XETRA"], "tags": [], "sentiment": {"polarity": 0.765, "neg": 0, "neu": 0.798, "pos": 0.202}}, {"date": "2023-07-31T13:10:00+00:00", "title": "It’s Halftime for Big Tech Earnings. Here’s Apple and Amazon Are Up Next.", "content": "AI hopes fueled a furious first-half rally for tech stocks. Now, it looks like advertising and the cloud could continue the gains.\n\nContinue reading", "link": "https://finance.yahoo.com/m/c108f083-c533-3cc2-96e1-03ab7f6cd1fa/it%E2%80%99s-halftime-for-big-tech.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "FB2A.F", "FB2A.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US"], "tags": [], "sentiment": {"polarity": 0.459, "neg": 0.122, "neu": 0.625, "pos": 0.253}}, {"date": "2023-07-31T12:45:00+00:00", "title": "1 Warren Buffett Stock to Buy Hand Over Fist Right Now", "content": "If you're looking for a stock that can deliver consistent growth and dividends, you might want to consider Apple (NASDAQ: AAPL). The tech giant is the largest holding of Warren Buffett's Berkshire Hathaway, (NYSE: BRK.A) (NYSE: BRK.B) accounting for a whopping 47% of its stock holdings at last count. Here are some of the factors that make Apple stock a compelling buy and hold right now.", "link": "https://finance.yahoo.com/m/267382b0-3c36-3304-8ddf-c6824aec111b/1-warren-buffett-stock-to-buy.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "BRK-A.US", "BRK-B.US"], "tags": [], "sentiment": {"polarity": 0.586, "neg": 0, "neu": 0.912, "pos": 0.088}}, {"date": "2023-07-31T12:30:00+00:00", "title": "55% of Warren Buffett's $382 Billion Portfolio Is Invested in These 2 Stocks", "content": "Two stocks account for over $211 billion of Berkshire Hathaway's $382 billion investment portfolio.", "link": "https://finance.yahoo.com/m/a0bb00df-c50a-385c-ae96-8be5a24a8a0f/55%25-of-warren-buffett%27s-%24382.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "BAC-PB.US", "BAC-PE.US", "BAC-PK.US", "BAC-PL.US", "BAC.MX", "BAC.US", "BML-PL.US", "BOAC34.SA", "MSC.US", "NCB.XETRA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-07-31T11:17:16+00:00", "title": "The VR Race is Officially On: Kiplinger Economic Forecasts", "content": "Tech giants like Apple and Meta are banking on VR headsets to be the next big thing.\n\nVirtual-reality technology has come a long way from 1980s arcade games, and tech companies, such as Apple, Meta and HTC, are heavily investing in the future of VR. To help you understand what is going on and what we expect to happen in the future, our highly-experienced Kiplinger Letter team will keep you abreast of the latest developments and forecasts (Get a free issue of The Kiplinger Letter or subscribe). You'll get all the latest news first by subscribing, but we will publish many (but not all) of the forecasts a few days afterward online. Here’s the latest...\n\nWith Apple’s first virtual-reality headset, called Apple Vision Pro, set to go on sale in early 2024, the VR race is officially on. But it will be a marathon, not a sprint. Apple may sell only a few hundred thousand devices of what it calls \"a revolutionary spatial computer\" (because it blends digital content with the physical world) in the first sales year, maybe fewer, as the price is too high for mass adoption.\n\nThe company’s focus: luring developers to produce apps and content, similar to how it built an ecosystem of iPhone apps. The device has garnered glowing reviews and is packed with high-end tech, much of it built in-house, including two low-power computer chips. Manufacturing is complex and drives up the price to $3,500, much more than other models from Meta (with its $999.99 Meta Quest Pro device) or HTC (and its $1,099 VIVE XR Elite).\n\nApple (AAPL) and Meta (META) combined have invested over $100 billion in Virtual Reality research, per one estimate, so both companies are in this promising market for the long haul.\n\nThis forecast first appeared in The Kiplinger Letter, which has been running since 1923 and is a collection of concise weekly forecasts on business and economic trends, as well as what to expect from Washington, to help you understand what’s coming up to make the most of your investments and your money. Subscribe to The Kiplinger Letter.\n\nRelated Content\n\nThe Lure of Virtual Reality Virtual Reality Turns Games Into Treatments What is the Metaverse? 9 Best Metaverse Stocks for the Future of Technology The Metaverse Explained (and Why You Should Care) 5 Cool New Technologies Launched via Crowdfunding", "link": "https://finance.yahoo.com/news/vr-race-officially-kiplinger-economic-111716502.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.972, "neg": 0, "neu": 0.937, "pos": 0.063}}, {"date": "2023-07-31T11:00:23+00:00", "title": "5 AI Stocks Poised for Growth Without Sky-High Risk", "content": "This article is an excerpt from the InvestorPlace Digest newsletter. To get news like this delivered straight to your inbox, click here.\n\nLast week, I revealed a list of the five top “moonshot” artificial intelligence (AI) stocks from across InvestorPlace.com.\n\nNot only are these elite companies the leaders in their field, but their relatively low valuations also make them far likelier to succeed.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nAs the 1999 tech bubble reminds us, it’s the smaller startups and turnarounds that end up trouncing the incumbents. (Consider how underdog Apple (NASDAQ:AAPL) outperformed blue-chip Cisco (NASDAQ:CSCO) during that period!)\n\nBut not every investor can shoulder the volatility of the riskiest moonshot bets.\n\nCompanies like C3.ai (NASDAQ:AI) and Sabre (NASDAQ:SABR) from last week’s letter are highly unprofitable. Meanwhile, those like GitLab (NASDAQ:GTLB) will require years of hypergrowth to reach their full potential.\n\nBuying only a few shares of these moonshot companies limits the potential profit to investors.\n\nThat’s why I’m revealing another five artificial intelligence bets from our writers at InvestorPlace.com.\n\nThese firms are mostly larger, have lower volatility, and are still benefiting from artificial intelligence tailwinds.\n\n5 AI Stocks Poised for Growth: Adobe (ADBE) Adobe logo on the smartphone screen is placed on the Apple macbook keyboard on red desk background. ADBE stock.\n\nSource: Tattoboo / Shutterstock\n\nAdobe (NASDAQ:ADBE) presents a challenge for investors. The graphics software firm is highly attractive for its profitability. Its 20% return on capital invested (ROIC) makes it five times more profitable than Amazon (NASDAQ:AMZN) by that metric.\n\nBut on the other hand, the company’s high quality comes with an equally high stock price.\n\nShares of the California-based firm trade at 32X forward earnings, well above the 20X median for all S&P 500 companies. The average Wall Street analyst gives Adobe only a 5% upside relative to current prices.\n\nFortunately, this will change as Adobe’s AI offerings grow.\n\nStory continues\n\nAs Samuel O’Brient notes in his recent article “25 Millionaire-Maker AI Stocks to Buy Now:”\n\nThe AI boom should give investors and analysts even more reason to embrace ADBE stock…\n\nIt is incorporating generative AI into its well-known products [which] will likely make it an even more popular tool among graphic design professionals and other creatives who depend upon it.\n\nThat will put Adobe on a new growth path.\n\nMedia firms are increasingly turning to generative AI to help create content, and Adobe’s lead in the industry gives it a distinct advantage over competitors like Avid Technology (NASDAQ:AVID) that have fewer AI capabilities.\n\nAs AI adoption accelerates, so too will Adobe’s ability to grow.\n\n2. Intel (INTC) Close up of Intel (INTC) sign at entrance of The Intel Museum in Silicon Valley. Intel is an American multinational corporation and technology company.\n\nSource: JHVEPhoto / Shutterstock.com\n\n“No words can portray or explain the historic collapse of Intel,” David Moadel noted in a recent article.\n\nAmerica’s largest chipmaker – Intel (NASDAQ:INTC) – is now expected to generate only $2.46 billion in profits this year, down from $21 billion in 2019. Intense competition from Advanced Micro Devices (NASDAQ:AMD) is also keeping prices low, especially in server-related chips.\n\nStill, Moadel suspects that Intel is about to turn a corner:\n\nOpportunities to ride along with a zero-to-hero stock don’t come along every day. The sentiment surrounding Intel is tepid at best right now. However, that could instantly change.\n\nThat’s because Intel is quietly pushing ahead with AI applications.\n\nLast week, the firm announced it would offer 34 open-source AI reference kits, the result of a years-long collaboration with consulting firm Accenture (NYSE:ACN). The firm also plans on introducing chips specific to AI use by 2025, codenamed “Falcon Shores.”\n\nIntel announced better-than-expected earnings on Thursday, July 27, suggesting that its cost-cutting measures are finally working.\n\nMost importantly, Intel’s cheap share price leaves plenty of room for upside.\n\nShares of the struggling chipmaker are down 50% since 2021 and only trade at 16X 2025 earnings.\n\nIf Intel succeeds in turning its business around, it could look much like Apple in the early 2000s: A fallen giant ready to surge again.\n\n3. Meta Platforms (META) Meta Written On The Googles - Man Wearing Virtual Reality Goggles Inside A Metaverse. FTC investigating META.\n\nSource: Aleem Zahid Khan / Shutterstock.com\n\nIn February, Luke Lango suddenly turned bullish on Facebook parent Meta Platforms (NASDAQ:META) and other big-tech stocks:\n\nNow’s the time to buy Big Tech stocks. That’s just what you do with long-term winners. You sell them when they are overhyped and undervalued. You buy them when they are underappreciated and undervalued.\n\nIt was a tactical trade. Big-tech firms had just sold off, and their valuations had become irresistible.\n\nThis week, Dana Blankenhorn joined Luke in recommending Meta, thanks to the tech giant’s newfound strength in artificial intelligence:\n\nMeta’s efforts in generative artificial intelligence (AI), where it has open-sourced key technologies, are also a contrast to other [cloud companies], which have urged government regulation to control the software…\n\nIts dominant position providing free services in the developing world has proven more powerful than any missteps with Threads or the metaverse. I admit I underestimated it.\n\nMeta also recently announced it would give its “Llama 2” large language model away for free, upsetting a standing rivalry between OpenAI and Google. This now puts Meta in the running for AI applications.\n\nFinally, Meta’s shares remain inexpensive compared to other “Magnificent Seven” stocks.\n\nThe company trades at 19X 2025 earnings, well below Microsoft (NASDAQ:MSFT) at 26X, Apple at 29X and Amazon at 49X.\n\nThough the firm has less upside than last week’s “moonshot” picks, Meta’s stability and constant cash generation makes it a safer bet on AI than most.\n\n4. Palantir (PLTR) A close-up shot of a hand on a screen with the Palantir (PLTR) logo.\n\nSource: Ascannio / Shutterstock.com\n\nIn 1994, consulting firm Accenture formed its Business Process Management unit to help companies outsource work.\n\nIt was a hit.\n\nWithin a decade, the management consulting firm had transformed into a service company focused on implementation. Today, Accenture is a $200 billion behemoth in tech and cloud-based outsourcing.\n\nPalantir Technologies (NYSE:PLTR) could soon walk the same path.\n\nThe $36 billion data analytics company focuses on helping governments and large enterprises manage, secure and analyze data. If the U.S. Army needs help creating an AI-enabled system, they’re more likely to turn to Palantir than attempt to build one from scratch.\n\nThis week, Faisal Humayun writes how he expects bullish momentum to be sustainable for Palantir and that AI applications could add further growth. InvestorPlace.com writer Larry Ramer also notes that well-respected analyst Dan Ives now calls Palantir an “unmatched… AI fortress” and has a $25 price target.\n\nThat said, Palantir still has a lot of work to do in AI.\n\nThe company doesn’t yet have deep in-house AI capabilities. Its platforms mostly involve data gathering and analysis. Ramer also notes how he has “seen no evidence of Palantir investing a significant amount of funds in developing AI before 2023.”\n\nNevertheless, Accenture’s experience shows that it’s not always necessary to have every platform in-house. If Palantir can develop its sales teams to mirror those of consulting firms, Dan Ives’ bullish calls will likely prove correct.\n\n5. DigitalOcean (DOCN) A laptop screen displays the logo for DigitalOcean (DOCN).\n\nSource: monticello / Shutterstock.com\n\nFinally, Bret Kenwell writes this week how DigitalOcean (NYSE:DOCN) is now a “buy” following its acquisition of Paperspace, an AI cloud computing startup.\n\nHere’s how CEO Yancey Spruill explains the acquisition:\n\nThe demand for AI/ML cloud solutions has witnessed an unprecedented surge, fueled by the emergence of large language models (LLMs)…\n\nTogether, DigitalOcean and Paperspace will unlock opportunities… [that will] delve into AI/ML applications such as generative media, text analysis, natural language understanding, recommendation engines, and image classifications.\n\nEven before the acquisition, DigitalOcean was a highly cash-flow positive firm. The New York-based company helps small and medium-sized businesses migrate to the cloud with virtual private servers (VPS). These scalable servers are a profitable business. Analysts were already expecting a strong $173 million profit in 2023.\n\nThe move into generative AI now gives DigitalOcean greater room for growth, especially if demand for pretrained systems begin to rise.\n\nKenwell currently has a $44-$45 floor price target on DOCN and expects shares to rise as high as $53 in the near term.\n\nThe AI Revolution Is Here\n\nIn 1983, the Pew Research Foundation found that middle-income families held 32% of U.S. wealth.\n\nFast forward to today, and everything’s changed. Middle-income families now own 17% of wealth and earn less than half of the country’s aggregate income.\n\nMeanwhile, the share owned by upper-income families has skyrocketed to almost 80%, turning America into a land of “haves” and “have-nots.”\n\nEric Fry calls this the Technochasm.\n\nIt’s a widening gulf between those who have benefited from technological change and those that have suffered or even been replaced.\n\nThe trend is accelerating with artificial intelligence. We’re seeing thousands of jobs getting replaced by generative AI. International Business Machines (NYSE:IBM) alone has already announced 7,800 cuts.\n\nAnd the better that artificial intelligence gets, the faster the trend will happen.\n\nThat’s why Louis Navellier, Eric and Luke teamed up and held the AI Impact Event on Thursday.\n\nDuring the event, they discussed the consequences of AI rapid adaptation… and the huge opportunity that we have if we act right now.\n\nPlus, Louis, Eric, and Luke shared how investors can position themselves to prosper.\n\nIf you missed the event, you can catch the replay here.\n\nAs of this writing, Tom Yeung did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.comPublishing Guidelines.\n\nTom Yeung is a market analyst and portfolio manager of the Omnia Portfolio, the highest-tier subscription at InvestorPlace. He is the former editor of Tom Yeung’s Profit & Protection, a free e-letter about investing to profit in good times and protecting gains during the bad.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live Wall Street Titan: Here’s My #1 Stock for 2023 The $1 Investment You MUST Take Advantage of Right Now It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 5 AI Stocks Poised for Growth Without Sky-High Risk appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/5-ai-stocks-poised-growth-110023858.html", "symbols": ["AAPL.US", "ACN.US", "ADB.F", "ADBE.US", "ADBE34.SA", "AI.US", "AMD.US", "AMZN.US", "AVID.US", "CSA.F", "CSCO.US", "DOCN.US", "GTLB.US", "IBM.US", "INTC.US", "META.US", "MSFT.US", "PLTR.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.029, "neu": 0.81, "pos": 0.161}}, {"date": "2023-07-31T10:52:30+00:00", "title": "Apple is taking no chances ahead of its $3,500 Vision Pro launch and has issued top-secret instructions to testing developers", "content": "The attention that comes with being the world's largest tech company has some downsides: Apple product launches are often leaked before release, and the company's competition is never far behind.\n\nThis is perhaps why the Tim Cook-led tech giant is taking no risks with the release of its hotly-anticipated headset, the Vision Pro.\n\nEstimated to be released in 2024, Apple has already announced the company's first \"spatial computer\", a mixed-reality headset with a 3D camera, that will retail for $3,499.\n\nDevelopers are being offered the chance to try out the tech before it hits the consumer market in order to build new features for customers—but it's an offer that comes with serious strings attached.\n\nThe legally binding terms and conditions signed by developers—or on behalf of a team of developers—dictate the Vision Pro can only be used in a fully-enclosed and locked room.\n\nThe document does not directly state that windows must be covered but says developers are responsible for ensuring unauthorized individuals cannot \"access, view, handle, or use\" the headset. It adds that unauthorized individuals include a developer's family, friends, housemates and household employees.\n\nIf the password-protected headset is being used the Vision Pro must also be in \"positive control\" of the developer—meaning it's either being used by the developer themselves or be in their direct line of sight.\n\nWhen it's not in use, the headset needs to be stored in its locked Pelican case—a waterproof, dustproof and crushproof case that is delivered alongside the Vision Pro—and then placed in a locked space like a room, closet or drawer, that only the developer has access to.\n\nIt can't leave the premises\n\nWhat if the developer wants to take the headset from their home to the office, or vice versa?\n\nNo can do, as the Ts and Cs continue the headset \"may not be moved from or taken away from its ship-to address by you or your authorized developers without Apple's prior written consent.\"\n\nStory continues\n\nThis is a lesson that Apple had to learn the hard way after tech website Gizmodo famously got its hands on an iPhone 4 disguised as a 3GS after it was left in a bar in 2010.\n\nOn top of that, the developer also needs to tell the iPhone maker if they're going to be away from the headset for more than 10 days and must \"consult with [their] Apple point of contact about how to keep the developer kit (DK) safe while you are away.\"\n\nThese measures are underlined with a strict policy on reporting to Apple if the set—be it parts or in its entirety—are stolen or broken, with the brand saying the headset must be returned in good working condition.\n\nFocus on theft was similarly a priority during the launch of the Apple Watch in 2015.\n\nAt the time a developer told Business Insider that a launch event was monitored by security guards at the exit, with attendees required to flash their wrists to the guards when visiting the bathroom or cafeteria to prove they weren't attempting to steal the devices.\n\nKeep it off social media\n\nThe Vision Pro marks Apple's biggest release in almost a decade and was welcomed with the expected fanfare on social media.\n\nBut consumers can't expect to get much more insight on platforms like Twitter once the product is in the hands of developers, as they've explicitly been told to keep their opinions to themselves.\n\nBe it paranoia or sound business sense, Apple isn't taking any risks when it comes to the publication of unapproved content, writing developers are banned from \"discussing, publicly writing about, or reviewing the DK, whether online, in print, in person, or on social media.\n\n\"You may not post, or permit your authorized developers to post, any photos, videos, or reactions to or about the DK.\"\n\nApp developers for the release of the iPad told Insider in 2011 that Apple was so concerned about photo leaks that the wood grain of developer's desks were photographed, so if any images leaked they could be traced back to an individual.\n\nThe developer added that holes had to be drilled into desks so that the iPads could be chained to the furniture with bike cables, and were presented in casing so that only the screens were available.\n\nThe news that certain developers will be able to take home a Vision Pro to test was released in June, with Apple confirming it would also be holding \"open developer labs\" in Cupertino, London, Munich, Shanghai, Singapore, and Tokyo in order to provide developers with hands-on experience to test their apps.\n\nThis story was originally featured on Fortune.com\n\nMore from Fortune: \r\n5 side hustles where you may earn over $20,000 per year—all while working from home\r\nLooking to make extra cash? This CD has a 5.15% APY right now\r\nBuying a house? Here's how much to save\r\nThis is how much money you need to earn annually to comfortably buy a $600,000 home", "link": "https://finance.yahoo.com/news/apple-taking-no-chances-ahead-105230753.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.039, "neu": 0.882, "pos": 0.079}}, {"date": "2023-07-31T10:27:00+00:00", "title": "Market and Fed Finally Agree on the Economy. What If They’re Both Wrong?", "content": "Apple and Amazon reports to show latest consumer spending trends, freight hauler Yellow to seek bankruptcy, and other news to start your day.", "link": "https://finance.yahoo.com/m/d7c64182-79e8-3ed6-92e4-f1b1f51f095d/market-and-fed-finally-agree.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0, "neu": 0.928, "pos": 0.072}}, {"date": "2023-07-31T10:05:00+00:00", "title": "Apple, Amazon, Starbucks, Uber and others are part of Zacks Earnings Preview", "content": "Chicago, IL – July 31, 2023 – Zacks.com releases the list of companies likely to issue earnings surprises. This week’s list includes Apple AAPL, Amazon AMZN, Starbucks SBUX, and Uber UBER.\n\nGreen Shoots Emerging from the Earnings Landscape\n\nWith a little over half of June-quarter results already out, we can confidently call the overall earnings picture reassuringly stable and resilient.\n\nEarnings aren't great, but no one expected them to be so. Instead, many in the market feared a material deterioration in the outlook that would show up in negative guidance and lowered estimates. While we have seen a few reports with downbeat guidance, the overall tone and substance of guidance and management commentary have been favorable.\n\nThe net effect of this is a very stable earnings outlook, even though estimates in the aggregate are still coming down due to a weakening revisions trend for the Energy sector.\n\nYou can see this by comparing earnings estimates for 2023 Q3 as well as full-year 2023 today to where they stood at the start of July and April.\n\nThe expectation today is for 2023 Q3 earnings to be down -2.1% from the same period last year on +0.2% higher revenues. If we exclude the Energy sector, Q3 earnings would be up +3.3% on +3% higher revenues.\n\nOne month ago, on June 27th, the expectation was for Q3 earnings to be down -1.4% on +0.7% higher revenues. Q3 earnings were expected to be up +3.4% on an ex-Energy basis on June 27th.\n\nFour months back, on March 29th, the expectation was for Q3 earnings to be up +0.6% on +0.7% higher revenues. Q3 earnings were expected to be up +4.4% on an ex-Energy basis on March 29th.\n\nThis discussion of evolving aggregate Q3 earnings estimates reflects that while analysts have cut their estimates for the period, a big part of the negative revisions is due to the Energy sector.\n\nWhile estimates in the aggregate for the remaining 15 sectors of the S&P 500 index are essentially unchanged over the past month, there are plenty of cross-currents at the individual sector levels. Specifically, estimates for the Tech, Construction, Autos, Transportation, and Utilities sectors have increased while the same for the other sectors have modestly come down.\n\nRegular readers of our earnings commentary would be familiar with these revisions trends, as we have been flagging them since the start of 2023 Q2. We noticed a significant stabilization in the revisions trend since the beginning of April, which was in contrast to the persistently negative revisions trend that had been in place for about a year prior.\n\nQ2 is on track to be the third consecutive quarter of earnings declines and the first quarter of declining revenues. As noted earlier, a big part of the earnings and revenue weakness is due to the Energy sector. Excluding the Energy sector drag, Q2 earnings would be down -2.9% on +3.6% higher revenues.\n\n2023 Q2 will be the 6th consecutive quarter of declining margins for the S&P 500 index.\n\nMargins in Q2 are expected to be below the year-earlier level for 10 of the 16 Zacks sectors, with the biggest margin pressure expected to be in the Energy, Medical, Basic Materials, and Construction sectors.\n\nWith the earnings focus lately on the Tech sector, it is instructive to see how much distance has been covered on the margins front in this vital sector.\n\nOn the positive side, margins are on track to be above the year-earlier level for six sectors, with notable gains in the Consumer Discretionary, Finance, and Transportation sectors.\n\nAs noted earlier, the estimate revisions trend has notably stabilized since the start of Q2. In the aggregate, S&P 500 earnings estimates for 2023 have declined -1.6% since the beginning of April but only -0.5% on an ex-Energy basis. Importantly, estimates for sectors like Tech, Construction, Autos, and Transportation have increased in that timeframe.\n\nWe see this favorable turn in the revisions trend as green shoots in the overall earnings landscape and indicative of better days ahead.\n\nQ2 Earnings Scorecard\n\nAs of Friday, July 28th, the Q2 earnings season crossed the halfway mark, with results from 254 S&P 500 members already out. We have a full reporting docket this upcoming week, with more than 1100 companies reporting results, including 169 S&P 500 members. By the end of this week, we will have seen Q2 results from almost 85% of the index members.\n\nThe notable companies reporting this week include Apple, Amazon, Starbucks, Uber and others.\n\nApple's Q2 earnings are expected to be -4.1% below the year-earlier level on -2% lower revenues. The stock has been a standout performer this year, up +50.1% vs. +19.4% for the S&P 500 index. It has been a while since Apple shares were down following a quarterly release. In fact, the last time the stock reacted negatively to a quarterly release was two years ago, in July 2021.\n\nUber, which reports before the market's open on Tuesday, August 1st, has done even better than Apple this year, up +95.6% in the year-to-date period. This is expected to be a milestone quarter for Uber, with the current consensus EPS estimate at breakeven, up from the year-earlier period's -$1.33 loss.\n\nTotal Q2 earnings for the 254 S&P 500 members are down -3.4% from the same period last year on +1.7% higher revenues, with 80.3% beating EPS estimates and 64.6% beating revenue estimates.\n\nThe Apple release after the market's close on Thursday, August 3rd, will keep the Tech sector in focus this week as well. Through Friday, July 28th, we have seen Q2 results from 52% of the sector's total market capitalization in the index. Total earnings for these Tech companies are up +0.4% from the same period last year on +1.5% higher revenues, with 93.8% beating EPS estimates and 75% beating revenue estimates.\n\nFor a detailed look at the overall earnings picture, including expectations for the coming periods, please check out our weekly Earnings Trends report >>>>Strong Tech Results Reflect a Resilient Earnings Picture\n\nWhy Haven't You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nZacks.com provides investment resources and informs you of these resources, which you may choose to use in making your own investment decisions. Zacks is providing information on this resource to you subject to the Zacks \"Terms and Conditions of Service\" disclaimer. www.zacks.com/disclaimer.\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss.This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performancefor information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\n\nApple Inc. (AAPL) : Free Stock Analysis Report\n\nStarbucks Corporation (SBUX) : Free Stock Analysis Report\n\nUber Technologies, Inc. (UBER) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/apple-amazon-starbucks-uber-others-100500540.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "GSPC.INDX", "U1BE34.SA", "UBER.US", "UT8.F", "UT8.STU"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.047, "neu": 0.859, "pos": 0.094}}, {"date": "2023-07-31T09:00:02+00:00", "title": "Apple \"well-positioned\" heading into earnings - Piper Sandler", "content": "Investing.com -- Apple (NASDAQ:AAPL) is well-positioned heading into the release of its third-quarter earnings later this week, analysts at Piper Sandler said on Monday, arguing that concerns around weak demand for the tech giant's handsets in China are \"a bit overblown.\"\n\nIn a note to clients, the analysts said that Apple has a \"solid footing\" in China despite lingering worries that a sputtering post-pandemic recovery in the country will weigh on sales of the California company's watches, earphones, Mac computers. Sales in China of Apple's popular iPhone handset in particular should see a \"small if any decline\" but still remain in line with internal estimates, the analysts predicted.\n\nMeanwhile, they added that \"dynamics around potential soft conditions in China will most likely be built into the guide for the September quarter.\"\n\nEven accounting for potentially weaker returns in China, the analysts said that Apple's projections for September will \"match or slightly exceed [Wall Street] expectations\" thanks in part to strong demand for the iPhone in India.\n\nApple will unveil its latest results on Thursday. Analysts have flagged that recent weakness in consumer demand for discretionary items may hit product sales, although Apple's increasingly important services business -- which features offerings like music, movies and iCloud storage -- is seen supporting margins.\n\nRelated Articles\n\nApple \"well-positioned\" heading into earnings - Piper Sandler\n\nUK regulator seeks public input on Microsoft-Activision deal\n\nDell expands 'Project Helix' with Nvidia to provide generative AI solutions", "link": "https://finance.yahoo.com/news/apple-well-positioned-heading-earnings-090002124.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.903, "neg": 0.062, "neu": 0.829, "pos": 0.108}}, {"date": "2023-07-31T07:40:02+00:00", "title": "Apple, Amazon, Starbucks to Report in Packed Earnings Week", "content": "Apple, Amazon.com and Starbucks will report earnings this week, offering insights into where consumers are spending their money as inflation eases and interest rates rise. Uber Technologies is also set to report, along with pharmaceutical companies Pfizer and Amgen, online payment giants PayPal and Block, and food conglomerates Kraft Heinz and Kellogg.\n\nContinue reading", "link": "https://finance.yahoo.com/m/37ecf0e0-22f3-3303-93d1-04bbe7c14c73/apple%2C-amazon%2C-starbucks-to.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "SBUB34.SA", "SBUX.MX", "SBUX.US", "SRB.F", "SRB.XETRA"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0.049, "neu": 0.861, "pos": 0.09}}, {"date": "2023-07-31T05:47:51+00:00", "title": "GLOBAL MARKETS-Asia shares up as China talks stimulus; Japanese yields a risk", "content": "*\n\nAsian stock markets : https://tmsnrt.rs/2zpUAr4\n\n*\n\nNikkei up 1.2%, S&P futures flat after firm July\n\n*\n\nChina factory survey steadies, services disappoint\n\n*\n\nYen slips anew despite BOJ shift on bond yields\n\n*\n\nRaft of earnings this week include Amazon and Apple\n\nBy Wayne Cole\n\nSYDNEY, July 31 (Reuters) - Asian shares were trying to end the month on a firm note on Monday in a week littered with major economic releases, central bank meetings and earnings updates from mega caps Amazon and Apple, though rising Japanese bond yields posed a risk.\n\nChina surveys were mixed with factory activity just pipping forecasts but services disappointing, though both merely reinforced wagers that Beijing would have to act at some point. China's State Council on Monday did issue measures to restore and expand consumption in the automobile, real estate and services sector, though this was a long way from the massive fiscal spending markets have been counting on.\n\nBlue chips seemed unperturbed and added 0.6%, bringing gains for July to 4.5%.\n\nMSCI's broadest index of Asia-Pacific shares outside Japan climbed 0.5%, having gained 5.2% so far in July to reach a five-month high.\n\nThe initial impetus for markets was positive following Friday's U.S. data showing an easing in wage costs and core inflation, which fuelled hopes the Federal Reserve was done tightening. \"The data surprises bolster confidence that global core inflation - ex. China - will fall sharply and set the stage for a developed market central policy pause and emerging market easing even if growth remains firm,\" said Bruce Kasman, head of economic research at JPMorgan.\n\nFigures due this week include the U.S. ISM surveys on manufacturing and services, the July payrolls report and European inflation.\n\nThe Bank of England is widely expected to raise rates by at least a quarter point, but markets are more divided on whether the Reserve Bank of Australia will hike or stay on hold.\n\nAlmost 30% of the S&P 500 report results this week and so far, earnings have been good enough to see the index extend its rally to 10% since the start of June.\n\nS&P 500 futures dipped 0.1% on Monday, but the index was still up 2.9% for July, while Nasdaq futures dipped 0.2%. EUROSTOXX 50 futures and FTSE futures both eased 0.4%.\n\nApple Inc and Amazon.com both report on Thursday, while other well-known names with results due include Western Digital Corp, Caterpillar Inc, Starbucks Corp, and Advanced Micro Devices.\n\nPARSING THE BOJ\n\nJapan's Nikkei rose 1.2% to re-take the 33,000 level and nudge closer to its recent three-decade peak.\n\nInvestors are still pondering the implications of Friday's shock decision by the Bank of Japan (BOJ) to lift the lid on bond yields, in a step away from its ultra-easy policies.\n\nAnalysts at BofA estimate the BOJ's bond buying added $1.3 trillion to global liquidity in the past 18 months and provided a low floor for global rates, so any sustained rise in Japanese government bond yields could ripple though other bond markets.\n\nJapanese 10-year yields climbed further to 0.6% on Monday, and toward the new cap of 1.0%. That also put upward pressure on Treasury yields, where the 10-year rose 3 basis points to 3.99%.\n\nWhile the yen had initially rallied on the BOJ move, it soon reversed course as investors still seemed happy to run carry trades, or yen-funded positions in higher-yielding currencies.\n\n\"Friday's action might best be viewed as an attempt to head off a fresh wave of yen-weakening carry trade activity, by at least ceasing to resist pressure for 10-year yields to rise above 0.5%,\" said Ray Attrill, head of FX strategy at National Australia Bank.\n\n\"Friday's actions do, though, fail to provide a catalyst for a secular reversal of yen weakness.\"\n\nThe yen was again under pressure on Monday as the dollar pushed up to 141.87 yen, a long way from Friday's brief low of 138.05.\n\nThe euro had also recovered from its initial pullback to stand at 156.18 yen, while steadying on the dollar at $1.1010 after some wild swings last week.\n\nIn commodities, gold was off a shade at $1,955 an ounce , leaving it 1.8% higher for the month so far.\n\nOil prices took a breather, having risen for five weeks in a row as production cuts by OPEC+ tightened supply.\n\nGoldman Sachs on Sunday revised up its global oil demand forecast for the year while sticking to its 12-month Brent price projection of $93 per barrel.\n\nBrent was off 59 cents at $84.40 a barrel, while U.S. crude eased 31 cents to $80.27.\n\n(Reporting by Wayne Cole; Editing by Jamie Freed and Himani Sarkar)", "link": "https://finance.yahoo.com/news/global-markets-asia-shares-china-054751050.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "GSPC.INDX"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0.048, "neu": 0.858, "pos": 0.095}}, {"date": "2023-07-31T05:26:54+00:00", "title": "Amazon and Apple earnings ahead, U.S. jobs report looms -- what's moving markets", "content": "Investing.com -- U.S. stocks point higher ahead of a week of major corporate results and key economic data. Amazon and Apple are set to round out a multi-week crush of earnings from Big Tech, while nonfarm payroll figures for July could provide clues into the impact of over a year of Federal Reserve policy tightening.\n\n1. Futures edge higher\n\nU.S. stock futures inched up on Monday, but stayed close to the flatline, as investors looked ahead to a fresh batch of tech earnings and key U.S. employment data this week.\n\nAt 05:12 ET (09:12 GMT), the Dow futures contract had gained 18 points or 0.05%, S&P futures added 4 points or 0.08%, and Nasdaq 100 futures moved up by 8 points or 0.05%.\n\nThe main indices remain on track to post monthly gains before the final trading day of July. The Dow Jones Industrial Average, which saw its longest win streak since 1987 snapped last week, is up 3.1% this month, while the S&P 500 has climbed 3% and the tech-heavy Nasdaq Composite has added 3.8%.\n\nAs July turns to August, traders are awaiting earnings later in the week from Amazon and Apple, as well as chipmakers AMD (NASDAQ:AMD) and Qualcomm (NASDAQ:QCOM).\n\nMeanwhile, the crucial U.S. nonfarm payrolls report for July is due out on Friday, with economists predicting that the world's biggest economy added fewer jobs compared to the prior month.\n\n2. Amazon and Apple results ahead\n\nE-commerce giant Amazon (NASDAQ:AMZN) and iPhone-maker Apple (NASDAQ:AAPL) will both report their latest quarterly results on Thursday, rounding out a wave of closely-watched Big Tech earnings in recent weeks.\n\nFocus will likely hover around how the companies' revenue flows fared during a three-month period marked by economic uncertainty that has persuaded some businesses and individuals to rein in spending.\n\nFor Amazon, attention will likely turn to its all-important cloud computing unit, Amazon Web Services, where growth decelerated in the previous quarter. Amazon has also flagged that the slowdown at the division continued into April.\n\nApple, meanwhile, will deliver its first results since the unveiling of its highly-anticipated Vision Pro headset in June. Despite the excitement around the device, weaker consumer demand is expected to weigh on other products like the iPhone and iPad.\n\nAnalysts may also be keen to question Amazon and Apple executives about their plans for artificial intelligence (AI). Last week, tech peers Microsoft (NASDAQ:MSFT), Facebook-owner Meta Platforms (NASDAQ:META), and Google-parent Alphabet (NASDAQ:GOOGL) cautioned that spending levels may soon rise as they race to develop AI tools.\n\n3. U.S. jobs report highlights economic calendar\n\nHiring in the U.S. is projected to have slowed in July, but the job market is expected to remain relatively tight even in the face of aggressive Federal Reserve interest rate hikes.\n\nEconomists predict that total nonfarm employment rose by 200,000 during the month, down from the June reading of 209,000, while the jobless rate is expected to remain steady at 3.6%.\n\nThe labor market has been a major focus of the Fed's long-standing monetary tightening campaign, with policymakers arguing that a loosening in employer demand could help alleviate inflationary pressures. The Fed increased interest rates by 25 basis points last week, but suggested that any future decisions would be \"data-dependent.\"\n\nDespite signs of moderation, job growth has remained robust in recent months. The strength has in turn fueled speculation that the Fed may be able to engineer a so-called \"soft landing\" -- corralling inflation without sparking a meltdown in the broader economy.\n\nFriday's figures may provide more clarity on this key question.\n\n4. SEC asked Coinbase to halt all non-Bitcoin trading - FT\n\nThe U.S. Securities and Exchange Commission requested that Coinbase (NASDAQ:COIN) cease trading in all digital tokens except for Bitcoin prior to filing a lawsuit against the cryptocurrency exchange, according to the Financial Times.\n\nIn an interview, Coinbase Chief Executive Brian Armstrong told the paper that the SEC \"said...we believe every asset other than bitcoin is a security.\" Armstrong added that the regulators then asked that Coinbase delist all of the more than 200 tokens it offers to customers, apart from Bitcoin.\n\nArmstrong refuted the claim, saying that agreeing to the shutdowns \"would have essentially meant the end of the crypto industry in the U.S.\" Instead, he said Coinbase decided to challenge the SEC's assertions in court.\n\nThe SEC has been angling to gain more control over the crypto industry, with Chair Gary Gensler arguing that most cryptocurrencies qualify as securities, or tradeable financial assets. Coinbase was sued by the SEC last month for failing to register as a broker.\n\nShould the SEC win this case, it could set a precedent for the power regulators in the U.S. have over crypto businesses and potentially lead to more stringent compliance rules.\n\nFor its part, the SEC told the FT that its enforcement division did not make formal requests for \"companies to delist crypto assets.\" It also declined to comment on what the delisting would mean for the crypto industry.\n\n5. Walmart boosts Flipkart stake - WSJ\n\nRetail giant Walmart (NYSE:WMT) has further cemented its interest in Flipkart through a $1.4 billion purchase of shares from a major investor in the Indian e-commerce group, according to the Wall Street Journal.\n\nWalmart bought New York-based hedge fund Tiger Global's remaining shares in Flipkart, the paper reported, citing a letter sent by Tiger to its investors. The transaction valued Flipkart at $35B, down from the almost $38B attached by Tiger to the company in 2021.\n\nMeanwhile, Walmart also bought out private equity firm Accel's remaining 1% stake in Flipkart, the Economic Times newspaper reported, although the size of the purchase was unknown.\n\nThe moves boost Walmart's exposure to Flipkart at a time when the Arkansas-based company is looking to expand its presence in the digital commerce space. Walmart paid $16B more than five years ago for an initial 77% stake in Flipkart, a wide-ranging business catering to more than 450 million customers.\n\nRelated Articles\n\nAmazon and Apple earnings ahead, U.S. jobs report looms -- what's moving markets\n\nAnalysis-Dwindling excess savings could scupper markets' soft-landing hopes\n\nCanada's Trudeau sets sights on fourth election fight with Cabinet refresh", "link": "https://finance.yahoo.com/news/amazon-apple-earnings-ahead-u-052654020.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "AMD.US", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "COIN.US", "GOOGL.US", "META.US", "MSFT.US", "QCOM.US", "WALM34.SA", "WMT.F"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.035, "neu": 0.846, "pos": 0.119}}, {"date": "2023-07-31T02:18:55+00:00", "title": "Dow Jones Futures Fall After Market Rally Powers Higher; Apple, Tesla Lead Stocks To Watch", "content": "The market rally had some wobbles amid big news, but powered for solid weekly gains. Apple and Tesla are stocks to watch.\n\nContinue reading", "link": "https://finance.yahoo.com/m/b3fa25dc-2b85-3119-9d25-c0e3a7639344/dow-jones-futures-fall-after.html", "symbols": ["307.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "SHOP.TO", "SHOP.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.612, "neg": 0, "neu": 0.815, "pos": 0.185}}, {"date": "2023-07-31T01:44:05+00:00", "title": "15 Biggest Green Tech Companies in the World", "content": "In this article, we will talk about 15 biggest green tech companies in the world. We will also cover some interesting insights on the latest trends in green technology. If you want to skip our detailed analysis, head straight to 5Biggest Green Tech Companies in the World.\n\nHow Important Is Green Energy Investment?\n\nThe financialization of green energy has proven to be an undeniable success, with both China and the U.S. emerging as global leaders in attracting capital to fuel the energy sector's transformation. China, in particular, has been remarkably successful, with a staggering $546 billion in green energy investments in 2022, while the U.S. trailed behind with $141 billion.\n\nMoreover, renewable energy has undergone a remarkable transformation. Once deemed costly and risky, heavily subsidized, it has become more affordable than certain traditional fossil fuel sources. Developments in mitigating intermittency issues and energy storage have played an equally pivotal role in this transformation and have raised the possibility that renewables could become the primary electricity source in the next 20-30 years.\n\nThe Latest Trends in Green Technology\n\nThe eco-friendly solutions like electric vehicles and solar power which once considered niche or unconventional, have now gained mainstream acceptance as part of the collective effort to combat climate change. The Climate Tech 2020 Report, published by PwC, highlighted a massive shift in investment trends. In 2013, venture capital investments in decarbonization solutions amounted to $418 million, but this figure soared to an impressive $16.1 billion in 2019. Subsequently, the momentum continued, with an exceptional $87.5 billion invested in climate tech between July 2020 and July 2021, as reported in the Climate Tech 2021 Report.\n\nCorporations have undergone an equally pertinent evolution in their corporate responsibility initiatives, placing a much stronger emphasis on sustainability. For instance, Alphabet Inc (NASDAQ:GOOG) has taken notable steps to address climate change which is also evident in the eco-routing feature of Google Maps, that has already resulted in a reduction of over 500,000 metric tons of greenhouse gas emissions.\n\nStory continues\n\nSimilarly, Apple Inc (NASDAQ:AAPL) has made pertinent contributions in reducing its carbon footprint in its operations and is actively working towards a carbon-neutral goal by the year 2030. Apple Inc (NASDAQ:AAPL) also encourages its suppliers to adopt clean energy practices. Through their Power for Impact program, Apple Inc (NASDAQ:AAPL) is dedicated to facilitating access to clean energy for communities worldwide. Apple Inc (NASDAQ:AAPL) is considered one of the greenest tech companies.\n\nMoreover, green hydrogen is emerging as a leading force in the clean energy transition and has gained a significant traction and recognition as the energy of the future. In 2023, numerous major green hydrogen projects are set to reach final investment decisions or commence construction, which signifies a shift from theoretical discussions to large-scale reality.\n\nThe momentum behind green hydrogen is further amplified by a surge of government subsidy schemes worldwide. The US hydrogen tax credits alone offer up to $3 per kilogram of green hydrogen to producers and promise substantial support. Additionally, the EU and UK Contracts for Difference subsidy programs and Germany's H2Global scheme will also provide financial assistance for clean hydrogen imports.\n\nDigital technology, particularly Artificial Internet of Things (AIoT), also plays a crucial role in accelerating the transition to green hydrogen. The World Economic Forum suggests that AIoT-enabled solutions can cut capital and operating expenses by up to 25%, expediting the commercial viability of green hydrogen by four to seven years. As investments rise and government backing strengthens, the future of green hydrogen is undoubtedly promising.\n\nClean Energy Projects in the US\n\nIn August 2022, the US enacted the Inflation Reduction Act of 2022 to curb inflation, reduce the budget deficit, and invest in domestic clean energy production. According to a report by Climate Power, Georgia ranks second in the U.S. for new private-sector clean energy projects since the Inflation Reduction Act's passage, with 22 projects and 16,678 expected jobs. Michigan leads with 24 projects, while Kansas expects 20,600 jobs. The law has been praised for boosting green energy investments and driving development. However, Governor Brian Kemp criticized the law for having little impact on EV and battery manufacturing expansion. 15 Biggest Green Tech Companies in the World\n\nIkonoklast Fotografie/Shutterstock.com\n\nOur Methodology\n\nTo list the biggest green tech companies in the world, we targeted pure play companies in green technologies and made a list of 20 such companies. Out of those, the 15 companies with highest annual revenue in 2022 were selected and have been ranked in ascending order of high revenue. We acquired data from the income statements of these companies. They are all public green tech companies.\n\nHere is a list of the Largest Green Tech Companies in the World\n\n15. Ormat Technologies, Inc (NYSE:ORA)\n\nAnnual Revenue: $734.16M\n\nOrmat Technologies, Inc (NYSE:ORA) is based in Reno, Nevada, and specializes in providing alternative and renewable geothermal energy technology. With over 190 power plants constructed and 3,200 MW installed, it owns and operates 933 MW of geothermal and recovered energy-based power plants as of January 2021. Ormat Technologies, Inc (NYSE:ORA)’s global presence includes supply of over 1000 turbochargers and products like turbines, generators, and heat exchangers.\n\n14. BloomEnergy Corp (NYSE:BE)\n\nAnnual Revenue: $1.20B\n\nBloom Energy Corp (NYSE:BE) is based in San Jose, California, and is known for manufacturing solid oxide fuel cells that generate on-site electricity. Bloom Energy Corp (NYSE:BE) was founded in 2001 and raised over $1 billion in venture capital in 2010 before going public in 2018. Benefiting from government incentives for green energy, the company has installed approximately 600 megawatts worth of fuel cells as of 2020. It is one of the most environmentally friendly tech company.\n\n13. TPI Composites Inc (NYSE:TPIC)\n\nAnnual Revenue: $1.52B\n\nTPI Composites Inc (NYSE:TPIC) is the largest U.S-based independent manufacturer of composite wind blades, serving global wind turbine manufacturers. With facilities in North America, Europe, and Asia, the company supports the high-growth wind energy market. TPI Composites Inc (NYSE:TPIC) manufactures wind blades and collaborates on research and development projects with organizations like the U.S. Department of Energy and RecycleWind to further advancements in the industry. It is one the biggest green tech companies in the world.\n\n12. EDP Renováveis\n\nAnnual Revenue: $2.21B\n\nEDP Renováveis is a renewable energy company based in Madrid, Spain. It was established in 2007 as part of Energias de Portugal (EDP Group) and operates wind and solar power plants in 13 international markets. EDPR is the world's fourth-largest wind energy generator, with 9.7 gigawatts of installed capacity. Despite challenges like state support, technology changes, and local opposition, the company has earned a reputation for reliability and strong relationships with private equity partners.\n\n11. Sunrun, Inc (NASDAQ:RUN)\n\nAnnual Revenue: $2.32B\n\nSunrun Inc (NASDAQ:RUN) is a San Francisco-based American provider of residential photovoltaic systems and battery energy storage products. Sunrun Inc (NASDAQ:RUN) uses a power purchase agreement (PPA) model to install and maintain solar systems for customers, selling power at agreed rates for 20-25 years. With partnerships, they've installed 5.7 gigawatts of power for around 800,000 customers, including 990 megawatts in 2023. Owing to the growing popularity of photovoltaic systems, solar photovoltaic installers is one of the most in-demand jobs for the future.\n\n10. Enphase Energy Inc (NASDAQ:ENPH)\n\nAnnual Revenue: $2.33B\n\nEnphase Energy Inc (NASDAQ:EPNH) is a leading energy technology company since 2006. They produce solar micro-inverters, battery storage, and EV charging stations for residential customers worldwide, shipping over 63 million microinverters to over 145 countries. It is one of the biggest sustainable tech companies in the world.\n\n9. First Solar Inc (NASDAQ:FSLR)\n\nAnnual Revenue: $2.62B\n\nFirst Solar, Inc (NASDAQ:FSLR) is an American solar panel manufacturer and utility-scale PV power plant provider. They use rigid thin-film modules with cadmium telluride (CdTe) semiconductor. Founded in 1990, the company went public in 2006. First Solar, Inc (NASDAQ:FSLR) is based in Tempe, Arizona, and has achieved several milestones, including lowering manufacturing costs to $1 per watt in 2009. It is one of the most important companies in the world.\n\n8. SolarEdge Technologies Inc (NASDAQ:SEDG)\n\nAnnual Revenue: $3.11B\n\nSolarEdge Technologies Inc (NASDAQ:SEDG), was established in 2006. The company is the pioneer of the utilizing DC optimized inverter systems and commercialized Power Optimizers. These devices enable module-level maximum power point tracking (MPPT) for solar photovoltaic systems to improve energy production compared to traditional central inverters. Power optimizers are placed behind each solar panel which addresses issues of shading and weather impact. They feed energy individually to a central inverter and allow panel-level monitoring for more efficient performance tracking. SolarEdge Technologies Inc (NASDAQ:SEDG) is one of the top green tech companies in the world.\n\n7. Daqo New Energy Corp (NYSE:DQ)\n\nAnnual Revenue: $4.61B\n\nDaqo New Energy Corp (NYSE:DQ) is a Chinese company that manufactures monocrystalline and polysilicon used in solar photovoltaic systems. They operate a manufacturing facility in Shihezi, in the Xinjiang Province of China. Daqo New Energy Corp (NYSE:DQ) previously produced silicon wafers in Chongqing which they discontinued in 2018 and photovoltaic modules in Nanjing which they also discontinued in 2012. Daqo New Energy Corp (NYSE:DQ) is one of the most economical producers of high-purity polysilicon for the solar PV industry.\n\n6. Vestas Wind Systems A/S\n\nAnnual Revenue: $14.49B\n\nVestas Wind Systems AS is a global leader in sustainable energy solutions that specializes in designing, manufacturing, installing, and servicing wind turbines worldwide. With over 166 GW of wind turbines in 88 countries, they have the largest wind power installation globally. They utilize smart data capabilities and manage over 146 GW of wind turbines under service. The company works with customers to deliver top-notch wind power solutions with a promise to provide a brighter and more sustainable future.\n\nClick here to see the 5 Biggest Green Tech Companies in the World.\n\nSuggested Articles:\n\n20 Most Important Companies in the World 10 Biggest Issues In the World and The Companies Working on Solving Them 15 Biggest Issues in America and the Companies Working on Solving Them\n\nDisclosure: 15 Biggest Green Tech Companies in the World is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/15-biggest-green-tech-companies-014405056.html", "symbols": ["1ZB.F", "1ZB.STU", "2ED.F", "3S9.F", "5DQ2.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "BE.US", "DQ.US", "ENPH.US", "EPNH.US", "F3A.F", "F3A.XETRA", "FSLR.MX"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.013, "neu": 0.831, "pos": 0.157}}, {"date": "2023-07-31T00:42:15+00:00", "title": "GLOBAL MARKETS-Asia shares extend gains; wary eye on Japan yields", "content": "*\n\nAsian stock markets : https://tmsnrt.rs/2zpUAr4\n\n*\n\nNikkei up 1%, S&P futures firm after upbeat July\n\n*\n\nRaft of earnings this week include Amazon and Apple\n\n*\n\nYen volatile in wake of BOJ shift on bond yields\n\nBy Wayne Cole\n\nSYDNEY, July 31 (Reuters) - Asian shares looked to end the month on a firm note on Monday in a week littered with major economic releases, central bank meetings and earnings updates from mega caps Amazon and Apple, though rising Japanese bond yields were a risk.\n\nThe early impetus for shares was positive following Friday's U.S. data showing an easing in wage costs and core inflation, which fuelled hopes the Federal Reserve was done tightening. \"The data surprises bolster confidence that global core inflation - ex. China - will fall sharply and set the stage for a developed market central bank policy pause and emerging market easing even if growth remains firm,\" said Bruce Kasman, head of economic research at JPMorgan.\n\nFigures due this week include the U.S. ISM surveys on manufacturing and services, the July payrolls report and European inflation. China factory surveys are due later on Monday.\n\nThe Bank of England is widely expected to raise rates by at least a quarter point, but markets are more divided on whether the Reserve Bank of Australia will hike or stay on hold.\n\nAlmost 30% of the S&P 500 report results this week and, so far, earnings have been good enough to see the index extend its rally to 10% since the start of June.\n\nS&P 500 futures added another 0.1% on Monday, bringing its gains for July to almost 3%, with Nasdaq futures up 0.2%.\n\nApple Inc and Amazon.com both report on Thursday, while other well-known names with results due include Western Digital Corp, Caterpillar Inc, Starbucks Corp, and Advanced Micro Devices.\n\nAsian markets have also been trending higher, with China's benchmark index enjoying a 4.5% jump last week on hopes for more stimulus from Beijing.\n\nEarly on Monday, MSCI's broadest index of Asia-Pacific shares outside Japan edged up 0.1%, having gained 4.9% so far in July to reach a five-month high.\n\nPARSING THE BOJ\n\nJapan's Nikkei rose 1.0% to re-take the 33,000 level and nudge closer to its recent three-decade peak.\n\nInvestors are still pondering the implications of Friday's shock decision by the Bank of Japan (BOJ) to lift the lid on bond yields, in a step away from its ultra-easy policies.\n\nAnalysts at BofA estimate the BOJ's bond buying added $1.3 trillion to global liquidity in the past 18 months and provided a low floor for global rates, so any sustained rise in Japanese government bond yields could ripple though other bond markets.\n\nJapanese 10-year yields climbed further to 0.6% on Monday, still short of the new cap of 1.0% and limiting the boost to the yen. While the yen initially rallied on the BOJ move, it soon reversed course, and the dollar climbed from 138.05 yen to as high as 141.18 late on Friday.\n\nOn Monday, the dollar was off slightly at 140.78 yen , with investors still seeming happy to run carry trades, or yen-funded positions in higher-yielding currencies.\n\n\"Friday's action might best be viewed as an attempt to head off a fresh wave of yen-weakening carry trade activity, by at least ceasing to resist pressure for 10-year yields to rise above 0.5%,\" said Ray Attrill, head of FX strategy at National Australia Bank.\n\n\"Friday's actions do, though, fail to provide a catalyst for a secular reversal of yen weakness.\"\n\nThe euro had also recovered from its initial pullback to stand at 155.17 yen, while steadying at $1.1026 after some wild swings last week.\n\nIn commodities, gold was steady at $1,957 an ounce, having gained around 2% for the month so far.\n\nOil prices have climbed for five weeks in a row as production cuts by OPEC+ tightened supply.\n\nBrent was off 9 cents on Monday at $84.90 a barrel, while U.S. crude eased 6 cents to $80.52.\n\n(Reporting by Wayne Cole; Editing by Jamie Freed)", "link": "https://finance.yahoo.com/news/global-markets-asia-shares-extend-004215487.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "GSPC.INDX"], "tags": [], "sentiment": {"polarity": 0.99, "neg": 0.033, "neu": 0.869, "pos": 0.098}}]