[{"date": "2024-03-20T22:10:29+00:00", "title": "12 Best Alternatives to a 4-Year College", "content": "In this article, we will look at the 12 best alternatives to a 4-year college. We have also discussed the decreasing value of college degrees. If you want to skip our detailed analysis, head straight to the 5 Best Alternatives to a 4-Year College.\n\nIn recent years, there has been a growing emphasis on alternatives to traditional four-year college degrees due to several factors. One major reason is the rising cost of higher education, which has led many individuals to seek more affordable options. Additionally, the job market's evolving nature demands a broader range of skills and competencies, prompting a shift towards alternative pathways such as vocational training, apprenticeships, and online certifications.\n\nHowever, it's essential to acknowledge the lasting benefits of a four-year college degree. Beyond providing specialized knowledge in a particular field, a bachelor's degree often cultivates critical thinking, communication, and problem-solving skills that are valuable across various professions. Moreover, a college education opens doors to a broader range of career opportunities and typically leads to higher earning potential over the long term. In fact, there are easy college degrees that are quite high paying as well.\n\nIt is interesting to note that Liberal Arts is one of the easiest 4 year degrees to get. However, Liberal Arts is also one of the most useless associate degrees if you want high-paying jobs.\n\nMoreover, data from the Burning Glass Institute highlights a decline in jobs requiring a college education, dropping from 51% in 2017 to 44% in 2021. Similarly, Gallup reports a stark decline in the percentage of young adults viewing college education as \"very important,\" plummeting from 74% to 41% within six years.\n\nCompanies like Apple Inc (NASDAQ:AAPL) and Alphabet Inc (NASDAQ:GOOG) are redefining hiring criteria, recognizing the value of life experiences over formal education. This sentiment is echoed in findings from Georgetown University, revealing that while a bachelor's degree holder may earn $2.8 million over a lifetime, non-degree holders can still expect $1.6 million in earnings, challenging conventional notions of the economic benefits of higher education.\n\nStory continues\n\nMoreover, in 2016, International Business Machines Corp (NYSE:IBM) introduced \"new collar\" roles, emphasizing transferable skills over bachelor's degrees. By 2020, 15% of hires included positions like application developer and cyber security specialist. In 2021, International Business Machines Corp (NYSE:IBM)  eliminated degree requirements for over half its US openings. The P-TECH program aided underprivileged students in acquiring tech skills and securing International Business Machines Corp (NYSE:IBM)  internships. While International Business Machines Corp (NYSE:IBM)  maintains lower degree requirements for roles like software QA engineer and network administrator, just 31% of software developer/engineer positions mandate a degree — the lowest among tech competitors per Burning Glass Institute data.\n\nFurthermore, the US Bureau of Labor Statistics reports an average of 12 job changes over a career, emphasizing the importance of adaptable skills garnered from varied experiences. Initiatives such as Alphabet Inc (NASDAQ:GOOG)’s career certificates and innovative programs like Minerva University's immersive learning confirm the growing emphasis on experiential learning.\n\nAnother observation we tend to find is that inflation, whether in currency or credentials, obeys the principles of supply and demand. Just as rare items like vintage baseball cards command high prices due to scarcity, rare skills in the job market yield high wages. However, the widespread adoption of college degrees as a signaling tool has led to their devaluation. With 99.5 million Americans now holding bachelor's degrees, the once-esteemed credential has become commonplace. This phenomenon, known as credential inflation, sees jobs that once required only a high school diploma now demanding a bachelor's degree. Consequently, many recent graduates find themselves overqualified for low-paying jobs, contributing to underemployment rates. To read about unemployment rates, see the countries with the highest unemployment rates. 12 Best Alternatives to a 4-Year College\n\nA student concentrate on their laptop in the library, taking advantage of an educational program online.\n\nOur Methodology\n\nTo list the best alternatives to a 4-year college degree, we have looked at alternatives with 4 major traits. Firstly, we tried to include options that offered specialized training or are specific in nature. Secondly, we identified options that provided hand-on experience. Thirdly, we looked at degree alternatives that were largely accessible. Lastly, we selected alternatives that aligned with current industry demands and trends and hence, came with high employability chances. We tried to score each alternative out of a total of 40 on the basis of consensus about the presence of these traits. We utilized Reddit as our primary source of consensus. The list is presented in an ascending order.\n\nBy the way, Insider Monkey is an investing website that uses a consensus approach to identify the best stock picks of more than 900 hedge funds investing in US stocks. The website tracks the movement of corporate insiders and hedge funds. Our top 10 consensus stock picks of hedge funds outperformed the S&P 500 stock index by more than 140 percentage points over the last 10 years (see the details here). So, if you are looking for the best stock picks to buy, you can benefit from the wisdom of hedge funds and corporate insiders.\n\n12. Volunteer Work at Non Profit Organizations\n\nIM Score: 20\n\nVolunteer work at non-profit organizations offers practical, hands-on experience in real-world settings, fostering valuable skills such as teamwork, communication, and problem-solving. Unlike a four-year college degree, volunteering provides immediate engagement with societal issues, promoting empathy and social responsibility. It allows individuals to explore different career paths, gain insights into various industries, and network with professionals. Additionally, volunteering can lead to job opportunities and personal fulfillment without the financial burden of college tuition. It can also lead to inner sense of purpose and happiness. To read more about such jobs, see the happiest jobs in the world.\n\nVolunteering is also a great option if you are struggling to find a direction. It is also one of the best alternatives for college dropouts.\n\n11. Get an Associate Degree at a Community College\n\nIM Score: 21\n\nGetting an Associate Degree at a Community College offers several advantages over a 4-year college degree. Firstly, it's typically more affordable, allowing students to save money on tuition and fees. Additionally, community colleges often offer flexible schedules, making it easier for students to work while attending school or to balance other responsibilities. The smaller class sizes can provide more personalized attention and support. Associate degrees can also lead to some of the highest paying jobs as well.\n\n10. Start Freelancing\n\nIM Score: 22\n\nFreelancing offers flexibility, autonomy, and potentially higher income without the time and financial commitments of a four-year college degree. It allows individuals to capitalize on their skills immediately, gaining practical experience while networking and building a portfolio. Additionally, freelancing offers the opportunity to work on diverse projects, fostering continuous learning and skill development. With the rise of remote work and digital platforms, freelancers can access global opportunities, transcending geographical limitations. In exceptional cases, it is one of the easiest and high paying alternatives to a 4 year college degree.\n\n9. Get an Internship or an Entry Level Job\n\nIM Score: 24\n\nThis is one of the best options other than college after high school as choosing to pursue an internship or an entry-level job over a 4-year college degree can offer several advantages. The real-world experience can often be more immediately applicable to a career path than theoretical learning in a college setting. To read more about this, see the highest paying entry level jobs with no experience.\n\n8. Join Apprenticeship Programs\n\nIM Score: 26\n\nApprenticeship programs are one of the most popular alternatives to college degree as offer hands-on experience and specialized training, often tailored to specific industries, providing immediate applicability of skills. For instance, in fields like software development, apprenticeships such as Alphabet Inc (NASDAQ:GOOG)’s apprenticeship program offer direct mentorship from industry experts, real-world projects, and potential job placement.\n\n7. Get Microcredentials and Nanodegrees\n\nIM Score: 27\n\nMicrocredentials and Nanodegrees offer focused, specialized learning tailored to immediate industry needs, providing a quicker pathway to acquiring relevant skills compared to a traditional 4-year degree. For instance, in fields like Data Science, professionals may opt for a Nanodegree in Machine Learning Engineer, which equips them with specific skills sought after in the industry. In 2024, it is definitely a good alternative to a 4 year college degree.\n\nThe Alpahebet Inc (NASDAQ:GOOG) and Udacity Nanodegree program offers courses in various fields like data science, artificial intelligence, and web development. Each Nanodegree typically consists of several courses, providing hands-on projects and personalized feedback. Learners can access video lectures, quizzes, and community support. Completion time varies, with programs ranging from 3 to 12 months.\n\n6. Join the Military Services\n\nIM Score: 30\n\nMilitary service provides hands-on experience in a variety of roles, including technical, logistical, and tactical positions, which can translate directly into civilian careers. Additionally, the military often offers financial support for further education, including assistance with tuition fees and specialized training programs. Moreover, serving in the military can instill values like teamwork, resilience, and adaptability, which are highly valued in both professional and personal endeavors.\n\nClick here to see the 5Best Alternatives to a 4-Year College.\n\nSuggested Articles:\n\n12 Most Useless Associate Degrees if You Want a High-Paying Job 40 Highest Paying Jobs Without a Degree in the US 25 Best Online Degree Programs For Working Adults\n\nDisclosure: None. 12Best Alternatives to a 4-Year College is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/12-best-alternatives-4-college-221029074.html", "symbols": ["0RIH.IL", "AAPL.US", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.NEO", "GOOG.US", "GOOGL.BA", "GOOGL.MX", "GOOGL.SN", "GOOGL.US", "IBM.BA", "IBM.BE"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.016, "neu": 0.852, "pos": 0.131}}, {"date": "2024-03-20T22:02:13+00:00", "title": "8 Best AirTag Alternatives That Are Actually Worth Buying", "content": "In this article, we will list the 8 best AirTag alternatives that are actually worth buying. If you want to skip our discussion about smart trackers, go to the 3 Best AirTag Alternatives That Are Actually Worth Buying.\n\nSmart Bluetooth Trackers like Apple's AirTags are emerging as pivotal components in an era of technological advancements. The market is expected to experience an impressive cumulative annual growth rate (CAGR) of 12.6% during the forecast period of 2021 to 2030. It was valued at $583 million in 2021 and is expected to reach a market size of $1,655 million by 2030.\n\nIt is worth noting that smart trackers are a part of the much larger Internet of Things (IoT) market. The IoT market, as a whole, is experiencing even higher growth and is expected to reach $2,703 billion by 2032. Its growth is driven by automation, big data demand, and advancements in artificial intelligence (AI) and machine learning (ML).\n\nSome of the factors influencing the growth of smart trackers include the rising number of smartphone owners. However, growth will be primarily driven by high-end phone users such as those of Apple's iPhones and Samsung's flagship phones.\n\nAirTag was launched with the motive of preventing the stealing and misplacing of iPhones. It was introduced as an accessory that works with Apple's Find My app to help users keep track of and find things that are important to them. However, users have found various uses for AirTags and other Bluetooth smart trackers, including pet surveillance.\n\nWhile the smart tracker market is on a trajectory of growth, it has significant challenges ahead of it. There are concerns over privacy, data security, and technological obsolescence. A host of legal issues are being raised, which might shift the regulatory environment against them. More recently, an attempted class action lawsuit against Apple, Inc. (NASDAQ:APPL) is being allowed to proceed because the judge was convinced that there are negligence issues surrounding the AirTags trackers. However, since leading tech companies have already invested quite alot in their smart trackers, they are ready to take proactive measures and innovations to address these challenges.\n\nStory continues\n\nDevices like Apple, Inc. (NASDAQ:APPL)'s AirTags epitomize the fusion of innovation and utility. These Bluetooth smart trackers employ an array of technologies, including GPS, WiFi, RFID, and cellular networks to provide real-time or near-real-time monitoring and location tracking.\n\nCurrently, the market is headed towards improving the ecosystem and app enhancement. Companies opening in the industry are building comprehensive ecosystems around their tracking devices, which go a mile or two beyond basic tracking. Creating and implementing a perfect ecosystem often involves the use of numerous technologies, including geofencing capabilities, crowd-sourced location tracking, and integration with other smartphone and IoT devices.\n\nOther trends prevalent in the market include a multi-technology approach and a focus on power efficiency and battery life. Most smart trackers today combine GPS, Bluetooth, and WiFI to ensure robust and efficient tracking solutions. In addition, manufacturers are now prioritizing extended battery life through efficient designs and optimized usage patterns.\n\nSome of the key players in the market include Apple, Inc. (NASDAQ:APPL), Tile, and Samsung. Apple, Inc. (NASDAQ:APPL)'s AirTags leads the market and are still the most popular type of tracking device. However, these can only be used with iPhones, which is why it is worth having a look at the best AirTag alternatives if you are an Android user. Tille is another prominent company that specializes in Bluetooth trackers for personal belongings. On the other hand, Samsung leverages its global presence to offer diverse smart tracking solutions.\n\nBefore diving into the list of the best AirTag alternatives, it is worth knowing how smart trackers and AirTag work. These trackers utilize a blend of wireless technologies, including Bluetooth Low Energy (BLE) and Ultra-wideband (UWB) to track personal belongings. In the case of AirTag, it sends out a secure Bluetooth signal that nearby devices can detect within the Find My network. These devices then send the location of AirTag into the owner's iCloud. While this is a smart approach, it also has a drawback as an AirTag needs an iPhone nearby to function.\n\nWith that backdrop, let's look at the 8 best Apple AirTag alternatives that are actually worth buying.  8 Best AirTag Alternatives That Are Actually Worth Buying\n\nMethodology\n\nTo curate our list of the 8 best AppleAirtag alternatives that are actually worth buying, we devised an original methodology. First, we went to online forums to understand what people actually want in their smart trackers, and we boiled it down to the following factors: battery life, Bluetooth tracking range, affordability, and protection. After looking at several smart trackers and their features, we devised a point system.\n\nFor battery life, we awarded 2 points to trackers that last a couple of days, 4 points to those that last a couple of weeks, and 5 points to those that last more than a month. For tracking range, we awarded 2 points for 10 meters or less, 3 points for 11 meters to 60 meters, 4 points for 61 to 100 meters, and 5 points for more than 100 meters range. For affordability, we awarded 3 points to trackers that cost more than $40, 4 points to those that cost less than $40 but more than $25, and 5 points to those that cost less than $25. For protection, we awarded 2 points to those that came with no protection, 3 points to weather resistant, 4 points to water resistant, and 5 points to waterproof trackers. Then, for each tracker, we summed the total and averaged it to arrive at the Insider Monkey Rating. The higher this rating, the higher the tracker ranked on our list.\n\nAs tie breakers, we used tracking range, battery life, and affordability in order. For all the points awarded, we tried to refer to user experience rather than the company's claim. It is worth noting that one of the trackers in our list is a pet collar, which we included because AirTags are sometimes used for pet surveillance.\n\nBy the way, Insider Monkey is an investing website that tracks the movements of corporate insiders and hedge funds. By using a similar consensus approach we identify the best stock picks of more than 900 hedge funds investing in US stocks. The top 10 consensus stock picks of hedge funds outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). Whether you are a beginner investor or a professional looking for the best stocks to buy you can benefit from the wisdom of hedge funds and corporate insiders.\n\n8 - Chipolo ONE Spot\n\nBattery Life - 5\n\nTracking Range - 3\n\nAffordability - 4\n\nProtection - 4\n\nInsider Monkey Rating - 4\n\nChipolo ONE Spot is one of the best Apple AirTag alternatives for iPhone users, as it works exclusively with Apple's Find My app. The battery is replaceable and lasts for up to one year. The device has a tracking range of up to 60 meters. Its price is comparable to the Apple Airtag as one Chipolo ONE spot retails for around $29. The tracker features a compact design with a built-in key ring hole, which makes attaching it to keys quite easy.\n\n7 - Cube Shadow\n\nBattery Life - 5\n\nTracking Range - 3\n\nAffordability - 4\n\nProtection - 5\n\nInsider Monkey Rating - 4.3\n\nCube Shadow is 7th on our list of the 8 best Apple AirTag alternatives that are actually worth buying. It has a thin design, making it ideal for attaching to small items like wallets or keys. The device emits a ringtone that is audible within a reasonable range, helping users locate their belongings. The device comes with a tracking range of up to 200 feet, which is comparable to AirTags. One of the best things about the tracker is that it comes with a rechargeable battery, which lasts for up to sixty days on a single charge.\n\n6 - Tile Mate Bluetooth Tracker\n\nBattery Life - 5\n\nTracking Range - 3\n\nAffordability - 5\n\nProtection - 4\n\nInsider Monkey Rating - 4.3\n\nTile Mate Bluetooth Tracker is one of the most affordable trackers you can find. It is a simple yet efficient Bluetooth tracking device that makes it easy to find essential items such as keys and wallets. It offers two-way tracking functionality as the users can ring the tracker from their phones or ring their phones from the tracker. The tracker offers a 200-foot tracking range and emits a ringtone that is audible through obstacles such as walls or thick clothing.\n\n5 - Tile Pro\n\nBattery Life - 5\n\nTracking Range - 4\n\nAffordability - 4\n\nProtection - 4\n\nInsider Monkey Rating - 4.3\n\nTile Pro is fifth on our list of the 8 best Apple Airtag alternatives that are actually worth buying. It is priced higher than the Tile Mate Bluetooth Tracker, which is why this one scores 4 in affordability. However, with the extra money comes additional range, which is why this one is ranked higher on our list. This tracker has a range of 400 feet, double that of the more affordable version. In addition, it is also capable of producing louder volumes compared to the Tile Mate.\n\n4 - Eufy Security SmartTrack Link\n\nBattery Life - 5\n\nTracking Range - 4\n\nAffordability - 5\n\nProtection - 4\n\nInsider Monkey Rating - 4.5\n\nEufy Security SmartTrack Link is 4th on our list of the 8 best Apple AirTag alternatives that are actually worth buying. It is a credit card-sized Bluetooth tracker that integrates with Apple's Find My app. The device is equipped with a loud alarm that can be activated to help users locate their belongings easily. However, one thing to note about Eufy Security SmartTrack Link is that it does not work with Android phones.\n\nClick to continue reading and see 3 Best AirTag Alternatives That Are Actually Worth Buying.\n\nSuggested articles:\n\n10 Best Alternatives to Amazon Echo and Alexa 50 Funny Things To Ask Chatgpt and Google’s AI Chatbot 12 Best Internet of Things (IoT) Stocks To Buy\n\nDisclosure: none. 8 Best AirTag Alternatives That Are Actually Worth Buying is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/8-best-airtag-alternatives-actually-220213459.html", "symbols": ["0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F", "APPL.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.011, "neu": 0.83, "pos": 0.159}}, {"date": "2024-03-20T21:42:07+00:00", "title": "Justice Department to Sue Apple for Antitrust Violations as Soon as Thursday", "content": "(Bloomberg) -- The Justice Department is poised to sue Apple Inc. as soon as Thursday, accusing the world’s second most valuable tech company of violating antitrust laws by blocking rivals from accessing hardware and software features of its iPhone.\n\nMost Read from Bloomberg\n\nTrump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New Team Sam Bankman-Fried Says 50-Year Sentence Only Suitable for a ‘Super Villain’ What Happens If Trump Can’t Post His $454 Million Bond Fed to Give Fresh Clues on Path of Interest-Rate Cuts Ultra-Wealthy Are Souring on Chicago’s Most Elite Neighborhood\n\nThe suit, which is expected to be filed in federal court, escalates the Biden administration’s antitrust fights against most of the biggest US technology giants. The Justice Department is already suing Alphabet Inc.’s Google for monopolization, while the Federal Trade Commission is pursuing antitrust cases against Meta Platforms Inc. and Amazon.com Inc.\n\nApple and the Justice Department didn’t immediately respond to requests for comment.\n\nThe case marks the third time that the Justice Department has sued Apple for antitrust violations in the past 14 years, but is the first case accusing the iPhone maker of illegally maintaining its dominant position.\n\nThe Justice Department opened the latest case in 2019 under former President Donald Trump. The antitrust division, though, chose to prioritize twin cases against Google, taking a back seat as Fortnite maker Epic Games Inc. sued Apple for monopolization in 2020 and that case worked its way through the federal courts.\n\n--With assistance from Samuel Stolton.\n\nMost Read from Bloomberg Businessweek\n\nElon Musk’s Don Lemon Implosion Selling Shohei Ohtani: Can Baseball’s Biggest Talent Transform the Sport? China’s Super-Cheap EVs Offer Hope for Average American Buyers Julius Baer Hits Reboot to Escape Swiss Banking’s New Malaise OpenAI Sprinting to Keep Up With Startups on AI-Generated Video\n\n©2024 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/justice-department-sue-apple-antitrust-212239046.html", "symbols": ["0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU"], "tags": [], "sentiment": {"polarity": 0.942, "neg": 0.045, "neu": 0.864, "pos": 0.091}}, {"date": "2024-03-20T21:02:20+00:00", "title": "Meta, Microsoft, X and Match join Epic Games' battle against Apple", "content": "By Jonathan Stempel\n\n(Reuters) - Meta Platforms, Microsoft, Elon Musk's X and Match Group on Wednesday joined \"Fortnite\" video game maker Epic Games' protest that Apple has failed to honor a court-ordered injunction governing payments in its lucrative App Store.\n\nThe technology companies, which developed some of the most popular apps in the App Store, said Apple was in \"clear violation\" of the Sept. 2021 injunction by making it difficult to steer consumers to cheaper means to pay for digital content.\n\nApple declined to comment specifically on the accusation, which was contained in a filing with the Oakland, California federal court.\n\nIt referred to its Jan. 16 statement that it had fully complied with the injunction, which it said would protect consumers and \"the integrity of Apple's ecosystem\" while ensuring that developers do not get a free ride.\n\nEpic had sued Apple in 2020, saying it violated antitrust law by requiring consumers to obtain apps through the App Store and charging developers up to 30% commissions on purchases.\n\nThe injunction required Apple to let developers provide links and buttons to direct consumers to alternative payment options.\n\nLast week, Epic demanded that Apple be held in contempt, saying new rules and a new 27% fee on developers made the links effectively useless.\n\nIn Wednesday's filing, the technology companies said Apple's conduct \"for all practical purposes\" entrenches anti-steering rules that the court found illegal, propping up Apple's \"excessive\" commissions and harming consumers and developers.\n\n\"Apple's restrictions on where and how developers can communicate with their users about their options for purchasing in-app content create significant barriers to competition and artificially inflate prices,\" the filing said.\n\nIn January, the U.S. Supreme Court decided not to hear Apple's appeal from the injunction. It also decided against hearing Epic's appeal of lower court findings that Apple's policies did not violate federal antitrust law.\n\nStory continues\n\nApple has until April 3 to formally respond to Epic's filing. The company is based in Cupertino, California, while Epic is based in Cary, North Carolina.\n\nThe case is Epic Games Inc v Apple Inc, U.S. District Court, Northern District of California, No. 20-05640.\n\n(Reporting by Jonathan Stempel in New York; Editing by Bill Berkrot)", "link": "https://finance.yahoo.com/news/meta-microsoft-x-match-join-210220149.html", "symbols": ["0QYP.IL", "0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F", "MSF.BE", "MSF.DU", "MSF.F"], "tags": [], "sentiment": {"polarity": -0.885, "neg": 0.099, "neu": 0.83, "pos": 0.071}}, {"date": "2024-03-20T20:42:08+00:00", "title": "Nvidia Is One Of 2 Mag 7 Stocks On This Breakout Screen", "content": "Google stock perked up on reports of talks to license Alphabet's Gemini AI training to Apple for use in iPhones.\n\nContinue reading", "link": "https://finance.yahoo.com/m/fce0a54f-aa85-31dd-b8a8-056176defb5a/nvidia-is-one-of-2-mag-7.html", "symbols": ["0QYP.IL", "0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-03-20T18:18:00+00:00", "title": "Apple Faces Legal Protest From Meta, Microsoft, X and Match", "content": "Meta Platforms Microsoft X and Match Group filed a legal petition protesting Apple app store policies, objecting to how the tech giant has complied with a federal court ruling that ordered Apple to allow alternative payment methods. The four companies, which have some of the most popular apps on the app store, join Fortnite-maker Epic Games in protesting Apple’s plan to charge a commission for payments made outside the app store. The briefing underscores the extent to which Apple’s rivals and other technology players intend to continue fighting to force the iPhone maker to loosen its tight controls over third-party software.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a8a92f15-8302-3877-bc65-7798687d8907/apple-faces-legal-protest.html", "symbols": ["0QYP.IL", "0QZI.LSE", "0R2V.IL", "4MGN.F", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F", "FB20.F"], "tags": [], "sentiment": {"polarity": -0.112, "neg": 0.074, "neu": 0.846, "pos": 0.08}}, {"date": "2024-03-20T15:56:00+00:00", "title": "Alphabet (GOOGL) Adds New Feature to Google Maps for Wear OS", "content": "Alphabet’s GOOGL Google added a new Transit feature to Google Maps for Wear OS, offering users public transit directions.\r\n\r\nNotably, this Transit option for location searches works with Wear OS Tile for quick travel, providing an ETA after driving, walking and biking.\r\n\r\nFurther, users can access a live map view, zoomed-out map view and exit icon on the watch face when selecting a route in Google Maps.\r\n\r\nThe latest move will likely boost the adoption of Wear OS. Moreover, the company is expected to gain solid traction across smartwatch users on the back of this new feature.\r\n\r\nThis, in turn, will enable Alphabet to capitalize on growth opportunities present in the global smartwatch market. Per an EMR report, the global smartwatch market is expected to be valued at $160.67 billion by 2032, exhibiting a CAGR of 15.6% between 2024 and 2032.\n\nAlphabet Inc. Price and Consensus Alphabet Inc. Price and Consensus\n\nAlphabet Inc. price-consensus-chart | Alphabet Inc. Quote\n\nGoogle Maps in Focus\n\nApart from the latest feature for Wear OS, the company also announced a feature on Google Maps that shows entrances for buildings to some select users, addressing the issue of navigating to specific building portions on the map. This feature is aimed at improving the user experience and ensuring accurate directions for businesses or locations.\r\n\r\nFurther, Google added \"glanceable directions\" for Maps on Android and iOS, providing live ETAs and directions on the device's lock screen, using regular system notifications.\r\n\r\nThe company has also updated Google Maps on Android Auto to display estimated drive time in a bolder font, similar to other platforms. The bolder number, now displayed alongside thinner minutes and hour indicators, is available in version 11.119.0100 of Google Maps and version 11.5 of Android Auto.\r\n\r\nAll the above-mentioned endeavors will enable the company to capitalize on growth opportunities present in the global digital map market. Per a Future Market Insights report, the global digital map market is expected to reach $73.1 billion by 2033, witnessing a CAGR of 14.8% between 2023 and 2033.\r\n\r\nMoreover, growing Google Maps efforts will further bolster its Android offerings. This, in turn, will boost its Google Services segment, which remains the key growth catalyst for the company. Its shares have rallied 45.9% in the past year compared with the Zacks Computer & Technology sector’s growth of 44.6%.\r\n\r\nThe strengthening Google Services segment is expected to aid its overall financial performance in the near term.\r\n\r\nThe Zacks Consensus Estimate for 2024 total revenues stands at $286.48 billion, indicating year-over-year growth of 11.7%.\n\nStory continues\n\nStiff Competition\n\nStrengthening Google Maps offerings will aid Alphabet to compete well with some notable industry players like Microsoft MSFT and Apple AAPL, which have positioned themselves well in the digital map space.\r\n\r\nApple is riding on the success of its Apple Maps offerings.\r\n\r\nApple’s launch of Apple Business Connect, a free tool enabling businesses to manage their location place cards and customize information for over a billion users on Apple Maps, including adding photos, logos and promotions, remains noteworthy.\r\n\r\nMeanwhile, Microsoft is enjoying the growing momentum of Bing Maps with new feature updates.\r\n\r\nMicrosoft introduced live traffic updates on Bing Maps, enabling users to plan their journeys more efficiently by providing real-time information about traffic conditions during commutes.\n\nZacks Rank & A Stock to Consider\n\nCurrently, Alphabet carries a Zacks Rank #3 (Hold).\r\n\r\nA better-ranked stock in the broader technology sector is CrowdStrike CRWD, carrying a Zacks Rank #2 (Buy) at present. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nShares of CrowdStrike have gained 28.7% in the year-to-date period. The long-term earnings growth rate for CRWD is 22.31%\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nApple Inc. (AAPL) : Free Stock Analysis Report\n\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\n\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\n\nCrowdStrike (CRWD) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/alphabet-googl-adds-feature-google-155600989.html", "symbols": ["0QYP.IL", "0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0, "neu": 0.859, "pos": 0.141}}, {"date": "2024-03-20T15:23:25+00:00", "title": "Google becomes the first AI company to be fined over training data", "content": "Nearly five years ago, I reported on how France’s news publishers had gone to war with Google over the issue of “ancillary copyright” fees—payments for including snippets of article text in Google’s search results. I wrote that the media houses were unlikely to win. Well, they just did. And as with everything else these days, AI suddenly became part of the equation.\n\nThis morning, the French competition authority fined Google €250 million ($271 million) for failing to comply with commitments it made a couple years ago regarding how it would negotiate the fees with the French news outlets. Google already received a €500 million fine over the matter in 2021. It’s not arguing back this time, which has probably spared it an even higher fine.\n\nI’m not going to go into the details of the revised negotiation process to which Google has agreed—it’s as dull as it sounds and, if you really want to dive in, here’s Google’s statement in French and English. The interesting part of this episode is about Google’s Bard AI, which these days goes by the name of Gemini.\n\nAs far as I’m aware, this is the first fine to be levied on an AI company at least partially because of its free-wheeling incorporation of everything it can grab into its training data.\n\nAccording to the French Competition Authority (FCA) the fine takes account of the fact that Google “used content from press agencies and publishers to train its [Bard] foundation model, without notifying either them or the [FCA].”\n\nAs Google tells it, the FCA “does not challenge the way web content is used to improve newer products like generative AI.” Google claimed this issue is “already addressed” in Article 4 of the EU Copyright Directive, which provides an exception for text and data mining, and in the upcoming EU AI Act, which tells AI companies to respect the Copyright Directive (and to publish “sufficiently detailed” summaries of their training data).\n\nBut according to the FCA, the question of whether article-scraping AI companies qualify for that text and data mining exception “has not yet been settled.” It said Google had “at the very least” broken its commitment to be transparent in its commercial dealings with French news publishers, making this a fining matter.\n\nStory continues\n\nNow, Google did recently launch a new control in the robots.txt file that web publishers use to send signals to Google’s web crawlers. The setting is called Google-Extended, and it’s supposed to let publishers opt out of having their data become Bard/Gemini training fodder without also having their articles disappear from Google Search and Google News.\n\nBut it only added that control at the end of September, more than two months after Bard’s European launch. During that period, French publishers effectively had to allow the unrestricted hoovering of their output into Bard if they also wanted it to appear in Search and News—which, remember, is how they then get to claim ancillary copyright fees from Google. That broke another of Google’s commitments, again contributing to today’s fine. The FCA also told Google to explain to publishers how the opt-out mechanism works.\n\nSo in summary, Google’s new control for publishers has belatedly fixed one of the issues with the unpaid incorporation of news articles into its AI training material, but the overall legality of this practice under EU copyright law remains an open question. It’s not hard to see why Google's big rival, OpenAI, has started cutting licensing deals with European press publishers like Axel Springer and Le Monde.\n\nOne final note while we’re on the subject of Big Tech and European antitrust regulators: Margrethe Vestager, the European Commission’s competition chief, just told Reuters that Apple may face a probe over the €0.50-per-app-installation “core technology fee” it’s levying on developers who dare to use the third-party iOS app stores that Apple must allow under the new EU Digital Markets Act. “There are things that we take a keen interest in, for instance, if the new Apple fee structure will de facto not make it in any way attractive to use the benefits of the DMA,” she said.\n\nGiven that Microsoft and Meta have both complained to Vestager that the fee makes third-party app stores unviable, there’s a storm a-coming, and I do not hate to say I told you so. More news below—and by the way, the Data Sheet team offers our red-cheeked apologies for misspelling “Nvidia” in yesterday’s email subject line…\n\nDavid Meyer\n\nWant to send thoughts or suggestions to Data Sheet? Drop a line here.\n\nThis story was originally featured on Fortune.com", "link": "https://finance.yahoo.com/news/google-becomes-first-ai-company-152325343.html", "symbols": ["0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU"], "tags": [], "sentiment": {"polarity": 0.977, "neg": 0.023, "neu": 0.903, "pos": 0.073}}, {"date": "2024-03-20T14:14:08+00:00", "title": "Only One Other Mag 7 Stock Joins Nvidia On This Breakout Screen", "content": "Google stock perked up on reports of talks to license Alphabet's Gemini AI training to Apple for use in iPhones.\n\nContinue reading", "link": "https://finance.yahoo.com/m/fce0a54f-aa85-31dd-b8a8-056176defb5a/only-one-other-mag-7-stock.html", "symbols": ["0QYP.IL", "0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-03-20T13:48:24+00:00", "title": "IBM Eyes First Record Since 2013 as AI Optimism Fuels 19% Rally", "content": "(Bloomberg) — One of the oldest companies in tech has been quietly trouncing some of the hottest stocks on Wall Street.\n\nMost Read from Bloomberg\n\nTrump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New Team What Happens If Trump Can’t Post His $454 Million Bond Ultra-Wealthy Are Souring on Chicago’s Most Elite Neighborhood Apple Is in Talks to Let Google Gemini Power iPhone AI Features Nvidia Looks to Extend AI Dominance With New Blackwell Chips\n\nInternational Business Machines Corp. recently hit its highest since 2013, putting it about 6% below an all-time high as investors bet that a turnaround is finally bearing fruit after years of tepid growth and share-price returns. Compared to the Magnificent Seven, IBM’s 19% gain this year, including dividends, trails only Nvidia Corp. and Meta Platforms Inc.\n\n“IBM has been discounted by the rest of the industry, but it has made a lot of investments in both cloud and AI, and with a strong AI business, we could see growth inflecting higher,” said Jethro Townsend, portfolio manager at Nia Impact Capital. He cites the firm’s cash flow generation and “healthy” dividend yield as factors that provide room for it to re-rate higher.\n\nMuch of the year’s advance followed IBM’s results in late January, when it gave a better-than-expected forecast for both free cash flow and revenue and said it was seeing growing demand for its AI products. The company has also cut jobs and expects to pause hiring for roles that could be replaced with AI, which is seen as a potential tailwind for margins.\n\nThe stock’s surge is a recent phenomenon, however; while Apple Inc. has lagged this year, its five-year total return of 275% is much stronger than IBM’s 82% gain over the same period.\n\nWall Street remains divided, with bulls outnumbered by skeptics and bears, according to data compiled by Bloomberg. While it looks cheaper relative to most big-tech stocks, IBM’s multiple of 19 times estimated earnings is near its highest in 20 years. Furthermore, the stock is 4% over the average price target, among the worst return potentials among components of the S&P 500 tech index.\n\nStory continues\n\nStill, the company offers something that is something of a rarity among big tech: a robust dividend. The indicated yield is 3.43%, well above others in the sector. The indicated yields for Apple Inc. and Microsoft Corp. are below 1%, and while Nvidia pays a dividend, the yield is essentially non-existent.\n\nThat hasn’t been enough to entice bulls in the face of IBM’s growth potential, which is expected to remain far below the megacaps. Revenue is expected to grow at a single-digit pace for the next several years, compared with double-digit expansion for other AI-adjacent companies like Microsoft or Alphabet Inc. Its most recent report failed to juice expectations; while the consensus for the company’s net 2024 earnings is up 4.4% over the past quarter, the view for revenue has barely budged, per data compiled by Bloomberg.\n\n“The CEO has done a heroic job in starting to turn the company around, but it is just generally slower growth, and not cheap enough to be enticing relative to those more modest prospects,” said David Katz, chief investment officer at Matrix Asset Advisors. “We can easily do better elsewhere.”\n\nTech Chart of the Day\n\nIn a measure of how tech continues to be driven by its biggest companies, an index of small-cap tech stocks is down 7% this year, making it a dramatic underperformer compared with other size categories. The S&P 500 tech sector index, which tracks large-cap tech stocks, is up 12% in 2024. However, an index of mid-cap tech has done best of all, with a gain of 14%.\n\nTop Tech Stories\n\nThe Biden administration is considering blacklisting a number of Chinese semiconductor firms linked to Huawei Technologies Co. after the telecom giant notched a significant technological breakthrough last year, people familiar with the matter said. The US will award Intel Corp. $8.5 billion in grants and as much as $11 billion in loans to help fund an expansion of its semiconductor factories, the Commerce Department announced Wednesday, marking the largest award from a program designed to reinvigorate the domestic chip industry. Tencent Holdings Ltd. plans to more than double its stock buyback program to at least $12.8 billion in 2024, mollifying investors concerned about a gradual dissipation of growth during a Chinese economic downturn. Samsung Electronics Co. gained its most in more than six months after Nikkei Asia reported Nvidia Corp. is looking to buy its high-bandwidth memory chips, marking a milestone for Korea’s largest company. PocketHealth Inc. has raised $33 million from new investors including Deloitte Ventures and Samsung Next, joining a growing crop of startups gathering capital to explore the use of AI in healthcare.\n\nEarnings Due Wednesday\n\nPremarket\n\nJinkoSolar Kingsoft Cloud Postmarket\n\nMicron\n\nMost Read from Bloomberg Businessweek\n\nElon Musk’s Don Lemon Implosion China’s Super-Cheap EVs Offer Hope for Average American Buyers Shohei Ohtani, the Dodgers’ $700 Million Man, Will Transform Baseball—If He Wants To Julius Baer Hits Reboot to Escape Swiss Banking’s New Malaise Congress Should Think Bigger Than TikTok Ban, Tech Critics Say\n\n©2024 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/ibm-eyes-first-record-since-114629010.html", "symbols": ["0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F", "IBM.BA", "IBM.BE", "IBM.DU", "IBM.F"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.029, "neu": 0.848, "pos": 0.123}}, {"date": "2024-03-20T12:11:45+00:00", "title": "10 NASDAQ Stocks with Biggest Upside", "content": "In this article, we discuss the 10 NASDAQ stocks with the biggest upside. To skip our detailed analysis, go directly to the 5 NASDAQ Stocks with Biggest Upside.\n\nThe Nasdaq Composite was the worst performer among the major market indices in 2022 and made a stellar comeback in 2023. The index was down 33% at the end of 2022 and recovered from its abysmal performance with a 43% gain in 2023. To put things in perspective, the Nasdaq Composite index hit its previous record in November 2021 with a little over 16,000 points, and it was still a thousand points behind it by the end of 2023, even after the outstanding performance during the year. However, the index has hit new highs and is at 16,275 at March 1 market close. The Nasdaq-100, which includes the 100 largest and most actively traded non-financial companies in the world, recorded its fourth-best performance since 1986, with a 53.81% gain in 2023.\n\nNasdaq’s performance is attributed to the fact that it is mostly concentrated in tech stocks, which were the best performers of the year in 2023. The Magnificent 7 stocks remained in the limelight as several of the top performers of the index were a part of the group, which include NVIDIA Corporation (NASDAQ:NVDA) and Meta Platforms, Inc. (NASDAQ:META), and they gained 239% and 194% in 2023, respectively. However, some other stocks made significant strides through the year as well. Some of them are Advanced Micro Devices, Inc. (NASDAQ:AMD), Palo Alto Networks, Inc. (NASDAQ:PANW), and Super Micro Computer, Inc. (NASDAQ:SMCI). Advanced Micro Devices, Inc. (NASDAQ:AMD) gained nearly 128%, and Palo Alto Networks, Inc. (NASDAQ:PANW) was 110% higher by the end of 2023. Super Micro Computer, Inc. (NASDAQ:SMCI) performed even more spectacularly in 2023 and is still on a remarkable upward trajectory in the current year. As of March 18, the stock has gained more than 900% over the past 12 months.\n\nAlthough 5 of the magnificent 7 stocks are still performing well and their price charts are still in green on a year-to-date basis, as of March 18, Apple Inc. (NASDAQ:AAPL) and Tesla, Inc. (NASDAQ:TSLA) have declined significantly. Apple is down 4.61%, and Tesla has also fallen out of favor among many analysts and is down 32% year-to-date. However, Cathie Wood of Ark Invest still sees long-term growth for Tesla, Inc.’s (NASDAQ:TSLA) stock due to its autonomous driving software. Last year, Wood said in an interview on CNBC that she believes that the company’s stock price will hit the $2000 mark by 2027. In 2024, the investor is still bullish on the stock. Ark Invest bought $141 million worth of Tesla, Inc.’s (NASDAQ:TSLA) stock in January, as reported by Bloomberg on January 29. The firm also bought over $35 million worth of company shares on March 14, as reported by Business Insider on the same day.\n\nStory continues\n\nIs There a Stop to the AI Rally?\n\nInvestors and analysts keep mixed reviews about the rising AI trend. While some believe that the AI surge could be a bubble and that tech stocks are now overvalued, others hold the opinion that AI is a revolutionary trend that will dominate the market for years to come. Looking at recent earnings of the tech stocks, the latter scenario is more likely.\n\nThe industry leader, NVIDIA Corporation (NASDAQ:NVDA), reported its Q4 earnings on February 21. It reported non-GAAP earnings per share (EPS) of $5.16, which was up 28% sequentially, and was 486% higher than last year. Furthermore, its revenue increased by 265% year-over-year (YoY) to $22.1 billion. The company's gross margin also increased by 10.6%, year over year, to 76.7% in the quarter. On March 18, Truist and HSBC raised NVIDIA’s price target by $266 and $170, respectively. Truist has a price target of $1,177 for the stock, while HSBC’s Frank Lee raised NVIDIA Corporation’s (NASDAQ:NVDA) price target to $1050. The stock is currently trading at around $885, as of March 18.\n\nAfter NVIDIA Corporation’s (NASDAQ:NVDA) first-rate earnings report, Dell Technologies (NYSE:DELL) also showed strength in its earnings in the fourth quarter due to a high demand for its artificial intelligence servers. The company reported an EPS of $2.20 and a revenue of $22.32 billion, which outperformed the market estimates by $0.48 and $150 million, respectively. The stock gained 31.5% in a day on March 1 and is up nearly 13% month-to-date as of March 18. Dell Technologies’ (NYSE:DELL) also increased its quarterly dividend by 20%. The company’s earnings revived investor belief in AI, and most of the industry-related stocks moved higher during the day. At Dell Technologies’ (NYSE:DELL) Q4 2024 earnings call, COO and Vice Chairman of the company, Jeffrey Clark, highlighted the demand growth for AI-optimized servers. He said:\n\n“AI-optimized server orders increased by nearly 40% sequentially. We shipped $800 million of AI-optimized servers, and our backlog nearly doubled sequentially, exiting the fiscal year at $2.9 billion. Demand continues to outpace GPU supply, though we are seeing H100 lead times improving. We are also seeing strong interest in orders for AI-optimized servers equipped with the next generation of AI GPUs, including the H200 and the MI300X. Most customers are still in the early stages of their AI journey, and they are very interested in what we are doing at Dell. We are helping them get started and work through their use cases, data preparation, training, and infrastructure requirements.”\n\nNow let us continue to our list of NASDAQ stocks with the biggest upside potential, which includes Ultragenyx Pharmaceutical Inc. (NASDAQ:RARE), Viasat, Inc. (NASDAQ:VSAT), and Sunrun Inc. (NASDAQ:RUN). You can also check out 11 Oversold NASDAQ Stocks To Buy Right Now and 15 Best NASDAQ Dividend Stocks To Buy. 10 NASDAQ Stocks with Biggest Upside\n\nPhoto by Pascal Bernardon on Unsplash\n\nOur Methodology\n\nFor this article, we identified 20 stocks listed on NASDAQ with the biggest upside potential through financial media websites including CNBC, Motley Fool, Kiplinger, and Business Insider. Next, we checked each stock’s analyst ratings and price targets on TipRanks. We then chose the 10 stocks with the highest average analyst price target upside at the time of writing on March 18 and listed the stocks in ascending order.\n\nWe also mentioned the hedge fund sentiment around each stock. The hedge fund data was taken from Insider Monkey’s database of 933 elite hedge funds as of Q4, 2023. Hedge funds’ top 10 consensus stock picks outperformed the S&P 500 Index by more than 140 percentage points over the last 10 years (see the details here). That’s why we pay very close attention to this often-ignored indicator.\n\n10 NASDAQ Stocks with Biggest Upside\n\n10. Baker Hughes Company (NASDAQ:BKR)\n\nAverage Analyst Price Target Upside: 22.99%\n\nNumber of Hedge Fund Holders: 47\n\nBaker Hughes Company (NASDAQ:BKR) is a Texas-based company that offers energy and industrial solutions. According to TipRanks, the stock has a consensus rating of Strong Buy as per the 14 Wall Street analysts that covered it over the past three months. The average price target of $39.85 implies an upside of 22.99% from the current levels at the time of writing on March 18.\n\nOn February 21, Baker Hughes Company (NASDAQ:BKR) announced that it won a significant and multi-year award for the provision of integrated well construction services for rigs in the Buzios pre-salt field offshore Brazil. The work on the three rigs is expected to begin in the first half of 2025.\n\nBaker Hughes Company (NASDAQ:BKR) was part of 47 hedge funds’ portfolios in the fourth quarter of 2023 with a total stake value of $911.825 million. AQR Capital Management is the most prominent shareholder in the company and has a position worth nearly $137.851 million, as of Q4, 2023.\n\nBaker Hughes Company (NASDAQ:BKR) is one of the top NASDAQ stocks with the biggest upside, along with Ultragenyx Pharmaceutical Inc. (NASDAQ:RARE), Viasat, Inc. (NASDAQ:VSAT), and Sunrun Inc. (NASDAQ:RUN).\n\nClearBridge Investments made the following comment about Baker Hughes Company (NASDAQ:BKR) in its Q3 2023 investor letter:\n\n“Performance was boosted in the quarter by the Strategy’s more economically-sensitive holdings among steady compounders and evolving opportunities. Oilfield equipment and services provider Baker Hughes Company (NASDAQ:BKR), meanwhile, benefited from a $20 rise in crude oil prices as well as disciplined execution.”\n\n9. Insulet Corporation (NASDAQ:PODD)\n\nAverage Analyst Price Target Upside: 44.79%\n\nNumber of Hedge Fund Holders: 50\n\nInsulet Corporation (NASDAQ:PODD) is engaged in developing, manufacturing, and distributing insulin management systems for diabetic patients. In the fourth quarter of 2023, 50 hedge funds had stakes in Insulet Corporation (NASDAQ:PODD) with total positions worth $1.197 billion. This is compared to 44 funds with positions worth $938.370 million in the preceding quarter. As of December 31, 2023, Citadel Investment Group is the largest shareholder in the company with a stake worth $288.885 million.\n\nOn February 7, Insulet Corporation (NASDAQ:PODD) announced that its Omnipod 5 automated insulin delivery system with Abbott Laboratories’ (NYSE:ABT) FreeStyle Libre 2 Plus sensor received CE Mark approval.\n\nIn the past three months, 12 Wall Street analysts have covered Insulet Corporation (NASDAQ:PODD), and 9 maintain a Buy rating on the stock. At the time of writing on March 18, the average price target of $238.33 has an upside of 44.79% from present levels.\n\nClearBridge Investments mentioned Insulet Corporation (NASDAQ:PODD) in its third quarter 2023 investor letter. Here is what it said:\n\n“Results were primarily impacted by weakness among two health care holdings, Insulet Corporation (NASDAQ:PODD) and Surgery Partners. Positive clinical studies for GLP-1 therapeutics showed substantial health benefits to diabetic and obese patients, boosting stock prices of pharmaceutical companies tied to the manufacturing of these drugs. The potential for improved patient outcomes raised the risk of lower utilization for Insulet, a maker of insulin patch pumps, and Surgery Partners, whose outpatient surgery centers conduct weight loss and many other types of outpatient procedures. Though the GLP-1 threat is weighing on the valuation multiple of Insulet, any negative effects would likely not meaningfully affect the business for many years, especially given how large and underpenetrated the Type 2 diabetes market is for the company currently. Additionally, this could require significant improvements in cost, availability, and adherence for GLP-1s. Furthermore, we are encouraged that the majority of Insulet’s business today is still from Type 1 diabetes, where fundamentals remain strong and the company is gaining share.”\n\n8. First Solar, Inc. (NASDAQ:FSLR)\n\nAverage Analyst Price Target Upside: 50.15%\n\nNumber of Hedge Fund Holders: 47\n\nFirst Solar, Inc. (NASDAQ:FSLR) is a Texas-based company that provides solar photovoltaic (PV) systems. First Solar, Inc. (NASDAQ:FSLR) takes the eighth spot on our list of NASDAQ stocks with the biggest upside. Over the past three months, 20 Wall Street analysts have given their recommendations on First Solar, Inc. (NASDAQ:FSLR), with 16 recommending to Buy the stock. As of March 18, the stock’s average price target of $220.72 implies an upside of 50.15% to its current price.\n\nAccording to Insider Monkey’s database which tracks 933 elite hedge funds, 47 funds had investments in First Solar, Inc.’s (NASDAQ:FSLR) stock in the fourth quarter of 2023 worth $1.106 billion. With 1.79 million shares worth $308.736 million, Robert Pohly’s Samlyn Capital is the top investor in the company, as of Q4 2023.\n\nOn February 27, First Solar, Inc. (NASDAQ:FSLR) announced its Q4 earnings result with a GAAP EPS of $3.25, which topped the estimates by $0.13. The revenue jumped 16.0% year-over-year to $1.16 billion.\n\n7. Shoals Technologies Group, Inc. (NASDAQ:SHLS)\n\nAverage Analyst Price Target Upside: 58.89%\n\nNumber of Hedge Fund Holders: 31\n\nShoals Technologies Group, Inc. (NASDAQ:SHLS) is a Tennessee-based company that offers electrical balance of system solutions. The stock has been covered by 15 Wall Street analysts over the past three months, with 12 keeping a Buy rating on the stock. The average price target of $18.86 implies an upside of 58.89% from the current levels on March 18.\n\nOn February 21, it was reported that Shoals Technologies Group, Inc. (NASDAQ:SHLS) will expand its existing Tennessee operations over the next five years and will spend $80 million for this endeavor.\n\nAccording to Insider Monkey’s database, 31 hedge funds had investments in Shoals Technologies Group, Inc. (NASDAQ:SHLS) in Q4 of 2023 with positions worth $464.778 million. This compared to 33 funds in the previous quarter, with positions worth $349.254 million. Encompass Capital Advisors is the top shareholder in the company with a position worth $105.713 million, as of the fourth quarter of 2023.\n\nOn February 28, Shoals Technologies Group, Inc. (NASDAQ:SHLS) announced its Q4 earnings result with a non-GAAP EPS of $0.12 and a revenue of $130.4 million, which grew by 37.8% YoY.\n\n6. Warner Bros. Discovery, Inc. (NASDAQ:WBD)\n\nAverage Analyst Price Target Upside: 61.26%\n\nNumber of Hedge Fund Holders: 56\n\nWarner Bros. Discovery, Inc. (NASDAQ:WBD) is a New York-based media and entertainment company. The stock was held by 56 hedge funds in the fourth quarter of 2023. The total stakes of the funds amounted to $1.122 billion. As of December 31, 2023, Harris Associates is the most dominant shareholder in the company with a position worth $904.761 million.\n\nOf the 17 Wall Street analysts that have covered Warner Bros. Discovery, Inc. (NASDAQ:WBD) over the past three months, 9 maintain a Buy rating on the stock. The average price target of $13.61 implies an upside of 61.26% from current levels, as of March 18.\n\nOn February 26, Barrington analyst James Goss lowered the price target on Warner Bros. Discovery, Inc.’s (NASDAQ:WBD) stock to $16 from $18 and kept an Outperform rating on the shares.\n\nUltragenyx Pharmaceutical Inc. (NASDAQ:RARE), Viasat, Inc. (NASDAQ:VSAT), and Sunrun Inc. (NASDAQ:RUN) are some of the NASDAQ stocks with the biggest upside, in addition to Warner Bros. Discovery, Inc. (NASDAQ:WBD).\n\nLongleaf Partners stated the following regarding Warner Bros. Discovery, Inc. (NASDAQ:WBD) in its fourth quarter 2023 investor letter:\n\n“The rules have improved how we analyze existing holdings and influenced the price at which we will buy a new holding and/or trim or add to an existing one. This has resulted in a higher level of resizing positions in the portfolio and exiting some long-term holdings this year. A good example in the portfolio today is Warner Bros. Discovery, Inc. (NASDAQ:WBD), a company that we bought too early but that remains a holding in the portfolio. Our average price for the initial WBD investment in 2021 was $26.48, or a P/V ratio in the mid-60s%. However, P/EV on the initial report was 79%. Under the new rules, we would not pay that price for the company today. We most likely would have waited for a mid-60s% P/EV, which would have equated to a $mid-teens entry price. In this case, we would have missed a too-large initial downturn in the stock price. The overweight rule dictated that we trimmed the position after the price ran up in the first half of 2023, which benefitted overall performance as the stock price subsequently fell again. However, even with the new rule lens, we remain confident in our case for the business and management’s ability to deliver going forward.”\n\nClick to continue reading and see the 5 NASDAQ Stocks with Biggest Upside.\n\nSuggested articles:\n\n17 Worst Bachelor’s Degrees for Student Loan Debt 13 Best EV Stocks To Buy in 2024 13 Best NASDAQ Penny Stocks To Invest In\n\nDisclosure. None. 10 NASDAQ Stocks with Biggest Upside is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/10-nasdaq-stocks-biggest-upside-121145757.html", "symbols": ["0RR8.LSE", "3S9.BE", "3S9.DU", "3S9.F", "3S9.MU", "68V.F", "68V.STU", "68V.XETRA", "91D.F", "AAPL.US", "ABT.US", "AMD.US", "BKR.US", "COMP.US", "DELL.US", "F3A.BE", "F3A.DU", "F3A.F", "F3A.STU"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.018, "neu": 0.911, "pos": 0.071}}, {"date": "2024-03-20T10:56:39+00:00", "title": "Apple CEO Arrives in China Touting Its Role as iPhone Base", "content": "(Bloomberg) -- Apple Inc. Chief Executive Officer Tim Cook arrived in China on Wednesday touting the country’s importance as a market and production base, reaching out to Chinese consumers who may be souring on the maker of iPhones.\n\nMost Read from Bloomberg\n\nTrump Rules Out Vivek Ramaswamy as Running Mate as He Eyes New Team What Happens If Trump Can’t Post His $454 Million Bond Ultra-Wealthy Are Souring on Chicago’s Most Elite Neighborhood Apple Is in Talks to Let Google Gemini Power iPhone AI Features US Weighs Sanctioning Huawei’s Secretive Chinese Chip Network\n\nThere’s no supply chain in the world more critical to the company than China’s, Cook told the Global Times in an interview tweeted by the newspaper. Apple’s been expanding its base in the country and increasing investment over the past 30 years, he added.\n\nCook’s comments, ahead of Thursday’s launch of Apple’s eighth store in Shanghai, come as the “symbiotic” relationship between the company and China as he once described is showing signs of fraying.\n\nAnchored by Foxconn, or Hon Hai Precision Industry Co., Apple’s manufacturing presence in China has been broad and unshakable for over two decades. But the company has suffered snags in production in recent years due to a US and China trade war and Covid-triggered factory closures, delaying launches of products.\n\nApple is now diversifying its operations away from China by working with assembly and component manufacturing partners in India, Thailand, Malaysia and elsewhere.\n\nApple’s 10 Biggest Challenges, From AI to China: QuickTake\n\nRead More: Apple’s iPhone Woes in China Deepen With a 24% Sales Plunge\n\nDemand for its products in China is also cooling.\n\nPhone sales plunged 24% over the first six weeks of this year, according to research firm Counterpoint. Apple has been losing market share to US-sanctioned Huawei Technologies Co., which has benefited from a wave of patriotic buying for its homegrown Mate 60 Pro devices.\n\nThe upcoming Shanghai store adds to Apple’s biggest retail network outside the US and is part of a broader effort to grow and revitalize the company’s brick-and-mortar outlets. China remains a vital market for the company with the world’s largest smartphone consumer base and potential for growing sales of accessories like the Apple Watch.\n\nStory continues\n\nApple’s apparent vote of confidence for China is no less important to Xi Jinping’s government. With the economy slowing, new foreign direct investment falling and multinationals looking to other markets for growth, it’s important to show the world China is still open for business in the wake of regulatory crackdowns and national security concerns that have spooked foreign investors.\n\nCook posted a video of himself on walking around Shanghai with Chinese actor Zheng Kai. In a Weibo clip seen by half a million people within minutes of posting, Cook crossed a bridge near the historic Bund, sampled soup dumplings in a local restaurant and said “hello” in the Shanghainese dialect.\n\nBorn and raised in Shanghai, Zheng is one of China’s most famous TV and movie stars. He recently starred in Blossoms Shanghai, a TV show aired on Tencent Holdings Ltd.’s video streaming service.\n\nRead More: Apple to Open New Shanghai Store as China iPhone Sales Slump\n\n--With assistance from Gao Yuan, Jessica Sui and Zheping Huang.\n\n(Updates with a revenue chart. A previous story was corrected to fix spelling of Cook.)\n\nMost Read from Bloomberg Businessweek\n\nElon Musk’s Don Lemon Implosion China’s Super-Cheap EVs Offer Hope for Average American Buyers Shohei Ohtani, the Dodgers’ $700 Million Man, Will Transform Baseball—If He Wants To Julius Baer Hits Reboot to Escape Swiss Banking’s New Malaise Congress Should Think Bigger Than TikTok Ban, Tech Critics Say\n\n©2024 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/apple-ceo-arrives-china-touting-105639860.html", "symbols": ["0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F"], "tags": [], "sentiment": {"polarity": -0.514, "neg": 0.05, "neu": 0.901, "pos": 0.048}}, {"date": "2024-03-20T04:20:08+00:00", "title": "UPDATE 1-Apple boss Tim Cook visits Shanghai, with China sales under pressure", "content": "(Adds background on iPhone sales and Cook's past visits)\n\nSHANGHAI, March 20 (Reuters) - Apple CEO Tim Cook said he is currently visiting Shanghai, according to a post on his Weibo account on Wednesday.\n\nCook said he spent the morning walking along Shanghai's historic Bund river with Chinese actor Zheng Kai and having a local breakfast but did not disclose what other plans he had for this China visit.\n\nHis visit comes after the iPhone maker announced that it would open a new retail store in the heart of the Chinese financial hub on Thursday, and as Apple battles falling iPhone sales in China and rising competition from domestic rivals such as Huawei.\n\nCook made at least two visits to China, Apple's third-largest market by revenue, last year. He also travelled to Beijing around the same time last year, where he visited an Apple store and attended the China Development Forum. (Reporting by Beijing newsroom and Brenda Goh in Shanghai; Editing by Muralikumar Anantharaman)", "link": "https://finance.yahoo.com/news/1-apple-boss-tim-cook-042008188.html", "symbols": ["0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F"], "tags": [], "sentiment": {"polarity": 0.361, "neg": 0.032, "neu": 0.934, "pos": 0.035}}, {"date": "2024-03-20T03:55:19+00:00", "title": "Apple boss Tim Cook visits Shanghai with China sales under pressure", "content": "SHANGHAI (Reuters) -Apple CEO Tim Cook hailed China's importance in the firm's supply chain as he met suppliers including BYD Electronics on Wednesday, local media said, on a visit that comes amid a drop in China sales for the iPhone maker.\n\nIn a post on his Weibo social media account, Cook said he spent the morning walking along Shanghai's historic Bund river with Chinese actor Zheng Kai and that he had eaten a local breakfast. He did not disclose, however, what other plans he had for this China visit.\n\nThe China Daily reported that Cook had said in an interview that \"there's no supply chain in the world that's more critical to us than China\".\n\nCook also met Wang Chuanfu, founder and president of Apple supplier BYD Electronics, as well as officials from Lens Technology at the firm's Shanghai office, the China Daily added.\n\nCook's visit comes after the iPhone maker announced that it would open a new retail store in the heart of the Chinese financial hub on Thursday, and as Apple battles falling iPhone sales in China and rising competition from domestic rivals such as Huawei.\n\nCook made at least two visits to China, Apple's third-largest market by revenue, last year. He also travelled to Beijing around the same time last year, where he visited an Apple store and attended the China Development Forum.\n\n(Reporting by Beijing newsroom and Brenda Goh in Shanghai; Editing by Muralikumar Anantharaman and Miral Fahmy)", "link": "https://finance.yahoo.com/news/apple-boss-tim-cook-visiting-035519951.html", "symbols": ["0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F"], "tags": [], "sentiment": {"polarity": 0.162, "neg": 0.044, "neu": 0.913, "pos": 0.043}}, {"date": "2024-03-20T01:46:02+00:00", "title": "Apple-Google Gemini Partnership Could Make an Unstoppable AI Force", "content": "Google’s parent company, Alphabet (NASDAQ:GOOGL), shot higher yesterday, finishing the day up 4.6%, following a Bloomberg report that Apple (NASDAQ:AAPL) may be looking to Google Gemini as the AI integrated into the iPhone. Indeed, a potential Apple-Google Gemini partnership in artificial intelligence (AI) could mirror their deal with search, which was the subject of considerable regulatory scrutiny in recent years.\n\nAnd while a Google-Apple AI partnership is sure to draw the ire of antitrust regulators, I see the move as a potentially massive win for both companies as they seek to gain (further) in the AI race.\n\nWith Microsoft (NASDAQ:MSFT) leading the charge on generative AI with its OpenAI stake, Apple must find a way to make up for lost time on the AI front. Teaming up with Google is a way to catch up with industry leaders like Microsoft. Also, it may be a straightforward way to pull ahead as Apple gains access to one of the most potent large language models (LLMs), Google Gemini. Given this, I remain bullish on both AAPL and GOOGL.\n\nApple: Teaming Up with an AI Powerhouse Could Prove Wise\n\nWhile I’m sure Apple could incorporate its own LLM into its devices, I think Google is the better option at this early phase in the AI boom. Why? As good as LLMs have become in recent quarters, they’re still not immune from hallucinating (making stuff up, seemingly out of the blue).\n\nOnly time will tell when we have a robust, hallucination-free LLM ready for the market. Regardless, given Apple’s history of releasing polished products that are truly ready for takeoff, I just don’t see Apple putting itself out there with a work-in-progress type of LLM product.\n\nAs capable and impressive as they are, even the latest versions of Google Gemini and ChatGPT-4 Turbo are technically works in progress, at least in my opinion.\n\nNeither LLM is perfect, especially at this point in the AI lifecycle, when hallucinations still happen regularly. My guess is it could take a while before LLMs are polished enough that mistakes become incredibly rare (or maybe virtually impossible).\n\nStory continues\n\nPerhaps we may be a few quarters or even a few years away from the error-free AI that many of us envision as a sort of holy grail in AI. Given how fast generative AI technologies are advancing (think exponential, not linear, rates), though, maybe hallucination-free LLMs are a heck of a lot closer than many of us may think.\n\nFor now, I think the masses have come to accept that the occasional hiccup is bound to happen when using even the best LLM that exists today. Users of such LLMs can simply check the sources themselves to ensure they’re not on the receiving end of a hallucination. Indeed, fact-checking can be a bit of a hassle when using LLMs like Gemini or GPT-4, but it’s a relatively small compromise. Further, it’s between that and using an old-fashioned search engine.\n\nWhat Could the Future Hold for the Google-Apple AI Partnership?\n\nI don’t think Apple has anything to really gain by rushing an LLM product to market right now, especially given that today’s LLMs are prone to errors, negative headlines, lawsuits, public outrage, and all sorts of negativity.\n\nWhen the perfect time comes (perhaps when LLMs have a bit more polish), though, I think Apple could have the option to replace Google Gemini with its own LLM, just like when it gave Intel (NASDAQ:INTC) the boot from Mac devices when it was ready to launch on the back of its very own Apple Silicon.\n\nIn these early stages of the AI boom, Apple stands to benefit from all the positives of AI by using Gemini without having to deal with the downsides. If something goes awry, it’s the Gemini LLM, not Apple, that’s to blame. In the meantime, look for Alphabet to gain traction as Gemini introduces itself to Apple’s golden install base, which is billions of users strong.\n\nIndeed, Gemini in iPhone could ultimately help Google and Apple surpass Microsoft in the LLM race. It will be interesting to see how a potential Google-Apple partnership evolves. Nevertheless, if any deal is inked, I expect that GOOGL stock could face a considerable valuation multiple expansion, perhaps one closer to that of its top AI peer, MSFT stock, even if Alphabet is forced to pay Apple a hefty sum.\n\nEven after surging 4.6% in a day, GOOGL stock still seems to have room to run at just 25.4 times trailing price-to-earnings (P/E) if it’s to catch up to MSFT stock’s 37.7 times trailing P/E multiple.\n\nIs GOOGL Stock a Buy, According to Analysts?\n\nAlphabet stock is a Strong Buy, according to analysts, with 28 Buys and eight Holds assigned in the past three months. The average Alphabet stock price target of $165.09 implies 12.3% upside potential.\n\nIs AAPL Stock a Buy, According to Analysts?\n\nApple stock is a Moderate Buy, according to analysts, with 16 Buys, nine Holds, and one Sell assigned in the past three months. The average Apple stock price target of $204.86 implies 16.3% upside potential.\n\nThe Bottom Line\n\nIt seems like a Google-Apple Gemini AI deal would be a win for both firms in a bid to pull ahead in the generative AI race. It’s important to note, however, that all we have is a report from Bloomberg about potential talks between the two companies.\n\nThe chatter about the chatter means that nothing is set in stone yet, even though recent market action suggests a dotted line has already been signed. In any case, look for Apple to go on the hunt for an AI partner as it seeks a “backstop” in this still-early (and less-than-polished) stage of generative AI.\n\nDisclosure", "link": "https://finance.yahoo.com/news/apple-google-gemini-partnership-could-014602633.html", "symbols": ["0QYP.IL", "0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.034, "neu": 0.866, "pos": 0.1}}, {"date": "2024-03-20T00:00:00+00:00", "title": "3 Stocks That Could Benefit From the Rise of the Metaverse", "content": "Metaverse stocks alert: Unity's bold moves, Roblox's user engagement and Apple's innovative strategies present unique investment picks.", "link": "https://investorplace.com/2024/03/3-stocks-that-could-benefit-from-the-rise-of-the-metaverse/", "symbols": ["AAPL.US", "RBLX.US", "U.US"], "tags": [], "sentiment": {"polarity": 0.866, "neg": 0, "neu": 0.549, "pos": 0.451}}, {"date": "2024-03-19T23:24:00+00:00", "title": "Apple Looks to External Partners to Boost AI Efforts", "content": "Apple is looking to outside companies to help its artificial intelligence efforts. Apple has held discussions with Google and other AI software providers about using their technology to power the iPhone maker’s mobile features, said people familiar with the matter. It wasn’t clear how any potential deal would be structured or whether Apple would partner exclusively with one of the companies.\n\nContinue reading", "link": "https://finance.yahoo.com/m/0aa93952-6faf-330e-ade9-d7ec3ce2ef7a/apple-looks-to-external.html", "symbols": ["0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F"], "tags": [], "sentiment": {"polarity": 0.818, "neg": 0, "neu": 0.861, "pos": 0.139}}, {"date": "2024-03-19T20:00:00+00:00", "title": "From Six Figures to Seven: 3 Semiconductor Stocks Set to Make Millionaires", "content": "These semiconductor stocks present a promising future, driving technological advancements in artificial intelligence, augmented reality, quantum computing and beyond. With data storage demands escalating, semiconductor technology plays a pivotal role in enabling upgrades to data center infrastructure. Yet, challenges such as fierce competition and cyclical market trends persist, necessitating strategic investment approaches. Despite risks like trade wars and supply chain disruptions, informed investors can leverage educational resources and research to capitalize on the semiconductor industry’s growth potential. Choosing semiconductor stocks could lead to massive profits.\n\nThe semiconductor market size is projected to grow to $1,380.79 billion by 2029, with a 12.2% CAGR . The following semiconductor stocks are projected to grow massively along with the industry growth. Investing in them now will result in your portfolio value skyrocketing from thousands to millions.\n\nQualcomm (QCOM) Qualcomm (QCOM) logo on an outdoor sign\n\nSource: Akshdeep Kaur Raked / Shutterstock.com\n\nQualcomm (NASDAQ:QCOM) is one of the largest American quantum computing companies. It focuses on research and development of wireless technology, especially in the communication sector. Valued at $165.28, QCOM has risen over 35% in the past year alone.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThe quantum computing industry is one of the largest and fastest-growing markets in the economy, and Qualcomm is poised to take advantage of the large growth. The industry was valued at $717.3 million in 2022, the quantum industry is projected to skyrocket through 2030 with a forecasted valuation of $6.5 billion at that point, marking an impressive 7-year CAGR of 32.1%.\n\nFinancially, QCOM is looking green on all accounts in its latest Q4 2023 report. QCOM’s holistic revenue was listed at $9.93 billion, or a YOY increase of nearly 5%. On other metrics, Qualcomm saw 24% YOY jumps from both net income and diluted EPS, with both reported at $2.77 billion and $2.46 respectively.\n\nStory continues\n\nQualcomm has set itself apart from the the increasingly competitive the quantum computing market with its 8S Gen 3 Snapdragon chips. These quantum chips, including the modern standard of artificial intelligence capabilities, are dividing the market through its target of mid-tier phones compared to the standard Snapdragon flagship models. Through this innovation of a middle model, QCOM can access both the high-end flagship phone market along the middle tier of products, expanding their market share and likewise profits.\n\nBroadcom (AVGO) broadcom (AVGO) logo outside office building\n\nSource: Sasima / Shutterstock.com\n\nBroadcom (NASDAQ:AVGO) is a designer, developer, manufacturer and global supplier of a wide range of semiconductor and infrastructure software products. It’s best known for producing the Wi-Fi hotspot chip in Apple’s (NYSE:AAPL) iPhone. AVGO’s current value of $1,236.58 grew over 92% this past year.\n\nDuring Q4 2023, AVGO didn’t manage to show its growth in net income. Broacom’s net income of $1.32 billion grew by 64.89%. Its diluted EPS of $2.84 grew down 67.73% whereas it beat the analyst’s expectations by 5.44%. Its revenue, on the other hand, showed some growth during Q4 2023, with the revenue of $11.96 billion growing 34.17% YOY, beating the analyst’s expectation by 2.06%.\n\nAVGO is rated as a “Strong Buy” (1.3 out of 5). Broadcom’s recent advancements in optical interconnect solutions for AI and ML include 200G/lane EML and VCSEL lasers, driving innovation in AI infrastructure. Industry partnerships and strong AI demand fuel its robust growth projections, with fiscal 2024 revenues expected to reach $50 billion.\n\nTaiwan Semiconductor Manufacturing (TSM) image of TSM semiconductor office building. Semiconductor Stocks\n\nSource: Sundry Photography / Shutterstock.com\n\nTaiwan Semiconductor Manufacturing (NYSE:TSM) is a semiconductor manufacturer, offering international access to chip fabrication and engineering services. It is best known for manufacturing chips for industry giants such as Apple, Nvidia (NASDAQ:NVDA), Advanced Micro Devices (NASDAQ:AMD) and Qualcomm.\n\nWhile earnings estimates are volatile, ranging from $1.08 to $1.37 billion, TSM regularly beats estimates. It currently has rating between “Strong Buy” and “Buy” on Yahoo! Finance. After a record-breaking 2022, TSM revenue slid in 2023, going down to $2.16 trillion. However, given the volatility in the semiconductor market due to shortages, this decrease is not to the company’s performance.\n\nThe semiconductor sector has a projected CAGR of 12.2%. However, market volatility, supply/demand shocks and geopolitical tensions are factors that may cause this growth to stagnate. To combat this, TSM is diversifying its factories out of the East-Asia region and into relatively more stable countries like the U.S. Additionally, it is in talks with Foxconn, another semiconductor manufacturer, to build a factory in India.\n\nAs demand for semiconductors picks up, TSM’s value will too. Management’s decision to invest in future-proofing revenue streams shows foresight and proactivity, which are great precursors to growth. All this makes TSM a “Buy” stock.\n\nOn the date of publication, Michael Que did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nThe researchers contributing to this article did not hold (either directly or indirectly) any positions in the securities mentioned in this article.\n\nMichael Que is a financial writer with extensive experience in the technology industry, with his work featured on Seeking Alpha, Benzinga and MSN Money. He is the owner of Que Capital, a research firm that combines fundamental analysis with ESG factors to pick the best sustainable long-term investments.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post From Six Figures to Seven: 3 Semiconductor Stocks Set to Make Millionaires appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/six-figures-seven-3-semiconductor-200000353.html", "symbols": ["2330.TW", "AAPL.US", "AMD.US", "AVGO.US", "NVDA.US", "QCI.BE", "QCI.DU", "QCI.F", "QCI.HM", "QCI.MU", "QCI.STU", "QCI.XETRA", "QCOM.MX", "QCOM.US", "QCOM34.SA", "TSFA.F", "TSFA.STU", "TSM.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.025, "neu": 0.861, "pos": 0.114}}, {"date": "2024-03-19T18:34:35+00:00", "title": "Judge denies Apple's attempt to dismiss a class-action lawsuit over AirTag stalking", "content": "NEW YORK (AP) — A judge has denied Apple's motion to dismiss a class-action lawsuit claiming that stalkers are using its AirTag devices to track victims — and that the tech giant hasn't done enough to prevent them.\n\nApple’s $29 AirTags have become popular items since their 2021 release, helping users keep tabs on the location of anything from their lost keys to wallets and luggage. But stalkers have also taken advantage of AirTags and similar products to follow individuals without their consent.\n\nIn December 2022, Apple was sued by dozens of plaintiffs who said they were stalked by AirTag users. They alleged that Apple failed to mitigate such dangers and should have done more to protect victims — claiming AirTags “revolutionized the scope, breadth, and ease of location-based stalking” and that current safety features are inadequate.\n\nApple attempted to dismiss the litigation in a filing last year, arguing the company “took proactive steps to try to deter misuse” and that it should not bear liability for injuries caused by third parties. But San Francisco-based U.S. District Judge Vince Chhabria dismissed that motion on Friday.\n\nChhabria ruled that, while most of the class-action plaintiffs' claims were “inadequately pled,\" three can proceed for negligence and strict product liability under California law. The remaining claims were dismissed in a separate order.\n\n“Apple may ultimately be right that California law did not require it to do more to diminish the ability of stalkers to use AirTags effectively, but that determination cannot be made at this early stage,\" Chhabria wrote.\n\nChhabria detailed arguments from both Apple and the plaintiffs in the ruling. Included were accounts from the three remaining claims of victims being stalked by former partners or others through AirTags that were allegedly attached to their cars, resulting in emotional and sometimes financial harm.\n\nAll three of these cases involve “purported defects” of AirTags that made it harder for the victims to both understand the tracking and quickly stop it, Friday's ruling outlines, including unclear or delayed notifications, as well as an inability to disable the devices remotely, which allegedly prolonged stalking.\n\nStory continues\n\n“We’re grateful for the opportunity to continue this critical litigation,” Gillian L. Wade, an attorney representing the plaintiffs, told The Associated Press via email. “Abusive and dangerous location tracking is only becoming more common, so it’s imperative to do everything we can to give voice to the victims, and to push for accountability and change.”\n\nApple and attorneys representing the California-based company did not immediately respond to requests for comment Tuesday.\n\nBack in February 2022, months ahead of the class action filing, Apple released a statement that said it “condemn(s) in the strongest possible terms any malicious use of our products.\" It also noted then-planned updates aimed at increasing safety.\n\nLast year, Apple also partnered with Google to submit a proposal aimed at setting standards for combatting secret surveillance on AirTags and similar gadgets.", "link": "https://finance.yahoo.com/news/judge-denies-apples-attempt-dismiss-183435295.html", "symbols": ["0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F"], "tags": [], "sentiment": {"polarity": -0.538, "neg": 0.098, "neu": 0.811, "pos": 0.09}}, {"date": "2024-03-19T17:59:44+00:00", "title": "I was there for the dot-com bust. Here's why the AI boom isn't the same.", "content": "The booming prices of artificial intelligence stocks have some obvious parallels with the dot-com bubble that inflated the stock market to outrageous highs in 1999 and 2000. Parallels that make some investors nervous today.\n\nAccording to a recent survey from Bank of America, 40% of fund managers think AI stocks are in a bubble (45% say no, and 15% don't know).\n\nBut as someone for whom the dot-com bubble was current events rather than history, I can tell you that today’s market isn’t remotely like the dot-com bubble market was.\n\nHow can I say such a thing?\n\nIt’s because the investing world has changed fundamentally from what it was in the dot-com bubble days.\n\nBack then, besotted people (I wouldn’t call them investors) paid whatever the market was asking for ridiculously priced stocks like Pets.com, Boo.com, and Webvan, which ultimately croaked and left shareholders with nothing.\n\nWhy were people loading up with individual stocks? The fear of missing out on the internet wave certainly kept people piling money onto the table as they looked to quintuple their money. But the main reason was that back in 2000, people simply didn’t invest like they do now, as broad-based index funds were pretty much nonexistent compared to today.\n\nSo people who had bought into the dot-com hype — and there were plenty of them — mostly bought individual stocks.\n\nThese days, people talk — mistakenly, in my opinion — about the S&P 500 (^GSPC) being in a bubble, given the concentration of a handful of stocks powering the index. Back then, the Nasdaq market was the hot thing. And boy, did that bubble burst. Pets.com, the leading online pet retailer, announced Nov. 7, 2000, that it was closing down and laying off more than 250 of its 320 employees after being unable to find a purchaser or a financial backer for the company. (Newsmakers) (Getty Images via Getty Images)\n\nOne of the most bubbly events took place on Jan. 10, 2000. That’s when Gerald Levin had Time Warner, the media and entertainment company that he was running, do the dumbest deal in history: selling itself to America Online in return for AOL stock, which was a dot-com megabubble.\n\n(You may have read about this deal lately because Levin died last week and many obituaries mentioned his AOL debacle.)\n\nStory continues\n\nTwo months after the Time Warner-AOL deal was announced — on Mar. 10, 2000 — the Nasdaq, which had more than doubled from a year earlier, hit its closing peak of 5,048.62.\n\nThen the slide began. And kept on going. And going. And going.\n\nUltimately, the Nasdaq bottomed out at 1,114.11 on Oct. 9, 2002. That was 78% below its high. It didn’t score another new high until April 23, 2015 — more than 15 years after the previous peak.\n\nEven one of the high-quality companies that survived the bubble — Cisco Systems — hasn’t been a great investment. It was recently trading for about 30% less than it fetched on Peak Bubble Day.\n\nBarring a totally unforeseen catastrophe, can you see the S&P losing 78% of its value in a little over two and a half years from now? I sure can’t see that happening. Especially given the trillions of dollars currently sloshing around in S&P index funds, with more money flowing in on a regular basis from employers and employees participating in benefit plans and from institutional investors such as pension funds for whom the S&P is a benchmark.\n\nBut, you say, what about the Magnificent Seven tech companies whose stocks more than doubled last year and drove the S&P to new high after new high?\n\nThe S&P’s total return — price increases plus reinvested dividends — for the year was 26.3%. Doesn’t this mean that we’re in a bubble?\n\nI don’t think so. Among the reasons is that even though the Seven were incredibly hot, the other S&P companies — let’s call them the Non-Magnificent 493 — had a total return of 9.9%, according to Howard Silverblatt, senior index analyst at S&P Dow Jones Indices. That’s about the average return the US market has shown over the long term. The Pets.com sock puppet dog stars in a commercial for the company in Los Angeles, Jan. 11, 2000. (Bob Riha/Liaison/Getty Images) (Bob Riha Jr. via Getty Images)\n\nAmazingly, this year’s market, despite a recent decline, is on track to outperform last year’s market. The S&P had returned 7.28% through Friday’s close, according to Silverblatt. Extrapolate that 2.5-month return to a full year and you get 34.9%.\n\nAnd now, some of last year’s Magnificent Seven are having a less-than-magnificent 2024. Tesla (TSLA) was down 34.2% as of Friday’s close — the worst performer in the S&P, according to Silverblatt.\n\nNvidia (NVDA) accounted for 32% of the S&P’s gain this year, he says, with Microsoft (MSFT), Meta (META), and Amazon (AMZN) accounting for another 28%. Apple (AAPL), however, is down for the year, and Alphabet (GOOG, GOOGL) has only a marginal gain. (So perhaps we should rename the Magnificent Seven the Fab Four?)\n\nThe point here is that it doesn’t seem very bubbly when three of the Magnificent Seven aren’t doing well and yet the S&P keeps chugging along.\n\nLook. I’m not telling you that the market is any sort of bargain these days — it’s not cheap by any standard. And I’m not telling you that it’s not going to decline, possibly sharply, over the mid- to long-term.\n\nBut what I am telling you is that there’s a big difference between a high-priced market like today’s and an insanely priced market like the Nasdaq was in the dot-com bubble days.\n\nThere may be some difficult times ahead for investors. But a decline of almost 80% over the next two and a half years? As we say in the part of the world in which I live: fuhgeddaboudit.\n\nAllan Sloan is an award-winning journalist and contributor to Yahoo Finance.\n\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/i-was-there-for-the-dot-com-bust-heres-why-the-ai-boom-isnt-the-same-175944680.html", "symbols": ["0QZI.LSE", "0R1O.IL", "0R2V.IL", "0RIH.IL", "0RIH.LSE", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.STU", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "AMZ.DU", "AMZ.F"], "tags": [], "sentiment": {"polarity": 0.983, "neg": 0.038, "neu": 0.896, "pos": 0.066}}, {"date": "2024-03-19T17:59:14+00:00", "title": "How To Set Up A Long-Term Covered Call On Apple", "content": "Apple doesn't provide much in the way of dividends. A covered call involves buying 100 shares of the underlying stock and simultaneously selling a call option against those shares. It creates an income stream for you in the form of the option premium you collect.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d0cd212e-499f-3105-b140-4a793b94e7e9/how-to-set-up-a-long-term.html", "symbols": ["0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F"], "tags": [], "sentiment": {"polarity": 0.671, "neg": 0, "neu": 0.866, "pos": 0.134}}, {"date": "2024-03-19T16:46:00+00:00", "title": "Alphabet (GOOGL) Aids YouTube Music With Song Search Feature", "content": "Alphabet’s GOOGL Google is leaving no stone unturned to capitalize on growth opportunities present in the music streaming market space. Per a Grand View Research report, the global music streaming market size is expected to witness a CAGR of 14.4% between 2023 and 2030.\r\n\r\nIn this regard, the company added a song search capability for YouTube Music on Android devices.\r\n\r\nNotably, YouTube Music now features a dedicated button next to voice search, allowing faster access by tapping the search icon in the top-right corner.\r\n\r\nAlphabet is likely to expand its YouTube Music subscriber base on the back of its latest move.\n\nAlphabet Inc. Price and Consensus Alphabet Inc. Price and Consensus\n\nAlphabet Inc. price-consensus-chart | Alphabet Inc. Quote\n\nYouTube Music in Focus\n\nApart from the song search feature, Google introduced a \"Trim Silence\" feature in the v6.43.52 version of YouTube Music, allowing users to skip past stretches of silence in a podcast, resulting in a slightly shorter runtime.\r\n\r\nFurther, the company announced a redesign of the Now Playing feature on YouTube Music for web, introducing a full-screen experience with a Song and Video switcher, minimize button, overflow menu and cast controls.\r\n\r\nAdditionally, Google added several new notifications for YouTube Music on Android and iOS, alerting users about new releases and playlists.\r\n\r\nThese notifications include music recommendation notifications, playlist update notifications, podcast recommendation notifications, product update notifications and recap notifications. Users can disable these notifications in their preferences at any time.\r\n\r\nAll the above-mentioned endeavors to enhance YouTube Music offerings will likely aid Alphabet to bolster its Google Services segment, which remains the key growth driver for the company. Its shares have rallied 45.9% in the past year compared with the Zacks Computer & Technology sector’s growth of 44.6%.\r\n\r\nThe strengthening Google Services segment is expected to aid its overall financial performance in the days ahead.\r\n\r\nThe Zacks Consensus Estimate for 2024 total revenues stands at $286.52 billion, indicating year-over-year growth of 11.7%.\n\nStory continues\n\nStiff Competition\n\nGrowing YouTube Music efforts will likely allow Alphabet to strengthen its competitive position against rivals like Apple AAPL and Amazon AMZN, which are also making substantial efforts to strengthen their footing in the global music streaming space.\r\n\r\nRecently, Apple offered USHER fans exclusive content on Apple Music ahead of his upcoming Apple Music Super Bowl LVIII Halftime Show. The content includes a trailer, studio album discography, playlists curated by USHER and NFL teams, and dedicated Apple Music Radio programming for Apple Music subscribers.\r\n\r\nApple also launched a Discovery Station for Apple Music. The Discovery Station, available on Apple Music's mobile, desktop and web apps, is a curated selection of music based on users’ recent listening, which has not yet been added to the library.\r\n\r\nAmazon, on the other hand, is riding on the success of its music streaming service, Amazon Music.\r\n\r\nThe company’s Amazon Music Unlimited service offers an expanded catalog and over 1,000 spatial remixes for Dolby Atmos soundbars, Android and iOS devices, and Amazon Echo Studio.\n\nZacks Rank & A Stock to Consider\n\nCurrently, Alphabet carries a Zacks Rank #3 (Hold).\r\n\r\nA better-ranked stock in the broader technology sector is CrowdStrike CRWD, carrying a Zacks Rank #2 (Buy) at present. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nShares of CrowdStrike have gained 28.7% in the year-to-date period. The long-term earnings growth rate for CRWD is 22.31%\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\n\nApple Inc. (AAPL) : Free Stock Analysis Report\n\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\n\nCrowdStrike (CRWD) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/alphabet-googl-aids-youtube-music-164600410.html", "symbols": ["0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "AMZ.DU", "AMZ.F", "AMZ.HM", "AMZ.MU", "AMZ.STU", "AMZ.XETRA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.003, "neu": 0.855, "pos": 0.142}}, {"date": "2024-03-19T16:00:37+00:00", "title": "Wall Street’s Favorite Blue-Chip Stocks? 3 Tickers That Are Practically Money Machines", "content": "Investors look for equities with the potential for rapid returns in their pursuit of profitable investments. Several blue-chip stocks are expected to continue to perform well, providing a mix of both cash flow stability and long-term growth.\n\nThese top players in the field, who offer stability and growth, cover sectors ranging from digital technology to pharmaceuticals. Businesses with large user bases and leadership in digital payment get more growth through technology utilization and strategic relationships.\n\nEven with the market’s record highs and year-long rise, it’s getting harder to sniff out undervalued blue-chip stocks. High valuations carry a danger of sudden price dips. Still, certain undervalued blue chip stocks open doors to stability and reliable returns.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nEvery investor should own these three blue chips and be open to great opportunities.\n\nApple (AAPL) Apple logo on a pink and purple background. AAPL stock.\n\nSource: Moab Republic / Shutterstock\n\nWe once knew it to be the world’s most valuable company.\n\nHowever, since giving up its crown Apple (NASDAQ:AAPL) shareholders may not need to worry. The company’s weak performance this year may be concerning, as revenue continues to decline despite still sky-high revenues. As analysis shows, it is noted that the price targets go from $158.00 to $250.00 with a $201.41 mean.\n\nHowever, light appears on the horizon for long-term investors. Recently, AAPL surged higher after the company reportedly bought Canadian AI startup DarwinAI. This deal highlights the company’s focus on this space, and that its AI initiatives are beginning to roll. In early 2024, Apple integrated the DarwinAI team, with Apple’s CEO hinting at future advancements in AI. This happened despite the company trailing behind rivals like Microsoft and Google.\n\nFurther, Apple dropped plans for electric cars and turned its attention toward generative AI, teasing a big AI reveal. Apple’s stock is still cheaper than competitors like Amazon and Tesla, with a healthy gross margin of about 45%, at 26-times forward profits.\n\nStory continues\n\nMeta Platforms (META) In this photo illustration the Meta logo seen displayed on a smartphone and in the background the Facebook logo\n\nSource: rafapress / Shutterstock.com\n\nStarting as Facebook, Meta Platforms (NASDAQ:META) has become a top player in technology, especially in virtual reality (VR) stocks. Known for its Rift and Quest VR headsets, Meta’s Oculus divisions led immersive gaming experiences with a transition to the metaverse.\n\nThe rise of Reels brings out Meta Platforms’ rule on social media. Its ad impressions increased by 28% in 2023 year over year (YOY). Temu, owned by PDD in China, became Meta’s biggest advertiser, spending around $2 billion on ads. In light of Meta’s dividend buzz, the change shows PDD’s intention to expand Temu in the U.S.\n\nAdditionally, experts believe that fiscal 2024 revenue will surpass $158.2 billion, a 17.3% boost from the last year. Also, they anticipate 2025 sales to cross $178 billion. With a $528.80 price target, experts rank its shares a strong buy, putting Meta with the top dogs of VR stocks.\n\nBerkshire Hathaway (BRK-B) A close-up of a Berkshire Hathaway (BRK-A, BRK-B) office in Terra Haute, Indiana.\n\nSource: Jonathan Weiss / Shutterstock.com\n\nWarren Buffet’s $364 billion Berkshire Hathaway (NYSE:BRK-B) portfolio, which includes Apple and other blue-chip stocks, continues to attract investors looking for stock inspiration. Apple controls 43% of the portfolio, and Buffet reaps the rewards from his initial 2016 investment. Additionally, this led to a 374% skyrocket in the stock by March 8.\n\nBerkshire Hathaway, unlike IT firms solely focused on AI and data, has experienced growth thanks to its varied sectoral investments. Diversity locks in stability and facilitates strategic capital adjustments. And Buffet’s seasoned experience raises Berkshire’s appeal, providing a sanctuary during market volatility.\n\nThe company’s Q4 operating income grew 28% to $8.48 billion, boosted by a 28% increase in buybacks, expected to total $2.2 billion. Barron’s listed BRK-B with its top ten picks, believing after-tax operating products to shoot through $40 billion in 2024. I tend to agree that this is a stock worth owning for the long-term, among several reasons.\n\nOn the date of publication, Chris MacDonald did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nChris MacDonald’s love for investing led him to pursue an MBA in Finance and take on a number of management roles in corporate finance and venture capital over the past 15 years. His experience as a financial analyst in the past, coupled with his fervor for finding undervalued growth opportunities, contribute to his conservative, long-term investing perspective.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of “America’s Top Trader” Issues A.I. Code Red: Act Now or Miss Out It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post Wall Street’s Favorite Blue-Chip Stocks? 3 Tickers That Are Practically Money Machines appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/wall-street-favorite-blue-chip-160037801.html", "symbols": ["AAPL.US", "BERK34.SA", "BRH.BE", "BRH.DU", "BRH.F", "BRH.HM", "BRHF.F", "BRK-A.US", "BRK-B.US", "BRK.NEO", "BRKB.MX", "BRYN.F", "BRYN.XETRA", "META.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.017, "neu": 0.859, "pos": 0.124}}, {"date": "2024-03-19T10:37:00+00:00", "title": "Nvidia Has Global Dominance in Its Sights, Why It’s the New Apple. And 5 Other Things to Know Before Markets Open.", "content": "Google’s potential AI tie-up could spark antitrust concerns, Japan finally raises interest rates after 17 years, and other news to start your day.\n\nContinue reading", "link": "https://finance.yahoo.com/m/35945fe1-1811-3122-b9c9-41e3b9239c56/nvidia-has-global-dominance.html", "symbols": ["0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU"], "tags": [], "sentiment": {"polarity": 0.599, "neg": 0, "neu": 0.824, "pos": 0.176}}, {"date": "2024-03-19T09:36:00+00:00", "title": "This Is the Cheapest \"Magnificent Seven\" Stock, According to Peter Lynch's Favorite Valuation Metric", "content": "There's been a lot of talk about the \"Magnificent Seven\" stocks recently. These large, competitively advantaged tech platforms have vastly outperformed the market over the past decade, and they also seem like great bets to benefit from the artificial intelligence revolution, too.\n\nBut their strong recent run has led many to believe these stocks are either overpriced or fairly priced relative to the rest of the market. On the other hand, many have been saying that for years, only to see these tech giants surpass earnings expectations.\n\nHow to balance their relatively high market valuations with their above-average growth prospects? One valuation metric touted by one of the most famous mutual fund managers of all time may hold the secret.\n\nThe PEG ratio\n\nThe PEG ratio, or price-to-earnings-to-growth metric, was first developed in 1969 by Mario Farina and later popularized by Peter Lynch, portfolio manager for the Fidelity Magellan Fund in the 1980s.\n\nTo calculate the PEG ratio, an investor should divide a company's P/E ratio by its expected earnings growth rate. In general, stocks may have a PEG ratio between 1 and 2, with stocks with PEGs under 1 considered undervalued, and stocks above 2 considered overvalued.\n\nA PEG ratio is an imperfect measure, to be sure, as some investors may use either the trailing or forward P/E ratio, and others use different lengths of time to calculate the long-term earnings growth numbers.\n\nOne standard type of PEG ratio is to look at the P/E ratio based on current year expected earnings, and the outlook for the next five years' earnings growth.\n\nMagnificent PEG Ratios\n\nHere's how the PEG ratios the Magnificent Seven stocks shake out.\n\nCompany PEG Ratio Meta Platforms(NASDAQ: META) 1.10 Nvidia(NASDAQ: NVDA) 1.36 Alphabet(NASDAQ: GOOGL)(NASDAQ: GOOG) 1.49 Tesla(NASDAQ: TSLA) 1.93 Microsoft(NASDAQ: MSFT) 2.11 Apple(NASDAQ: AAPL) 2.12 Amazon(NASDAQ: AMZN) 2.36\n\nData source: Yahoo! Finance.\n\nStory continues\n\nThere are a few expected results here, but also a few surprises. First, it's not surprising to see both Meta and Alphabet among the cheapest of these stocks. These two generally trade at discounts to other \"disruptive\" tech names, perhaps because of their already being large, \"mature\" companies. Moreover, many investors give less credit to revenue and profits that come from advertising, as ad revenue is thought to be economically sensitive and perhaps flighty.\n\nStill, that has been the case for years, and both Alphabet and Meta have generally been able to defy skeptics and continue solid growth over the long term as ad dollars continue to flow to digital ads from traditional advertisements.\n\nIn addition, Alphabet has lots of cash on its balance sheet and generates significant losses from its \"Other Bets\" segment, increasing its P/E ratio relative to its core business and making it look more expensive. And since it's really hard to know whether some of Alphabet's moonshot projects will pay off, analysts probably aren't forecasting any contribution from these loss-making but forward-thinking businesses, perhaps underrating Alphabet's earnings growth prospects even further.\n\nAnd of course, besides a reasonable valuation, Meta's new dividend is a good sign of confidence management has in the sustainability of its earnings. Thus, both of these stocks may be worth looking at if contemplating allocating to Magnificent Seven stocks today.\n\nOne big surprise here is Nvidia, which actually comes out as the second cheapest stock based on this measure. That's despite having the highest trailing P/E ratio at 73.5. That is, of course, because analysts are forecasting robust growth for Nvidia based on its lead in GPUs that currently dominate the artificial intelligence market. From the looks of it, it appears analysts believe that advantage will continue, and that the AI revolution will deliver sustainable high growth for Nvidia over the immediate term. Image source: Getty Images.\n\nAre the bottom four worth considering?\n\nTesla, Apple, Microsoft, and Amazon are all near 2 or above in terms of their PEG ratios, making them generally unattractive on this metric.\n\nHowever, that doesn't necessarily mean one should avoid these stocks. Remember, the PEG ratio is just one indication, based on future earnings growth that is somewhat unknowable.\n\nMoreover, each of these companies have slightly different reasons for their high PEG ratios. Both Microsoft and Apple are generally given high valuations, not necessarily because of growth, but rather because of the stability of their businesses and the confidence that earnings will generally remain intact for a long time. Apple obviously has among the best consumer franchises in the world with the iPhone, making it not only a tech stock but more of a consumer staple. And consumer staples stocks generally trade at higher valuations despite lower growth, because of their perceived \"safety\" in good economic environments and bad.\n\nMicrosoft is also regarded as a very safe stock, because of its dominance of not one but several high-profit businesses, including the Windows operating system, the Office enterprise software suite, and its Azure cloud computing platform. Add in its exclusive arrangement with OpenAI, and it's perhaps no wonder Microsoft is given a high valuation that may be deserved.\n\nOn the other hand, the high PEGs for Amazon and Tesla probably have to do with their high multiples today and the substantial uncertainty to their future earnings.\n\nAmazon has typically spent all or most of its profit on future innovation, so its bottom line is incredibly difficult to project, even if the company generally does well. It's likely that Wall Street analysts aren't projecting much profit inflection, as is the case for Alphabet's \"other bets,\" since Amazon hasn't really ever harvested profit in a significant way.\n\nMeanwhile, Tesla is a pioneer in the emerging electric vehicle market, which has high growth expectations over the long term. However, that market has slowed in recent months amid high interest rates, and Tesla's earnings are actually currently declining as it cuts prices.\n\nThe combination of high long-term growth expectations in the face of a likely earnings decline this year means Tesla is quite risky. In fact, I would personally own Amazon over Tesla, despite the slightly higher PEG, since I think Amazon is more likely to see profit inflect upward relative to current analyst expectations than Tesla.\n\nDon't just use the PEG\n\nThe PEG ratio can be useful in offering a very quick snapshot of a company's valuation relative to its growth. However, one factor the PEG ratio doesn't capture very well is a business' safety compared with other stocks. P/E ratios are a reflection of both growth expectations and risk, but risk is a very squishy and difficult concept to quantify.\n\nMoreover, the greatest stock gains usually come from businesses that wildly outperform expectations, so using a metric that merely reflects expectations is also a limiting factor. That's why the PEG ratio is best used for companies with stable earnings growth, and not a bottom line that may bounce around year to year such as Amazon or Tesla.\n\nOverall, the PEG ratio is just one shortcut for investors. But remember, a company's intrinsic value is always the present value of future cash flows. If you come across a company that looks cheap based on a PEG ratio, see if you can dig deeper and map out what you think cash flow can do over the next decade, as well as the probability that your projected scenario will unfold.\n\nWhile the PEG ratio is a useful shortcut, remember that it's more a starting point than a destination.\n\nShould you invest $1,000 in Nvidia right now?\n\nBefore you buy stock in Nvidia, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Nvidia wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of March 18, 2024\n\nJohn Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. Suzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Billy Duberstein has positions in Alphabet, Amazon, Apple, Meta Platforms, and Microsoft. His clients may own shares of the companies mentioned. The Motley Fool has positions in and recommends Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, and Tesla. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\n\nThis Is the Cheapest \"Magnificent Seven\" Stock, According to Peter Lynch's Favorite Valuation Metric was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/cheapest-magnificent-seven-stock-according-093600536.html", "symbols": ["AAPL.US", "AMZN.US", "GOOG.US", "GOOGL.US", "META.US", "MSFT.US", "NVDA.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.047, "neu": 0.797, "pos": 0.156}}, {"date": "2024-03-19T09:14:48+00:00", "title": "Trending tickers: Nvidia, Apple, Unilever and Astrazeneca", "content": "Nvidia CEO Jensen Huang reveals new processor as company seeks to cement AI chip market dominance (Eric Risberg, Associated Press)\n\nNvidia (NVDA)\n\nNvidia has unveiled its latest artificial intelligence (AI) chip which it said it is up to 30 times speedier than its predecessor.\n\nIts new chip, named the Blackwell B200, takes two chips the size of Nvidia’s previous offering and binds them together into a single chip.\n\n“Blackwell GPUs are the engine to power this new industrial revolution,” said NVIDIA CEO Jensen Huang at the company’s annual GTC event in San Jose attended by thousands of developers.\n\nRead more: FTSE 100 LIVE: European markets cautious as central banks circle wagons on rates\n\n“Generative AI is the defining technology of our time. Working with the most dynamic companies in the world, we will realize the promise of AI for every industry,” Huang added in a press release.\n\nADVERTISEMENT\n\nNvidia has an 80% share of the data centre AI chip market and hopes to cement its dominance with this latest chip.\n\nThe company is the third-most valuable company in the US, behind only Microsoft (MSFT) and Apple.\n\nApple (AAPL)\n\nApple is discussing a potential deal to integrate Google’s (GOOG) artificial intelligence platform Gemini into the iPhone, Bloomberg reported.\n\nApple is holding “active negotiations” to license Gemini’s AI models to integrate its generative AI features into an upcoming software update to the iPhone later this year.\n\nApple’s models could power on-device generative AI with iOS 18, releasing later this year, while cloud-based AI features like text- and image-generation could come via partnerships with the likes of Google.\n\n\"Given Apple's installed base of 2.2 billion iOS devices, a licensing deal based on volume of usage could end up being a very significant cost for Apple but a fixed license for any cloud-based usage would not be economical for partners,” Bank of America analyst Wamsi Mohan said.\n\n“An on-device fixed charge per device seems most likely but would be more limited in capabilities. Apple could also use this as an approach to speed up time to market, while continuing to develop in-house technologies,” he added.\n\nStory continues\n\nUnilever (ULVR.L)\n\nUnilever has warned that up to 7,500 jobs are at risk as the Magnum maker outlined plans to split off its ice cream unit as a separate business.\n\nThis overhaul is primarily aimed at saving around €800m (£684m) over the next three years. The plan will separate its ice cream businesses and divide the rest of Unilever into four divisions: Beauty & Wellbeing, Personal Care, Home Care and Nutrition.\n\nThe FTSE 100 consumer goods giant said it was accelerating its “growth action plan” which will make it a “simpler, more focused company”.\n\nMatt Britzman, equity analyst at Hargreaves Lansdown, said: “Action is what shareholders wanted to see from the new team at the top, and that’s what’s been delivered today.\n\n“Ice cream always looked like the odd one out when you compare it to other product lines, and performance has struggled of late.\n\nRead more: AI could spark 'complete annihilation of humankind' unless regulated\n\n“It’s not a huge shock to see this move, but it’s something prior management wasn’t able to deliver.\n\n“Unilever’s not an overly expensive name at the minute so expect markets to react positively to the news, perhaps more due to the decisive action than anything else.”\n\nAccording to the group, any impacted staff members will be consulted about the job cuts but did not reveal whereabouts they will be made.\n\nAstrazeneca (AZN.L)\n\nAstraZeneca has acquired oncology biotech Fusion Pharmaceuticals for $2.4bn as part of a plan to accelerate the development of next-generation cancer treatments.\n\nCanadian biotech Fusion, whose shares trade in New York, is involved in radiopharmaceuticals, a rapidly growing area of cancer treatment that targets specific organs, tissues or cells within the human body.\n\n\"The acquisition marks a major step forward in AstraZeneca delivering on its ambition to transform cancer treatment and outcomes for patients by replacing traditional regimens like chemotherapy and radiotherapy with more targeted treatments,\" said AstraZeneca.\n\nThe deal involves a $2bn upfront cash transaction, with a total transaction value of $2.4bn based on contingent, further payments. It follows AstraZeneca’s $1bn acquisition of a French rare diseases start-up Amolyt last week.\n\nWatch: Nvidia CEO Unveils Latest Powerful Chip at “AI Woodstock”\n\nDownload the Yahoo Finance app, available for Apple and Android.", "link": "https://uk.finance.yahoo.com/news/nvidia-apple-unilever-astrazeneca-trending-tickers-091448319.html", "symbols": ["0QYP.IL", "0R2V.IL", "0RIH.IL", "0RIH.LSE", "A1ZN34.SA", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.STU", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU"], "tags": [], "sentiment": {"polarity": 0.974, "neg": 0.049, "neu": 0.86, "pos": 0.091}}, {"date": "2024-03-19T09:00:02+00:00", "title": "Companies are getting back control of their companies", "content": "Companies are getting bolder in their battles to beat back proposals requiring them to disclose more about everything from environmental policies to AI, as shareholder support for governance changes shows new signs of waning in 2024.\n\nSo far this year, Apple (AAPL), Tyson Foods (TSN), and Applied Materials (AMAT) have defeated proposals that would have required the giants to disclose more about diversity, ESG, labor practices and AI policies.\n\nExxon (XOM) is suing two activist investor groups — Arjuna Capital and Follow This — after the organizations tried to bring a shareholder vote on whether the oil giant should disclose greenhouse gas emissions. Exxon Mobil chairman and CEO Darren Woods, speaking in Houston Monday. (Photo by MARK FELIX/AFP via Getty Images) (MARK FELIX via Getty Images)\n\nAnd the Securities and Exchange Commission watered down a new set of climate-risk disclosure rules after companies complained about the costs of compiling indirect emissions. The Chamber of Commerce last week filed a petition asking the Fifth Circuit Court of Appeals to block the rules the SEC did pass.\n\nThe bolder action by big businesses comes as political heat around environmental, social, and governance (ESG) concerns and diversity, equity, and inclusion (DEI) policies mount in an election year.\n\nFormer President Trump has promised to banish ESG \"forever,\" while a top Trump ally has called DEI \"bigotry\" against white men.\n\nRepublican-led states are also pushing companies to rescind race-based employee quotas, piggybacking on the Supreme Court's decision in 2023 to strike down race-based admission policies at Harvard University and the University of North Carolina.\n\nBig asset managers and Wall Street banks that own giant slugs of stock in major American companies are contributing to the retreat.\n\nThe latest retrenchment came last month when financial giants JPMorgan Chase (JPM), State Street (STT), and Pimco all pulled out of Climate Action 100+, a coalition formed in 2017 to encourage companies to reduce their emissions.\n\nBlackRock (BLK), the world's largest money manager, also ended its US involvement with the group.\n\nStory continues\n\nDialing back\n\nA key test of these issues is taking place this spring, as companies collect votes on a variety of proposals seeking changes to corporate governance. So far this year, stockholders are saying 'no' to many of them.\n\nApple shareholders roundly rejected a collection of ethics- and employment-centered initiatives, turning down a labor-backed proposal from AFL-CIO Equity Index Fund (AFLCIX) that suggested the iPhone maker report how it uses AI technology in its business operations.\n\nOther failed initiatives pushed for Apple to report more detailed information on racial and gender pay gaps and the evenness of its application of human rights policies around the globe. The headquarter of Apple in Cupertino, Calif. Photo: REUTERS/Carlos Barria (REUTERS / Reuters)\n\nEven a proposal that sought to protect conservative views from discrimination lacked enough support to pass. It would have required Apple to disclose potential risks from its omission of \"viewpoint\" and \"ideology” discrimination in its employment policy.\n\nBig money managers that serve as the largest stockholders in big, publicly-traded companies are shying away from any proposals likely to be viewed as activism, according to Lindsey Stewart, Morningstar’s director of investment stewardship research.\n\nThat includes proposals both for and against ESG- and DEI-type policies.\n\n\"Certainly asset managers have dialed down their enthusiasm to back these kinds of proposals over the last few years,\" Stewart said.\n\nThe apparent swing in favor of less disclosure may be an indication that shareholders are growing tired of trying to influence corporate behavior.\n\n\"It’s still too early to tell,\" said Stewart, referring to whether this year will show a statistically significant shift.\n\nA new phase\n\nThere have been some other notable company victories so far in 2024.\n\nAt Tyson Foods, shareholders voted against a third-party audit to monitor its worker population while the meat producer faces claims its employment of minors violated US labor laws.\n\nAt Applied Materials, shareholders of the semiconductor materials manufacturer voted against proposals to report on quantitative median and adjusted pay gaps across race and gender.\n\nOne greenhouse gas emissions proposal has won shareholder approval so far this year, according to ISS-Corporate. That came at Jack In the Box (JACK), where 56% of shareholders voted to require disclosure of emission reduction targets. One ESG proposal that did win enough votes so far this year came at Jack In The Box, where 56% of shareholders voted to require disclosure of emission reduction targets. Photo: REUTERS/Mike Blake (REUTERS / Reuters)\n\nThere could be another explanation for the waning support: New reporting mandates from regulators and US exchanges are starting to satisfy investors.\n\nA lot of new rules have been passed this decade requiring more information from companies. In 2020, the SEC expanded human capital disclosure rules to require that companies disclose risks and resources associated with their employee headcount.\n\nThe next year in 2021, the SEC made it easier for investors to get climate change and social issues on corporate voting ballots while Nasdaq made it mandatory for listed companies to disclose diversity.\n\nStarting in 2025, the SEC's new climate rules will require companies to reveal their carbon footprint in an effort to help investors evaluate how climate change may impact businesses’ bottom line.\n\n\"Those regulations and standards are starting to hit,\" Stewart said, \"so I think [shareholders] are feeling less need to push quite so hard on them because there are actual requirements out there that are prompting companies to make those kinds of disclosures.\"\n\nNo matter the reason, overall support for ESG-focused resolutions is falling and will likely continue, according to a recent Morningstar analysis.\n\n\"I think we're entering a phase moving away from the investor activism side of things into a phase where there's written down regulations and standards,\" Stewart said.\n\nAlexis Keenan is a legal reporter for Yahoo Finance. Follow Alexis on Twitter @alexiskweed.\n\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/companies-are-getting-back-control-of-their-companies-090002906.html", "symbols": ["0L9G.LSE", "0LHR.LSE", "0QZZ.LSE", "0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "AMAT.MX", "AMAT.US", "AP2.BE", "AP2.DU", "AP2.F", "AP2.HM", "AP2.MU", "AP2.STU", "AP2.XETRA", "APC.BE"], "tags": [], "sentiment": {"polarity": 0.979, "neg": 0.042, "neu": 0.887, "pos": 0.071}}, {"date": "2024-03-19T08:06:00+00:00", "title": "These 3 Companies Have Collectively Repurchased $1.07 Trillion of Their Own Stock Since the Start of 2013", "content": "In case you haven't noticed, the bulls are running wild on Wall Street. Following a challenging year in 2022, which saw all three major stock indexes plunge into respective bear markets, the ageless Dow Jones Industrial Average, benchmark S&P 500, and innovation-driven Nasdaq Composite have all launched to new all-time highs in 2024.\n\nThere isn't just one factor that can be pointed to as the fuel for Wall Street's epic rally. Rather, it's a confluence of factors that includes a strong U.S. economy, better-than-expected corporate earnings, the emergence of artificial intelligence (AI) as a next-big-thing trend, and a historically robust level of share repurchase activity. Image source: Getty Images.\n\nAlthough aggregate corporate share buybacks in 2023 fell from the record levels observed during the 2022 bear market, the $787.3 billion S&P 500 companies collectively spent on share repurchases on a trailing-12-month basis, as of Sept. 30, 2023, remains well above the historic average.\n\nThe reason public companies enact share repurchase programs is threefold:\n\nFor companies with steady or growing net income, a steady reduction in the number of outstanding shares can increase earnings per share (EPS) over time. In other words, it can make a company appear more fundamentally attractive to investors. When a public company retires shares of its common stock, the ownership stakes of existing/long-term shareholders can increase over time. This encourages investors to have a long-term mindset. It's a way for a company's board of directors to demonstrate faith in a company's long-term growth strategy.\n\nWhile more than 56% of S&P 500 companies repurchased at least $5 million worth of their own stock during the September-ended quarter, there are a few companies that are step above the rest when it comes to buybacks.\n\nSince 2013, the following three widely owned companies have collectively repurchased $1.07 trillion worth of their own stock.\n\nStory continues\n\nApple: $651 billion in share repurchases since 2013\n\nWhen it comes to share repurchases, it's fair to say that tech stock Apple(NASDAQ: AAPL) is in a class of its own. Since initiating a share buyback program in 2013, the company has bought back about $651 billion worth of its common stock.\n\nTo put this into context, there are only eight companies in the S&P 500, excluding Apple, with a market cap above $651 billion. Apple could have comfortably purchased 491 of the other 499 S&P 500 companies with the amount of money it's spent buying back its stock.\n\nThere are a couple of reasons Apple has an abundance of cash to repurchase its stock. To start with, it's a trusted brand with an exceptionally loyal following. A survey conducted by SellCell.com in March 2021 of more than 2,000 iPhone users found that nearly 92% had no intention of switching smartphone brands with their next purchase.\n\nInnovation is the other big reason Apple has been nothing short of a cash cow. Domestically, Apple's iPhone has accounted for 50% or more of smartphone market share since becoming 5G-capable in 2020.\n\nHowever, Apple's future rests with innovation beyond the physical realm. Specifically, CEO Tim Cook has been emphasizing a shift toward subscription services. A subscription-driven operating model should steadily lift the company's operating margin, help smooth out some of the revenue lumpiness associated with physical product upgrade cycles, and can further enhance the benefits of the Apple product and service ecosystem.\n\nWhile reducing its outstanding share count by 41% since 2013 has provided a lift to Apple's EPS, investors should remain diligent about digging beneath the surface when analyzing the company's growth trends. For instance, even though Apple's adjusted EPS ticked higher by $0.02 per share in fiscal 2023 (ended in September), the company's net income fell by $2.8 billion to $97 billion for the year.\n\nFor the moment, Apple's buybacks are helping to partially mask a stalling of its growth engine. Image source: Getty Images.\n\nAlphabet: $240 billion in share repurchases since 2015\n\nAnother S&P 500 component that's turned on the proverbial jets in the buyback department in recent years is Alphabet(NASDAQ: GOOGL)(NASDAQ: GOOG), the parent of internet search engine Google, social media site YouTube, and autonomous driving company Waymo, among other ventures.\n\nSince initiating a share repurchase program in 2015, Alphabet's stock buybacks have grown with each passing year. The $61.5 billion spent repurchasing its stock in 2023 increased its aggregate buybacks over roughly eight years to $240 billion. Alphabet has spent enough on buybacks that it could have purchased all but 28 companies within the S&P 500, not counting itself.\n\nIf you're wondering what's made Alphabet such a success for so long, look no further than its virtual monopoly, Google. Data from GlobalStats shows that Google has accounted for at least a 90% monthly share of global internet search dating back almost nine years. It's the obvious go-to for businesses wanting to target their message(s) to users. As a result, Google tends to enjoy premium ad-pricing power in most economic climates.\n\nHowever, the lion's share of Alphabet's cash flow growth moving forward may well come from Google Cloud. As of the September-ended quarter, Google Cloud was the world's No. 3 cloud infrastructure service provider, with an estimated 10% share of enterprise cloud spending. More importantly, this segment generated a full-year profit in 2023 after many years of losses. Cloud services tend to produce considerably higher margins than advertising.\n\nAs Alphabet's outstanding share count continues to shrink, the company's sales and net income are climbing. This is a recipe for EPS growth to outpace sales growth for the foreseeable future.\n\nMicrosoft: $183 billion in share repurchases since 2013\n\nThe third juggernaut that's been putting the pedal to the medal in the buyback department for more than a decade is Microsoft(NASDAQ: MSFT). Though I've arbitrarily cut off the start date at 2013, Microsoft has been repurchasing its stock for even longer than Apple. Since 2013, it's collectively retired around $183 billion worth of its common stock.\n\nNot including itself, Microsoft has spent more on buybacks since the beginning of 2013 than the market caps of all but 41 S&P 500 companies.\n\nMicrosoft's continued outperformance is a function of it seamlessly blending its legacy operations with a handful of high-growth initiatives. For example, it's no secret that the growth heyday for Windows and Office have long since passed. Nevertheless, Windows still holds a 72% share of desktop operating systems worldwide. This is an exceptionally high-margin segment that generates abundant cash flow, which allows Microsoft to aggressively invest in higher-growth initiatives.\n\nWith regard to \"high-growth initiatives,\" I'm primarily talking about cloud services and AI. Cloud infrastructure service platform Azure is the world's No. 2 provider in terms of enterprise spending. Meanwhile, Microsoft has invested billions into OpenAI, the company behind popular chatbot ChatGPT, and recently unveiled its Maia AI chip to help power its own Azure data centers. The cloud and AI can help Microsoft sustain a double-digit sales growth rate.\n\nMicrosoft also has what might be the most pristine balance sheet on the planet. It's one of only two publicly traded companies to receive the highest possible credit rating (AAA) from Standard & Poor's. Microsoft closed out calendar year 2023 with $81 billion in cash, cash equivalents, and short-term investments, and it's generated nearly $103 billion in operating cash flow over the trailing-12-month period. This cash allows Microsoft to innovate, make acquisitions, buy back copious amounts of its own stock, and comfortably pay out the largest nominal-dollar dividend among publicly traded companies in the U.S.\n\nShould you invest $1,000 in Apple right now?\n\nBefore you buy stock in Apple, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Apple wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of March 18, 2024\n\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Sean Williams has positions in Alphabet. The Motley Fool has positions in and recommends Alphabet, Apple, and Microsoft. The Motley Fool recommends the following options: long January 2026 $395 calls on Microsoft and short January 2026 $405 calls on Microsoft. The Motley Fool has a disclosure policy.\n\nThese 3 Companies Have Collectively Repurchased $1.07 Trillion of Their Own Stock Since the Start of 2013 was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/3-companies-collectively-repurchased-1-080600044.html", "symbols": ["AAPL.US", "GOOG.US", "GOOGL.US", "MSFT.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.032, "neu": 0.848, "pos": 0.12}}, {"date": "2024-03-19T07:32:07+00:00", "title": "11 Best Dividend ETFs To Buy", "content": "In this article, we discuss 11 best dividend ETFs to buy. If you want to skip our discussion on dividend-paying companies, head over to 5 Best Dividend ETFs To Buy.\n\nReutersreported that global corporate dividends reached a record high of $1.66 trillion in 2023, largely due to substantial contributions from banks. According to the Janus Henderson Global Dividend Index, nearly 86% of listed companies worldwide either increased or maintained their dividends. Projections from the same index indicate that dividend payouts are set to hit a new peak of $1.72 trillion this year. Microsoft Corporation (NASDAQ:MSFT) emerged as the leading dividend payer in 2023, followed closely by Apple Inc. (NASDAQ:AAPL) and Exxon Mobil Corporation (NYSE:XOM). The overall value of corporate dividends saw a 5% increase from 2022 to 2023, totaling $1.57 trillion. Ben Lofthouse, head of global equity income at Janus Henderson, attributed this growth to robust corporate cash flow, driving dividends and share buybacks.\n\nMoreover, high interest rates boosted bank margins, resulting in a record $220 billion payout to shareholders in 2023. However, this positive trend was counteracted by significant dividend cuts in the mining sector, primarily due to lower commodity prices. Although the rapid ascent of bank dividends may decelerate, declines in the mining sector are expected to have a reduced impact. Despite challenges in specific sectors, diverse industries such as vehicles, utilities, software, food, and engineering demonstrated promising growth. Geographically, Europe (excluding the UK) and Japan played pivotal roles in global dividend growth, with Europe witnessing a 10.4% increase in payouts. The United States, while making a substantial contribution to global dividend growth owing to its size, reported a growth rate in line with the global average at 5.1%. Conversely, emerging markets observed stagnant dividends, with Brazil facing substantial cuts and China experiencing lackluster growth.\n\nStory continues\n\nThe Federal Reserve responded to the rise in inflation, spurred by monetary easing during the COVID-19 pandemic, by steadily increasing interest rates throughout 2023. This move had significant ramifications, leading to heightened borrowing costs for companies amid escalating interest rates and inflationary pressures. S&P Global Market Intelligencereported that there was a notable 59% increase in the number of companies filing for bankruptcy in 2023, compared to the previous year, nearing levels observed during the pandemic's peak. However, the anticipated growth in regular dividends in the US market averages around 5.8%, aligning with the 10-year compound annual growth rate (CAGR) of 5.7% since 2014. The energy sector leads variable dividends, driven by a shift towards performance-based shareholder return policies since 2019. In 2022, over 20 energy companies disbursed a record $20 billion in variable dividends, benefiting from elevated oil and gas prices. However, in 2023, companies favored share repurchases due to lower valuation. The size of variable dividends in 2024 will hinge on oil and gas price volatility, demand, and its impact on share prices. The five largest sectors collectively contribute nearly 40% of total dividends and 2.05% in the estimated 5.8% growth, with real estate mandated to distribute the majority of its earnings.\n\nLately, investors are showing renewed interest in dividend-paying stocks this year after a period of decline in 2023, despite robust returns in the US stock market. Last year, rising interest rates led investors to favor bonds over stocks with smaller payouts, while mega-cap tech stocks attracted attention due to artificial intelligence hype. The S&P 500 Dividend Aristocrats index saw a modest 5.7% increase compared to the broader S&P 500 total return index's 26% gain. However, with recent declines in yields and the possibility of interest rate cuts by the Federal Reserve, dividend stocks are gaining traction again. Analysts suggest that investors are seeking stable, higher-yielding dividends amidst ongoing market volatility, particularly during an easing cycle. Companies that raise their dividends often receive favorable attention from investors, as evidenced by recent examples such as Lennar Corporation (NYSE:LEN) and Mastercard Incorporated (NYSE:MA), whose stock prices increased following dividend hikes and share buyback announcements. Historical data indicates that companies increasing dividends tend to outperform in the stock market, while those lowering dividends may face underperformance.\n\nSome of the best dividend stocks to buy include Johnson & Johnson (NYSE:JNJ), JPMorgan Chase & Co. (NYSE:JPM), and Exxon Mobil Corporation (NYSE:XOM). However, this article includes the best dividend ETFs to buy, which also expose investors to top stocks in the industry.\n\nOur Methodology\n\nWe curated our list of the best dividend ETFs by choosing consensus picks from multiple credible websites. We have mentioned the 5-year share price performance of each ETF as of March 15, 2024, ranking the list in ascending order of the share price. We have also discussed the top holdings of the ETFs to offer better insight to potential investors.  11 Best Dividend ETFs To Buy\n\nPhoto by Viacheslav Bublyk on Unsplash\n\nBest Dividend ETFs To Buy\n\n11. SPDR S&P Dividend ETF (NYSE:SDY)\n\n5-year Share Price Performance as of March 15: 30.21%\n\nSPDR S&P Dividend ETF (NYSE:SDY) aims to track the performance of the S&P High Yield Dividend Aristocrats Index, which includes companies that have raised their dividends for at least 20 consecutive years. The ETF's portfolio consists of 136 stocks. As of March 14, 2024, SPDR S&P Dividend ETF (NYSE:SDY) had $20.5 billion in assets under management and an expense ratio of 0.35%. Established on November 8, 2005, it offers exposure to companies with both capital growth and dividend income characteristics. SPDR S&P Dividend ETF (NYSE:SDY) is one of the best dividend ETFs to invest in.\n\n3M Company (NYSE:MMM) is the largest holding of SPDR S&P Dividend ETF (NYSE:SDY). 3M is a global technology services provider operating through four segments – Safety and Industrial, Transportation and Electronics, Health Care, and Consumer. On March 13, 3M Company (NYSE:MMM) stock surged 5% to a two-month high after CEO Mike Roman said he expects a higher first-quarter profit of as much as $2.20 per share, up from $2.15. This increase is due to interest earned on debt raised for the spinoff of Solventum as an independent healthcare company.\n\nAccording to Insider Monkey’s fourth quarter database, 62 hedge funds were long 3M Company (NYSE:MMM), compared to 54 funds in the last quarter. Dmitry Balyasny’s Balyasny Asset Management is the largest stakeholder of the company, with 2.65 million shares worth approximately $290 million.\n\nIn addition to Johnson & Johnson (NYSE:JNJ), JPMorgan Chase & Co. (NYSE:JPM), and Exxon Mobil Corporation (NYSE:XOM), 3M Company (NYSE:MMM) is one of the best dividend stocks to buy.\n\n10. WisdomTree U.S. MidCap Dividend Fund (NYSE:DON)\n\n5-year Share Price Performance as of March 15: 31.35%\n\nWisdomTree U.S. MidCap Dividend Fund (NYSE:DON) ranks 10th on our list of the best dividend ETFs. WisdomTree U.S. MidCap Dividend Fund (NYSE:DON) aims to mirror the performance of dividend-paying mid-cap companies in the US equity market. It offers investors exposure to a wide array of dividend-paying firms in this segment, catering to both growth potential and income objectives. As of March 14, 2024, the fund had total assets of $3.5 billion and an expense ratio of 0.38%. Established on June 16, 2006, it provides a distribution yield of 1.54% and a SEC 30-day yield of 2.37%.\n\nVistra Corp. (NYSE:VST) is the largest holding of WisdomTree U.S. MidCap Dividend Fund (NYSE:DON). It is an integrated retail electricity and power generation company operating in the United States and the District of Columbia. On February 23, Vistra Corp. (NYSE:VST) declared a $0.215 per share quarterly dividend, a 0.9% increase from its prior dividend of $0.213. The dividend is payable on March 29, to shareholders on record as of March 20.\n\nAccording to Insider Monkey’s fourth quarter database, 56 hedge funds were bullish on Vistra Corp. (NYSE:VST), compared to 52 funds in the last quarter. Dan Loeb’s Third Point is the largest stakeholder of the company, with 4.60 million shares worth $177.2 million.\n\nSound Shore Management made the following regarding Vistra Corp. (NYSE:VST) in its fourth quarter 2023 investor letter:\n\n“For the year, we had a number of stocks up 50% or more and the list includes a diverse set of industries such as homebuilding, heavy truck manufacturing, and semiconductor capital equipment. We would like to highlight one outstanding contributor for the year, electricity generator and marketer Vistra Corp. (NYSE:VST), a low-cost provider with a healthy balance between generation and retail. Demand for electricity is growing and notably, load peaks are changing as well. As the country brings on more renewables and adjusts to greater demand later in the day due to increased use of electric heat pumps and electric car charging, reliable clean power is at a premium. Vistra is well positioned with diversified fuel sources including solar, natural gas, coal, nuclear and battery power storage facilities, along with a marketing division to manage price volatility. The company will soon be closing its accretive acquisition of merchant power generator, Energy Harbor, and the deal will make Vistra the second largest carbon free, nuclear electricity provider behind Constellation Energy, another portfolio holding. Vistra CEO Jim Burke, leads a veteran utility management team that is committed to transitioning the company’s portfolio to a sustainable footprint by closing older fossil fuel plants and increasing the renewables portfolio. They have also been an important voice to advocate for changes that will accelerate the global transition to a clean, renewable energy future, while maintaining adequate near-term supply. Vistra has a strong balance sheet that allows the company to invest in innovation and operational improvements. Additionally, management is using excess cash flow to buy 40% of the outstanding shares over a five year period and they are more than half way through that process. Currently valued at 9 times earnings with a 17% free cash flow yield and a 2.3% dividend, the stock remains a full position. As you can see from the chart below, Vistra’s performance was quite different than many other electricity providers and provides further evidence of the disparate performance that can often be found within a sector.”\n\n9. Vanguard High Dividend Yield Index Fund ETF Shares (NYSE:VYM)\n\n5-year Share Price Performance as of March 15: 36.14%\n\nVanguard High Dividend Yield Index Fund ETF Shares (NYSE:VYM) aims to replicate the performance of the FTSE High Dividend Yield Index, which measures the returns of stocks with high dividend yields. It offers investors an easy way to track stocks with anticipated above-average dividend yields. The ETF follows a passive management strategy, utilizing a full-replication approach. The fund has an expense ratio of 0.06% and a 30-day SEC yield of 3.02%, along with a portfolio of 451 stocks as of February 29, 2024. Vanguard High Dividend Yield Index Fund ETF Shares (NYSE:VYM) is one of the best dividend ETFs to buy.\n\nBroadcom Inc. (NASDAQ:AVGO) is the largest holding of Vanguard High Dividend Yield Index Fund ETF Shares (NYSE:VYM). Broadcom Inc. (NASDAQ:AVGO) plans to boost revenue in 2024, focusing on networking and artificial intelligence offerings. Analysts express positivity towards the company's fiscal year 2024 guidance. Mizuho reaffirmed a Buy rating and increased its price target on Broadcom Inc. (NASDAQ:AVGO) from $1,550 to $1,625 on March 8.\n\nAccording to Insider Monkey’s fourth quarter database, 91 hedge funds were bullish on Broadcom Inc. (NASDAQ:AVGO), compared to 87 funds in the previous quarter.\n\nCarillon Eagle Growth & Income Fund stated the following regarding Broadcom Inc. (NASDAQ:AVGO) in its fourth quarter 2023 investor letter:\n\n“Broadcom Inc. (NASDAQ:AVGO) traded higher after closing on its acquisition of VMware. The company also announced earnings that were relatively in line with estimates with some benefit of better operating expenses. The stock appears to be one of the first real beneficiaries of generative artificial intelligence (AI) with meaningful revenue expected to show up in 2024.”\n\n8. ProShares S&P 500 Dividend Aristocrats ETF (CBOE:NOBL)\n\n5-year Share Price Performance as of March 15: 47.80%\n\nProShares S&P 500 Dividend Aristocrats ETF (CBOE:NOBL) aims to mirror the performance of the S&P 500 Dividend Aristocrats Index, focusing solely on high-quality companies within the S&P 500 that have consistently increased dividends for at least 25 consecutive years. Established on October 9, 2013, ProShares S&P 500 Dividend Aristocrats ETF (CBOE:NOBL) has an expense ratio of 0.35% as of February 29, 2024, and holds a portfolio of 67 stocks. It offers a distribution yield of 2.71% and a 30-day SEC yield of 2.11%. ProShares S&P 500 Dividend Aristocrats ETF (CBOE:NOBL) is one of the best dividend ETFs to buy.\n\nDover Corporation (NYSE:DOV) is the largest holding of ProShares S&P 500 Dividend Aristocrats ETF (CBOE:NOBL). Dover Corporation (NYSE:DOV) is a global provider of different equipment, components, consumable supplies, aftermarket parts, software, digital solutions, and support services. On February 8, the company declared a quarterly dividend of $0.51 per share, in line with previous. The dividend was paid on March 15.\n\nAccording to Insider Monkey’s fourth quarter database, 21 hedge funds were bullish on Dover Corporation (NYSE:DOV), same as the prior quarter. Phill Gross and Robert Atchinson’s Adage Capital Management is the largest stakeholder of the company, with 1.90 million shares worth $293.75 million.\n\n7. T. Rowe Price Dividend Growth ETF (NYSE:TDVG)\n\n5-year Share Price Performance as of March 15: 48.18%\n\nRowe Price Dividend Growth ETF (NYSE:TDVG) primarily invests at least 80% of its assets in stocks with a history of paying dividends or those that are expected to do so over time. As of March 14, 2024, T. Rowe Price Dividend Growth ETF (NYSE:TDVG) has an expense ratio of 0.50% and net assets totaling $395 million. It is one of the best dividend ETFs to invest in.\n\nMicrosoft Corporation (NASDAQ:MSFT) is the top holding of T. Rowe Price Dividend Growth ETF (NYSE:TDVG). JPMorgan analysts, led by Mark Murphy, believe that Microsoft Corporation (NASDAQ:MSFT)’s Copilot for Security artificial intelligence chatbot is revolutionizing the company's security capabilities. They perceive Microsoft's strong emphasis on AI at its flagship security event as indicative of the potential impact on enhancing the company's differentiation in the market. The analysts maintain an Overweight rating on Microsoft Corporation (NASDAQ:MSFT) shares and set a price target of $440 on March 14.\n\nAccording to Insider Monkey’s fourth quarter database, 302 hedge funds were bullish on Microsoft Corporation (NASDAQ:MSFT), compared to 306 funds in the last quarter. Bill & Melinda Gates Foundation Trust is the largest stakeholder of the company, with 38.2 million shares worth $14.3 billion.\n\nCarillon Eagle Growth & Income Fund stated the following regarding Microsoft Corporation (NASDAQ:MSFT) in its fourth quarter 2023 investor letter:\n\n“Microsoft Corporation (NASDAQ:MSFT) performed well after reporting strong earnings supported by accelerated growth from Azure. The cloud business is seeing consistent trends from optimization while AI has contributed strongly to its growth.”\n\n6. Fidelity High Dividend ETF (NYSE:FDVV)\n\n5-year Share Price Performance as of March 15: 49.18%\n\nFidelity High Dividend ETF (NYSE:FDVV) aims to mirror the performance of the Fidelity High Dividend Index before fees and expenses. The index is structured to represent large and mid-cap dividend-paying companies expected to sustain and increase their dividends. Established on September 12, 2016, Fidelity High Dividend ETF (NYSE:FDVV) had net assets totaling $2 billion as of December 31, 2023, with a portfolio comprising 97 stocks. Its expense ratio stands at 0.15%. Fidelity High Dividend ETF (NYSE:FDVV) is one of the best dividend ETFs to buy.\n\nApple Inc. (NASDAQ:AAPL) is the largest holding of Fidelity High Dividend ETF (NYSE:FDVV). On March 14, Apple Inc. (NASDAQ:AAPL) acquired Canadian artificial intelligence startup DarwinAI. This acquisition aims to boost Apple's generative AI capabilities as it competes in the field against rivals like Microsoft and Alphabet's Google.\n\nAccording to Insider Monkey’s fourth quarter database, 131 hedge funds were long Apple Inc. (NASDAQ:AAPL), compared to 134 funds in the last quarter. Warren Buffett’s Berkshire Hathaway is the largest stakeholder of the company, with 905.56 million shares worth $174.3 billion.\n\nIn addition to Johnson & Johnson (NYSE:JNJ), JPMorgan Chase & Co. (NYSE:JPM), and Exxon Mobil Corporation (NYSE:XOM), Apple Inc. (NASDAQ:AAPL) is one of the best dividend stocks to invest in.\n\nHorizon Kinetics stated the following regarding Apple Inc. (NASDAQ:AAPL) in its fourth quarter 2023 investor letter:\n\n“The full point is that if BYD has turned its attention from its domestic market to direct global competition, then other Chinese companies can do the same. The next most visible example of Chinese commercially applied technological prowess relates to the 2nd highest-weight company in the S&P 500, Apple Inc. (NASDAQ:AAPL).\n\nIn September 2023, Huawei Technologies introduced its Mate 60 Pro smartphone. It uses its own, internally developed 5G enabled chip that is apparently competitive with the Apple A17 chip. For practical purposes it has the functionality of the iPhone 15 Pro. This came as a great surprise – perhaps even shock – to the U.S. technology community, because four years ago the U.S. placed strict sanctions on China’s access to state-of-the-art semiconductor manufacturing technology…”\n\nClick to continue reading and see 5 Best Dividend ETFs To Buy.\n\nSuggested articles:\n\nForget Magnificent Seven: Jim Cramer Likes These ‘Super 7’ European Stocks 12 Best Artificial Intelligence (AI) Stocks To Buy According to Financial Media 11 Oversold Energy Stocks You Can Buy Right Now\n\nDisclosure: None. 11 Best Dividend ETFs To Buy is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/11-best-dividend-etfs-buy-073207211.html", "symbols": ["0QYP.IL", "0R2V.IL", "0V6.F", "0V6.STU", "0YXG.LSE", "1YD.BE", "1YD.DU", "1YD.F", "1YD.HA", "1YD.HM", "1YD.MU", "1YD.STU", "1YD.XETRA", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.012, "neu": 0.834, "pos": 0.154}}, {"date": "2024-03-19T00:00:00+00:00", "title": "\nAdam Spatacco  |  Mar 19, 2024\n", "content": "Apple's AI vision is becoming more clear with its recent acquisition of DarwinAI.", "link": "https://www.fool.com/investing/2024/03/19/amid-rumors-of-a-deal-with-rivian-apple-acquired-t/", "symbols": ["AAPL.US"], "tags": [], "sentiment": {"polarity": 0.595, "neg": 0, "neu": 0.693, "pos": 0.307}}, {"date": "2024-03-19T00:00:00+00:00", "title": "Wall Street&#039;s Favorite Blue-Chip Stocks? 3 Tickers That Are Practically Money Machines", "content": "Here are three top blue chip stocks analysts continue to pound the table on, that long-term investors can go without at their own peril.", "link": "https://investorplace.com/2024/03/wall-streets-favorite-blue-chip-stocks-3-tickers-that-are-practically-money-machines/", "symbols": ["AAPL.US", "BRK-B.US", "META.US"], "tags": [], "sentiment": {"polarity": -0.226, "neg": 0.102, "neu": 0.83, "pos": 0.068}}, {"date": "2024-03-19T00:00:00+00:00", "title": "\nKeith Speights  |  Mar 19, 2024\n", "content": "Both of these tech giants could win with incorporating Google Gemini into Apple's iPhones.", "link": "https://www.fool.com/investing/2024/03/19/apple-and-google-could-team-up-on-generative-ai-he/", "symbols": ["AAPL.US"], "tags": [], "sentiment": {"polarity": 0.586, "neg": 0, "neu": 0.774, "pos": 0.226}}, {"date": "2024-03-19T00:00:00+00:00", "title": "\nSean Williams  |  Mar 19, 2024\n", "content": "One industry-leading company has spent north of $650 billion on share repurchases since 2013.", "link": "https://www.fool.com/investing/2024/03/19/3-companies-repurchase-107-trillion-own-stock-2013/", "symbols": ["AAPL.US"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.855, "pos": 0.145}}, {"date": "2024-03-19T00:00:00+00:00", "title": "3 Augmented Reality Stocks That Could Soar as AR Goes Mainstream", "content": "Augmented reality stocks could begin to heat up as new products, platforms and mass adoption get improved with time.", "link": "https://investorplace.com/2024/03/3-augmented-reality-stocks-that-could-soar-as-ar-goes-mainstream/", "symbols": ["AAPL.US", "META.US", "SNAP.US"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0, "neu": 0.853, "pos": 0.147}}, {"date": "2024-03-18T21:45:48+00:00", "title": "Nvidia bringing its Omniverse technology to Apple's Vision Pro headset", "content": "Nvidia (NVDA) says that it is bringing its Omniverse enterprise technology to Apple’s (AAPL) Vision Pro AR/VR headset. The graphics chip giant announced the news during its annual GTC conference in San Jose on Monday.\n\nThe idea is to let developers use Nvidia’s Omniverse tools in an AR/VR setting via the Vision Pro. Nvidia’s Omniverse is a platform that allows programmers to create digital twins of objects and locations that they can use to determine how they’ll behave or look in the real world.\n\nNvidia says organizations can use its Omniverse tool to create things like factories in a digital space so that they can understand how workers will move around the facility before they ever put shovels into the ground.\n\nDuring GTC, Nvidia showed how a designer could use a car configuration tool via the Vision Pro to manipulate different aspects of a vehicle and then virtually step into it.\n\nThe company says it’s able to do this via its Omniverse Cloud APIs, or application programming interfaces, and its Graphics Delivery Network that streams directly to the Vision Pro via the cloud. A customer uses Apple's Vision Pro headset at the Apple Fifth Avenue store in Manhattan in New York City, Feb. 2, 2024. (Brendan McDermid/REUTERS) (REUTERS / Reuters)\n\n“Apple Vision Pro is the first untethered device which allows for enterprise customers to realize their work without compromise,” Rev Lebaredian, Nvidia vice president of simulation, said in a statement. “We look forward to our customers having access to these amazing tools.”\n\nThe move is a win for both Nvidia and Apple. It ensures that Nvidia’s Omniverse is available on Apple’s high-end headset and gives Apple’s Vision Pro another enterprise offering.\n\nApple's $3,499 Vision Pro is too pricy for most consumers, but enterprise customers, for the most part, can more easily swallow that kind of price. Plus, bringing Nvidia's Omniverse technology to the headset makes it a far more attractive purchase.\n\nWhether that means Apple will see a meaningful sales jump, however, remains to be seen. If it does, it could provide a powerful business line for the Vision Pro and Apple's bottom line.\n\nStory continues Subscribe to the Yahoo Finance Tech newsletter. (Yahoo Finance)\n\nDaniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley.\n\nClick here for the latest technology news that will impact the stock market.\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/nvidia-bringing-its-omniverse-technology-to-apples-vision-pro-headset-220007689.html", "symbols": ["0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F"], "tags": [], "sentiment": {"polarity": 0.983, "neg": 0, "neu": 0.908, "pos": 0.092}}, {"date": "2024-03-18T19:26:52+00:00", "title": "Apple, Google in talks for Gemini to power iPhone AI features: report", "content": "Apple is in talks with Google to use its new Gemini artificial intelligence models to power the AI features for iPhones after previously discussing the prospect with ChatGPT maker OpenAI, according to a new report.\n\nCiting people familiar, Bloomberg reported Monday that Apple is in \"active negotiations\" with Alphabet-owned Google's Gemini to run new features coming to iPhone software, but any potential deal would likely not be announced until Apple's Worldwide Development Conference (WWDC) in June. Apple is reportedly in talks with Google to use its Gemini artificial intelligence models to power upcoming features in iPhones.\n\nNeither Apple nor Google immediately responded to FOX Business' requests for comment on the report.\n\nMICROSOFT TELLS EUROPEAN REGULATORS GOOGLE HAS AN EDGE IN GENERATIVE AI\n\nA possible deal between the firms could help Google expand the use of its AI services to more than 2 billion active Apple devices, boosting the search giant's efforts to catch up with Microsoft-backed OpenAI.\n\nIt could also help allay investor fears about the slow roll-out of AI apps by Apple, which has lost the crown of the world's most valuable firm after a 10% decline in its shares this year.\n\nREAD ON THE FOX BUSINESS APP\n\nIS GOOGLE TOO BROKEN TO BE FIXED? INVESTORS ‘DEEPLY FRUSTRATED AND ANGRY,’ FORMER INSIDER WARNS\n\nThe firms have a years-long partnership that makes Google the default search engine on Apple's Safari web browser, and a genAI tie-up may help the Alphabet unit navigate fears that services like ChatGPT could threaten its search dominance. Apple previously spoke with OpenAI about the possibility of using its ChatGPT chatbot to run iPhone AI features, according to Bloomberg.\n\nBut the agreement could also invite sharper scrutiny from U.S. regulators, who have sued Google alleging it unlawfully stifled competition by paying billions of dollars to Apple to maintain its search dominance.\n\nGOOGLE RELEASES NEW GEMINI UPDATE TO GIVE USERS ‘MORE CONTROL’ OVER AI CHATBOT RESPONSES\n\nApple CEO Tim Cook said last month that the iPhone maker was investing \"significantly\" in generative AI and would reveal more about its plans to put the technology to use later this year.\n\nStory continues Apple CEO Tim Cook looks at a new iPhone 14 Pro during an Apple special event on September 07, 2022 in Cupertino, California.\n\nThe Bloomberg report said Apple was planning to use its own homegrown AI models for some new capabilities in its upcoming iOS 18, but was seeking a partner to power genAI features, including functions for creating images and writing essays based on simple prompts.\n\nReuters contributed to this report.\n\nOriginal article source:Apple, Google in talks for Gemini to power iPhone AI features: report", "link": "https://finance.yahoo.com/news/apple-google-talks-gemini-power-192652851.html", "symbols": ["0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU"], "tags": [], "sentiment": {"polarity": 0.973, "neg": 0.062, "neu": 0.821, "pos": 0.117}}, {"date": "2024-03-18T18:59:38+00:00", "title": "Giving up oil is a ‘fantasy’, says Saudi Aramco chief", "content": "Amin Nasser, chief executive of Saudi Aramco - Aaron M. Sprecher/Bloomberg\n\nDitching oil and gas is a “fantasy” amid increasing demand, one of the world’s most powerful oil and gas bosses has said.\n\nAmin Nasser, chief executive of Saudi Aramco, said the transition to net zero is “visibly failing” with oil demand set to rise for “some time to come”.\n\n“The current discourse on energy transition ignores this reality,” he told the CERAWeek conference in Texas.\n\n“The world should abandon the fantasy of phasing out oil and gas.”\n\nRising demand from developing economies could feed oil demand growth through 2045, he said.\n\nThis forecast for long-term demand growth is in line with forecasts from Opec and in contrast to the 2030 forecast for peak demand from the West’s energy watchdog, the International Energy Agency.\n\nADVERTISEMENT\n\nThe two are far apart on both short-term and long-term demand forecasts, in part because of their contrasting views on the energy transition.\n\nReducing greenhouse gas emissions from hydrocarbons through carbon capture and other technologies achieves better results than alternative energies, Nasser said.\n\nNew energy sources and technologies should only be introduced when they are genuinely ready, and economically competitive, he added.\n\nWithout government subsidies, electric vehicles are as much as 50pc more expensive than internal-combustion cars, he added. “They cannot be subsidised forever.”\n\nRead the latest updates below.\n\n06:59 PM GMT\n\nSigning off...\n\nThanks for joining us today. Chris Price will be back in the morning, but I’ll leave you with some of the latest pieces from elsewhere at The Telegraph:\n\nHeathrow has lost its status as a global transport hub, says Dubai Airports boss Cut borrowing or face debt crisis, warns top central banker Don’t use ‘threatening’ tone when chasing debts to protect borrowers’ mental health, companies told\n\n06:14 PM GMT\n\nDirty Martini owner reveals higher losses\n\nCocktail bar operator Nightcap has revealed higher losses and cautioned over “challenging” trading since the start of the year.\n\nStory continues\n\nIts boss, the former Dragons’ Den panellist Sarah Willingham, said conditions will remain challenging for the next few months. But she predicted it will see a gradual recovery later this year after expected reductions in inflation, energy costs and interest rates.\n\nThe group, which owns Cocktail Club and Dirty Martini venues, revealed sales of £33.4m for the six months to December 31, compared with £23.5m over the same period a year earlier.\n\nSales were boosted by the group’s continued expansion through acquisitions.\n\nNightcap also confirmed that it dropped to a £1.8m pre-tax loss for the past half-year, from a £0.9m loss a year earlier.\n\n05:21 PM GMT\n\nLionised British entrepreneur Mike Lynch arrives at fraud trial\n\nMike Lynch, former chief executive of  Autonomy, pictured, has arrived at a Federal court in San Francisco today.\n\nMr Lynch has been charged with 16 counts of fraud related to the sale of Autonomy, the former FTSE 100 software company, to Hewlett Packard in 2011. He denies the charges.\n\nThe Silicon Valley company wrote down almost all the value of the £7bn deal a year later and claimed accounting improprieties.\n\nUS prosecutors allege that Autonomy executives inflated the company’s value with illegal accounting practices, while Mr Lynch has insisted that HP destroyed value by mismanaging the company. Mike Lynch Mike Lynch - Loren Elliott/Bloomberg\n\n05:18 PM GMT\n\nGiving up oil is a ‘fantasy’, says Saudi Aramco chief\n\nDitching oil and gas is a “fantasy” amid increasing demand, one of the world’s most powerful oil and gas bosses has said.\n\nAmin Nasser, chief executive of Saudi Aramco, said the transition to net zero is “visibly failing” with oil demand set to rise for “some time to come”.\n\n“The current discourse on energy transition ignores this reality,” he told the CERAWeek conference in Texas.\n\n“The world should abandon the fantasy of phasing out oil and gas.”\n\nRising demand from developing economies could feed oil demand growth through 2045, he said.\n\nThis forecast for long-term demand growth is in line with forecasts from Opec and in contrast to the 2030 forecast for peak demand from the West’s energy watchdog, the International Energy Agency.\n\nThe two are far apart on both short-term and long-term demand forecasts, in part because of their contrasting views on the energy transition.\n\nReducing greenhouse gas emissions from hydrocarbons through carbon capture and other technologies achieves better results than alternative energies, Nasser said.\n\nNew energy sources and technologies should only be introduced when they are genuinely ready, and economically competitive, he added.\n\nWithout government subsidies, electric vehicles are as much as 50pc more expensive than internal-combustion cars, he added. “They cannot be subsidised forever.”\n\n05:04 PM GMT\n\nFootsie flat\n\nThe FTSE 100 closed down 0.06pc today. Insurer Beazley was the biggest riser, up 2.97pc, followed by British American Tobacco, up 2.50pc. The biggest faller was pensions firm Phoenix, down 4.50pc, followed by Vodafone, down 3.61pc.\n\nThe FTSE 250 was down 0.14pc. The biggest riser was Currys, up 6.01pc, followed by PPHE Hotel Group, up 5.99pc. The biggest faller was landscaping products seller Marshalls, down 8.53pc, followed by software supplier Bytes Technology, down 7.50pc.\n\n04:42 PM GMT\n\nEasyJet will grow ‘more than any other European airline’ as it avoids aircraft shortages\n\nEasyJet expects to grow “more than any other European airline this summer,” and bookings for the busy travel period are strong, chief executive Johan Lundgren has claimed.\n\nThe British carrier is still on track to grow 8pc this summer, he said.\n\nPassenger capacity at EasyJet is set to return to pre-pandemic levels later this year, while business travel is picking up quickly and could potentially reach 2019 levels as well, he added.\n\nEasyJet has managed to avoid the delivery delays and aircraft shortages that have dogged customers of Boeing, as well as Airbus operators that use Pratt & Whitney geared turbofan engines on its A320-series jets.\n\n“It is a difficult environment, but certainly I think we will be better off than any competitor,” Lundgren said.\n\nLow-cost leader Ryanair was forced to reduce its annual passenger forecast this year due to Boeing 737 Max delays. Another budget rival, Wizz Air, has had to ground some of its A320-family planes because of issues with Pratt turbines.\n\nEasyJet’s all-Airbus fleet is powered by engines from CFM International and hasn’t been hit by those snags.\n\nEasyJet on Monday opened its first UK base in more than a decade at Birmingham Airport. EasyJet boss Johan Lundgren on the tarmac of Birmingham airport earlier today - Joanna Plucinska/Reuters\n\n04:26 PM GMT\n\nApple may not be able to catch up on AI, says analyst\n\nApple is in advanced negotiations with Google to adopt its powerful Gemini AI models for the iPhone, which has sent Google’s share price up 5.6pc today. Apple shares are up 1.5pc.\n\nBut according to Colin Sebastian, an analyst at Baird, this risks concentrating power in Google’s hands. He said:\n\nFor Google, any hypothetical deal with Apple could mean they essentially “own” generative AI on mobile devices (Android and iOS).\n\nIt also means Apple may not be in a position to catch-up to GenAI leaders, at least not in the next generation of devices. Google could essentially 'own' generative artificial intelligence on mobile phones - Elijah Nouvelage/AFP\n\n04:20 PM GMT\n\nChina’s property crisis deepens as housing sales plummet\n\nChina’s property crisis deepened last month as housing sales plunged and builders cut back on new developments. Deputy economics editor Tim Wallace reports:\n\nChallenges across the country’s real estate sector were laid bare in new figures for February that revealed properties sold fell by more than a fifth year-on-year.\n\nThis led to a 9pc drop-off in overall investment across the real estate sector, which continues to struggle under the weight of an underwhelming recovery from Covid.\n\nThe amount of floorspace under construction in China was also down 29.7pc year-on-year.\n\nLynn Song, economist at ING, said confidence in the industry remains weak, as he warned that the property market will keep shrinking through 2024.\n\n“The sentiment index has yet to bottom out as well, falling further from 93.34 at the end of 2023 to 92.13 in February, a new all-time low,” he said.\n\n“With little sign of a turnaround in sentiment so far, we expect property to remain a major drag on growth this year.”\n\nThe data came as Hui Ka Yan, the founder and former chairman of property giant Evergrande, was given a lifetime ban from participating in China’s stock markets.\n\nRead the full story... Workers on a rooftop of a residential building under construction in Nanjing, in eastern China's Jiangsu province, earlier this month - STR/AFP via Getty Images\n\n04:11 PM GMT\n\nDemand for liquefied natural gas is rising, says Shell boss\n\nGlobal demand for liquefied natural gas (LNG) is picking up due to a recent fall in prices, Shell chief Wael Sawan said today at a conference in Houston.\n\nLNG shipping has seen little impact from attacks by Houthi rebels in the Red Sea, he said.\n\nThe LNG market will be well supplied in the second half of the decade, he added. The boss of rival TotalEnergies meanwhile warned of near-term tightness in the LNG market that would not abate until 2026.\n\n04:07 PM GMT\n\nUS technology giants push higher\n\nMost high-tech growth stocks have jumped today, with Google-owner Alphabet gaining 8.8pc after a report that Apple is in talks to build Google’s Gemini AI engine into the iPhone.\n\nTesla rose 5.8pc after the electric carmaker said it would increase the price of its Model Y electric cars in some European countries on March 22, by approximately £1,700.\n\nFocus will also be on AI-darling Nvidia, which kicks off its annual developer conference, with investors focused on potential new chip announcements from chief executive Jensen Huang in a keynote address. The chipmaker climbed 0.8pc.\n\nRivals Micron Technology and Intel added 1.8pc and 0.21pc, respectively, while the Philadelphia Semiconductor index climbed 0.5pc.\n\n04:02 PM GMT\n\nShares drop in Sensodyne-owner Haleon as founders sell out\n\nThis morning we reported on news that Pfizer plans to sell around 630m shares in Haleon in the coming weeks. This will take Pfizer’s stake in Haleon down to 24pc from 32pc, which follows sell-offs by Pfizer’s joint venture partner GSK.\n\nHannah Boland has more on how the founders have been selling out:\n\nOn its debut, around 45pc of shares in the company were held by GSK and Pfizer, which had created the company in 2019 as a joint venture of their consumer health businesses.\n\nThe planned share sale marks the first step in Pfizer’s push to exit its position. It previously said it would do so “in a disciplined manner” to maximise value for its own shareholders.\n\nHaleon owns brands including Centrum vitamins, Sensodyne toothpaste and Panadol pain relief. It recently sold off its Lamisil antifungal cream and Chapstick brands as it focuses on reducing its debt pile. By the end of 2023, it had reduced its debt by more than £2bn since its spin-off from GSK.\n\nGSK has already started selling down its position in Haleon. Last May, it sold 240m shares, taking its stake from 13pc down to 10.3pc . In October, it offloaded another 270m worth of shares and cut its position to 4.2pc in January this year.\n\nPfizer’s decision to start paring its stake back comes as it looks to focus more on its medicines and vaccines.\n\nThe US drugmaker is currently battling to bolster its pipeline of treatments after the end of a boost from the Covid pandemic, when it sold billions of dollars worth of its jabs. GSK and Pfizer have been selling out of their consumer healthcare joint venture - Simon Dawson/Bloomberg\n\n03:53 PM GMT\n\nSoho House shares jump amid takeover discussions\n\nSoho House, the group of private members clubs, could be taken private, according to report.\n\nReuters said that CC Capital is one of the suitors in talks to take the group private.\n\nShares in Soho House, which is listed in New York, are up more than 15pc today.\n\nReuters reported that the talks with CC Capital have been on and off since late last year, and a deal is uncertain, the sources said.\n\nSoho Executive Chairman Ron Burkle’s investment firm Yucaipa and Soho founder Nick Jones collectively own about three-quarters of the company.\n\nMr Burkle, in an open letter to Soho shareholders on Monday, reportedly said the stock market, which values Soho at about $1.8bn (£1.4bn), including debt, is not giving the company its true worth. Soho’s stock has lost more than 50pc of its value since the company floated its shares in 2021.\n\nSoho House has been approached for comment. CC Capital declined to comment. The original Soho House on Greek street, London - Peter Nicholls/Reuters\n\n03:42 PM GMT\n\nShares rise amid Japanese hopes\n\nGlobal stocks have jumped today, while Treasury yields crept higher, as investors looked ahead to a raft of central bank meetings this week that could see the end of free money in Japan and a blueprint for US rate cuts this year.\n\nUpbeat industrial output and retail sales data from China have also helped.\n\nIn the United States, the Dow Jones Industrial Average has risen 0.41pc, the S&P 500 gained 0.92pc, and the Nasdaq Composite added 1.28pc.\n\nTuesday could see Japan end the longest run of negative interest rates in history, after its companies decided on the biggest pay hikes in 33 years.\n\nHowever, there is a chance the Bank of Japan might wait for its April meeting, given it will be issuing updated economic forecasts then.\n\nJapan’s Nikkei closed up 2.7pc, while Shanghai’s blue chip index finished up about 1pc.\n\n03:30 PM GMT\n\nPictured: Dyson unveils new £400 hairdryer\n\nI’m heading off now and Alex Singleton will be typing like the wind as he keeps you up to speed with the latest.\n\nSpeaking of which, Sir James Dyson has unveiled his company’s new Supersonic Nural hair dryer which will be unveiled soon.\n\nIt will not come cheap, mind you, retailing at £399.99 soon. Sir James Dyson unveiled the Supersonic Nural hair dryer - JinIl_KIM\n\n03:22 PM GMT\n\nOver half of heat pump grant money unspent as public shun devices\n\nMore than half of the money allocated to government heat pump grants so far has gone unspent as installers battle red tape and lower-than-expected demand from households.\n\nOur industry editor Matt Oliver has the latest:\n\nThrough the boiler upgrade scheme, consumers can claim a voucher worth £7,500 towards the cost of getting a heat pump fitted in their home.\n\nBut despite the scheme getting a budget of £300m for its first two financial years, 58pc of the cash remains unspent after demand fell short of expectations.\n\nFrom the boiler upgrade scheme’s launch in May 2022 to the end of February this year, just £127m of vouchers have been redeemed, according to official figures published on Friday.\n\nThat was after 35,700 voucher applications were received but only 22,300 redeemed.\n\nWith just one month left before the end of the scheme’s second financial year, the numbers fall far short of the 60,000 vouchers the scheme was designed to have funded by this point.\n\nIt also comes after the Government increased the amount of money available in October, from £5,000 per household to £7,500.\n\n03:04 PM GMT\n\nSwitch to renewables ‘visibly failing’ says Saudi oil boss\n\nThe boss of the world’s largest oil company has said the switch to renewable sources of energy is “visibly failing” and the governments should “abandon the fantasy of phasing out oil and gas”.\n\nSaudi Aramco chief executive Amin Nasser told the fossil fuels conference CERAWeek that a peak in worldwide oil demand is unlikely for “for some time to come, let alone 2030,” as forecast by the International Energy Agency.\n\nHe said crude demand would reach an all-time high during the second half of this year, with significant growth potential in developing countries.\n\nHe added that without government subsidies, electric vehicles are as much as 50pc more expensive than internal-combustion cars,\n\nHe said: “They cannot be subsidised forever.”\n\nHe told the conference in Houston:\n\nWe should abandon the fantasy of phasing out oil and gas, and instead invest in them adequately, reflecting realistic demand assumptions.\n\nWe should phase in new energy sources and technologies when they are genuinely ready, economically competitive. Saudi Aramco chief executive Amin Nasser speaks during the CERAWeek oil summit in Houston - MARK FELIX/AFP via Getty Images\n\n02:30 PM GMT\n\nMann reappointed as interest rate setter at Bank of England\n\nOne of the most “hawkish” policymakers at the Bank of England who has consistently voted for interest rate increases has been reappointed to her position.\n\nCatherine Mann will serve a second three-year term on the Monetary Policy Committee (MPC) which sets interest rates, the Treasury announced.\n\nHer first term was due to end later this summer, and she will now remain in place on the nine-member MPC until the end of August 2027.\n\nMs Mann, a former chief economist at the OECD and Citibank, was one of two interest rate setters who still voted to increase borrowing costs further in February, even as another colleague voted for cuts in a three-way split.\n\nThe Bank of England held interest rates steady at 5.25pc and makes its next decision on Thursday. Catherine Mann has been reappointed as an external member of the Monetary Policy Committee - Jason Alden/Bloomberg\n\n02:14 PM GMT\n\nSunak to make UK ‘best place in the world’ to be female entrepreneur\n\nRishi Sunak has set out plans to support female entrepreneurs, cut red tape for businesses, and boost apprenticeships.\n\nThe Prime Minister said he wants the UK to be the “best place in the world” for women to start a business.\n\nHe also pledged to create up to 20,000 more apprenticeships with plans to fully fund training for young people.\n\nSpeaking at a business event in Coventry, Mr Sunak said:\n\nFemale founders receive just 2pc of equity investment and that figure hasn’t budged in a decade.\n\nSo, to change that, we’re announcing a new Invest In Women taskforce led by Hannah Bernard from Barclays and serial entrepreneur Debbie Wosskow. It’s going to raise a female-focused investment fund to address that gap directly.\n\nWe’re going to make the UK the best place in the world to be a female founder.\n\nSo, lower taxes, less admin, better access to finance - that’s how we’re backing our small businesses.\n\n02:02 PM GMT\n\nMusk: If you use too much ketamine you can’t get a lot of work done\n\nAsked whether he ever abuses his ketamine prescription, Elon Musk said: “I don’t think so.”\n\nHe told Don Lemon:\n\nIf you use too much ketamine you can’t really get work done. I have a lot of work.\n\nI typically put in 16-hour days. That’s normal for me. It’s rare for me to even take off a weekend day.\n\nSo I don’t really have a situation where I can be not mentally acute for an extended period of time.\n\nI can’t really get wasted because I can’t get my work done.\n\nHe said he takes a “small amount” once every other week.\n\n01:40 PM GMT\n\nWall Street opens higher ahead of Fed meeting\n\nThe main US stock indexes opened higher amid a rally in megacap growth stocks and chipmakers ahead of the US Federal Reserve’s meeting this week.\n\nThe Dow Jones Industrial Average rose 112.16 points, or 0.3pc, at the open to 38,826.93.\n\nThe S&P 500 opened higher by 37.68 points, or 0.7pc, at 5,154.77, while the Nasdaq Composite gained 181.75 points, or 1.1pc, to 16,154.92 at the opening bell.\n\n01:38 PM GMT\n\nMusk refuses to rule out endorsing Trump after breakfast meeting\n\nElon Musk did not rule out endorsing Donald Trump to be the next US president after admitting that the Republican nominee met him for breakfast at a friend’s house.\n\nMr Musk said Mr Trump “did most of the talking” but he did not recall him saying “anything he hasn’t said publicly”.\n\nHe stold former CNN anchor Don Lemon in an interview on YouTube that he would not make a donation to any candidate in the US presidential elections and the Republican nominee did not ask him for one.\n\nHe said he is not paying Mr Trump’s legal bills “in any way, shape or form”.\n\nHe said:\n\nI may in the final stretch endorse a candidate but I don’t know yet.\n\nI want to make a considered decision before the election and if I do decide to endorse a candidate then I will explain exactly why.\n\n01:21 PM GMT\n\nMusk says ketamine prescription in investors’ best interests\n\nTesla chief exectuve Elon Musk has defended his use of ketamine, saying it is in the best interests of the shareholders in the electric vehicle maker and the other companies that he runs.\n\nThe billionaire entrepreneur, who also leads SpaceX, said that for investors on Wall Street “what matters is execution”.\n\nMr Musk said he takes the drug on prescription to treat what he described as “chemical tides” that lead to depression-like symptoms.\n\nHe told former CNN anchor Don Lemon in an interview on YouTube: “There are times when I have a negative chemical state in my brain, like depression I guess, or depression that’s not linked to any negative news, and ketamine is helpful for getting one out of a negative frame of mind.”\n\nHe added: “From an investor standpoint, if there is something I’m taking, we should keep taking it.”\n\nAn article in the Wall Street Journal in January said that executives at Tesla and SpaceX had grown concerned about his recreational drug use.\n\nThe Don Lemon Show episode 1: Elon Musk\r\n\r\nTIMESTAMPS:\r\n(02:23) News on X\r\n(10:07) Donald Trump and Endorsing a Candidate\r\n(13:04) The New Tesla Roadster\r\n(16:46) Relaxation and Video Games\r\n(17:54) Tweeting and Drug Use\r\n(23:19) The Great Replacement Theory\r\n(30:03) Content Moderation… pic.twitter.com/bLRae4DhyO\n\n— Don Lemon (@donlemon) March 18, 2024\n\n12:56 PM GMT\n\nGoogle in talks to put AI chatbot on every iPhone despite diversity row\n\nGoogle and Apple are in talks over a deal that could see the search engine’s chatbot technology installed on every iPhone, despite a row over the system’s excessive efforts to promote diversity.\n\nOur technology editor James Titcomb has the details:\n\nThe two tech giants are in discussions over licensing parts of Google’s Gemini bot for the iPhone’s built-in AI tools such as its Siri assistant, Bloomberg reported.\n\nA deal would be a major boost to Google, whose chatbot has been under fire for returning allegedly biased answers to questions and for publishing “diverse” images of historical figures by depicting white figures such as Nazi soldiers and Vikings as black.\n\nApple has been developing its own AI features for the next version of the iPhone’s operating system, including a version of Siri powered by “generative AI” technology similar to chatbots such as Gemini and ChatGPT.\n\nRead why a partnership with Google could raise concerns.\n\n12:31 PM GMT\n\nEasyJet launches first new UK hub in 12 years in Birmingham\n\nEasyJet has said its first new UK base in more than a decade will give passengers more travel options and could reduce fares.\n\nThe airline’s new operation at Birmingham Airport will also create 140 direct jobs for pilots and crew, and support a further 1,200 indirect jobs, according to the carrier.\n\nIt is easyJet’s first new UK base since it launched at Southend Airport in 2012.\n\nEasyJet has previously operated flights to and from Birmingham Airport using planes based elsewhere.\n\nBasing three planes at the West Midlands airport will allow the airline to launch 16 new routes this summer to destinations such as Antalya in Turkey, the Greek island of Kos, and Sharm el Sheikh in Egypt.\n\nIt will also increase frequencies on its existing network, equating to more than 50pc additional flights each week.\n\nSpeaking at a press conference at the airport, easyJet chief executive Johan Lundgren said: “This is going to provide a huge amount of additional connectivity, which not only will serve the holidays community, but also a very critical part of the business community as well.” EasyJet\n\n12:15 PM GMT\n\nWall Street poised to jump ahead of Fed rate announcement\n\nUS stock indexes gained in premarket trading ahead of the US Federal Reserve’s meeting this week, where policymakers are expected to keep borrowing costs steady.\n\nStronger-than-expected inflation figures last week have prompted investors to rethink when and by how much the Fed will lower rates this year.\n\nTraders have been pulling back bets of a June rate cut to around 59pc from 71pc last Monday, according to the CME FedWatch Tool.\n\nNevertheless, Wall Street, led by optimism around artificial intelligence (AI), hit fresh all-time highs in March, before pulling back some gains last week.\n\nMeanwhile, exchange operator Nasdaq said it has resolved an issue related to connectivity and stock orders after more than two hours.\n\nAhead of the opening bell, the Dow Jones Industrial Average was up 0.2pc, the S&P 500 had gained 0.8pc and the Nasdaq 100 was up 1.2pc.\n\n11:52 AM GMT\n\nEaster eggs more expensive as cocoa prices hit new record\n\nCocoa prices have doubled since the start of the year as shoppers prepare for large price increases for chocolate eggs this Easter.\n\nContracts for the crop in New York have risen to $8,394 a metric ton, the highest on record as yields in West Africa have been battered by disease and extreme weather.\n\nLast month Cadbury, the market leader for Easter eggs which has been producing them since 1875, has warned that it may have to raise prices or shrink its products “as a last resort”. Nestle has warned the same.\n\nWhile manufacturers buy cocoa beans months ahead of time, the surge in prices is beginning to bite.\n\nOle Hansen, head of commodity strategy at Saxo Bank, said he expects manufacturers will increasingly resort to making their products smaller to cut costs, sparking another wave of so-called “shrinkflation”.\n\nMartin Hug, chief financial officer at chocolate maker Lindt, said this month:\n\nThere are lots of players who have already announced price increases. We are also part of that group.\n\nIt is very difficult to predict at the moment what will happen with the cocoa market. But I think we have controlled it as well as we can. Cocoa prices have surge since the start of the year, leading many Easter egg makers to reduce product sizes and put up prices - Ben Pedley/PA Wire\n\n11:39 AM GMT\n\nPound gains strongest backing from investors in 17 years\n\nThe level of bets on strong gains for the pound has reached its highest point in 17 years as the Bank of England is expected to keep interest rates at 16-year highs until the late summer.\n\nHedge funds are backing sterling to move higher and cutting back positions on falls in the currency amid expectations that the US Federal Reserve and European Central Bank will reduce interest rates more quickly than in Britain.\n\nIt has taken overall bets in favour of the pound to the most since July 2007, according to data from the Commodity Futures Trading Commission for the week to March 12.\n\nThe pound has been the best performer among the so-called G10 group of the world’s major currencies since the start of the year.\n\nMoney markets are pricing in a first interest rate cut by the Bank of England in August and only one more quarter of a point cut by the end of the year.\n\nMeanwhile, the US Federal Reserve is priced in to make a first cut in July, with a 50.4pc chance of a June cut.\n\nHowever, Goldman Sachs said the Bank of England could cut rates earlier if inflation falls faster than expected when figures are published on Wednesday.\n\nRoberto Cobo Garcia, head of G-10 FX strategy at Banco Bilbao Vizcaya Argentaria, added:\n\nCurrent positioning suggests the pound upside potential is limited and that any negative news could trigger a correction.\n\nIf inflation or employment data weakens in spring, the pound would trade in lower levels into the summer.\n\n11:16 AM GMT\n\nTory MPs broke impartiality rules on GB News, Ofcom finds\n\nThree Tory MPs have been found to have broken Ofcom’s broadcasting rules on due impartiality during programmes on GB News.\n\nThe watchdog’s investigation involved five episodes of shows presented separately by former House of Commons leader Sir Jacob Rees-Mogg and minister without portfolio Esther McVey, and backbencher Philip Davies.\n\nA further episode of Sir Jacob’s State Of The Nation was not investigated because it did not raise issues under the rules, according to Ofcom.\n\nMarried couple Ms McVey and Mr Davies are no longer part of the GB News line-up, and last hosted programmes on the channel last year.\n\nOfcom said: “We found that two episodes of Jacob Rees-Mogg’s State Of The Nation, two episodes of Friday Morning With Esther And Phil, and one episode of Saturday Morning With Esther And Phil, broadcast during May and June 2023, failed to comply with Rules 5.1 and 5.3 of the Broadcasting Code.”\n\nThe media watchdog said that because the politicians “acted as newsreaders, news interviewers or news reporters in sequences which clearly constituted news - including reporting breaking news events - without exceptional justification, news was, therefore, not presented with due impartiality”. Husband and wife MPs Esther McVey and Philip Davies on GB News - Zara Farrar/HM Treasury\n\n10:43 AM GMT\n\nOil prices rise amid growing China factory output\n\nOil prices have hit a fresh four-month high amid optimism about China’s industrial output.\n\nGlobal benchmark Brent rose 0.6pc towards $86 a barrel after gaining 4pc last week, while West Texas Intermediate was up 0.8pc and heading in the direction of $82.\n\nIt comes after China’s factory output and investment grew more strongly than expected at the start of the year., In refining, output hit a record.\n\nMeanwhile, Russian oil refineries were hit by drone strikes over weekend, just as Vladimir Putin strolled to victory in a presidential election which Defence Secretary Grant Shapps accused Putin of stealing.\n\n10:14 AM GMT\n\nGas prices rise amid global production outages\n\nEuropean natural gas prices have risen for a fourth day amid concerns about global energy supplies.\n\nThe benchmark contract on the continent jumped as much as 7.7pc in its biggest intraday jump since January 3.\n\nPrices have rallied for the longest period since the end of January after plunging as much as 30pc since the start of the year.\n\nOutages at global gas liquefaction facilities — from Malaysia to the US — are sending jitters through the market.\n\nColder-than-normal temperatures are also expected across parts of northern Europe next week before heading higher.\n\nDutch front-month futures, Europe’s gas benchmark, were last up 5.1pc to more than €28 per megawatt-hour. The UK equivalent contract was up 5.3pc to more than 71p per therm.\n\n09:42 AM GMT\n\nWorld’s largest solar company cuts thousands of jobs\n\nThe world’s largest solar power manufacturer is poised to announce plans to cut nearly a third of its workforce as costs rise for the net zero industry.\n\nLongi plans to reduce staff levels by as much as 30pc as it ramps up a reduction in its headcount which began in November, according to Bloomberg News.\n\nThe Chinese company employed about 80,000 people at its peak last year but has suffered amid a wider downturn in the country’s solar industry.\n\nManufacturers have been forced to sell at or below production costs after prices for solar panels fell to record lows last year.\n\nLongi, which makes wafers used in solar panels, also had to significantly cut prices last year amdi fierce competition in the sector.\n\n09:13 AM GMT\n\nPound steadies ahead of interest rate decision\n\nThe pound has regained its footing against the dollar after falling 1pc last week.\n\nSterling was last flat at $1.27 as traders gear up for the Bank of England’s next interest rate decision on Thursday.\n\nIt was also little changed against the euro at 85p.\n\n08:51 AM GMT\n\nMiners boost FTSE 100 amid China’s industrial growth\n\nThe FTSE 100 has inched higher as metal miners rose on upbeat economic data from China.\n\nBase metal miners gained as much as 1pc after the upbeat industrial output and retail sales data from top metal consumer China, which in turn lifted the resource-heavy FTSE 100 by 0.1pc.\n\nIndustrial output in the world’s second largest economy rose 7pc from a year earlier in February, better than analysts had forecast. Spending on factories and equipment, known as fixed-asset investments, rose 4.2pc.\n\nLondon’s benchmark stock index was also boosted by Reckitt Benckiser, which jumped as much as 5.9pc after slumping around 14pc on Friday after the consumer goods giant lost a US legal case claiming its baby formula contributed to the death of a premature child.\n\nHaleon was among the worst performers, down as much as 3.2pc after its top shareholder Pfizer said it would reduce its stake in the toothpaste maker from 32pc to about 24pc, selling shares worth about £2bn.\n\nThe mid-cap FTSE 250 edged 0.2pc lower after an 11pc fall in Marshalls as the landscaping and roofing products supplier flagged lower revenue for 2024 on slower-than-expected recovery.\n\nInvestors will watch UK inflation figures due on Wednesday, as well as interest rate decisions by the Bank of Japan, the US Federal Reserve and the Bank of England.\n\nThe Bank is widely expected to keep rates at current levels in the upcoming meeting, although the focus will be on ascertaining the timing of the first rate cut.\n\n08:22 AM GMT\n\nBuilders’ merchant Marshalls warns of ‘slower’ recovery\n\nBuilding materials supplier Marshalls has warned it expects the industry to remain “subdued” over the first half of 2024 and see a “slower” recovery than previously expected.\n\nIt came as the London-listed company revealed a slump in profits and revenues for last year, and downgraded forecasts for 2024.\n\nMarshalls said it closed and mothballed factories and reduced shifts in other facilities in 2023 in an attempt to cut costs, leading to the loss of 330 jobs during the year. The group said this has helped the business save £11m a year.\n\nBosses said the builders’ merchant will continue to come under pressure from the weak market, as developers slow down their building work.\n\nNew chief executive Matt Pullen said:\n\n“In the short term, markets are expected to remain challenging, with continued weakness in the first half of the year followed by a progressive recovery in the second half as the macro-economic environment improves.\n\nThis recovery is however expected to be slower and more modest than previously anticipated.\n\nAs a result, it said sales for the full year are set to be “lower than expected” and profits are now expected to remain roughly flat. Shares dropped by 9.5pc in early trading.\n\n08:05 AM GMT\n\nUK markets subdued at the open\n\nThe FTSE 100 was little changed as trading began ahead of interest rate decisions this week from the Bank of Japan, the US Federal Reserve and the Bank of England.\n\nThe UK’s blue chip index was flat at 7,731.33 while the midcap FTSE 250 down 0.1pc at 19,492.96.\n\n07:52 AM GMT\n\nPfizer to sell £2bn of its shares in Haleon\n\nDrugs giant Pfizer has announced plans to sell about £2bn of shares in Centrum vitamins maker Haleon.\n\nThe US company, which has said for some time it planned to start selling down its stake, aims to offload 630m shares in the company behind Sensodyne toothpaste, which was the largest business to list in London since 2011 when it floated two years ago.\n\nHaleon, a spin-off from Pfizer’s rival pharmaceutical giant GSK, has agreed to buy £315m worth of the shares off market.\n\nThe sales will reduce Pfizer’s stake from 32pc to about 24pc. It is Haleon’s largest shareholder. FTSE 100 consumer health company Haleon, which owns Sensodyne toothpaste and Panadol tablets, was spun out of GSK in 2022 - REUTERS/Dado Ruvic\n\n07:38 AM GMT\n\nBritish Land sells 50pc stake in offices after Meta exit\n\nCommercial property giant British Land has sold a 50pc stake in a major London office months after Facebook owner Meta paid £149m to forfeit its lease at the site as its staff continue to work from home.\n\nRoyal London Asset Management Property will run the eight-storey office on 1 Triton Square, near Regent’s Park, with the FTSE 250 real estate developer under a deal which values the site at £385m.\n\nSilicon Valley giant Meta still had 18 years outstanding on the office lease for the building, which it had never occupied, but paid a break fee amounting to around seven years of rent as it redesigns its offices with more shared work areas and hot-desking. Meta still uses a nearby building on Brock Street.\n\nBritish Land has marketed the site as a science and innovation building “in the heart of the Regent’s Place campus within London’s Knowledge Quarter”, which is home to leading research institutions including The Francis Crick Institute, The Wellcome Trust, The Alan Turing Institute and University College London.\n\nChief executive Simon Carter said:\n\nWe proactively took 1 Triton Square back from Meta to reposition it for science and innovation customers, with the expectation of unlocking significantly higher rents, whilst benefitting from a considerable surrender premium to further improve the economics.\n\nThis transaction is another example of how we drive value through establishing innovative JV partnerships, enabling us to flex our balance sheet, share the risk and crystallise the value created from Meta’s surrender premium.\n\nMark Evans of Royal London Asset Management Property added: “We have long recognised the demand for best-in-class science and innovation space, particularly in the Golden Triangle, and the need for this space in supporting the UK’s economic growth. Meta paid a £149m fee to landlord British Land as part of its exit from 1 Triton Place\n\n07:22 AM GMT\n\nCurrys boosts profit outlook as it moves past bidding war\n\nCurrys said profits are on track to be slightly better than expected as a bidding war for the electricals retailer came to an end.\n\nBosses said adjusted profit before tax is expected to be at least £115m, having previously said it would come in between £105m to £115m.\n\nThe company remains on track to offload its Greece business in the first half of April, which will leave the company in a net cash position at the end of the financial year.\n\nIt comes after Chinese tech giant JD.com announced on Friday it would not make an offer for Currys, days after US investors Elliott Management said it would not submit a third bid to take the UK listed business private. Currys said its pre-tax profit would be at least £115m this year, having previously predicted £105m to £115m - Jason Alden/Bloomberg\n\n07:12 AM GMT\n\nRed Sea crisis ‘causing 90-day shipping delays’ for UK manufacturers\n\nBritish manufacturers are facing delays of as long as 90 days for shipments of parts caused by disruption in the Red Sea.\n\nMake UK, the manufacturing trade association, has warned of the enduring effect of attacks by Iran-backed Houthi rebels, who have been targeting commercial vessels travelling through the Red Sea in protest at Israeli military action in Gaza.\n\nMake UK said in its quarterly report:\n\nManufacturers are now reporting lead times increasing on average by two to three weeks, and even upwards of 90 days in some cases.\n\nThe challenge is that this creates bottlenecks across the supply chain as the delay of one component of even simple products can result in increasing lead times for goods.\n\nIt comes as the trade body warned the UK’s manufacturing sector faces two years of “anaemic growth”, with the sector forecasted to grow by just 0.1pc this year and 0.6pc next - half the rate of the broader economy in 2025.\n\n06:50 AM GMT\n\nHouse asking prices jump £5,000 in a month\n\nAsking prices have jumped by more than £5,000 so far this month as calm in the mortgage market fosters more confidence in property values.\n\nThe average price of a newly marketed house rose by 1.5pc to £368,118 in March, according to figures from Rightmove. That equates to a £5,279 increase, which markets the biggest rise in 10 months.\n\nIn a further sign of recovery for the UK housing market, the number of sales being agreed has risen 13pc compared with this time last year.\n\nTim Bannister, director of property science at Rightmove, said: “The stronger than usual price growth this March indicates that new sellers are feeling much more confident, with some perhaps being over-optimistic, that there is enough buyer activity and affordability in their local market to achieve a higher price.”\n\nLondon saw the biggest increase in demand for properties compared with this time last year, as slowing inflation, wage increases and a push back to offices among employers made the capital more appealing.\n\nMuch of the activity in the housing market has been driven by sales of properties to wealthy buyers for whom mortgage rates are less of an issue. So-called ‘top-of-the-ladder’ sales were up 18pc in March so far compared with last year, Rightmove said.\n\nDespite March’s jump, average asking prices are still £4,776 lower than their peak in May 2023.\n\nMr Bannister added:\n\nDespite the above-average price increases in this opening three months of the year, asking prices are still £4,776 below their peak in May 2023.\n\nFor those who can afford to buy and have yet to take action to move this year, this may provide a window of opportunity to buy as we now seem to be past the bottom of the market.\n\nWhile some sellers are still being overoptimistic with their pricing expectations, there are also more sellers who are aware of the need to be negotiable and realistic, with elevated interest rates compared to recent years still stretching affordability for many buyers. Rightmove has released its latest figures on UK house asking prices - Yui Mok/PA Wire\n\n06:47 AM GMT\n\nGood morning\n\nThanks for joining us today. An improving mortgage market has given house sellers the confidence to demand an extra £5,000 for their home on average this month compared to February.\n\nRightmove said the value of newly marketed house has risen by 1.5pc to £368,118.\n\n5 things to start your day\n\n1) Migration surge drives London population to new record | Concerns over housing intensify as capital surpasses pre-pandemic peak\n\n2) Hunt hits landlords with stealth capital gains tax raid | Previous reduction in tax-free allowance offsets gains from lowered rate\n\n3) ITV cuts jobs amid advertising slump | Broadcaster faces biggest slump in advertising since financial crisis\n\n4) British Airways to use robot baggage handlers at Gatwick | Driverless baggage tugs to be rolled out as industry battles staff shortages\n\n5) Why Britain’s four-day week pioneer says he will never go back | Boss of UK challenger bank Atom believes office purists need to ‘grow up’\n\nWhat happened overnight\n\nAsian stocks advanced ahead of policy decisions this week by the Bank of England, Japan’s central bank and the US Federal Reserve.\n\nChinese data for January-February were mixed, with property investment falling while other indicators showed improvement.\n\nIn Tokyo, shares closed sharply higher as investors await a decision by the Bank of Japan on Tuesday on whether to raise its benchmark interest rate for the first time in 17 years. Since 2016, the rate has remained at minus 0.1pc.\n\nThe benchmark Nikkei 225 index jumped 2.7pc, or 1,032.80 points, to 39,740.44, while the broader Topix index climbed 1.9pc, or 51.19 points, to end at 2,721.99.\n\nThe Hang Seng in Hong Kong was flat at 16,720.40, and the Shanghai Composite index gained 0.5pc to 3,069.67.\n\nElsewhere, Australia’s S&P/ASX 200 was unchanged at 7,670.60, while the Kospi in South Korea advanced 0.6pc, to 2,681.26.\n\nIn India, the Sensex was unchanged and in Bangkok the SET was up 0.5pc.", "link": "https://uk.finance.yahoo.com/news/giving-oil-fantasy-says-saudi-185938914.html", "symbols": ["0Q1N.IL", "0R2V.IL", "0RIH.IL", "91D.F", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.06, "neu": 0.841, "pos": 0.1}}, {"date": "2024-03-18T18:25:00+00:00", "title": "A Google Deal With Apple on AI Software Could Pose Antitrust Challenges", "content": "Google pays billions of dollars a year to be the default search engine on the iPhone and in the Safari internet browser.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d654b9db-88e1-30c2-bf71-42adbc3be5d3/a-google-deal-with-apple-on.html", "symbols": ["0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-03-18T16:51:04+00:00", "title": "The Mag 7 Is Soaring Again", "content": "After pulling back from recent highs, the Magnificent Seven collection of megacap technology stocks was rallying on Monday. Tesla stock was leading the way with a gain of 5.8%. Meta Platforms shares were up 2.1%, while Apple stock was up 1.6%.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1b4420c5-adf6-37e4-a65a-32a5d3344982/the-mag-7-is-soaring-again.html", "symbols": ["0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU"], "tags": [], "sentiment": {"polarity": 0.859, "neg": 0, "neu": 0.804, "pos": 0.196}}, {"date": "2024-03-18T16:46:45+00:00", "title": "7 Stocks I Like on the Nasdaq Market", "content": "The Nasdaq Stock Market has been hitting new highs this year.\n\nNasdaq is a market with a dual personality. It's home to most large technology companies, and also the place where a slew of smaller stocks in other industries are traded.\n\nTech stocks have been the stock market's leaders last year and so far this year. Smaller stocks are starting to come alive.\n\nMost investors head to the Nasdaq for technology exposure. That's fine, but I wouldn't ignore the small fry in other industries. Here are seven Nasdaq stocks I like now.\n\nEast West\n\nEast West Bancorp Inc. (NASDAQ:EWBC), based in Pasadena, California, finances a lot of film and television projects. It's also one of the few U.S. banks licensed to do business in China.\n\nU.S.-China relations stink right now. And the major presidential candidates (Joe Biden and Donald Trump) aren't perceived as friendly to China. But neither was Richard Nixon, until he moved to open up a relationship with China in 1972.\n\nAny thaw in the U.S.-China relationship would be good for East West. Meanwhile, it is doing pretty well, having increased its earnings by more than 14% a year over the past 10 years.\n\nAgco\n\nSelling all kinds of agricultural equipment, from fertilizer to tractors, through a network of more than 3,000 dealers worldwide, Agco Corp. (NYSE:AGCO) has been profitable in each of the past 24 years.\n\nOver the past 10 years, it has increased its earnings at better than a 14% clip (coincidentally the same as East West). Its return on stockholders' equity lately has been running at 27%; I consider anything over 15% good. Yet the stock is cheap, selling for less than 8 times recent earnings.\n\nLegacy Housing\n\nBased in Bedford, Texas, Legacy Housing Corp. (NASDAQ:LEGH) makes manufactured homes and extra-small homes, serving the low end of the housing market.\n\nSince the U.S. has a shortage of single-family homes, and since paying for a home is a strain from many families, I think this company occupies a useful niche. The company has very little debt, and the stock sells for 9 times earnings.\n\nStory continues\n\nPreformed Line\n\nPreformed Line Products Co. (NASDAQ:PLPC), which calls Cleveland, Ohio home, makes equipment for power lines and phone lines. It also makes mounting systems for solar panels.\n\nOver the past decade, Preformed has increased its earnings at a 19% annual pace. Last year growth was slower, at 7%. The stock sells for about 10 times earnings.\n\nMasterCraft Boat\n\nI've had poor luck with holdings in the boating industry. Nonetheless, I think that MasterCraft Boat Holdings Inc. (NASDAQ:MCFT) looks intriguing.\n\nThe company, out of Vonore, Tennessee, makes sport boats and outboard boats. The pandemic boosted boat sales because it's a form of recreation that is outdoors and doesn't involve crowds. Lately boat makers' sales have retreated, but if they level off, I like this stock at less than 7 times earnings.\n\nAlphabet\n\nWe don't want to neglect the big tech companies. Alphabet Inc. (NASDAQ:GOOGL) is one of the Magnificent Seven stocks that have chalked up big gains in Alphabet's case, 373% over the past 10 years.\n\nAlphabet is the parent to Google, You Tube, Waymo and Deep Mind. Innovation is built into its culture, and the company has increased its earnings by an average of more than 21% a year over the past decade.\n\nThe stock is much more expensive than those discussed above, but I don't think that 24 times earnings is too much to pay here.\n\nApple\n\nEven more expensive, at 27 times earnings, is Apple Inc. (NASDAQ:AAPL), the maker of iPhones and Mac computers. Here there are worries, but also great strengths.\n\nEarnings growth, which averaged better than 16% over the past decade, slowed to 9% last year. The iPhone faces increased competition from Huawei in China. And the company's debt has climbed to 146% of equity.\n\nNonetheless, I still like Apple. It has a large and loyal following, and a history of successfully pulling rabbits out of hats in product development.\n\nTrack record\n\nEvery year in March, I write about my favorite stocks on the Nasdaq. Over 17 years, the average 12-month return on my recommendations has been 19.20%. The beats the average return on the Nasdaq Composite Index (16.30%) and the Standard & Poor's 500 Total Return Index (13%).\n\nBear in mind that my column results are hypothetical and shouldn't be confused with results I obtain for clients. Also, past performance doesn't predict the future.\n\nMy picks from a year ago climbed 23.80%, which beat the Nasdaq Composite (20.80%) but not the S&P 500 (31.60%). The best performer was Taylor Morrison Home Corp. (NYSE:TMHC), up 57%. The worst was Cirrus Logic Inc. (NASDAQ:CRUS), down 15%.\n\nJohn Dorfman is chairman of Dorfman Value Investments LLC in Boston, Massachusetts. He or his clients may own or trade securities discussed in this column. He can be reached at jdorfman@dorfmanvalue.com.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/7-stocks-nasdaq-market-164645346.html", "symbols": ["0RIH.IL", "91D.F", "AAPL.US", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "AGCO.US", "COMP.US", "CRUS.US", "EW2.F", "EWBC.US", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.NEO", "GOOG.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.039, "neu": 0.824, "pos": 0.137}}, {"date": "2024-03-18T16:30:14+00:00", "title": "Wall Street Analyst Warns Apple Stock Could Get 'Killed' And 'Would Not Be Surprised If Buffett Is Selling Right Now'", "content": "It's been a terrible year so far for Apple Inc. (NASDAQ:AAPL) investors, with the company's share price down about 7% year to date, compared to the roughly 9% gain the SPDR S&P 500 ETF (NYSE:SPY) has experienced during the same period.\n\nCommonly cited reasons for the disappointing start to the year have been fears of lower demand in China, potentially falling behind in the artificial intelligence (AI) race, regulatory pressures and low growth.\n\nJordan Klein, an analyst at Mizuho, sees another major risk on the horizon, warning that things could get worse for Apple.\n\nDon't Miss:\n\nUS military-backed AI robotics company announces new equity raise for regular investors, here’s how to buy shares and potentially own a stake. Fortnite’s creator company greenlights partial ownership for up to 100 accredited investors in the upcoming series.\n\nKlein said he \"would not be surprised if [Buffett] is selling right now\" and that Buffett \"knows when that 13F comes out showing he started to sell, that [Apple] shares will get killed as retail investors rush for the exit.\"\n\nBerkshire Hathaway Inc.'s (NYSE:BRK) most recent 13F disclosed that Buffett sold some of his Apple stock, albeit a marginal 1% of his massive position.\n\nNews of Berkshire Hathaway selling more shares could put pressure on the stock given that the company owns 5.9% of all outstanding Apple shares, representing 42.8% of its entire stock portfolio.\n\nWhile Buffett has said that his \"favorite holding period is forever,\" Berkshire's portfolio has experienced turnover lately.\n\nTrending: This startup coined “eBay for gamers” with a breathtaking track record has opened up a window to invest in its future growth.\n\nIn addition to trimming its Apple stock, Berkshire exited its positions in StoneCo Ltd. (NASDAQ:STNE), Markel Group Inc. (NYSE:MKL), Globe Life Inc. (NYSE:GL), and D.R. Horton Inc. (NYSE:DHI) as well as significantly trimming its stakes in HP Inc. (NYSE:HPQ) and Paramount Global (NASDAQ:PARA).\n\nStory continues\n\nThe D.R Horton stake in particular was built up as recently as the second quarter of last year.\n\nKlein sees the stock as likely to lag the market until the company shares more about its AI plans, which he speculates might come as soon as June at the Worldwide Developers Conference (WWDC) developer event.\n\nDan Ives, a senior equity research analyst at Wedbush Securities, deems the situation a strong buying opportunity, giving Apple's stock a price target of $250 per share. He cites massive pent-up demand in the iPhone upgrade cycle and high expectations of \"AI finally coming to Cupertino (in California).\"\n\nFor long-term investors in Apple, it's paid to ignore short-term worries and stay the course. In the past five years, the stock has seen a more than 267% gain. Meanwhile, investors fortunate enough to have bought and held since its 1984 initial public offering (IPO) would be sitting on an over 142,000% gain.\n\nThe 13Fs are due within 45 days of a quarter ending, so investors waiting for the next updates on Berkshire’s portfolio will likely need to wait until mid-May.\n\nRead More on Startup Investing:\n\nWealthTech startup unlocks a $33 trillion home equity market and you can own a stake in it with just $250. New homebuilding startup could be in the right place at the right time to shock real estate market – and it sells for $5 per share.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nAPPLE (AAPL): Free Stock Analysis Report TESLA (TSLA): Free Stock Analysis Report\n\nThis article Wall Street Analyst Warns Apple Stock Could Get 'Killed' And 'Would Not Be Surprised If Buffett Is Selling Right Now' originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/wall-street-analyst-warns-apple-163014714.html", "symbols": ["0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F", "BERK34.SA", "BRH.BE", "BRH.DU"], "tags": [], "sentiment": {"polarity": 0.975, "neg": 0.074, "neu": 0.82, "pos": 0.106}}, {"date": "2024-03-18T15:53:37+00:00", "title": "12 Best Apple Music Alternatives: Top Music Streaming Services in 2024", "content": "In this article, we will take a look at the 12 best alternatives to Apple Music to stream in 2024. If you want to skip our detailed analysis, you can go directly to 5 Best Apple Music Alternatives: Top Music Streaming Services in 2024.\n\nThe Hype Behind Apple Music\n\nApple Inc. (NASDAQ:AAPL) is a leading multinational technology company that owns a range of consumer electronics, computer software, and other online services. Apple Music is a product of Apple Inc. (NASDAQ:AAPL). The platform is an audio and video streaming service launched in 2015. The platform is home to more than 100 million songs consisting of over 30,000 curated playlists and original content from artists. Users can also create playlists based on personalized mixes and picks. Apple Music offers several plans to its users. The student plan is available for $5.99 per month, the individual plan is available for $10.99 per month, and the family plan is available for $16.99 per month. The family plan accommodates up to six people.\n\nApple Music recently launched a new feature, Apple Music Sing. Apple Music Sing allows users to be a part of the music. Users can use the feature to control the vocal volume of songs and sing along to them with beat-by-beat lyrics. To sing along users simply need to open the app and tap the lyrics icon on a song. Users can then use the mic icon and slider to alter the vocal volume and then sing along.\n\nSome of the Leading Alternatives to Apple Music\n\nSpotify Technology S.A. (NYSE:SPOT), Amazon Music by Amazon.com, Inc. (NASDAQ:AMZN), and YouTube Music, a product of Alphabet Inc. (NASDAQ:GOOG), are among the leading music streaming services in 2024. Let's discuss some updates from these companies. You can also take a look at the best music stocks to buy now.\n\nSpotify Technology S.A. (NYSE:SPOT) is a leading music streaming platform operator headquartered in Sweden. Users can access music and podcasts on the platform. It is available on iOS, Android, and on desktop. Users can subscribe to the premium version for individuals for $10.99 per month, the duo version for $14.99 per month, the family version for $16.99 per month, and the student version for $5.99 per month. On March 13, Spotify Technology S.A. (NYSE:SPOT) announced that the company is set to launch music videos in beta for Spotify Premium users. The feature is only available in eleven markets including Germany, Italy, the Netherlands, Poland, Sweden, Brazil, Colombia, the Philippines, Indonesia, and Kenya. If users do not wish to see videos, they can simply click the \"Switch to Audio\" button. You can also read our piece on the most popular songs on Spotify of all time.\n\nStory continues\n\nRowan Street Capital stated the following regarding Spotify Technology S.A. (NYSE:SPOT) in its 2023 annual investor letter:\n\nSpotify Technology S.A. (NYSE:SPOT) is currently selling for about $15 billion. Does this make any sense?” We argued that Spotify stock was extremely mis-priced by the market. That aged pretty well as the current market cap for Spotify is ~$40 billion. Spotify’s stock skyrocketed +138% in 2023, strongly contributing to our outperformance. Spotify surpassed analyst expectations by adding 26% more monthly active users (MAUs) year-over-year in Q3 2023, reaching a total of 489 million (estimated to close the year with 600 million MAUs). This impressive growth solidified Spotify’s position as the world’s leading music streaming platform. Investors also applauded Spotify’s bid to improve profitability by suspending its podcasting spending spree and implementing cost-cutting measures, including layoffs, which reduced operating expenses.\n\nAlphabet Inc. (NASDAQ:GOOG) offers some of the most technologically equipped products. YouTube Music is a product of YouTube, a subsidiary of Alphabet Inc. (NASDAQ:GOOG). YouTube Music is among the leading music streaming platforms in the world. On February 1, YouTube Music announced that the platform had crossed 100 million subscribers. The platform was launched in 2015 and is available in more than 100 countries and regions. The company has a premium playback experience, allowing users to watch YouTube across several devices. YouTube Music also launched several generative AI features including a conversational AI and an AI tool that summarizes comments. Additional features include a samples tab, a faster way to discover new music, a customized radio-building experience, and bought podcasts.\n\nAmazon Music is a product of Amazon.com, Inc. (NASDAQ:AMZN). Amazon Music streamers gain access to more than 100 million songs. Users can also listen to podcasts on the platform. Amazon Prime members can subscribe to Amazon Music for as low as $9.99 per month. Non-Prime members must pay $10.99 per month to subscribe to Amazon Music. The platform also offers a family plan costing $14.99 per month. Users can also use Amazon Music for free. However, the free version comes with ads. Amazon Music offers a unique and immersive listening experience to users with its spatial audio feature. The spatial audio feature allows users to listen to music with high definition and depth. Users can switch between the spatial and stereo versions. Amazon Music also ensures that streamers are listening to music the way the original artist intended, ensuring the music is rich and more clear.\n\nNow that we have discussed the music industry, without further ado, let's take a look at the 12 best alternatives to Apple Music to stream in 2024. You can also read our piece on the biggest music festivals in the world. 12 Best Apple Music Alternatives: Top Music Streaming Services in 2024\n\n12 Best Apple Music Alternatives: Top Music Streaming Services in 2024\n\nOur Methodology\n\nTo come up with the 12 best alternatives to Apple Music to stream in 2024, we employed a consensus approach. We consulted more than 10 rankings on the internet to aggregate the best alternatives to Apple Music. Of them, we picked items that appeared in 50% of our sources. We then ranked our items based on the average customer star rating and the total number of reviews across two sources including the Google Play Store and App Store. It is to be noted that we only included software with total reviews of more than 10,000. Our list of the 12 best alternatives to Apple Music to stream in 2024 is in ascending order of the average customer star rating as a primary metric, and the total number of reviews as a secondary metric.\n\n12 Best Apple Music Alternatives: Top Music Streaming Services in 2024\n\n12. Amazon Music\n\nAverage Customer Star Rating: 3.95\n\nTotal Number of Reviews: 6,171,130\n\nAmazon Music ranks 12th on our list of the best music streaming services in the world. The platform is home to more than 100 million songs. Users can listen to ad-free music by subscribing to the Amazon Prime membership.\n\n11. IDAGIO\n\nAverage Customer Star Rating: 4.35\n\nTotal Number of Reviews: 17,769\n\nIDAGIO is a classical music streaming application, The platform was founded in 2015 and is based in Germany. The leading music streaming application is home to more than 2 million tracks. IDAGIO has an average customer star rating of 4.35.\n\n10. LiveOne\n\nAverage Customer Star Rating: 4.4\n\nTotal Number of Reviews: 387,124\n\nLiveOne, Inc. (NASDAQ:LVO) is a global digital media company for music and other entertainment services. The LiveOne app allows users to stream music and podcasts. Users can also watch videos and stream live content for free. LiveOne has an average customer star rating of 4.4 based on 387,124 reviews.\n\n9. Pandora\n\nAverage Customer Star Rating: 4.4\n\nTotal Number of Reviews: 13,445,368\n\nPandora is one of the best alternatives to Apple Music. The platform is a subscription-based music streaming service. The two paid platforms include Pandora Premium and Pandora Plus. By subscribing users can listen to music without having access to the internet. Users can access the platform on all Android and iOS devices as well as on desktops.\n\n8. Tidal\n\nAverage Customer Star Rating: 4.45\n\nTotal Number of Reviews: 478,635\n\nTidal ranks eighth on our list of the best music streaming platforms in the world. The platform is home to more than 100 million high-quality songs. The platform is targeted at artists and fans. Tidal offers several plans such as HiFi and HiFi Plus.\n\n7. Deezer\n\nAverage Customer Star Rating: 4.5\n\nTotal Number of Reviews: 3,361,154\n\nDeezer is one of the best platforms to stream music. It gives users access to more than 120 million tracks across the globe. Deezer is based in France and is available in more than 180 countries. The platform offers a 7-day free trial. The premium version is available for $11.99 per month. Users are able to cancel their subscriptions at any time.\n\n6. Qobuz\n\nAverage Customer Star Rating: 4.55\n\nTotal Number of Reviews: 49,654\n\nQobuz ranks sixth on our list of the best alternatives to Apple Music. The platform is home to more than 100 million tracks. Users can stream unlimited high-quality music on the platform. It is based in France and is now owned by Xandrie SA. It has an average customer star rating of 4.55.\n\nClick to continue reading and see 5 Best Apple Music Alternatives: Top Music Streaming Services in 2024.\n\nSuggested articles:\n\n15 German Speaking Countries in the World 10 Cheap Clean Energy Stocks To Buy According to Wall Street Analysts 30 Most Spoken Languages in the World in 2050\n\nDisclosure: None. 12 Best Apple Music Alternatives: Top Music Streaming Services in 2024 is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/12-best-apple-music-alternatives-155337375.html", "symbols": ["0R2V.IL", "639.F", "639.STU", "639.XETRA", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "AMZ.DU", "AMZ.F", "AMZ.HM", "AMZ.MU", "AMZ.STU", "AMZ.XETRA", "AMZ1.F", "AMZN.BA", "AMZN.MX"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.007, "neu": 0.876, "pos": 0.117}}, {"date": "2024-03-18T15:47:10+00:00", "title": "Looks like Apple will need a partner to go all in on generative AI—but big antitrust issues await", "content": "Apple-watchers will have noted the company’s recent progression from “We’ve deployed machine learning for years and are too sui generis to talk about ‘AI’” to “We have a lot of AI stuff coming soon, honest!” But with Apple being way behind in the generative AI race it has now deigned to join, how will it catch up?\n\nAccording to a Bloomberg report his morning, the answer lies in partnerships—at least, for what the publication calls the “heavy lifting of generative AI,” as opposed to the on-device AI action that would presumably/hopefully power a smarter Siri. It seems Apple has considered using OpenAI’s models for image generation and the like, but “active negotiations” with Gemini proprietor Google are underway.\n\nOf course, Apple and Google have already had a close partnership for nearly two decades, around making Google the default search engine in Safari. That bond is now being frayed by pressure from antitrust regulators in the U.S. (where the Justice Department has sued Google for paying Apple and others billions of dollars to make it the search default) and in Europe (where the new Digital Markets Act has forced Apple to prompt iOS Safari users to choose which search engine they want as their default).\n\nAs Bloomberg notes, a new AI deal could “help make up for” the falling value of Google and Apple’s search agreement—but it could also increase antitrust scrutiny for both companies. After all, the smartphone operating system market is essentially divided between the two companies, so having the same AI garnish on both Android and iOS could raise questions.\n\nWhat if Apple opts for OpenAI instead? Here, Microsoft enters into the equation. On the one hand, Microsoft’s patronage of OpenAI is also under antitrust scrutiny in both the U.S. and Europe, so an OpenAI-Apple deal could be quite useful in demonstrating that Sam Altman’s company is not effectively a Microsoft unit. But can you imagine if the deal were to extend to MacOS? Then the whole desktop operating system market would be powered by the same large language model.\n\nStory continues\n\nPerhaps a more durable solution would be for Apple to partner with an AI company like Anthropic or Mistral, where the potential antitrust pitfalls aren’t quite so predictable. Or maybe Apple can get its act together on developing its own models into a competitive option.\n\nIncidentally, while on the subject, there’s a new report out that says OpenAI’s models have developed prejudices against speakers of African American English, “exhibiting covert stereotypes that are more negative than any human stereotypes about African Americans ever experimentally recorded, although closest to the ones from before the civil rights movement… Language models are more likely to suggest that speakers of African American English be assigned less prestigious jobs, be convicted of crimes, and be sentenced to death.”\n\nApple won’t be using AI for such life-changing (or life-ending) decisions, but still, my advice would be to tread really carefully when deciding which models to use, and how to use them. More news below.\n\nDavid Meyer\n\nWant to send thoughts or suggestions to Data Sheet? Drop a line here.\n\nThis story was originally featured on Fortune.com", "link": "https://finance.yahoo.com/news/looks-apple-partner-generative-ai-154710112.html", "symbols": ["0QYP.IL", "0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F", "MSF.BE", "MSF.DU", "MSF.F"], "tags": [], "sentiment": {"polarity": 0.95, "neg": 0.041, "neu": 0.884, "pos": 0.075}}, {"date": "2024-03-18T12:00:00+00:00", "title": "Apple Jing’an to welcome its first customers this Thursday, March 21, in Shanghai", "content": "The new Apple Store in Shanghai features Apple’s best lineup of products ever, special Today at Apple sessions that celebrate local culture, and a team of more than 150 ready to offer excellent service to customers\n\nSHANGHAI, March 18, 2024--(BUSINESS WIRE)--Apple® today previewed Apple Jing’an, located near Jing’an Temple and Jing’an Park in Shanghai. The store is encircled by an exterior plaza that gives the community a gathering place for special events, as well as providing a one-of-a-kind shopping destination where customers can discover and buy Apple’s unparalleled lineup of products and services.\n\n\"We’re thrilled to open Apple Jing’an — a store that seamlessly blends the traditional with the modern and perfectly complements this historic neighborhood in Shanghai,\" said Deirdre O’Brien, Apple’s senior vice president of Retail. \"From our phenomenal iPhone lineup to the new 13- and 15- inch MacBook Air, Apple Jing’an brings all of our products and services together with an amazing team to create a truly magical shopping experience for our customers.\"\n\nThe Store and Team Located next to the landmark Jing’an Temple, Apple Jing’an is a must-see destination in Shanghai. Approaching the store through a grove of maple trees that line the upper plaza, visitors are treated to a stunning view of the temple. As customers descend down the stairs, they pass by terracing, double-curved walls that extend forward in a circle to form amphitheater seating that will host Today at Apple® sessions specially created for Apple Jing’an to celebrate the community and its creators. Upon entering the expansive store from the lower level, customers are invited to explore the surrounding avenues and display tables with the latest iPhone® 15 lineup, the new 13- and 15- inch MacBook Air® with the powerful M3 chip, and Apple’s first-ever carbon neutral products in its latest Apple Watch® lineup.\n\nOnce inside the store, visitors can travel between floors using the central feature staircase or through the stainless steel elevator. The Forum, featuring a large video wall in the center, serves as a space for learning and inspiration through free Today at Apple sessions. Meanwhile, the Boardroom offers a private setting where the store’s Business Team can offer advice and training to entrepreneurs, developers, and customers of businesses large and small.\n\nStory continues\n\nFrom the design of the store to the materials used to bring it to life, every element of Apple Jing’an is built with purpose. Reflecting Apple’s long-standing commitment to the environment, the new store features a Padang Light stone wall that is sustainably and locally sourced within China, giving the store a seamless visual and material harmony.\n\nThe 150-person-strong team is ready to help customers shop for a new device, provide personalized setup and support, learn about switching to iOS, or find out about retail services like Apple Trade In or financing programs.\n\nIdeally situated just steps away from public transport, the new store offers a dedicated Apple Pickup station to make it easier than ever for customers in Shanghai to order online and collect their devices in-store at a time that’s convenient for them.\n\nSpecial Sessions Opening festivities include a special performance by the youngest members of the Shanghai Symphony Orchestra to share the future of classical music in-store for customers. Apple Jing’an will also offer a special six-week Today at Apple program that pays homage to the local community and its creatives with the series Let Diverse Creativity Bloom in Jing’an, showcasing Shanghai’s next generation of creators and their multifaceted skills through the groundbreaking capabilities of iPhone.\n\nFollowing opening weekend, the store will host its free, ongoing Today at Apple sessions that help users get set up, connected, and make the most out of their devices. The free Apple-led programming includes:\n\nPhoto Tour: Framing Architecture Get Started: Mac® Workshop: Photography on iPhone Video Tour: Capturing Cinematic Shots\n\nApple in China For more than 30 years, Apple has been innovating and delivering the best products and services for customers in China, and supports more than 5 million jobs through direct employment, its supply chain, and the iOS app economy. From the opening of our first stores, Apple Sanlitun, in 2008 and the Apple Store Online in 2010, Apple retail has constantly innovated to meet customers where they are, provide the best shopping experience both in stores and online, and deepen connections with local communities.\n\nToday, Apple has 57 stores in Greater China, with thousands of team members delivering exceptional service and creating magical experiences for customers. Last year, Apple opened Apple MixC Shenzhen, the second store in the vibrant city, as well as Apple MixC Wenzhou, the first store in the coastal city. Apple Jing’an marks Apple’s eighth store in Shanghai. In addition to shopping directly with Apple Retail, customers in China have even more places to discover and buy Apple products, get expert support, and more on the Apple Store online.\n\nThe team at Apple Jing’an will welcome its first customers on Thursday, March 21, at 7 p.m.\n\nNOTE TO EDITORS: For additional information visit Apple Newsroom (www.apple.com/newsroom), or email Apple’s Media Helpline at media.help@apple.com.\n\n© 2024 Apple Inc. All rights reserved. Apple, the Apple logo, Today at Apple, iPhone, MacBook Air, Apple Watch and Mac are trademarks of Apple. Other company and product names may be trademarks of their respective owners.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240318506213/en/\n\nContacts\n\nBRIAN BUMBERY\r\nApple\r\nbumbery@apple.com\n\nPIA FONTES\r\nApple\r\npia_fontes@apple.com", "link": "https://finance.yahoo.com/news/apple-jing-welcome-first-customers-120000209.html", "symbols": ["0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.002, "neu": 0.853, "pos": 0.145}}, {"date": "2024-03-18T10:53:55+00:00", "title": "Apple says it's complying with EU's Digital Markets Act amid criticism", "content": "By Foo Yun Chee\n\nBRUSSELS (Reuters) - Apple on Monday fended off criticism that it has not done enough to open up its closed eco-system as required under the European Union's Digital Markets Act, saying it has complied with the landmark legislation.\n\nThe DMA sets out a list of obligations and prohibitions for Apple, Alphabet's Google, Amazon, TikTok owner ByteDance, Meta Platforms and Microsoft which the six companies had to abide by on March 7.\n\nApple has in recent weeks announced a series of changes from allowing apps developers to distribute their iPhone apps directly to consumers instead of through Apple's App Store to letting developers distribute their apps to users in the European Union outside of the App Store.\n\nThe company told apps developers, business users and rivals at a day-long hearing organised by the European Commission that it has redesigned its systems to comply with the DMA.\n\n\"We were guided first and foremost by ensuring that we've complied with the law. And then second, that we did it in a way that was consistent with our values and consistent with the language that we've developed with our users over a very long period of time. And we think we've accomplished that,\" Apple's lawyer Kyle Andeer told the hearing.\n\n\"And I think we're focused on it from a user perspective. Now, it's not to say that we're not focused on the impact of developers, but I think from our perspective first and foremost, we'll be tracking very carefully what's the impact of all of these different changes on the user experience that we've delivered to our customers for 15, 16 years through the iPhone?\"\n\nMeta will present its compliance efforts at a separate hearing on Tuesday, Amazon on Wednesday, Alphabet on Thursday, ByteDance on Friday and Microsoft next Tuesday.\n\nCompanies that fail to comply with the DMA risk investigations that can lead to fines of as much as 10% of their global annual turnover.\n\n(Reporting by Foo Yun Chee; Editing by Susan Fenton)", "link": "https://finance.yahoo.com/news/apple-says-complying-eus-digital-105355491.html", "symbols": ["0R2V.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU", "APC.STU", "APC.XETRA", "APC8.F"], "tags": [], "sentiment": {"polarity": -0.187, "neg": 0.031, "neu": 0.927, "pos": 0.041}}, {"date": "2024-03-18T10:43:00+00:00", "title": "Alphabet and Apple Stocks Rise on Report of Talks About AI for iPhones. What to Know.", "content": "Gemini, Google's suite of generative AI models, could be integrated into Apple software later this year, Bloomberg reports.\n\nContinue reading", "link": "https://finance.yahoo.com/m/2dfd01b9-80ee-3ee1-9da2-de5273e6d8ec/alphabet-and-apple-stocks.html", "symbols": ["0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-03-18T10:35:00+00:00", "title": "Why QCOM Stock Is the Conservative Investor’s AI Dream Play", "content": "Qualcomm (NASDAQ:QCOM) is well-positioned to benefit from the proliferation of localized artificial intelligence, the increased digitalization of automobiles, and the rapidly increasing sales of Samsung smartphones. Over the longer term, QCOM stock could also get a considerable boost from Apple’s (NASDAQ:AAPL) renewal of its modem deal with the chip maker.\n\nFinally, Qualcomm recently reported encouraging quarterly financial results, and the valuation of QCOM stock is relatively low.\n\nGiven all of these points, I believe that investors looking for a conservative, long-term play on AI should consider buying QCOM stock.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nA Good Play on Edge AI and the Increased Computerization of Autos\n\nAs I noted in a previous column, “Edge AI devices are connected to the internet and have their own AI rather than relying on distant data centers and the cloud (for AI capabilities).” And by using their own AI chips, these devices are able to process workload significantly more quickly and provide many more applications than systems that rely on cloud-based AI.\n\nAmong the apps enabled by devices with their own AI capabilities are “facial recognition and real-time traffic updates.” Edge AI devices also can assist healthcare practitioners more effectively than systems that use datacenters’ AI chips.\n\nIn October, QCOM stock introduced new AI chips for PCs and smartphones. Given the firm’s decades of experience with providing cutting-edge chips for smartphones and PCs, I’m confident that QCOM will benefit significantly from what I see as the coming proliferation of Edge AI.\n\nMeanwhile, in January, QCOM stock reported that it was developing hardware that would enable autos to exploit AI. Noting that its Snapdragon Digital Chassis, has been installed in over 350 million vehicles, the firm estimated that its “automotive-related revenue” would reach $4 billion “by 2026,” Seeking Alpha reported.\n\nWith autos becoming increasingly more computerized and AI likely to become significantly more advanced over the medium term and the long term, I think that many automakers will look to incorporate a significant amount of the technology into their products in the coming years. The latter trend, in turn, should meaningfully lift Qualcomm and QCOM stock.\n\nStory continues\n\nHelp From Samsung and Apple Is on the Way\n\nIn a note to investors on March 11, investment bank Rosenblatt Securities reported that the deliveries of Samsung’s Galaxy S24 had risen 13% compared with those of its predecessor, the S23, during the same period a year earlier. Moreover, the shipments of the Galaxy S24, which incorporate Qualcomm’s Snapdragon 8 chip, were 47% above the rate at which the S22 was delivered two years ago, Rosenblatt stated.\n\nMeanwhile, after Apple reportedly had difficulty creating its own modem chips, Qualcomm reported at the end of January that the iPhone maker had agreed to buy Qualcomm’s modem chips for another two years, through March 2027. The Street is likely still upbeat about the latter news.\n\nMoreover, I believe that ,given Apple’s past struggles with building its own modem chips, we can expect to see the tech giant eventually further extend its contract with Qualcomm in this area.\n\nStrong Quarterly Results and an Attractive Valuation\n\nIn QCOM’s fiscal Q1 which ended on Dec. 24, the firm’s earnings per share jumped 24% versus the same period a year earlier to $2.46, while its top line rose 5% year-over-year to $9.9 billion.\n\nAlso noteworthy is that its smartphone revenue rose 16% YOY, while its automotive revenue soared 31% YOY to a record $598 million.\n\nIn terms of valuation, the stock’s forward price-earnings ratio of 17.6 times is rather low and attractive, given its strong, positive catalysts.\n\nMoreover, the shares have a significant dividend yield of 1.9%.\n\nQualcomm’s high current profitability, along with its well-established smartphone business and attractive valuation, make it a good AI play for conservative investors.\n\nOn the date of publication, Larry Ramer did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nLarry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of “America’s Top Trader” Issues A.I. Code Red: Act Now or Miss Out It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post Why QCOM Stock Is the Conservative Investor’s AI Dream Play appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/why-qcom-stock-conservative-investor-103500703.html", "symbols": ["AAPL.US", "QCI.BE", "QCI.DU", "QCI.F", "QCI.HM", "QCI.MU", "QCI.STU", "QCI.XETRA", "QCOM.MX", "QCOM.US", "QCOM34.SA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.015, "neu": 0.87, "pos": 0.116}}, {"date": "2024-03-18T09:06:00+00:00", "title": "Forget Nvidia: Billionaires Are Selling It and Buying This \"Magnificent Seven\" Stock Instead", "content": "It's been another banner start to the year for Wall Street. The Dow Jones Industrial Average, S&P 500, and Nasdaq Composite have all firmly placed the 2022 bear market in the rearview mirror and blasted to record-closing highs. While there have been pockets of strength in various sectors and industries, much of the heavy lifting for the current bull market can be attributed to the \"Magnificent Seven.\"\n\nAs their collective name implies, the Magnificent Seven are seven of the largest and most influential publicly traded companies. They're often industry leaders (sometimes in more than one category) and traditionally on the cutting edge of technological innovation(s). In order of descending market cap, the Magnificent Seven stocks are:\n\nMicrosoft(NASDAQ: MSFT) Apple(NASDAQ: AAPL) Nvidia(NASDAQ: NVDA) Amazon(NASDAQ: AMZN) Alphabet(NASDAQ: GOOGL)(NASDAQ: GOOG) Meta Platforms(NASDAQ: META) Tesla(NASDAQ: TSLA) Image source: Getty Images.\n\nAll seven of these companies have overwhelmingly outperformed the benchmark S&P 500 over extended periods. This is a fact that's not lost on Wall Street's brightest and most successful institutional money managers.\n\nHowever, there was a discernible shift in sentiment among billionaire investors during the December-ended quarter concerning the top-performing Magnificent Seven component: Artificial intelligence (AI) leader Nvidia.\n\nSurprise! Billionaire money managers are selling AI stock Nvidia\n\nInvestors who've put their money to work in artificial intelligence stocks have been handsomely rewarded -- perhaps none more so than Nvidia's shareholders.\n\nIn a little over a year's time, Nvidia has established itself as the infrastructure foundation of the AI movement. The company's A100 and H100 graphics processing units (GPUs) account for the lion's share of GPUs currently in use in AI-accelerated data centers. In fact, many of the company's top customers are Magnificent Seven members, including Microsoft, Meta Platforms, Amazon, and Alphabet.\n\nStory continues\n\nOptimists fully expect Nvidia to keep its foot on the accelerator as it ramps production of its prized A100 and H100 GPUs. With supply chain issues easing -- including Taiwan Semiconductor Manufacturing boosting its chip-on-wafer-on-substrate capacity -- Nvidia should be able to meet demand from more of its customers this year.\n\nHowever, the Nvidia growth story may not be as picture-perfect as its stock chart would suggest. Aside from well-established valuation concerns, Nvidia is set to face a flurry of operating headwinds. Perhaps that's what compelled eight billionaires to sell shares of Nvidia during the fourth quarter, including (total shares sold in parentheses):\n\nIsrael Englander of Millennium Management (1,689,322 shares) Jeff Yass of Susquehanna International (1,170,611 shares) Steven Cohen of Point72 Asset Management (1,088,821 shares) David Tepper of Appaloosa Management (235,000 shares) Philippe Laffont of Coatue Management (218,839 shares) Chase Coleman of Tiger Global Management (142,900 shares) John Overdeck and David Siegel of Two Sigma Investments (30,663 shares)\n\nMost investors in AI stocks/Nvidia have probably heard all about incoming competition from the likes of Intel and Advanced Micro Devices. Both companies have GPUs they've launched or plan to launch this year that are specifically designed to compete with Nvidia in enterprise data centers.\n\nThe far bigger concern for Nvidia is that the aforementioned four Magnificent Seven members that account for 40% of its sales -- Microsoft, Meta Platforms, Amazon, and Alphabet -- are all developing AI chips of their own for use in their data centers. A significant percentage of Nvidia's sales may go away if these core customers shift to in-house AI chips. At best, Nvidia will see less in the way of purchases from these four juggernauts.\n\nAnother kick in the pants for Nvidia is that U.S. regulators are actively restricting exports of high-powered AI GPUs to the world's No. 2 economy, China. After the first round of restrictions, Nvidia developed toned-down versions of its powerhouse AI GPUs, the A800 and H800, for the Chinese market. However, the newest round of export restrictions affects these models, too.\n\nThere's also a strong likelihood that Nvidia will sap its own gross margin as it increases production of its top-selling GPUs. With data center sales growing many multiples faster than cost of revenue in fiscal 2024 (Nvidia's fiscal year ended on Jan. 28, 2024), it clearly shows that pricing power, not an increase in units sold, drove the company's sales higher. As GPU scarcity tapers, so will Nvidia's otherworldly pricing power. Image source: Getty Images.\n\nA multi-industry leader has been a popular buy for billionaire investors\n\nTo be perfectly fair, Nvidia wasn't the only AI stock and member of the Magnificent Seven that billionaire investors put on the chopping block during the fourth quarter. Prominent billionaire money managers commonly sold Meta Platforms, Alphabet, and even Microsoft stock during the previous quarter.\n\nBut there was one exception to this selling: E-commerce and cloud-services frontrunner Amazon. All told, eight high-profile billionaires piled into this multi-industry leader, including (total shares purchased in parentheses):\n\nKen Griffin of Citadel Advisors (4,321,477 shares) Jim Simons of Renaissance Technologies (4,296,466 shares) Chase Coleman of Tiger Global Management (947,440 shares) Ken Fisher of Fisher Asset Management (888,369 shares) John Overdeck and David Siegel of Two Sigma Investments (726,854 shares) Steven Cohen of Point72 Asset Management (462,179 shares) Israel Englander of Millennium Management (85,532 shares)\n\nThe biggest risk for Amazon at the moment is the likelihood of a U.S. recession taking shape in the not-too-distant future. A couple of prominent money-based metrics and predictive tools suggest that the economy may weaken later this year. Since Amazon is the world's leading online marketplace and generates a sizable percentage of its sales from e-commerce, there's the logical perception that a recession would be trouble.\n\nYet what's interesting about Amazon is that very little of its operating cash flow or net income derives from online retail sales. Rather, the bulk of the company's cash flow and profits can be traced to its three fast-growing ancillary operating segments: Amazon Web Services (AWS), advertising services, and subscription services.\n\nA strong argument can be made that AWS is the single most important puzzle piece at Amazon. Enterprise cloud spending is still relatively early in its ramp, and AWS accounted for close to a third of global cloud infrastructure service spending during the September-ended quarter. In other words, a sustained double-digit growth rate should be the expectation for this high-margin segment.\n\nDon't overlook the importance of advertising services, either. Amazon is one of the most visited social sites in the world, with 2.3 billion to 2.7 billion aggregate visitors each month from July 2023 through December 2023. These are predominantly motivated shoppers, which makes Amazon a logical go-to for merchants wanting to target users with their message.\n\nWith regard to subscription services, Amazon surpassed 200 million worldwide Prime subscribers in April 2021, according to then-CEO Jeff Bezos. The addition of Thursday Night Football as exclusive content has likely only added to this figure.\n\nAlthough Amazon may not appear cheap based on traditional fundamental metrics, such as the price-to-earnings ratio, it's valued at a historically inexpensive multiple relative to its future cash flow. Billionaire investors recognize a long-term value when they see one.\n\nShould you invest $1,000 in Amazon right now?\n\nBefore you buy stock in Amazon, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Amazon wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nStock Advisor provides investors with an easy-to-follow blueprint for success, including guidance on building a portfolio, regular updates from analysts, and two new stock picks each month. The Stock Advisor service has more than tripled the return of S&P 500 since 2002*.\n\nSee the 10 stocks\n\n*Stock Advisor returns as of March 11, 2024\n\nSuzanne Frey, an executive at Alphabet, is a member of The Motley Fool's board of directors. Randi Zuckerberg, a former director of market development and spokeswoman for Facebook and sister to Meta Platforms CEO Mark Zuckerberg, is a member of The Motley Fool's board of directors. John Mackey, former CEO of Whole Foods Market, an Amazon subsidiary, is a member of The Motley Fool's board of directors. Sean Williams has positions in Alphabet, Amazon, Intel, and Meta Platforms. The Motley Fool has positions in and recommends Advanced Micro Devices, Alphabet, Amazon, Apple, Meta Platforms, Microsoft, Nvidia, Taiwan Semiconductor Manufacturing, and Tesla. The Motley Fool recommends Intel and recommends the following options: long January 2023 $57.50 calls on Intel, long January 2025 $45 calls on Intel, long January 2026 $395 calls on Microsoft, short January 2026 $405 calls on Microsoft, and short May 2024 $47 calls on Intel. The Motley Fool has a disclosure policy.\n\nForget Nvidia: Billionaires Are Selling It and Buying This \"Magnificent Seven\" Stock Instead was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/forget-nvidia-billionaires-selling-buying-090600521.html", "symbols": ["AAPL.US", "AMZN.US", "GOOG.US", "GOOGL.US", "META.US", "MSFT.US", "NVDA.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.033, "neu": 0.839, "pos": 0.128}}, {"date": "2024-03-18T06:30:51+00:00", "title": "Qualcomm debuts AI-focused Snapdragon 8s Gen 3 chip", "content": "Qualcomm (QCOM) is pushing deeper into the generative AI space with its latest smartphone chip, the Snapdragon 8s Gen 3. The processor, which will be available in Android smartphones from Chinese manufacturers including Xiaomi and Honor, is the second addition to Qualcomm's Snapdragon 8 Gen 3 family.\n\nLike the original Snapdragon 8 Gen 3, Qualcomm is marketing the 8s Gen 3 as an on-device AI powerhouse. The company says that the processor supports a number of models including Meta's Llama 2 and Google's Gemini Nano.\n\nThe 8s Gen 3 places just below the standard 8 Gen 3 in terms of performance and pricing, meaning you'll likely find it in smartphones that are just under flagship devices. The company says it's taken a number of the major features from the top-of-the-line 8 Gen 3 and dropped them into the 8s Gen 3, including high-powered gaming performance.\n\nBut Qualcomm is largely positioning this chip as a generative AI processor. So far, on-device generative AI features include photo editing and real-time translation. Smartphone makers are increasingly leaning into the technology as a major selling point and the first major software change for devices in some time. Qualcomm is positioning its new Snapdragon 8s Gen 3 as a solid generative AI powerhouse. (Image: Qualcomm) (Qualcomm)\n\nThe smartphone market has largely remained stagnant over the last few years with only incremental changes to cameras and processing speeds. As a result, consumers are more apt to hold onto their devices for longer periods of time, slowing down overall sales.\n\nGenerative AI, however, could be just what the market needs: a new, flashy capability that gets consumers to update their phones as faster clips.\n\nAndroid smartphone makers are taking an early lead with the technology, with both Samsung and Google (GOOG, GOOGL) touting their latest offerings as generative AI-capable devices. Apple (AAPL) is widely expected to debut some kind of generative AI software during its WWDC developer conference, which will likely take place in June.\n\nWall Street analysts are pointing to generative AI as a potential catalyst for a boost in Apple's next-generation iPhone sales. And while the company hasn't made any announcements regarding what it's cooking up, CEO Tim Cook has said he sees generative AI as a \"huge opportunity for Apple\" and that the iPhone maker will show off what it's been developing later this year.\n\nStory continues\n\nBut generative AI apps and features are still in their early stages, and there's nothing quite interesting enough on the market yet to get people to start running out their front doors and into their nearest smartphone shops. Subscribe to the Yahoo Finance Tech newsletter. (Yahoo Finance)\n\nAnd some of the most well-known generative AI apps like ChatGPT are cloud-based, meaning it doesn't matter what kind of chip your smartphone is running; as long as you've got a connection to the internet, you'll likely be able to use the service.\n\nStill, as developers continue to develop the technology and roll it into more and more apps, chips capable of running them like the 8s Gen 3 will become increasingly important for users who want to take advantage of the software.\n\nDaniel Howley is the tech editor at Yahoo Finance. He's been covering the tech industry since 2011. You can follow him on Twitter @DanielHowley.\n\nClick here for the latest technology news that will impact the stock market.\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/qualcomm-debuts-ai-focused-snapdragon-8s-gen-3-chip-063051782.html", "symbols": ["0R2V.IL", "0RIH.IL", "0RIH.LSE", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.STU", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA"], "tags": [], "sentiment": {"polarity": 0.979, "neg": 0.008, "neu": 0.927, "pos": 0.065}}, {"date": "2024-03-18T05:43:41+00:00", "title": "Apple in talks to let Google's Gemini power iPhone AI features, Bloomberg News says", "content": "(Reuters) - Apple is in talks to build Google's Gemini artificial intelligence (AI) engine into the iPhone, Bloomberg News reported on Monday, citing people familiar with the situation.\n\nApple also recently held discussions with the Microsoft-backed OpenAI and has considered using its model, the report added.\n\nApple and Google are in active negotiations to let the iPhone maker license Gemini to power some new features coming to the phone's software this year, Bloomberg said.\n\nApple is preparing new capabilities as part of its upcoming iPhone iOS 18 based on its own homegrown AI models, but it is seeking a partner to power generative AI features, including functions for creating images and writing essays based on simple prompts, the report said.\n\nThe two parties have not decided the terms or branding of an AI agreement or finalised how it would be implemented, Bloomberg said, adding it was unlikely that any deal would be announced until June, when Apple plans to hold its annual Worldwide Developers Conference.\n\nBoth companies have an existing deal for Google to be the default search engine on Apple's Safari web browser.\n\nApple, Google and OpenAI did not immediately respond to a Reuters request for comment outside business hours.\n\nApple has been slower in rolling out generative AI, which can generate human-like responses to written prompts, than rivals Microsoft and Google, which are weaving them into products.\n\nLast month, Apple CEO Tim Cook said the company plans to disclose later this year more about its plans to put generative AI to use, adding that the company is investing \"significantly\" in the area.\n\n(Reporting by Jahnavi Nidumolu in Bengaluru; Editing by Savio D'Souza and Janane Venkatraman)", "link": "https://finance.yahoo.com/news/apple-talks-let-googles-gemini-054341739.html", "symbols": ["0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU"], "tags": [], "sentiment": {"polarity": 0.927, "neg": 0, "neu": 0.949, "pos": 0.051}}, {"date": "2024-03-18T05:41:00+00:00", "title": "UPDATE 3-Apple in talks to let Google's Gemini power iPhone AI features, Bloomberg News says", "content": "(Adds details from paragraph 3)\n\nMarch 18 (Reuters) - Apple is in talks to build Google's Gemini artificial intelligence engine into the iPhone, Bloomberg News reported on Monday, citing people familiar with the situation.\n\nApple also recently held discussions with OpenAI and has considered using its model, the report added.\n\nApple and Google are in active negotiations to let the iPhone maker license Gemini, Google's set of generative AI models, to power some new features coming to the phone's software this year, Bloomberg said.\n\nThe two parties have not decided the terms or branding of an AI agreement or finalised how it would be implemented, the report added.\n\nIt is unlikely that any deal would be announced until June, when Apple plans to hold its annual Worldwide Developers Conference, the report said.\n\nApple, Google and OpenAI did not immediately respond to a Reuters request for comment outside business hours.\n\n(Reporting by Jahnavi Nidumolu in Bengaluru; Editing by Savio D'Souza and Janane Venkatraman)", "link": "https://finance.yahoo.com/news/1-apple-talks-let-googles-054100258.html", "symbols": ["0R2V.IL", "0RIH.IL", "AAPL.BA", "AAPL.MX", "AAPL.NEO", "AAPL.SN", "AAPL.US", "AAPL34.SA", "ABE0.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.STU", "ABEC.XETRA", "APC.BE", "APC.DU", "APC.F", "APC.HA", "APC.HM", "APC.MU"], "tags": [], "sentiment": {"polarity": 0.893, "neg": 0, "neu": 0.93, "pos": 0.07}}, {"date": "2024-03-18T00:00:00+00:00", "title": "As Apple Stock Slips, This May Be Time to Buy the Dip", "content": "Apple has problems, but so does every company, even if it's in the Magnificent Seven. So, bargain hunters should take a look at AAPL stock.", "link": "https://investorplace.com/market360/2024/03/as-apple-stock-slips-this-may-be-time-to-buy-the-dip/", "symbols": ["AAPL.US"], "tags": [], "sentiment": {"polarity": 0.796, "neg": 0.06, "neu": 0.682, "pos": 0.258}}]