[{"date": "2024-02-07T21:33:00+00:00", "title": "These Stocks Moved the Most Today: Snap, Alibaba, Enphase, Sonos, VF Corp., Ford, Emerson, and More", "content": "Snap’s disappointing outlook sinks the stock, Alibaba boosts its buyback program, and shares of Enphase Energy surge after earnings.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e17a38cd-7e1e-37ac-9814-d1eb360d0c81/these-stocks-moved-the-most.html", "symbols": ["0IR9.LSE", "8SO.F", "8SO.STU", "DIS.MX", "DIS.NEO", "DIS.SN", "DIS.US", "DISB34.SA", "DISN.BA", "E0P.F", "ENPH.US", "F.MX", "F.US", "F1TN34.SA", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0.119, "neu": 0.634, "pos": 0.246}}, {"date": "2024-02-07T20:17:04+00:00", "title": "Ford considers axing car feature that could save company millions per year", "content": "Ford Motor Co. is considering getting rid of the automated parallel parking feature in its vehicles as part of its cost-cutting measures in 2024, saying few customers utilize it anyway.\n\nFord COO Kumar Galhotra said during a call with analysts Tuesday that the automaker plans to make some material and design changes aimed at improving efficiency and saving money.\n\nGalhotra said connected vehicle data has helped the company determine whether customers are using certain features, and from assessing that data, it makes sense to scrap the auto-park feature.\n\n\"Very, very few people are using it, so we can remove that feature,\" Galhotra said, saying the move would save around $60 per vehicle, amounting to roughly $10 million per year. 2020 Ford Fusion vehicles are displayed at a car dealership in Orland Park, Illinois, on Sept. 27, 2019.\n\nFORD HYBRID SALES JUMP IN JANUARY AS EVS SLIDE\n\nAll told, Ford expects to save around $2 billion this year through efficiencies, executives said on the call.\n\nREAD ON THE FOX BUSINESS APP\n\nThe automaker forecast $10 billion to $12 billion in pretax profit for 2024, after earning $10.4 billion before taxes last year.\n\nProfit from Ford's Pro commercial vehicle business and Ford Blue combustion vehicle units offset steep losses from Model E electric vehicle operations.\n\nFord is slowing investment in new EV capacity to match slower demand following a seismic change in EV pricing over the past year, Ford executives told analysts.\n\nReuters contributed to this report.\n\nOriginal article source:Ford considers axing car feature that could save company millions per year", "link": "https://finance.yahoo.com/news/ford-considers-axing-car-feature-201704856.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.965, "neg": 0.015, "neu": 0.892, "pos": 0.093}}, {"date": "2024-02-07T19:19:55+00:00", "title": "Ford sees new 'reality' for EV sales as costs challenge industry transition", "content": "Ford's (F) latest quarterly results out Tuesday were the latest to underscore the challenge facing an auto industry moving towards an electric future — high prices.\n\n\"We learned that as you scale EVs to 5,000, to 7,000 units a month, and you move into the early majority customer, they are not willing to pay a significant premium for EVs,\" Ford CEO Jim Farley said on Tuesday's earnings call.\n\nFarley added that as subsidies for EV purchases rolled off, pricing for EVs \"quickly converged to hybrids.\"\n\n\"Now, Tesla (TSLA) found out this first but we were right behind that ... But we learned very quickly, and I want to say that no one will be immune to this reality,\" Farley said.\n\nFarley's comments come as Ford reported quarterly results that saw revenues and profits top expectations, while the company forecasted increased losses in its EV-focused unit as it gets more competitive on pricing.\n\nFord shares were up as much as 4% on Wednesday.\n\nThe conversation about pricing power — or a lack thereof — from automakers looking to turn their fleets toward EVs continues to be the biggest theme in the industry in 2023.\n\n\"I just can't emphasize enough how important cost is,\" Tesla CEO Elon Musk said back in the fall. \"…We have to make our products more affordable so people can buy [them].\"\n\nAccording to data from Bank of America published last month, of 62 electric vehicle models currently sold in the US, only 20 have a starting manufacturer’s suggested retail price below $45,000.\n\n\"A lack of affordability, limited choice and 'range anxiety' are likely key reasons for the relatively sluggish mass market EV adoption,\" the firm wrote.\n\nTheir findings also show \"hybrid vehicles are bridging some of the gap to full EV transition, while the choice and affordability of EVs should improve from here.\" More expensive vehicles are making up a larger share of hybrids purchased in recent months. (Source: Bank of America)\n\nThe demand for gasoline-powered vehicles has, in part, prompted energy companies to continue their oil and refined fuels production, while at the same time investing in technologies for the energy transition.\n\nStory continues\n\nLast year, ExxonMobil (XOM) announced a lithium initiative to become a major provider of the critical metal used to make electric vehicle batteries.\n\n\"We see an opportunity to supply approximately 1 million electric vehicles per year by 2030,\" said ExxonMobil CEO Darren Woods during the company's earnings call last week. \"With economically advantaged production, it has a much smaller environmental impact than today's supply.\"\n\nThe transition, at least in the US, is also not evenly distributed geographically, creating additional dynamics for the company to work through.\n\nIn the fourth quarter, for instance, sales of the F-150 truck, Ford's best-selling vehicle, saw a 50/50 mix of hybrid or EV vehicles and internal combustion engine (ICE) vehicles. In Dallas, Farley said the split in favor of ICE vehicles was more like 85/15. \"Hybrids will play [an] increasingly important role in our industry's transition, and will be here for the long run,\" Farley told analysts on Tuesday. A Ford electric F-150 truck is displayed outside of the New York Stock Exchange (NYSE) on March 23, 2023, in New York City. (Spencer Platt/Getty Images) (Spencer Platt via Getty Images)\n\nFord is also betting that giving customers more choice will be crucial in the transition away from traditional ICE vehicles and towards EVs, both in terms of price and performance.\n\n\"All of our EV teams are ruthlessly focused on cost and efficiency in our EV products because the ultimate competition is going to be the affordable Tesla and the Chinese OEMs,\" Farley said.\n\nInes Ferre is a senior business reporter for Yahoo Finance. Follow her on Twitter at @ines_ferre.", "link": "https://finance.yahoo.com/news/ford-sees-new-reality-for-ev-sales-as-costs-challenge-industry-transition-191955221.html", "symbols": ["0P4F.LSE", "0R0E.LSE", "8GM.BE", "8GM.F", "8GM.HM", "8GM.MU", "8GM.STU", "EXXO34.SA", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA", "GM.MX", "GM.US"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.037, "neu": 0.857, "pos": 0.106}}, {"date": "2024-02-07T19:15:00+00:00", "title": "Interest rate cuts would alleviate EV affordability problems", "content": "While Ford (F) remains committed to its EV business despite demand slowdowns, what pricing trends will emerge in the electric vehicle segment of the US auto market?\n\nCox Automotive Executive Analyst Michelle Krebs and Tom Narayan, RBC Capital Markets Lead Equity Analyst — Global Autos, comment on how pricing and lack of charging infrastructure is dissuading American car buyers from going all in on an EV.\n\nInterest rate cuts \"will certainly be a huge help. High-interest rates have pushed a lot of people out of the market, have pushed monthly payments really high,\" Krebs explains.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Luke Carberry Mogan.", "link": "https://finance.yahoo.com/video/interest-rate-cuts-alleviate-ev-191500024.html", "symbols": ["0P4F.LSE", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.799, "neg": 0.034, "neu": 0.864, "pos": 0.102}}, {"date": "2024-02-07T17:21:06+00:00", "title": "Ford's EV forecast 'gone from rosy to realistic': Analyst", "content": "Ford (F) announced a supplemental dividend after topping fourth-quarter earnings estimates on Tuesday. While raising its full-year outlook for 2024, the automaker is still facing losses in its EV segment, to which CEO Jim Farley assured shareholders of Ford's commitment to present affordable electric vehicles to better compete against its rivals.\n\nCox Automotive Executive Analyst Michelle Krebs and Tom Narayan, RBC Capital Markets Lead Equity Analyst — Global Autos, sit down with Yahoo Finance Live to discuss Ford's EV strategy and consumer demand challenges.\n\n\"At the end of the day, this is an evolution. We are moving towards electrification, so these bets will eventually pay off,\" Narayan says. \"It's just that right now, and we heard this from the Tesla call as well, we're in kind of an in-between two waves, and it could be a little challenging for some time.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Luke Carberry Mogan.", "link": "https://finance.yahoo.com/video/fords-ev-forecast-gone-rosy-171714399.html", "symbols": ["0P4F.LSE", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.73, "neg": 0.031, "neu": 0.897, "pos": 0.071}}, {"date": "2024-02-07T17:04:09+00:00", "title": "EVs Are In Need Of A Push As Complex Bumps Slow Progress", "content": "The EV king, Tesla Inc (NASDAQ: TSLA) entered the new year by missing analyst estimates along with a warning of slower growth this year. But Chinese EV makers Nio (NYSE: NIO), XPeng (NYSE: XPEV), and Li Auto (NASDAQ: LI) kicked off 2024 with rising YoY deliveries, with BYD Company Limited (OTC: BYDDY) seeing its best January yet with a 33% YoY rise, although even BYD experienced a MoM drop from December for about a third. BYD also ended 2023 by surpassing Tesla for the first time during the last quarter of the year. But although even the mighty Tesla reported a dismal quarter, a pickup accessory maker Worksport (NASDAQ: WKSP) who is promising to bring game-changing products to the EV front, reported impressive fourth quarter figures on Tuesday.\n\nTesla reported weak auto revenue during the fourth quarter.\n\nTesla also warned its vehicle volume growth this year could be notably lowered to 2023.For its fourth quarter, Tesla reported revenue rose 3% to $25.17 billion, coming short of LSEG’s $25.6 billion estimate. Tesla also reported its operating margin almost halved from last year’s comparable quarter when it amounted to 16% to 8.2%. This year, Tesla will be focused on launching its “next-generation” vehicle and therefore, it finds itself between two major growth waves. Tesla ended 2023 by getting the long-anticipated electric pickup to the market but it warned that ramping up the production of the Cybertruck will take longer compared to its other models due to the vehicle’s increased complexity.\n\nWorksport, who specializes in pickup accessories, told a different quarterly story today. Its unaudited revenue for its fourth quarter skyrocketed 2,050% YoY to $839,690, after already reporting an impressive growth of 2,400% in its third quarter.\n\nDuring the reported quarter, Worksport launched a second production line at its state-of-art U.S. facility as it continues to confidently march ahead to make its mark in the field of sustainable automotive innovation. Both quarters are a reflection of Worksport’s strategic execution as it ramped up production of its “made in the USA’tonneau covers that will be available even on Amazon and Walmart. Besides redefining standards when it comes to light bed tonneau covers, Worksport is preparing for the alpha release of its COR portable battery system, which will be followed by the SOLIS solar-powered tonneau cover. The power duo that Worksport is bringing to the market promises to address range anxiety and bring the opportunity to power remote locations, redefining off-road driving and enhancing camping experiences across the globe.\n\nStory continues\n\nWhile some fear the EV progress is slowing down with traditional automakers like General Motors (NYSE: GM) and Ford Motor (NYSE: F) switching gears and scaling down their efforts in response to challenges that are even slowing down Tesla, companies like Worksport could be the ones to turbocharge EVs back to growth with their innovations.\n\nDISCLAIMER: This content is for informational purposes only. It is not intended as investing advice.\n\nThis article is from an unpaid external contributor. It does not represent Benzinga's reporting and has not been edited for content or accuracy.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nGet the latest stock analysis from Benzinga?\n\nTESLA (TSLA): Free Stock Analysis Report\n\nThis article EVs Are In Need Of A Push As Complex Bumps Slow Progress originally appeared on Benzinga.com\n\n© 2024 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/evs-push-complex-bumps-slow-170409708.html", "symbols": ["F.US", "GM.US", "LI.US", "NIO.US", "TL0.BE", "TL0.F", "TL0.XETRA", "TL01.F", "TSLA.MX", "TSLA.NEO", "TSLA.US", "TSLA34.SA", "WKSP.US", "XPEV.US"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.044, "neu": 0.842, "pos": 0.114}}, {"date": "2024-02-07T17:01:05+00:00", "title": "3 Stocks to Snap Up Before Any Interest Rates Cuts", "content": "Stock markets usually climb when interest rates are cut because many businesses respond to rate declines by borrowing more in order to expand.\n\nThis trend causes companies to hire more employees, driving consumer consumption, the main driver of the U.S. economy, higher. Additionally, consumers tend to borrow more when rates go down, allowing them to make more large purchases. As a result, the firms that sell the most expensive items, such as vehicles and homes, tend to be most significantly affected by rate cuts.\n\nAlso noteworthy is that, over the last two years, the quick pace of rate hikes caused the balance sheets of many banks that held large amounts of bonds to be greatly undermined. That’s because the value of bonds drops when rates increase. Consequently, the rate cuts that seem imminent will help many banks become stronger in the eyes of investors by lifting the value of their bonds.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nHere are three stocks to buy before interest rate cuts.\n\nEnphase Energy (ENPH) Smartphone with logo of American company company Enphase Energy Inc. (ENPH) on screen in front of business website. Focus on left of phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nEnphase (NASDAQ:ENPH) specializes in making solar inverters that are used to convert sunlight into electricity. Enphase, like many solar firms, have reported significantly lower revenue over the last year. One of the key culprits behind their slump has been the high rates which make it much more expensive for consumers and businesses to borrow money in order to install solar panels.\n\nIndeed, on the company’s fourth-quarter earnings call, held on Feb. 6, CEO Badri Kothandaraman, noted that California solar installers are still being meaningfully hurt by high rates. Moreover, Kothandaraman noted that another one of the company key businesses — selling batteries used for energy storage — has also been badly hindered by high rates.\n\nAnd the CEO explicitly said that the firm expects the demand for inverters to climb in the U.S. if rates drop by 0.5 to one percentage points. And in California, he anticipates that the demand for both batteries and inverters would climb in such a scenario.\n\nStory continues\n\nGiven these points, ENPH is definitely one of the best stocks to buy before interest rate cuts.\n\nBank of America (BAC) As It Tests Support, Bank of America Stock Provides a Trading Opportunity\n\nSource: Michael Vi / Shutterstock.com\n\nBank of America (NYSE:BAC) is the most prominent bank whose balance sheet has taken a big hit as a result of high rates. Indeed, as of the end of the third quarter of 2023, “the unrealized losses in the bank’s held-to-maturity assets climbed to $131.6 billion….from $105.8 billion. As of the end of the year, however, these losses fell back down to $102 billion, driven by the interest rate drops that have already occurred in anticipation of the Fed’s.\n\nThat’s because most of those assets consist “of low-yielding mortgage securities and government debt,” and the value of those instruments rise as rates fall. As a result, the future rate cuts will definitely greatly enhance BAC’s balance sheet.\n\nAnd as BAC’s balance sheet improves further, the valuation of its shares is likely to climb a great deal.\n\nCurrently, BAC has a price/book ratio of one, well below JPMorgan’s equivalent ratio of 1.68. As rates drop, that valuation gap will very likely narrow tremendously.\n\nFord (F) Ford logo on a steering wheel. F stock\n\nSource: Proxima Studio / Shutterstock.com\n\nAccording to Cox Automotive Chief Economist Jonathan Smoke, “2024 will be the best year for consumers to buy a new car since before the pandemic.”\n\nOne of the reasons for the improvement is the probable decline of interest rates later this year, the economist explained. Indeed, lower rates make buying vehicles much more affordable for the vast majority of consumers who take out loans in order to purchase them.\n\nSince the majority of Ford’s (NYSE:F) auto sales occur in the U.S., the firm is well-positioned to benefit significantly from rate cuts here.\n\nAnd the automaker may already be benefiting from lower rates, as its cash flow from operating activities soared to $2.5 billion last quarter from $1.2 billion during the same period a year earlier.\n\nOn the date of publication, Larry Ramer did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nLarry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been SMCI, INTC, and MGM. You can reach him on Stocktwits at @larryramer.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\n\nThe post 3 Stocks to Snap Up Before Any Interest Rates Cuts appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-stocks-snap-interest-rates-170105702.html", "symbols": ["BAC.US", "E0P.F", "ENPH.US", "F.US"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.055, "neu": 0.839, "pos": 0.106}}, {"date": "2024-02-07T16:55:24+00:00", "title": "More Bad News for Tesla Stock: Ford and Toyota Are Thriving", "content": "Tesla (NASDAQ:TSLA) investors have had a miserable year. The stock is already down more than 20% in 2024. And it could get worse for Elon Musk before it gets better.\n\nThat’s because two of the electric vehicle maker’s biggest traditional automotive rivals… Ford (NYSE:F) and Toyota Motor (NYSE:TM) just both reported phenomenal results, in large part due to the success of their hybrid offerings.\n\nFord, Toyota Head Up on Hybrids\n\nShares of Toyota briefly touched new all-time highs Tuesday after the Japanese auto giant reported strong earnings and lifted its outlook for 2024. The stock is now up more than 20% this year. Toyota noted that demand for hybrid vehicles, which have both gas-fueled internal combustion engines and electric-battery powered motors, surged nearly 38% in the first three quarters of its most recent fiscal year. The company added that sales of hybrid Toyota and Lexus models in China were steady and strong.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nFord posted strong earnings as well after the closing bell Tuesday, lifting its stock 2% Wednesday morning and pushing shares into positive territory for 2024 in the process. Ford CEO Jim Farley said in the earnings release that its Ford Blue gas and hybrid unit is booming, thanks largely to sales of its hybrid F-150 and Maverick trucks.\n\n“We sold about 700,000 hybrids worldwide over the past three years and Ford is the only brand in the top three in both hybrids and EVs in the U.S.,” Farley said in the earnings release. “We’re expecting double-digit hybrid growth again in 2024.”\n\nThe healthy earnings from Ford and Toyota come just one week after General Motors (NYSE:GM) indicated that it was going to start selling some plug-in hybrids in the U.S. after discontinuing its Chevrolet Volt a few years ago in favor of all-electric cars.\n\nGM CEO Mary Barra said on a conference call that the company “remains committed” to going fully electric by 2035 but conceded that it will be a challenge for both the company and consumers that still want gas-powered cars and trucks. “Deploying plug-in technology in strategic segments will deliver some of the environmental benefits of EVs as the nation continues to build its charging infrastructure,” she noted. GM shares are also outperforming Tesla so far this year, rising about 6%.\n\nStory continues\n\nThe Bottom Line\n\nTesla, meanwhile, has been struggling due to concerns about intense competition in the U.S. and China. Rivals are offering cheaper EV models, which has prompted Tesla to cut prices. That may be good news for consumers, but it’s not what Tesla investors want to hear. Analyst worries about the Cybertruck being a flop, coupled with continued concerns about how committed Musk is to Tesla after a Delaware judge voided his massive compensation package, could be weighing on the stock as well.\n\nAnd the latest earnings from Ford and Toyota are just one more reason why legacy auto stocks are probably a better bet right now. The fact that other major car companies are finding success with their own EVs as well as hybrids is just one more headache that Tesla doesn’t need.\n\nAs of this writing, Paul R. La Monica did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nPaul R. La Monica is a veteran financial journalist with nearly 30 years experience (including more than 20 at CNN) covering the stock market and other asset classes, the economy and other corporate and business news.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\n\nThe post More Bad News for Tesla Stock: Ford and Toyota Are Thriving appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/more-bad-news-tesla-stock-165524891.html", "symbols": ["7203.TSE", "8GM.BE", "8GM.F", "8GM.HM", "8GM.MU", "8GM.STU", "F.US", "GM.MX", "GM.US", "GMCO34.SA", "TM.US", "TMCO34.SA", "TMN.MX", "TOM.BE", "TOM.DU", "TOM.F", "TOM.HM", "TOM.MU"], "tags": [], "sentiment": {"polarity": 0.981, "neg": 0.039, "neu": 0.866, "pos": 0.094}}, {"date": "2024-02-07T16:26:00+00:00", "title": "Ford Could Get 50% More Profit Without EVs", "content": "HEARD ON THE STREET Pickup trucks and big sport-utility vehicles are too heavy to turn into efficient electric vehicles. Ford results showed Tuesday that this is both a blessing and a curse for the companies that make the monsters of the road.\n\nContinue reading", "link": "https://finance.yahoo.com/m/857b5294-56e0-3382-92ae-dbc98e9f0133/ford-could-get-50%25-more.html", "symbols": ["0P4F.LSE", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.361, "neg": 0.072, "neu": 0.804, "pos": 0.124}}, {"date": "2024-02-07T16:20:21+00:00", "title": "Ford's Big EV Dilemma", "content": "Delaying investments in electric vehicles will boost Ford's earnings—but also prolong a messy transition. Ford sees its losses on electric vehicles deepening to between $5 billion and $5.5 billion this year.\n\nContinue reading", "link": "https://finance.yahoo.com/m/aeb2d9f0-4d0a-3d27-83b8-41ff3167f309/ford%27s-big-ev-dilemma.html", "symbols": ["0P4F.LSE", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.361, "neg": 0.141, "neu": 0.786, "pos": 0.073}}, {"date": "2024-02-07T15:45:41+00:00", "title": "Ford Stock Offers Early Entry, Special Dividend As Earnings Double Estimates", "content": "Ford earnings per share came in more than double analyst expectations. A special dividend also boosted Ford stock.\n\nContinue reading", "link": "https://finance.yahoo.com/m/29623023-3e7d-3cba-b4ba-aa7c04df8f1d/ford-stock-offers-early.html", "symbols": ["0QXR.IL", "7203.TSE", "8TI.BE", "8TI.DU", "8TI.F", "8TI.HA", "8TI.HM", "8TI.MU", "8TI.XETRA", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.751, "neg": 0, "neu": 0.684, "pos": 0.316}}, {"date": "2024-02-07T15:16:45+00:00", "title": "Ford Motor Company (NYSE:F) Q4 2023 Earnings Call Transcript", "content": "Ford Motor Company (NYSE:F) Q4 2023 Earnings Call Transcript February 6, 2024\n\nFord Motor Company isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here).\n\nOperator: Good afternoon and welcome to the Ford Motor Company 2023 Fourth Quarter Financial Results Conference Call. All participants will be in listen-only mode. [Operator Instructions] After today's presentation, there will be an opportunity to ask questions. [Operator Instructions] Please note this event is being recorded. I’d now like to turn the conference over to Lynn Antipas Tyson, Head of Investor Relations. Please go ahead.\n\nLynn Antipas Tyson: Thank you, Gary, and welcome to Ford Motor Company's fourth quarter 2023 earnings call. With me today are Jim Farley, President and CEO and John Lawler, Chief Financial Officer. Also joining us for Q&A is Marion Harris, CEO of Ford Credit; Kumar Gauhotra, COO of Ford and Marin Gjaja, COO of Model e. Today's discussion includes some non-GAAP references. These are reconciled to the most comparable U.S. GAAP measures in the appendix of our earnings deck. You can find the deck along with the rest of our earning materials and other important content at shareholder.ford.com. Our discussion also includes forward-looking statements about our expectations. Actual results may differ from those stated. The most significant factors that could cause actual results to differ are included on page 25.\n\nUnless otherwise noted, all comparisons are year over year. Company EBIT, EPS, and free cash flow are on an adjusted basis. Included on our earnings deck this quarter is a table of our global wholesales for 2023. With name, flight detail by segment and major geography, this is a roll forward of the detail we shared with you last March at our teach-in in our new segmentation. Lastly, I want to call out a few near-term IR engagements. Next week, February 15, Jim Farley and John Lawler will participate in a fireside-chat in New York with Rod Lash at the Wolf Global Auto, Auto Tech and Mobility Conference. February 22, Naveen Kumar, CFO of Ford Pro, will participate in a fireside chat in Miami with Dan Levy at the Barclays Industrial Conference.\n\nStory continues\n\nWe do plan to run this call about 15 minutes longer, so that'll take us to 15 minutes after the hour. We want to leave ample time for your questions. Jim, I'll turn the call over to you.\n\nJim Farley: Thank you, Lynn. And hi, everyone. Thanks for joining us. Last year turned out to be a fundamental year, a foundational year for our company. We launched some amazing [Technical Difficulty]\n\nOperator: Pardon me, this is the conference operator. We've seen that we've lost audio from the speakers location. Please stand by as we regain the signal. Pardon me, this is the conference operator. We have rejoined the audio with the main speaker location. Sir please continue.\n\nJim Farley: Hi, everyone. I'm not sure where we got cut off but I want to just highlight how important last year was not only financially but a foundational year for our team. Our power choice and our powertrains really came through, and you can really see that on the F-Series, which I'll talk about in a second. Our global hybrid sales were up 20% last year and we expect them to be up 40% this year. We're now the number one and number two best-selling hybrid trucks in the U.S. Maverick is number one and we're the number three hybrid brand in the U.S. behind Toyota and Honda. But unlike them, our hybrids really sell best on trucks for our side. We launched some awesome tech. BlueCruise just passed 150 million miles of hand-free use, but more importantly, the growth is up 25% quarter-over-quarter and the gross margins for BlueCruise are at 70%-plus, the same for Ford Pro Intelligence.\n\nAnd boy, can Ford do work vehicles. The new Super Duty and Transit are off to great starts as is the new Ranger. We are really focused as a team on the segmentation. You can see the speed, the accountability for results and focus within the company. And our underlying business is getting better, as John will show. Despite the UAW strike, our auto profits were up year-over-year. We returned to investment grade, we have higher ROIC, and we have really solid conversion from profits to cash. We're returning capital to shareholders, we're declaring a regular and a special dividend, and we're getting much more disciplined on capital not just where we allocate, but more importantly, how much we spend and when. Our Integrated Services are really accelerating under Peter Stern.\n\nThese are high-growth, high margin, as I said, and much less cyclical profits for us. We have one single leader, Kumar Galhotra on our industrial system and he is laser focused on quality and cost. And our international operations have made a remarkable turnaround after a lot of difficult restructuring. It's the second year we made profit. It's about a $3 billion turnaround compared to just three or four years ago. And what would surprise people is what a juggernaut Ranger has become. It's a global franchise and it's our second best-selling nameplate globally, just behind F-Series and ahead of Super Duty. Now John is going to go into last year's results. It was a solid year, but I want to be really clear, we are nowhere near our earnings potential for Ford Motor Company.\n\nAnd we are really positioned well this year for growth and profitability, for revenues as well. I'm going to cover four key areas. The first area is Ford Pro. It's nearly a $60 billion high-margin hardware, software and physical services business and most of that revenue is reoccurring. I believe Ford Pro is where the industry is going, an integrated business between all three of those factors. And we're seeing it first there because the customers use the vehicle more intensely and are more willing to pay for software. And we believe the attributes of Ford Pro are undervalued, but the performance will reveal that over time and look at the performance last year. Ford Pro doubled its EBIT to $7 billion despite a significant slowdown on Super Duty during the launch in the name of quality.\n\nAnd we're now on track for mid-teen EBIT margins at Pro. And you're going to see top and bottom line growth this year in Pro. We have the freshest product lineup in Ford's work history in two decades. Our order banks are exceeding our supply. And the reason why that order bank is so strong is fundamentally different economic factors than our retail business. What I mean by that is, look at North America. We're really dominant. We do really well on state and local government Pro sales. These are very profitable. And last year, state and local governments increased their spending by $75 billion or 16%, and a sizable portion of that is in infrastructure and people need Super Duties and Transits. Look at the build-out of telecom and 5G, directly correlates to our robust revenues.\n\nAnd the same is happening in the manufacturing sector in the U.S. with reshoring or onshoring manufacturing. Dealers are clamoring for more Pro allocation. They normally get only 50% to 75% of the volume they want. And in Europe, it's the ninth straight year of Ford being the best-selling CV brand, and we're just in the middle of launching the Super Duty of Europe, the Transit Custom and the new Ranger is now ramping up. Why do we think we're undervalued in Pro? Well, there's a couple of reasons. The first is our market leadership is a little bit opaque. We don't just lead in Pro, we dominate. We're 40% of the market share of Class 1 through 7 full-sized trucks and vans. In fact, many months, our second-place competitor isn't even half our size.\n\nNow commercial -- commanding that share means that we are dominant in vocations like service construction, utility and, as I said, government. But our biggest success is in TAMs where the market is biggest, small and medium-sized businesses and tradespeople. That's the backbone of the U.S. economy, and boy, does Ford have a reputation with those customers. Our second big moat is upfitters. Again, very difficult for investors to see but this is really significant. Every one of our landscapers, plumbers, electricians, they all upfit their Transits and Super Duties and Rangers specific to their vocation. So these upfitters being really important. We now have already developed a digital upfit integration system, and we share engineering specs with all those upfitters.\n\nWe've been working with them for decades and they really trust Ford. They're even able to move their upfit equipment from old Fords to new Fords. The third big moat is a growing one. It's software and our physical repair business. Example of that is last year, we already have 0.5 million active software paid subscriptions at Pro. It's up 46% and the margins are over 50%. In two years, we expect software and services to drive 20% of the Pro EBIT. And that's supported by two things: getting to 60% mix on our connected vehicles and a threefold increase in our attach rates for those paid subscriptions that I mentioned, which are only at about 12% today. One of the biggest advantages we have in Pro that's hard for people to see is our physical repair network.\n\nIt costs a lot of money to create, costs decades of time and there's a lot of expertise. In the U.S., we have 23,000 service bays that are busy seven days a week, 24 hours a day, and we're pressing on that advantage. Every day, we have new, very large service elite repair centers launching in the U.S. We haven't waited for brick-and-mortar. We now have 1,200 vans and Super Duties that are outfitted for remote service to our fleet customers. The Net Promoter Score is 10 points higher because they don't have to come on with the dealership. And this has effectively added 10% more capacity for our service. The bottom line is, we have these amazing vehicles. We have a leading market share position. We're now adding long-term durability of those products.\n\nWe have a highly profitable alternative revenue streams in repair and software now. Ford Pro is really a magical breakthrough for our customers and our company and, I believe, the industry. Quality, we don't have to go into the negative effects about quality, but we've been addressing it for three years now and we're starting to see progress. Our vision is that we want to give customers, who buy our trucks and vans and our passion products, off-road, Bronco, all of it, the long-term durability from companies like Toyota and Honda, but in the segments we compete in. We already have world-class quality in many parts of our company, and now we're seeing green shoots in North America. Kumar is leading this and he's here for Q&A to answer any questions.\n\nBut there are two aspects of quality I want to highlight. The first is launch quality. That Super Duty launch I mentioned, it was a line in the sand for this management team. We intensified all of our testing, our real-world problem-solving on the plant with our suppliers and engineers. We slowed down the launch and boy, did it cost us. $1 billion of EBIT we forego last year, but it was the right trade-off for our company and our customers. The result is the launch spike that every launch has we think on Super Duty is now similar to best-in-class in our industry, and we're seeing the benefits in the F-150 launch. That launch is underway right now and it's a really important one for our company. The second area of quality we're seeing progress on is initial quality.\n\nNow we measure that in three months in service. And that is highly correlated to long-term quality, and yes, warranty costs. And we saw last year a 10% increase. That is the largest improvement in the similar quality that we saw last time in 2016. It's the best in a long time and we are committing to a similar improvement this year. Quality now factors into 70% of the short-term incentives for our management at Ford. In the long-term, it's even more important, because we're measuring total shareholder return. We will share those KPIs on quality with you every quarter. Next thing I'd like to highlight is EVs. Now someone portrayed the change in the EV market as Darwinian. That could be a slow evolutionary change, but we think this has been a seismic change in the last six months of last year. A Ford truck roaring down a highway, with powerful headlights blazing its way.\n\nThat will rapidly sort out winners and losers in our industry. Now the catalyst for that seismic change is a combination of EV manufacturers cutting their price by 20% across all major geographies and a tremendous amount of capital flowing and a ton of new capacity into one single segment, two-row crossovers. Our overall EV strategy has never been more relevant as the seismic change happens, and we want to share with you our targets. Our next Gen 2 products will be profitable in the first 12 months of their launch. And that will mean that we'll get to mid to high single-digit EBIT profit margins over their life cycle, and that's going to deliver profits above Model e's cost of capital. And here are our big bets and adjustments. We're going to spend less capital on larger EVs. And as we've always said, we'll have a very small number of those.\n\nWe're going to focus those large EVs on geographies and product segments where we have a dominant advantage like trucks and vans. And those products will have breakthrough efficiency compared to our Gen 1 products, and they're going to be packed with innovations that customers are going to be excited to pay for. We're also adjusting our capital switching more focused on to smaller EV products. Now this is important because we made a bet in silence two years ago. We developed a super-talented skunkworks team to create a low-cost EV platform. It was a small group, small team, some of the best EV engineers in the world, and it was separate from the Ford mothership. It was a startup. And they've developed a flexible platform that will not only deploy to several types of vehicles but will be a large installed base for software and services that we're now seeing at Pro.\n\nAll of our EV teams are ruthlessly focused on cost and efficiency in our EV products because the ultimate competition is going to be the affordable Tesla and the Chinese OEMs. And that bet and all of the rightsizing of capital and even delays to some of our products, given the market realities, better balance growth, profits and returns for us. But one of the things we're taking advantage of and taking some timing delays is rationalizing the level and timing of our battery capacity to match demand and actually reassessing the vertical integration that we're relying on and betting on new chemistries and capacities. Our overall EV business will grow this year because we have the Explorer launching in Europe and really exciting, many of our commercial vehicles launched with electric this year as we refresh the lineup.\n\nWe will also align production and inventory for customer demand. EV customers are also helping us in a very critical area of software quality. They really, really are teaching us a lot. And this is a critical place where I think we're ahead as a company. Why are we making these changes in our EV business and capital allocation? Well, because we learned as an early leader as we scale the EVs and hybrids simultaneously. The demand curve turns out to be for EV is very different than ICE. We've seen an explosive growth in EVs in 2021 and 2022, and we realize very quickly that our first three Gen 1 products, we didn't have enough capacity. With EV growth, but as well importantly, the COVID supply shocks and the chip crisis itself and Tesla's ability to make vehicles despite the chip crisis in ‘21 and ‘22 and the zero cost of capital gave us too optimistic of a demand signal at that time, and it drove a temporary spike in supply.\n\nAs the COVID shock retreated, we learned that as you scale EVs to 5,000 to 7,000 units a month and you move into the early majority customer, they are not willing to pay a significant premium for EVs. This is a huge moment for us. What we've seen, because we offer everything, is pricing quickly converged to hybrids after any benefit from subsidies. Now Tesla found out this first but we were right behind that, and they were very exposed to early majority. But we learned very quickly, and I want to say that no one will be immune to this reality. The most obvious indicator of this reality is looking at total revenue, not units for EVs. Look at the U.S. market. EV total revenue was down in the second-half of last year versus Q2. If you look at unit volumes, they were up.\n\nThat is a really important insight we learned in being a first mover. The same thing happened in China, same thing happened in Europe. Our data shows that EVs are a clear destination for many customers based on their unique duty cycle. It's going to take time more than we expected 18-months ago. But we are seeing big adoption variances by geography, and that's why the power of choice at Ford is so important and a big advantage for us. We're betting that choice and flexible manufacturing is going to get us successfully through this transition. Look at the best-selling vehicle in the United States, the F-150. We have a lightning, we have a hybrid and high volume and a nice choice. In Q4, in California, our mix was 50% hybrid and EV F-150 and 50% ICE.\n\n1,000 miles away in Dallas, it was only 15% hybrid and EV, 85% ICE. You go around the world, you'll see same variations. Hybrids will play an increasingly important role in our industry's transition and will be here for the long run. Hybrid just hit specific customer use cases. On a Maverick pickup truck, our hybrid is focused on mileage and efficiency and they do the math very clearly, and they don't have to change their behaviors. On F-150 Hybrid, they get the same benefits even when they're toeing on fuel efficiency, but we throw in Pro Power on board on top of that to displace a very expensive generator cost. And margins on hybrids are closer to ICE, much higher than EV margins. The journey on EVs is inevitable in our eyes and we have a bright future of EVs. We're adjusting our capital and we're giving customers choice.\n\nLast thing I want to mention is talent. None of these breakthroughs in our company operationally or financially or in technical excellent innovation are going to happen without the right talent. And we've learned that the right talent is not sufficient. Over the last two years, it's been imperative that we go to a right performance management system. It's a fundamental change in the way we're running the company. We now truly differentiate and reward excellence at Ford, and that matches our operation and our business delivery. It's a massive culture change. Evolving to a compensation and benefit structure weighed more towards variable compensation that is tied to our delivery business results is fantastic. You can't bring in and retain the best talent without making this change.\n\nAnd now our long-term incentives and our short-term incentives are tied specifically to shareholder value creation. Over to you, John.\n\nJohn Lawler: Thanks, Jim, and good afternoon, everyone. We appreciate you joining us today. So 2023 was an important year as we continued to execute our Ford+ plan. Our strong global product line, which is clearly resonating with our customers, delivered revenue of $176 billion, which was up 11%, marking our second consecutive year of double-digit growth. We delivered $10.4 billion in adjusted EBIT, at the high end of our guidance, driven by continued strength in both Blue and Pro. Now to provide some perspective, compared to last year collectively, our core business units, Pro, Model e, and Blue grew, improved EBIT by $2 billion or 26%, and this is after fully absorbing roughly $1.7 billion impact of the UAW strike. Free cash flow was $6.8 billion, generating a free cash flow conversion rate of 65%.\n\nAnd this is above the top end of our target range and was driven by underlying strength in both Pro and Blue. Now both of these metrics provide a good litmus test for the effectiveness of our Ford+ strategy. Our balance sheet remains strong with nearly $29 billion in cash and more than $46 billion in liquidity. And this provides considerable flexibility to manage our business as the industry continues to transform. With the improving trajectory of our business and strong free cash flow, we announced a quarterly dividend of $0.15 per share plus a supplemental dividend of $0.18 per share. This brings our payout ratio to 50% for the year, in line with our target to consistently return 40% to 50% of our free cash flow to shareholders. Now let's take a closer look at our performance.\n\nRevenue for the quarter was $46 billion, up 4% despite the impact of the strike, which cost us roughly 90,000 units of production. Adjusted EBIT came in at $1.1 billion with an EBIT margin of 2.3%, which again included the impact of the strike. Now let's look at our segments. Ford Pro delivered another strong quarter with revenue up 11%, EBIT of $1.8 billion was up 25% with a margin of 11.8%. Full year results clearly demonstrated the potential earnings power of this growth business. Revenue jumped 19% and EBIT more than doubled year-over-year to $7.2 billion, an improvement of $4 billion. And with a margin of 12.4%, we're just shy of our mid-teen target. The strengths Jim highlighted for Ford Pro are differentiated and drove strong results this year and have Pro poised for another strong year in 2024.\n\nFord Model E drove a 14% increase in wholesales in the quarter, a 2% increase in revenue and EBIT loss of $1.6 billion. For the year, wholesales were up 20%, revenue was up 12% and EBIT was a loss of $4.7 billion. Both the quarter and year were impacted by challenging market dynamics and investments in next-generation vehicles, both of which Jim addressed in his remarks. In the quarter, Ford Blue revenue was flat despite the loss of roughly 60,000 units due to the strike. EBIT was $113 million with a margin of 3.1%. For the year, Ford Blue grew again with revenue up 8%. All of our regions are now profitable and contributing significantly to Blue's bottom line results. EBIT of $7.5 billion was up year-over-year with a margin of 7.3%. The improvement in EBIT reflects the underlying strength of our product portfolio, dampened by higher warranty and the UAW-related costs.\n\nTurning to Ford Credit. Ford Credit generated EBT of $280 million in the quarter and $1.3 billion for the year. As expected, full-year results were down year-over-year. Credit loss performance continues to normalize but remains below our historical average. Now before I turn to guidance, I wanted to touch briefly on capital allocation. One of the benefits of our segmentation, in addition to increased transparency and accountability, is that we are now allocating capital based on the growth opportunities in different risk and return profile of our segments. This allows us to assign specific risk-adjusted hurdle rates for each of our businesses, driving greater accountability to returns on the capital we invest. So here's how we're thinking about 2024 guidance.\n\nFor the full year, we expect to earn between $10 billion to $12 billion in adjusted EBIT. The high end of the range would be a record for Ford. Adjusted free cash flow of $6 billion to $7 billion and capital expenditures of $8 billion to $9.5 billion, flat to moderately up year-over-year. So let me double click on capital expenditures. We expect EVs to be about 40% of the total, and this reflects products already in flight, including investments in EV powertrain supporting our next generation of products in our LFP battery plant here in Michigan. As we continue to adjust to market dynamics, we are scrutinizing every dollar and will continue to drive efficiencies, targeting to land at the lower end of our CapEx range. For example, in 2023, we already started to take action.\n\nWe delayed our second JV battery plant. We reduced the size of our new LFP plant in Michigan, and we did not proceed with our JV battery plant in Turkey. And now we are further adjusting installed capacity to match demand, reassessing vertical integration in new battery chemistries, adjusting Gen 2 products and potentially their launch timing to ensure they meet our criteria for profitability, given the new market reality. Our 2024 outlook also assumes -- a flat to slightly higher SAAR in both the U.S. and Europe, and our planning assumption for the U.S. is 16 million to 16.5 million units, Nonrecurrence of the UAW strike, full year of our all-new Super Duty driving both positive pricing and mix in Ford Pro, industry supply and demand normalizing.\n\nNow from a planning perspective, we are assuming lower industry pricing of roughly 2%, driven by higher incentive spending as we move through the year. We expect this to be partially offset by top line growth from the launch of our new products. In addition, we're assuming a $2 billion benefit from cost reduction initiatives that offset higher labor and product refresh costs. Within the segments, we expect Ford Pro's strength will continue unabated. With continued strong demand for our leading products, we are targeting EBIT between $8 billion to $9 billion, driven by continued growth and favorable mix, partially offset by moderated pricing. For Model E, we expect losses to widen to a range of $5 billion to $5.5 billion, driven by continued pricing pressure and investments in our next-generation vehicles.\n\nWe expect our first-generation vehicles to improve their profits throughout the year. Ford Blue, EBIT to be about equal to last year at $7 billion to $7.5 billion, reflecting a balanced market equation, including the impact of our all-new F-150. We also expect costs to be flat as we offset higher labor and product cost with efficiencies. And we expect Ford Credit's EBT to be up slightly year-over-year to about $1.5 billion. Now taking a step back, our performance last year reflects the positive momentum of our Ford+ plan. Capital discipline is driving the right global footprint, portfolio of products and consistent cash generation. We continue to see growth opportunities and remain focused on delivering improvements in both quality and cost.\n\nNow that wraps our prepared remarks. We'll use the balance of the time to address what's on your mind. Thank you. Operator, please open up the line for questions.\n\nSee also Jim Cramer Says You Should Stay Away from These 10 Stocks and 17 Deadliest And Most Common Cancers In The world.\n\nTo continue reading the Q&A session, please click here.", "link": "https://finance.yahoo.com/news/ford-motor-company-nyse-f-151645592.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.021, "neu": 0.814, "pos": 0.165}}, {"date": "2024-02-07T14:58:00+00:00", "title": "Tesla’s Stock Is Rising. Here’s the Latest News.", "content": "The stock was up for a second day in a row despite a downgrade on Tuesday. News from Ford is helping.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6c0aea49-a866-32b5-9bac-48accb80dc57/tesla%E2%80%99s-stock-is-rising..html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA", "TL0.BE", "TL0.F", "TL0.XETRA", "TL01.F", "TSLA.MX", "TSLA.NEO", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.896, "pos": 0.104}}, {"date": "2024-02-07T14:43:14+00:00", "title": "Ford, Snap, NYCB: 3 Top Stories to Watch", "content": "Ford (F) shares are moving up during pre-market trading as the automaker posted quarterly earnings which beat Wall Street expectations in sales. In addition, the company projected a positive full-year profit outlook, citing strength in its ICE (Internal Combustion Engines) business.\n\nSnap (SNAP) shares were down over 30% in extended-hours trading on Tuesday after posting its latest quarterly report, missing Wall Street expectations on revenue and struggling to compete against its competition.\n\nNew York Community Bancorp (NYCB) appoints Alessandro Dinello as its Executive Chairman while Moody's downgraded the bank's credit rating to Junk, citing mounting issues that lead to \"multi-faceted financial, risk management, and governance challenges.\"\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Nicholas Jacobino", "link": "https://finance.yahoo.com/video/ford-snap-nycb-3-top-144314394.html", "symbols": ["0P4F.LSE", "0RNH.LSE", "1SI.F", "1SI.STU", "1SI.XETRA", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA", "NYCB-PA.US", "NYCB.US", "QC1.BE", "QC1.F", "SNAP.US"], "tags": [], "sentiment": {"polarity": 0.863, "neg": 0.048, "neu": 0.84, "pos": 0.112}}, {"date": "2024-02-07T14:43:00+00:00", "title": "Ford (F) Q4 Earnings Surpass Estimates, Revenues Rise Y/Y", "content": "Ford F reported adjusted earnings of 29 cents per share for fourth-quarter 2023, which beat the Zacks Consensus Estimate of 12 cents but fell from 51 cents recorded in the year-ago quarter. The company’s consolidated fourth-quarter revenues came in at $43.3 billion, beating the Zacks Consensus Estimate of $37.96 billion and rising 4% year over year.\n\nFord Motor Company Price, Consensus and EPS Surprise Ford Motor Company Price, Consensus and EPS Surprise\n\nFord Motor Company price-consensus-eps-surprise-chart | Ford Motor Company Quote\n\nSegmental Performance\n\nThe U.S. legacy automaker reports its automotive results under three business segments — Ford Model e, Ford Blue and Ford Pro. While Ford Blue focuses on the firm’s legacy gas-powered business, Ford Model e focuses on EVs, advanced technologies and several related aspects to support electrification plans and Ford Pro deals with commercial vehicles and services.\r\n\r\nIn the fourth quarter, total wholesale volume in the Ford Blue segment remained flat year over year at 758,000 units and exceeded our expectation of 641,000 units. Also, revenues from the segment remained flat year over year at $26.2 billion but topped our estimate of $22.3 billion on better-than-expected volume. Earnings before interest and taxes came in at $813 million with an EBIT margin of 3.1%. EBIT exceeded our projection of $743.7 million.\r\n\r\nTotal wholesale volume in the Ford Model e segment increased 14% year over year to 34,000 units and exceeded our expectation of 28,000 units. Revenues from the segment rose 2% year over year to $1.6 billion and surpassed our estimate of $1.35 billion on better-than-expected volume. Loss before interest and taxes widened to $1.57 billion with an EBIT margin of negative 98.2%.\r\n\r\nTotal wholesale volume in the Ford Pro segment increased 1% year over year to 361,000 and exceeded our expectation of 280,000 units. Also, revenues from the segment grew 11% year over year to $15.4 billion and beat our expectations of $12.86 billion. Earnings before interest and taxes came in at $1.81 billion with an EBIT margin of 11.8%. EBIT exceeded our projection of $1.08 billion.\r\n\r\nOverall, Ford’s total automotive revenues came in at around $43.2 billion, surpassing our estimate of $36.5 billion on stronger-than-expected results from Ford Blue, Ford Model e and Ford Pro units.\r\n\r\nFourth-quarter revenues from the Ford Credit unit came in at $2.7 billion, up 17.4% year over year and beat our estimate of $2.53 billion. Pretax earnings totaled $280 million, rising from $191 million in the year-ago quarter.\n\nStory continues\n\nFinancial Position\n\nFord reported an adjusted free cash flow of $1.96 billion for the quarter. It had cash and cash equivalents of $24.86 billion as of Dec 31, 2023. Long-term debt, excluding Ford Credit, totaled $19.2 billion at the end of the fourth quarter of 2023.\r\n\r\nFord declared its first-quarter 2024 regular dividend of 5 cents per share and a supplemental dividend of 18 cents per share, payable on Mar 1, 2024, to shareholders of record at the close of business on Feb 16, 2024.\n\n2024 Guidance\n\nFor full-year 2024, Ford expects adjusted EBIT in the range of $10-$12 billion. Adjusted free cash flow is estimated in the range of $6-$7 billion. Capital spending is expected between $8 billion and $9.5 billion.\n\nZacks Rank & Key Picks\n\nF currently carries a Zacks Rank #3 (Hold).\r\n\r\nSome better-ranked players in the auto space are Honda Motor Co., Ltd. HMC, Oshkosh Corporation OSK and Modine Manufacturing Company MOD, each sporting a Zacks Rank #1 (Strong Buy) at present. You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nThe Zacks Consensus Estimate for HMC’s 2024 sales and earnings implies year-over-year growth of 14.8% and 37.3%, respectively. The EPS estimates for 2024 and 2025 have moved up 16 cents and 22 cents, respectively, in the past 30 days.\r\n\r\nThe Zacks Consensus Estimate for OSK’s 2024 sales and earnings suggests year-over-year growth of 6.7% and 4%, respectively. The EPS estimates for 2024 and 2025 have improved 8 cents and 22 cents, respectively, in the past seven days.\r\n\r\nThe Zacks Consensus Estimate for MOD’s 2024 sales and earnings suggests year-over-year growth of 4% and 67.2%, respectively. The EPS estimates for 2024 and 2025 have improved 22 cents each in the past seven days.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nHonda Motor Co., Ltd. (HMC) : Free Stock Analysis Report\n\nOshkosh Corporation (OSK) : Free Stock Analysis Report\n\nModine Manufacturing Company (MOD) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/ford-f-q4-earnings-surpass-144300481.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.018, "neu": 0.851, "pos": 0.131}}, {"date": "2024-02-07T14:41:00+00:00", "title": "Ford Stock Jumps After Earnings—and Wall Street Sees More Gains Ahead", "content": "Analysts are raising their price targets on shares of Ford Motor after the auto maker’s latest earnings report impressed both Wall Street and Main Street. For the fourth quarter, Ford reported an operating profit of $1.1 billion, above the $900 million Wall Street projected. A year ago, Ford reported $2.6 billion in operating profit in the fourth quarter.\n\nContinue reading", "link": "https://finance.yahoo.com/m/23c63f0c-efa4-3d1f-8b0e-0e0f32de136f/ford-stock-jumps-after.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.878, "neg": 0, "neu": 0.832, "pos": 0.168}}, {"date": "2024-02-07T14:37:40+00:00", "title": "Ford stock pops on earnings, guidance", "content": "Shares of Ford Motor (F) are rising in pre-market trading after reporting fourth-quarter results that topped analyst estimates and announcing a supplemental dividend. On the call, CEO Jim Farley laid out the automaker's plans for new vehicles.\n\nYahoo Finance Autos Reporter Pras Subramanian reports the details in the video above.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Stephanie Mikulich", "link": "https://finance.yahoo.com/video/ford-stock-pops-earnings-guidance-143740367.html", "symbols": ["0P4F.LSE", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.972, "pos": 0.028}}, {"date": "2024-02-07T13:51:19+00:00", "title": "Q4 2023 Ford Motor Co Earnings Call", "content": "Participants\n\nAshwani Kumar Galhotra; COO; Ford Motor Company\n\nJames D. Farley; President, CEO & Director; Ford Motor Company\n\nJohn T. Lawler; VP & CFO; Ford Motor Company\n\nLynn Antipas Tyson; Executive Director of IR; Ford Motor Company\n\nMarin Gjaja; COO of Ford Model e; Ford Motor Company\n\nAdam Michael Jonas; MD; Morgan Stanley, Research Division\n\nDan Meir Levy; Senior Analyst; Barclays Bank PLC, Research Division\n\nEmmanuel Rosner; Director & Research Analyst; Deutsche Bank AG, Research Division\n\nJames Albert Picariello; Senior Automotive Analyst; BNP Paribas Exane, Research Division\n\nJohn Joseph Murphy; MD and Lead United States Auto Analyst; BofA Securities, Research Division\n\nRod Avraham Lache; MD & Senior Analyst; Wolfe Research, LLC\n\nRyan Joseph Brinkman; Senior Equity Research Analyst; JPMorgan Chase & Co, Research Division\n\nPresentation\n\nOperator\n\nGood afternoon, and welcome to the Ford Motor Company 2023 Fourth Quarter Financial Results Conference Call. (Operator Instructions) Please note, this event is being recorded. \r\nI would now like to turn the conference over to Lynn Antipas Tyson, Head of Investor Relations. Please go ahead.\n\nLynn Antipas Tyson\n\nThank you, Gary, and welcome to Ford Motor Company's Fourth Quarter 2023 Earnings Call. With me today are Jim Farley, President and CEO; and John Lawler, Chief Financial Officer. Also joining us for Q&A is Marion Harris, CEO of Ford Credit; Kumar Galhotra, COO of Ford; and Marin Gjaja, COO of Model e. \r\nToday's discussion includes some non-GAAP references. These are reconciled to the most comparable U.S. GAAP measures in the appendix of our earnings deck. You can find the deck along with the rest of our earnings materials and other important content at shareholder.ford.com. Our discussion also includes forward-looking statements about our expectations. Actual results may differ from those stated. The most significant factors that could cause actual results to differ are included on Page 25. \r\nUnless otherwise noted, all comparisons are year-over-year. Company EBIT, EPS and free cash flow are on an adjusted basis. Included in our earnings deck this quarter is a table of our global wholesales for 2023. With nameplate detail by segment and major geography, this is a roll forward of the detail we shared with you last March at our teach-in in our new segmentation. \r\nLastly, I want to call out a few near-term IR engagements. Next week, February 15, Jim Farley and John Lawler will participate in a fireside chat in New York with Rod Lache at the Wolfe Global Auto, Auto Tech, and Mobility Conference. February 22, Navin Kumar, CFO of Ford Pro, will participate in a fireside side chat in Miami with Dan Levy at the Barclays Industrial Conference. We do plan to run this call about 15 minutes longer, so that will take us to 15 minutes after the hour. We want to leave ample time for your questions. \r\nJim, I'll turn the call over to you.\n\nStory continues\n\nJames D. Farley\n\nThank you, Lynn, and hi, everyone. Thanks for joining us. Last year turned out to be a fundamental year, a foundational year for our company. We launched some amazing...\n\nOperator\n\nPardon me, this is the conference operator. We seem to have lost audio from the speaker's location. Please standby as we regain the signal. \r\n(technical difficulty) \r\nPardon me, this is the conference operator. We have rejoined audio with the main speaker location. Sir, please continue.\n\nJames D. Farley\n\nHi, everyone. I'm not sure where we got cut off, but I want to just highlight how important last year was not only financially but a foundational year for our team. Our power of choice and our powertrains really came through, and you can really see that on the F-Series, which I'll talk about in a second. Our global hybrid sales were up 20% last year, and we expect them to be up 40% this year. We're now the #1 and #2 best-selling hybrid trucks in the U.S. Maverick is #1, and we're the #3 hybrid brand in the U.S. behind Toyota and Honda. But unlike them, our hybrids really sell best on trucks for our side. \r\nWe launched some awesome tech. BlueCruise just passed 150 million miles of hand-free use, but more importantly, the growth is up 25% quarter-over-quarter and the gross margins for BlueCruise are at 70-plus percent, the same for Ford Pro Intelligence. And boy, can Ford do work vehicles. The new Super Duty and Transit are off to great starts as is the new Ranger. We are really focused as a team on the segmentation. You can see the speed, the accountability for results and focus within the company. \r\nAnd our underlying business is getting better, as John will show. Despite the UAW strike, our auto profits were up year-over-year. We returned to investment grade, we have higher ROIC, and we have really solid conversion from profits to cash. We're returning capital to shareholders; we're declaring a regular and a special dividend; and we're getting much more disciplined on capital not just where we allocate, but more importantly, how much we spend and when. \r\nOur Integrated Services are really accelerating under Peter Stern. These are high-growth, high margin, as I said, and much less cyclical profits for us. We have one single leader, Kumar Galhotra, on our industrial system and he is laser focused on quality and cost. And our international operations have made a remarkable turnaround after a lot of difficult restructuring. It's the second year we made profit. It's about a $3 billion turnaround compared to just 3 or 4 years ago. And what would surprise people is what a juggernaut Ranger has become. It's a global franchise and it's our second best-selling nameplate globally, just behind F-Series and ahead of Super Duty. \r\nNow John is going to go into last year's results. It was a solid year, but I want to be really clear, we are nowhere near our earnings potential for Ford Motor Company. And we are really positioned well this year for growth and profitability, for revenues as well. I'm going to cover 4 key areas. The first area is Ford Pro. It's nearly a $60 billion high-margin hardware, software and physical services business and most of that revenue is reoccurring. I believe Ford Pro is where the industry is going, an integrated business between all 3 of those factors. And we're seeing it first there because the customers use the vehicle more intensely and are more willing to pay for software. And we believe the attributes of Ford Pro are undervalued, but the performance will reveal that over time and look at the performance last year. \r\nFord Pro doubled its EBIT to $7 billion despite a significant slowdown on Super Duty during the launch in the name of quality. And we're now on track for mid-teen EBIT margins at Pro. And you're going to see top and bottom line growth this year in Pro. We have the freshest product lineup in Ford's work history in 2 decades. Our order banks are exceeding our supply. And the reason why that order bank is so strong is fundamentally different economic factors than our retail business. \r\nWhat I mean by that is, look at North America. We're really dominant. We do really well on state and local government Pro sales. These are very profitable. And last year, state and local governments increased their spending by $75 billion or 16%, and a sizable portion of that is in infrastructure and people need Super Duties and Transits. Look at the build-out of telecom and 5G, directly correlates to our robust revenues. And the same is happening in the manufacturing sector in the U.S. with reshoring or onshoring manufacturing. \r\nDealers are clamoring for more Pro allocation. They normally get only 50% to 75% of the volume they want. And in Europe, it's the ninth straight year of Ford being the best-selling CV brand, and we're just in the middle of launching the Super Duty of Europe, the Transit Custom and the new Ranger is now ramping up. \r\nWhy do we think we're undervalued in Pro? Well, there's a couple of reasons. The first is our market leadership is a little bit opaque. We don't just lead in Pro, we dominate. We're 40% of the market share of Class 1 through 7 full-sized trucks and vans. In fact, many months, our second-place competitor isn't even half our size. \r\nNow commercial -- commanding that share means that we are dominant in vocations like service construction, utility and, as I said, government. But our biggest success is in TAMs where the market's biggest: small- and medium-sized businesses and tradespeople. That's the backbone of the U.S. economy, and boy, does Ford have a reputation with those customers. \r\nOur second big moat is outfitters. Again, very difficult for investors to see but this is really significant. Every one of our landscapers, plumbers, electricians, they all upfit their Transits and Super Duties and Rangers specific to their vocation. So these upfitters and it being really important. We now have already developed a digital upfit integration system, and we share engineering specs with all those upfitters. We've been working with them for decades and they really trust Ford. They're even able to move their upfit equipment from old Fords to new Fords. \r\nThe third big moat is a growing one. It's software and our physical repair business. Example of that is last year, we already have 0.5 million active software paid subscriptions at Pro. It's up 46% and the margins are over 50%. In 2 years, we expect software and services to drive 20% of the Pro EBIT. And that's supported by 2 things: getting to 60% mix on our connected vehicles and a threefold increase in our attach rates for those paid subscriptions that I mentioned, which are only at about 12% today. \r\nOne of the biggest advantages we have in Pro that's hard for people to see is our physical repair network. It costs a lot of money to create, costs decades of time and there's a lot of expertise. In the U.S., we have 23,000 service bays that are busy 7 days a week, 24 hours a day, and we're pressing on that advantage. Every day, we have new, very large service elite repair centers launching in the U.S. We haven't waited for brick-and-mortar. We now have 1,200 vans and Super Duties that are outfitted for remote service to our fleet customers. The Net Promoter Score is 10 points higher because they don't have to come on to the dealership. And this has effectively added 10% more capacity for our service. \r\nThe bottom line is, we have these amazing vehicles. We have a leading market share position. We're now adding long-term durability of those products. We have a highly profitable alternative revenue streams in repair and software now. Ford Pro is really a magical breakthrough for our customers and our company and, I believe, the industry. \r\nQuality. We don't have to go into the negative effects about quality, but we've been addressing it for 3 years now and we're starting to see progress. Our vision is that we want to give customers who buy our trucks and vans and our passion products, off-road, Bronco, all of it, the long-term durability from companies like Toyota and Honda, but in the segments we compete in. \r\nWe already have world-class quality in many parts of our company, and now we're seeing green shoots in North America. Kumar is leading this and he's here for Q&A to answer any questions. But there are 2 aspects of quality I want to highlight. The first is launch quality. That Super Duty launch I mentioned, it was a line in the sand for this management team. We intensified all of our testing, our real-world problem-solving on the plant floor with our suppliers and engineers. We slowed down the launch and boy, did it cost us. $1 billion of EBIT we forego last year, but it was the right trade-off for our company and our customers. \r\nThe result is the launch spike that every launch has we think on Super Duty is now similar to best-in-class in our industry, and we're seeing the benefits in the F-150 launch. That launch is underway right now and it's a really important one for our company. The second area of quality we're seeing progress on is initial quality. Now we measure that in 3 months in service. And that is highly correlated to long-term quality, and yes, warranty costs. And we saw last year a 10% increase. That is the largest improvement in the similar quality that we saw last time in 2016. It's the best in a long time and we are committing to a similar improvement this year. \r\nQuality now factors into 70% of the short-term incentives for our management at Ford. In the long term, it's even more important because we're measuring total shareholder return. We will share those KPIs on quality with you every quarter. \r\nNext thing I'd like to highlight is EVs. Now some have portrayed the change in the EV market as Darwinian. That could be a slow evolutionary change, but we think this has been a seismic change in the last 6 months of last year. That will rapidly sort out winners and losers in our industry. Now the catalyst for that seismic change is a combination of EV manufacturers cutting their price by 20% across all major geographies and a tremendous amount of capital flowing and a ton of new capacity into one single segment: 2-row crossovers. \r\nOur overall EV strategy has never been more relevant as the seismic change happens, and we want to share with you our targets. Our next Gen 2 products will be profitable in the first 12 months of their launch. And that will mean that we'll get to mid to high single-digit EBIT profit margins over their life cycle, and that's going to deliver profits above Model e's cost of capital. And here are our big bets and adjustments. We're going to spend less capital on larger EVs. And as we've always said, we'll have a very small number of those. \r\nWe're going to focus those large EVs on geographies and product segments where we have a dominant advantage like trucks and vans. And those products will have breakthrough efficiency compared to our Gen 1 products, and they're going to be packed with innovations that customers are going to be excited to pay for. We're also adjusting our capital, switching more focus on to smaller EV products. Now this is important because we made a bet in silence 2 years ago. We developed a super-talented skunk works team to create a low-cost EV platform. It was a small group, small team, some of the best EV engineers in the world, and it was separate from the Ford mothership. \r\nIt was a start-up. And they've developed a flexible platform that will not only deploy to several types of vehicles but will be a large installed base for software and services that we're now seeing at Pro. All of our EV teams are ruthlessly focused on cost and efficiency in our EV products because the ultimate competition is going to be the affordable Tesla and the Chinese OEMs. And that bet and all of the rightsizing of capital and even delays to some of our products, given the market realities, better balance growth, profits and returns for us. \r\nBut one of the things we're taking advantage of and taking some timing delays is rationalizing the level and timing of our battery capacity to match demand and actually reassessing the vertical integration that we're relying on and betting on new chemistries and capacities. Our overall EV business will grow this year because we have the Explorer launching in Europe and really exciting, many of our commercial vehicles launched with electric this year as we refresh the lineup. We will also align production and inventory for customer demand. EV customers are also helping us in a very critical area of software quality. They really, really are teaching us a lot. And this is a critical place where I think we're ahead as a company. \r\nWhy are we making these changes in our EV business and capital allocation? Well, because we learned as an early leader, as we scale the EVs and hybrids simultaneously. The demand curve turns out to be for EV is very different than ICE. We've seen an explosive growth in EVs in 2021 and 2022, and we realize very quickly that our first 3 Gen 1 products, we didn't have enough capacity. With EV growth, but as well importantly, the COVID supply shocks and the chip crisis itself and Tesla's ability to make vehicles despite the chip crisis in '21 and '22 and the 0 cost of capital gave us too optimistic of a demand signal at that time, and it drove a temporary spike in supply. \r\nAs the COVID shock retreated, we learned that as you scale EVs to 5,000 to 7,000 units a month and you move into the early majority customer, they are not willing to pay a significant premium for EVs. This is a huge moment for us. What we've seen, because we offer everything, is pricing quickly converged to hybrids after any benefit from subsidies. Now Tesla found out this first but we were right behind that, and they were very exposed to early majority. But we learned very quickly, and I want to say that no one will be immune to this reality. The most obvious indicator of this reality is looking at total revenue, not units for EVs. \r\nLook at the U.S. market. EV total revenue was down in the second half of last year versus Q2. If you look at unit volumes, they were up. That is a really important insight we learned in being a first mover. The same thing happened in China, the same thing happened in Europe. Our data shows that EVs are a clear destination for many customers based on their unique duty cycle. It's going to take time, more than we expected 18 months ago. But we are seeing big adoption variances by geography, and that's why the power of choice at Ford is so important and a big advantage for us. We're betting that choice and flexible manufacturing is going to get us successfully through this transition. \r\nLook at the best-selling vehicle in the United States, the F-150. We have a Lightning, we have a hybrid and high volume and a nice choice. In Q4, in California, our mix was 50% hybrid and EV F-150 and 50% ICE. 1,000 miles away in Dallas, it was only 15% hybrid and EV, 85% ICE. You go around the world, you'll see same variations. Hybrids will play an increasingly important role in our industry's transition and will be here for the long run. \r\n\r\nHybrid just fits specific customer use cases. On a Maverick pickup truck, our hybrid is focused on mileage and efficiency and they do the math very clearly, and they don't have to change their behaviors. On F-150 Hybrid, they get the same benefits even when they're toeing on fuel efficiency, but we throw in Pro Power Onboard on top of that to displace a very expensive generator cost. And margins on hybrids are closer to ICE, much higher than EV margins. The journey on EVs is inevitable in our eyes and we have a bright future of EVs. We're adjusting our capital and we're giving customers choice. \r\nLast thing I want to mention is talent. None of these breakthroughs in our company operationally or financially or in technical excellence and innovation are going to happen without the right talent. And we've learned that the right talent is not sufficient. Over the last 2 years, it's been imperative that we go to a right performance management system. It's a fundamental change in the way we're running the company. We now truly differentiate and reward excellence at Ford, and that matches our operation and our business delivery. It's a massive culture change. \r\nEvolving to a compensation and benefit structure weighed more towards variable compensation that is tied to our delivery business results is fantastic. You can't bring in and retain the best talent without making this change. And now our long-term incentives and our short-term incentives are tied specifically to shareholder value creation. Over to you, John.\n\nJohn T. Lawler\n\nThanks, Jim, and good afternoon, everyone. We appreciate you joining us today. So 2023 was an important year as we continued to execute our Ford+ plan. Our strong global product line, which is clearly resonating with our customers, delivered revenue of $176 billion, which was up 11%, marking our second consecutive year of double-digit growth. We delivered $10.4 billion in adjusted EBIT, at the high end of our guidance, driven by continued strength in both Blue and Pro. \r\nNow to provide some perspective, compared to last year collectively, our core business units, Pro, Model e, and Blue, improved EBIT by $2 billion or 26%, and this is after fully absorbing roughly $1.7 billion impact of the UAW strike. Free cash flow was $6.8 billion, generating a free cash flow conversion rate of 65%. And this is above the top end of our target range and was driven by underlying strength in both Pro and Blue. Now both of these metrics provide a good litmus test for the effectiveness of our Ford+ strategy. \r\nOur balance sheet remains strong with nearly $29 billion in cash and more than $46 billion in liquidity. And this provides considerable flexibility to manage our business as the industry continues to transform. With the improving trajectory of our business and strong free cash flow, we announced a quarterly dividend of $0.15 per share plus a supplemental dividend of $0.18 per share. This brings our payout ratio to 50% for the year, in line with our target to consistently return 40% to 50% of our free cash flow to shareholders. \r\nNow let's take a closer look at our performance. Revenue for the quarter was $46 billion, up 4% despite the impact of the strike, which cost us roughly 90,000 units of production. Adjusted EBIT came in at $1.1 billion with an EBIT margin of 2.3%, which again included the impact of the strike. \r\nNow let's look at our segments. Ford Pro delivered another strong quarter with revenue up 11%, EBIT of $1.8 billion was up 25% with a margin of 11.8%. Full year results clearly demonstrated the potential earnings power of this growth business. Revenue jumped 19% and EBIT more than doubled year-over-year to $7.2 billion, an improvement of $4 billion. And with a margin of 12.4%, we're just shy of our mid-teen target. \r\nThe strengths Jim highlighted for Ford Pro are differentiated and drove strong results this year and have Pro poised for another strong year in 2024. \r\nFord Model e drove a 14% increase in wholesales in the quarter, a 2% increase in revenue and EBIT loss of $1.6 billion. For the year, wholesales were up 20%, revenue was up 12% and EBIT was a loss of $4.7 billion. Both the quarter and year were impacted by challenging market dynamics and investments in next-generation vehicles, both of which Jim addressed in his remarks. \r\nIn the quarter, Ford Blue revenue was flat despite the loss of roughly 60,000 units due to the strike. EBIT was $813 million with a margin of 3.1%. For the year, Ford Blue grew again with revenue up 8%. All of our regions are now profitable and contributing significantly to Blue's bottom line results. EBIT of $7.5 billion was up year-over-year with a margin of 7.3%. The improvement in EBIT reflects the underlying strength of our product portfolio, dampened by higher warranty and the UAW-related costs. \r\nTurning to Ford Credit. Ford Credit generated EBT of $280 million in the quarter and $1.3 billion for the year. As expected, full year results were down year-over-year. Credit loss performance continues to normalize but remains below our historical average. \r\nNow before I turn to guidance, I wanted to touch briefly on capital allocation. One of the benefits of our segmentation, in addition to increased transparency and accountability, is that we are now allocating capital based on the growth opportunities in different risk and return profiles of our segments. This allows us to assign specific risk-adjusted hurdle rates for each of our businesses, driving greater accountability to returns on the capital we invest. \r\nSo here's how we're thinking about 2024 guidance. For the full year, we expect to earn between $10 billion to $12 billion in adjusted EBIT. The high end of the range would be a record for Ford. Adjusted free cash flow of $6 billion to $7 billion and capital expenditures of $8 billion to $9.5 billion, flat to moderately up year-over-year. So let me double click on capital expenditures. \r\nWe expect EVs to be about 40% of the total, and this reflects products already in flight, including investments in EV powertrain supporting our next generation of products in our LFP battery plant here in Michigan. As we continue to adjust to market dynamics, we are scrutinizing every dollar and will continue to drive efficiencies, targeting to land at the lower end of our CapEx range. \r\nFor example, in 2023, we already started to take action. We delayed our second JV battery plant in Kentucky. We reduced the size of our new LFP plant in Michigan, and we did not proceed with our JV battery plant in Turkey. And now we are further adjusting installed capacity to match demand, reassessing vertical integration in new battery chemistries, adjusting Gen 2 products and potentially their launch timing to ensure they meet our criteria for profitability, given the new market reality. \r\nOur 2024 outlook also assumes a flat to slightly higher SAAR in both the U.S. and Europe. And our planning assumption for the U.S. is 16 million to 16.5 million units, nonrecurrence of the UAW strike, full year of our all-new Super Duty driving both positive pricing and mix in Ford Pro, industry supply and demand normalizing. Now from a planning perspective, we are assuming lower industry pricing of roughly 2%, driven by higher incentive spending as we move through the year. We expect this to be partially offset by top line growth from the launch of our new products. \r\nIn addition, we're assuming a $2 billion benefit from cost reduction initiatives that offset higher labor and product refresh costs. Within the segments, we expect Ford Pro's strength will continue unabated. With continued strong demand for our leading products, we are targeting EBIT between $8 billion to $9 billion, driven by continued growth and favorable mix, partially offset by moderated pricing. For Model e, we expect losses to widen to a range of $5 billion to $5.5 billion, driven by continued pricing pressure and investments in our next-generation vehicles. We expect our first-generation vehicles to improve their profits throughout the year. \r\nFord Blue, EBIT to be about equal to last year at $7 billion to $7.5 billion, reflecting a balanced market equation, including the impact of our all-new F-150. We also expect costs to be flat as we offset higher labor and product cost with efficiencies. And we expect Ford Credit's EBT to be up slightly year-over-year to about $1.5 billion. \r\nNow taking a step back, our performance last year reflects the positive momentum of our Ford+ plan. Capital discipline is driving the right global footprint, portfolio of products and consistent cash generation. We continue to see growth opportunities and remain focused on delivering improvements in both quality and cost. \r\nNow that wraps our prepared remarks. We'll use the balance of the time to address what's on your mind. Thank you. Operator, please open up the line for questions.\n\nQuestion and Answer Session\n\nOperator\n\n(Operator Instructions) Our first question today is from Adam Jonas with Morgan Stanley.\n\nAdam Michael Jonas\n\nJim, I want to talk to you about Ford versus Ferrari, which is by the way, a great movie, by the way, and I think the good guys won. I remember a time when Fiat owned Ferrari, and I had a valuation of about $4 billion on it. Now Ferrari is worth $80 billion today, and the business was totally ignored by investors when it was part of Fiat. Now Ford has a Ferrari, it's called Ford Pro. And I think we agree, people are ignoring the cash cow but I disagree with you, Jim. You said it's because of opaque kind of transparency or opaque kind of metrics. I don't agree. I think it's because almost all the profits are funding this EV science project. Am I being unfair, Jim, with that kind of assessment or what can your team do about this? I have a follow-up.\n\nJames D. Farley\n\n(inaudible) enthusiasm towards it. But relative to EVs, there's a lot we can do, and there's a lot we're doing. I think you're going to see a lot of seismic changes in the industry because of this pricing power reality that we've all faced. More OEM relationships, different shifting to a buy versus a build or vertical integration, shifting in capital and generally more focus on smaller vehicles. \r\nThe EV customers are very robust. They really like the vehicles. They do not repurchase ICE or hybrid vehicles. They're very loyal and they love the vehicles, so it's on us to get the cost right. That is the issue with the transition. The good news is Ford has a high-volume hybrid business, and the timing of our second cycle product gives us a chance to make a lot of adjustments in capital, bringing it down, including, and it allows us to execute them with a cost approach that's very different than our first generation. \r\nAnd I think all of our commitments to make money in the first 12 months of all of our launches, to have that kind of profitability in Model e, to return its cost of capital, I wouldn't be saying it if I didn't believe it. And it's also got a lot of other benefits, which I want the team to explain and that are really important to understand. \r\nMarin, maybe you want to go over those, or John?\n\nMarin Gjaja\n\nSure. Thanks, Jim. If we just think about what the Gen 1 vehicles can do for us, we're building the EV business and, at the same time, we need the compliance value. We mentioned before the value of the credits that generated allow us to sell these high-margin ICE vehicles. Each EV sold allows us to sell multiple high-margin vehicles. A Lightning can offset roughly...\n\nJames D. Farley\n\nIncluding Pro.\n\nMarin Gjaja\n\nIncluding Pro. We're also building new customer-facing capabilities. We are satisfying demand that is out there where there's high levels of adoption. We've got new dealer standards, changing experience for the customer for shop and buy ownership and service so that we're learning what's required to serve these customers, both us and our dealers. We're developing a charging network through our dealers and together with Tesla.\r\nNow the adoption varies tremendously by geography. As Jim mentioned, across the West Coast, we're seeing 30% of the market in F-150 being in EVs. That volume is giving us a feedback loop for engineering. We're developing these electric powertrains. We've got better handle on thermal propagation, and the software and services that these customers demand much more intensely than a typical ICE customer, we're learning how to deliver those much better, much more efficiently and with higher quality.\r\nI would be remiss if we ignore the lifetime value of both the customer and the vehicle. We've got a 60% conquest rate on Gen 1 and the integrated services like BlueCruise that we can sell in these vehicles goes through the whole life of the vehicle.\n\nJames D. Farley\n\nAnything else, John?\n\nJohn T. Lawler\n\nYes. I mean, the only thing I would say is, Adam, one of the important things, just on top of that, is that the segmentation is really important here. And we know that the EV business needs to stand on its own, right? We're very clear about that. And it needs to generate a profit and a return on the capital we're investing. Now we're not there yet, but that's what we're working towards. \r\nThe compliance benefit that we get, that's important. We can sell up to a dozen ICE F-150s or other ICE profitable vehicles for every Lightning we sell. But that -- we don't do anything with wooden nickels. We don't do any credit into EV, into Model e or anything like that because eventually, this business has to stand on its own sooner rather than later. And that's a really important point. It's clean.\n\nMarin Gjaja\n\nThanks, John.\n\nJames D. Farley\n\nBy the way, Pro includes electric. And although electric is going slower for Pro customers, it's actually they do the math quicker than retail customers. And so actually, our January EV sales in Pro were higher than December, which would ever make sense. But we're seeing more and more Pro customers go electric if their duty cycle makes sense. So even for Pro, it's important for our success.\n\nAdam Michael Jonas\n\nI appreciate that, Jim. I just have just a brief follow-up on China. You guys come across as very sophisticated in terms of having sophisticated insight into China. You got Ambassador Huntsman on the Board, been there for years. You have a JV partner with Changan that's really kicking a** lately with EVs. So how can Ford work -- potentially work with Chinese partners to help Ford achieve its EV objectives in a more capital-efficient way?\n\nJames D. Farley\n\nThank you. Well, person right next to me, John was the head of Ford at China and knows the Changan leadership really well. John and I went to a [Gamba] trip last spring and it was really eye-opening for us. I mean, as 2 leaders who look to each other said, holy cow. I think, first of all, China as an export for our very profitable overseas markets is really important now. And actually, we shouldn't overlook the importance of JMC now. We have really profitable export business in China: ICE and EV.\r\nWe're going to actually a very different strategy, I think our competitors in China with a very low capital approach to EVs. So we don't -- we see the kind of bloodbath reality now in China on EVs, and we're watching that really carefully. We don't think it's a good time to jump in with both feet in China with EVs, but we're allowing our partners' platforms to lead our electrification. And in doing that, we are learning a lot about their capability and the local IP there in China.\r\nAnd it's pretty breathtaking to see what we're learning. I think our approach of very low capital, profitable business is appropriate at this moment in time for this kind of EV explosion but also bloodbath and profitability. And I think we're also building a global capability team for digital experience, battery and sensing tech and product concepting in China that we'll use globally. I think even though that's not a profit or loss thing, we see that as a real capability globally. So our strategy is quite different but I think it works for our company.\n\nOperator\n\nThe next question is from John Murphy with Bank of America.\n\nJohn Joseph Murphy\n\nJust a first question here, Jim, on EVs. Obviously, it's a hot topic here. As we look at sort of the slowdown here, we're hearing from dealers, particularly I spent some time in NADA last week, that they're seeing EVs traded in and folks buying ICE and EV. So they're actually swapping out EVs and buying ICE and hybrids. And then you're seeing Hertz dumping 20,000 EVs and canceling or postponing orders. So both on the retail side and the commercial side, you're getting these stories. It's following up with data that folks are really not happy with the product sort of near term.\r\nWhat do you think is happening because the customers are not happy? I mean it sounds like on the Pro side, some folks might be with the product that they have right now. And if you think about sort of your planning assumptions maybe near term, I don't, just for argument's sake, say you have 100,000 less EVs. Do you think if you sell 100,000 less EVs at Ford that you have the ICE and hybrids to backfill for that so you actually don't lose sales and you actually might be a little bit more profitable in the short term? It's kind of a lot in that question, but just trying to understand what you're seeing in the market, why things are failing here both on the retail side and on the commercial side to some degree. And do you have the product to backfill if those volumes are lower?\n\nJames D. Farley\n\nYou can imagine -- John, you can -- thank you for your question. You can imagine with our choice portfolio being big on scaled hybrids, ICE, of course, and EV, this is a very fundamental question for us because we have to plan our capacity years out. Here's what we found. Customers are doing the quick showroom math on hybrids. They can quickly evaluate the breakeven between ICE and a hybrid on the showroom floor. For an F-150, they can -- they know how much a Honda generator cost versus Pro Power Onboard, and they don't have to change the behavior.\r\nA lot of the operating cost efficiencies in EV for a mainstream customer require change like installing a charger at home, or they're uncertain. How much will I save on repair cost? How much will I save on electrons versus gasoline? It's harder to compare. And so we're just seeing the cost of ownership, which is interesting because the success of EVs and Pro is a customer that does that math more brutally and they use the vehicle at a higher utilization. So they're looking at cost of ownership in a much clearer lens. And therefore, some of them are doing the math and going to EV.\r\nI think that math has always been there for HEV, but now more customers are interested in doing that. And we believe that customers are smart and some people would do these cycles for EVs. So going to do that math over time and it's worth investing because it's a really good business. But it's on us to get the cost right. So I just think we're seeing the math for an EV customer, mainstream EV customer is a little bit more opaque than what we see on hybrids. We're hearing -- Marin, do you want to say anything quickly about dealers?\n\nMarin Gjaja\n\nYes. I think what we're seeing with our dealers is they've been making margins comparable to their ICE vehicles in the last year. And in '21 and '22, we're actually doing better than on their ICE vehicles when pricing was really strong. So we feel really good about making sure our dealers are making money on this and are making investments for the long term. But I think that's something that we monitor closely. I think just building on Jim's point quickly, I would just say the big difference for consumers is they make that one choice every few years, whereas the Pro customer is changing their fleet, consistently buying lots of vehicles, and they test and they learn what the TCO difference is that total cost of operation.\n\nJames D. Farley\n\nAnd as far as the manufacturing capacity, we planned that 40% growth in HEVs years ago, so that is our capacity. We may have some pricing room above that. And we've seen actually HEV pricing become more robust as we hit these capacity limits. But 40% growth is a big increase for us. We think we got it about right. That means like an F-150, America's best-selling vehicle. We think 25% of the sales for America's best-selling vehicles can be hybrid. And I think we're going to get close to some of the all-hybrid nameplates out there that people think of when they think of hybrids with F-150. So we have a lot of flexibility. I think we're in good shape.\n\nJohn Joseph Murphy\n\nJim, just one follow-up. I mean you reported to a rumor to be doing a 2-week tour to your dealers, around your different dealers. I'm just curious, I mean, some of them are happy, some of them are annoyed at the EV stuff. What is the general message going to be as you're going around to the all-important channel and trying to get the troops in line and everything moving in the right direction in the distribution channel?\n\nJames D. Farley\n\nA couple of key messages. First of all, I mentioned Ford Pro and what a profit juggernaut that is. We continue to need our dealers to invest in the brick-and-mortar in those remote service van and accelerate that because that is the upside. We want to get to -- if we want to get to 20% of the profit for Pro being attached services, it's going to have to come on the back of capacity in our dealers and vans. So invest in Pro.\r\nThe second thing is we have manufacturing flexibility between ICE and EV and hybrid. So we want to make sure that they understand that we're in probably better shape than any other brand in this transition. \r\nThe third message is we want them to understand our progress on quality, and we are going to press to be among the leaders in retailing. They should keep for our customer, remote pick up and service, doing more repairs for our retail customers remote, and that takes investment in their side. We really want to step on the gas on customer experience, both ownership and purchase. And I think that has to come from the top. Jim Farley has to say to all these dealers who are private investors, we need your partnership right now. That's why I'm going on the tour.\n\nOperator\n\nThe next question is from Rod Lache with Wolfe Research.\n\nRod Avraham Lache\n\nJim, you said that you're discovering that the adoption curve for EVs is a bit shallower, but we're still seeing $5 billion to $5.5 billion of losses in Model e, which implies that structural costs are probably higher in 2024 than 2023. So it sounds like you're committed because you see the ultimate benefit and maybe also a little bit because there isn't much choice. So ultimately, the question is, can you control and commit to when that business reaches breakeven, either through stronger demand or lower spending? Because from here, $5 billion improvement is pretty meaningful. Or do you have to do that because of the trajectory of ZEV and EPA and all the other things possibly exceeding where consumers are?\n\nJames D. Farley\n\nWell, we're not going to go to market with the vehicle unless we completely convinced ourselves that it's going to be profitable. And that takes some adjustments on timing actually. And we see opportunity in the short term to make some adjustments. But yes, I know it's a huge turnaround and it's a big number. John, maybe you want to go into the actual losses in Model e just to pick them apart a little bit. And then I think you'll see a little bit more about the opportunity we have at Gen 2.\n\nJohn T. Lawler\n\nYes. So the biggest issue we have in our Gen 1 vehicles, of course, is that the revenue collapsed and they're not optimized from a cost standpoint. We put them through very quickly to get to market and you're seeing that flow through. But I think, Rod, part of what you were getting at is that we have no choice. And we will continue to work on improving the cost structure of the Gen 1 vehicles. And as Jim said, our Gen 2 vehicles we won't launch unless we can get to a profit and a return on that capital that we're investing there at the pricing environment that we now understand is a reality.\r\nSo yes, it is very much the mother of all optimization modeling and work around the balance between how many EVs we sell because we talked about the compliance benefit of that. For every Lightning, we can sell 12 ICE vehicles. We can sell a number of ICE vehicles with every Mach-E we sell, and so there's that balance. And then there's the balance of what we need to sell from the ICE standpoint and how we can improve with HEVs there, and that's a benefit, too. But there's also, and you'll see that in our K tomorrow, we are buying credits as they're available. So we have to optimize across all 3 of those frontiers and that's what we're working on right now.\r\nBut we know that we have to have this electric vehicle business stand on its own and be profitable because we know that there are competitors out there. We talked about that the Chinese as well as Tesla that are profitable, and we have to cross that fulcrum and get there. And that's what our goal is. So it needs to be a benefit of profitable business, return on the capital plus the compliance benefit that we get from those.\n\nJames D. Farley\n\nAnd Rod, we have a lot of stakeholders at Ford so we're not going to go in a lot of details, but we have optionality even this year in capital spending. I mean a lot of that guide is EVs. John, I don't know if you want to be specific, but...\n\nJohn T. Lawler\n\nIt's about 40% last year and 40% of our CapEx this year and is EV.\n\nJames D. Farley\n\nAnd we're driving as a team to be on the low end of that range.\n\nJohn T. Lawler\n\nAbsolutely.\n\nJames D. Farley\n\nBecause we are working hard on our EV spend. And I just want to make sure we don't want to leave this call with the fact that this is totally baked. We are working really hard to be on the low end of that range because we think it's appropriate to run the business.\n\nRod Avraham Lache\n\nCan you commit to breakeven at a certain point that you said before that the Gen 2 vehicles come out in 2026? Is that kind of the time line for closing that $5 billion? And then just as a follow-up, I think you're saying that you've got line of sight on warranty coming down. Will we see the variable cost disadvantage that you've highlighted in warranty and material starting to come down this year?\n\nJames D. Farley\n\nWe have the leader of our EV business here, Marin, so I think that question goes to you on timing and warranty.\n\nMarin Gjaja\n\nYes, I don't think we're prepared right now to commit to a specific timing on when we're going to be positive EBIT. We are going to expect to see improving gross margin quarter-over-quarter over the course of the year. John mentioned some of the levers we're starting to pull, and we will continue to adjust to the market realities. We've changed our production. We have increased C&I as need be to address our inventory issues. And we're going to keep working on our cost.\r\nWe've taken 4,000 to 5,000 out of the BOM on Mustang Mach-E since it was launched and 2,000 to 3,000 out of Lightning, and the team continues to work. But the market is turned and it's going to be a challenge. And I don't know that we can commit because we don't know exactly what's going to happen in the market.\r\nIn terms of warranty costs, our Generation 1 vehicles, as we mentioned earlier, have been incredibly valuable for us to learn about a set of the issues around EVs, batteries and thermal obligation. And we will continue to work on that to lower our warranty costs dramatically for Generation 2, but we've got to deliver that in partnership with Kumar and the industrial platform.\n\nJohn T. Lawler\n\nSo Rod, I think the last part of your question was around, are we going to start to see costs turn? I would say that from a warranty standpoint, costs are probably going to be about flat this year. We're starting to see green shoots in the quality improvements. But as you know, the way that works, there's a lag. And Kumar can touch upon this a little bit more, but this year, we expect to see $2 billion of efficiencies flow through.\r\nAnd those efficiencies are in the material cost in the industrial system, pretty much offsetting the impact of UAW. But also remember, 60% of our global portfolio this year will be refreshed. And coming with that will be incremental costs that we have for new features, compliance, et cetera. And so what we should see this year is the efficiencies of $2 billion offsetting the UAW labor contract plus the refresh costs of our -- 60% of our products being refreshed this year.\n\nOperator\n\nThe next question is from Dan Levy with Barclays.\n\nDan Meir Levy\n\nI want to go back to Pro and your -- the guide that you have for this year is already in line with the midteen margin guide you provided at your CMD last spring. So really the question is, how sustainable is this earnings stream? And specifically, I think you've had something like $7 billion of price tailwind. Last year, I think $11 billion if you aggregate over a 2-year stretch. I know this is partially driven by new product, but what is the sustainability of these very robust price tailwinds you experienced?\n\nJames D. Farley\n\nWell, first of all, I tried to explain the fundamental factors for our vehicle profitability in Pro that's driving that demand will be here for a while. It's basic infrastructure, government state, 5G, onshoring, manufacturing, manufacturing sector. We believe that, that's very durable. And by the way in Europe, we've been the top-selling brand there for 9 years and we have very old products. So we haven't even seen the effect of Transit Custom and Ranger that's all coming our way.\r\nWe feel that this is a pretty robust profitability because we've never had the 20% attach rates. We've never had 0.5 million units of software with 50% margins. We've never really focused on Pro aftersales like we are now. We're just getting started with this 20% of the profitability coming from attached services. And I think that totally changes the risk portfolio of our commercial business. And we -- this is a real opportunity for our company that we never had.\r\nI also believe that attach rates are the kind of things that we'll start to see on the retail side of our business. Blue's software is now 70% marked and it's high volume now. And we're just getting started with that optionality. So what it will be 5 years from now? I'm not sure the time frame of your question, hard to predict. But for the next couple of years, we're in a really good spot because the shovels are in the ground or about to get in the ground.\r\nThe one other thing about Pro that we have to watch really carefully, which would be even more upside, is a return to a robust construction housing market, which has been really slow in the last couple of years. If that starts to fire up, we're going to even have more capacity issues on Pro.\n\nDan Meir Levy\n\nGreat. And then as a follow-up, John, I want to go back to your comments that you just mentioned a second ago on the industrial costs. And specifically, I think at the CMD, talked about a $7 billion cost disadvantage versus your competitors in Blue. So how do we contextualize the cost improvements that you're getting now versus the $7 billion? I mean is it safe to say that now this journey on sort of narrowing that gap is starting? Or is it still just still a lot more work to do? Just help us understand the path to narrowing that cost gap versus your competitors' inflow?\n\nJohn T. Lawler\n\nYes. What I would say is that it is now we're starting to gain the traction and that gap should start to narrow. And your -- that's part of the $2 billion. And so it's going to be across the industrial system, both in material and in labor. And I think Kumar can share some more details on how he's leading that and driving that.\n\nAshwani Kumar Galhotra\n\nYes. Thanks, John. Well, this year, we're starting very differently than '24 than '23, for example. A couple of fundamental different things. Last year, we had a lot of inflationary pressures and claims from our suppliers. Those have eased very substantially and are going to help us deliver the $2 billion that John talked about.\r\nThe second thing is the supply chain is much more stable. That allows us to run our entire system much more smoothly and helps us remove a lot of waste. It also reduces a lot of our freight cost because we've been doing a lot of premium freight last couple of years so that will help as well. And in terms of material, we're attacking it in like 3 different ways. One is where our designs are not efficient, so I want to give you a bit of color on what those are, a couple of examples.\r\nIn one of our vehicle lines, we were using certain aero shields for fuel economy and the fresh eyes Kaizen review internally and some benchmarking, the team came up with a different way of delivering the same aero and save $40 per vehicle. So that's equivalent to about $10 million per year. Another category is where we are providing certain features to our customers where they're not finding a lot of value. And connected vehicle data here is very important because it helps us see what we're providing, whether the customers are using it or not.\r\nSo one example is an auto park feature that lets the customer parallel park automatically. Very, very few people are using it. So we can remove that feature. It's about $60 per vehicle, another $10 million per year. We're doing very extensive benchmarking for our manufacturing, both internally because we have lots of good ideas within our system and externally at a station-by-station level.\r\nSo just recently, one of the teams completed analysis of about 50 stations and saved about $8 million. And I already mentioned the freight. So these are the kinds of very robust ideas we have in the hopper, along with less inflationary claims, along with a stable supply chain that's going to help us close that gap that John mentioned and save $2 billion this year.\n\nOperator\n\nThe next question is from Emmanuel Rosner with Deutsche Bank.\n\nEmmanuel Rosner\n\nI was actually hoping to pick it up just where you left off on all that good color on the cost side. Are there any green shoots that you can sort of point us to, to give us increased conviction around some of these costs? Obviously, in 2023, cost was still a fairly major drag and that includes even in the fourth quarter. So like any in your reporting, any of these markets that we should be watching in terms of what will actually provide the tailwind, the $2 billion-plus in 2024?\n\nAshwani Kumar Galhotra\n\nIt's just fundamentally the things I talked about. We have a very robust hopper of ideas that we're very busy executing: stability in supply chain, removing a lot of waste, and freight cost. So we spent a lot of money, all of us did, in premium freight. We're starting to see in fourth -- third quarter and fourth quarter a much more stable supply chain that allows us not to spend that premium and bring those costs down in 2024.\n\nJohn T. Lawler\n\nEmmanuel, the other thing I would add to that is that when you look at '22 and '23, we were very much behind the curve of supply base, catching up to where they were and understanding what was driving their inefficiencies in claims. And we spent a lot of time in 2023 getting out in front of that. And I would say that we ended '23 with a great work that Liz has done to be at a very different place with our supply base. And now we're working together with them very proactively across Kumar's industrial system to identify efficiencies, things that we can change to help them and, as Kumar said, design actions, et cetera, things like that, that will make them more efficient as well. So that's another bit of color to add to that.\n\nEmmanuel Rosner\n\nJust a quick follow-up on this. The -- should we -- will these things take time to play out? I guess I'm looking at your fourth quarter walk and still on freight was still like a $1 billion headwind. So curious if you would need a number of quarters and then it would be a bit more back-end loaded? Or if we could sort of like turn on the switch and see some of these benefits in 2024? And then secondly, curious about your thoughts about the volume outlook for this year, especially for Ford Blue. I think some of the inventory days are sort of like towards the higher end of what you've historically been comfortable with. And so I'm wondering where you see volume growth for this year.\n\nJohn T. Lawler\n\nYes, so a lot in there. What I think you should see from a calendarization standpoint on the cost for 2024 is that you'll see, as Kumar said, a lot of these are the design actions we've been working to identify in 2023 that have built up this cadre of actions we call the hopper. And those will start coming through on the model year turnover. So more towards the middle of the year, you'll start to see a lot more traction there on those. Some of the manufacturing improvements, you'll see throughout the quarters, probably a little bit more of an even flow of those, I would say, right, Kumar?\r\nAnd so that's where we're at. When you look at our days' supply, when you look at our Blue days' supply, retail deal days' supply is in the low to mid-50s, so it's at about the limit of where we expect it to be. So leaning back that into volume, we expect the industry to be -- for the year, we expect it to be about [16 to 16 5], so maybe up 3% to 4% for us from a wholesale standpoint about that. From a planning perspective, that's where we're at. From a pricing perspective, we're planning to see about a 2% decline, negative pricing.\r\nAnd then when you step back and you look at that from an affordability standpoint, we think 2024 is the year where affordability is going to get back to pre-pandemic levels, where the monthly disposable income it takes to buy a vehicle should be back to about that 13% to 13.5%, which is what we saw before pandemic. So we're going to continue to see some top line pressure on Blue. We've got new product coming in Blue, which is going to give us some mix and some tailwind there. So that's going to be a positive for Blue.\r\nAnd then I think Jim covered off Pro. We're seeing incredible demand on Pro. And as you know, Emmanuel, those commercial orders come in 2 tranches. Half of them came in last year so they're all set. The other half are coming through now and we're continuing to see strength there.\n\nMarin Gjaja\n\nAnd that portfolio is going to be [refreshed] or new by the year-end.\n\nOperator\n\nThe next question is from James Picariello with BNP Paribas.\n\nJames Albert Picariello\n\nJust wondering if you could help dimension EV volumes for this year associated with the $5 billion-plus in Model e losses. And then with respect to Ford Pro's midteens margins this year, just curious on the impact tied to the fleet demand for EVs beyond companies, of course. Like do you foresee a step-up in Pro EV volumes for the year, no Model e losses getting more difficult. So just how are you thinking about the EV dynamic for Pro profitability as well?\n\nJames D. Farley\n\nOn the retail side, I'll ask Marin to answer that. On Pro, absolutely, our EV sales will grow not only because we're seeing more interest because the cost of ownership is advantageous for some fleet, but we're also expanding in Europe quite a bit our electric offering with our 2 Transit vans coming online. And so that will definitely -- and there are a lot of city closures and other kind of regulations in Europe that's driving adoption for electric vehicles, especially vans specifically. So yes, we'll have very robust growth in our EVs for Pro.\n\nMarin Gjaja\n\nYes. We expect growth in sales on the retail side as well. Remember, we had times where we were out of production last year on Mustang Mach-E and F-150 Lightning. So we'll be overlapping those, we'll see growth. And then more importantly, we're launching Explorer in Europe in the second half of this year so that's going to be a new offering that will help us grow. So we expect to see substantial unit volume growth.\n\nJames Albert Picariello\n\nAnd John, I know you touched on this already but are supplier cost reductions a core component of the $2 billion in savings for the year? Just wondering how commercial negotiations have progressed? And are there any areas that stand out in terms of opportunity?\n\nJohn T. Lawler\n\nYes. A lot of the $2 billion is, again, through the manufacturing system so it's the industrial efficiencies that we've been working on. And then from a design and material standpoint, it's mostly design reductions that are part of the $2 billion on a year-over-year basis. So it's those actions that we've been benchmarking and working on similar to the ideas that Kumar had described, pretty much design-related.\n\nJames D. Farley\n\nSo design, labor and freight primarily.\n\nOperator\n\nAnd the final question today comes from Ryan Brinkman with JPMorgan.\n\nRyan Joseph Brinkman\n\nObviously, a strong guide in aggregate. Digging into, though, the higher anticipated Model e losses of $5 billion to $5.5 billion, what is embedded within that from like a variable contribution margin perspective? How do you expect that to progress throughout '24? And then could we also check in a little bit longer term on how you're feeling about that Model e margin target of, I think, it's 8% by the end of '26 annualized, right? Including after GM recently lowered their '25 EV margin target.\r\nAnd given that I think you rolled out that 8% before Tesla cut their prices and saw their overall margin actually like decline to be basically in line with yours. If you're still targeting an 8% with the '24 guide out there now, it's really only '25 is the mystery. So it seems like quite a step-up then over the course of '25 to '26. \r\nI know you do expect a big boost from those second-generation EVs you discussed earlier but in comparison to the mixed fuel models. But is that just -- is that enough to get you to the 8% or are there other sources of improvement that need to layer in over '25 and '26? I don't know, vertical integration or what are those sources of savings? And how are you feeling about that target?\n\nJohn T. Lawler\n\nYes. So I think it's clear, given the dynamics in the marketplace and the way the top line come down significantly since we had put that out there that the 8% is not in the 2026 time period. So I think that's clear. I don't think anybody believes that by '26, we can bridge from here to 8%. It's going to come down to launching our next generation of vehicles and improving the contribution margin, gross margin, as Marin has said, on the first generation as we go through the year. \r\nBut Marin, do you want to add more color to that?\n\nMarin Gjaja\n\nJohn, I think that's right. I think it's really the levers we're pulling this year to improve gross margin over time on Gen 1 and then really sticking to the capital discipline and the operating discipline around launching Gen 2 only when they can be profitable and deliver the kind of returns we want. And over time, that will build a stand-alone profitable EV business.\n\nOperator\n\nThis concludes our question-and-answer session, and the conference has also now concluded. Thank you for attending today's presentation. You may now disconnect.", "link": "https://finance.yahoo.com/news/q4-2023-ford-motor-co-135119958.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.025, "neu": 0.829, "pos": 0.146}}, {"date": "2024-02-07T12:23:24+00:00", "title": "Snap tanks on earnings, Uber, CVS, and Disney report: Yahoo Finance Live", "content": "Shares of Snap (SNAP) are deep in the red this morning after the company’s quarterly results fell short of estimates, while also delivering first-quarter guidance below expectations. The news continues a rough week for Snap, which laid off 10% of its workforce on Monday. Elsewhere on Wall Street, several top names are reporting including Uber (UBER) and CVS (CVS). Uber's earnings and revenue topped expectations, while CVS topped estimates but cut its full-year outlook. Investors will be eyeing key earnings after the bell today from companies including Disney (DIS), PayPal (PYPL), and Mattel (MAT). Yahoo finance trending tickers include New York Community Bancorp (NYCB), Ford (F), and fuboTV (FUBO).\n\nKey guests include:\r\n9 a.m. ET - James Heaney, Jefferies Vice President\r\n9:45 a.m. ET - Jack Hartung, Chipotle CFO\r\n10:30 a.m. ET - Dan Sullivan, Edgewell Personal Care CFO\r\n11:40 a.m. ET - Chris Nassetta, Hilton CEO", "link": "https://finance.yahoo.com/video/snap-tanks-earnings-uber-cvs-122324044.html", "symbols": ["0A1U.IL", "0HRS.LSE", "0JZH.LSE", "0P4F.LSE", "0RNH.LSE", "1SI.F", "1SI.STU", "1SI.XETRA", "2PP.F", "2PP.STU", "2PP.XETRA", "2PP0.F", "CVS.BE", "CVS.DU", "CVS.F", "CVS.MU", "CVS.MX", "CVS.NEO", "CVS.STU", "CVS.US"], "tags": [], "sentiment": {"polarity": 0.565, "neg": 0.018, "neu": 0.932, "pos": 0.05}}, {"date": "2024-02-07T11:59:00+00:00", "title": "Regional Banks Are Under Pressure But This Isn’t a Systemic Crisis, and 5 Other Things to Know Before Markets Open.", "content": "Boeing plane door was missing bolts, Disney should split into three activist says, and other news to start your day.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a200b276-a7e3-3b6f-95aa-bc64b0ea7001/regional-banks-are-under.html", "symbols": ["0BOE.LSE", "BA.MX", "BA.NEO", "BA.US", "BCO.BE", "BCO.DU", "BCO.F", "BCO.HA", "BCO.HM", "BCO.MU", "BCO.STU", "BCO.XETRA", "BOEI34.SA", "DIS.MX", "DIS.NEO", "DIS.SN", "DIS.US", "DISB34.SA", "DISN.BA", "F.MX"], "tags": [], "sentiment": {"polarity": -0.296, "neg": 0.095, "neu": 0.905, "pos": 0}}, {"date": "2024-02-07T11:45:41+00:00", "title": "Ford Earnings More Than Double Views. F Stock Jumps As 2024 Outlook Races Past Views.", "content": "Ford earnings per share came in more than double analyst expectations. Ford stock surged, eyeing an early entry.\n\nContinue reading", "link": "https://finance.yahoo.com/m/29623023-3e7d-3cba-b4ba-aa7c04df8f1d/ford-earnings-more-than.html", "symbols": ["0QXR.IL", "7203.TSE", "8TI.BE", "8TI.DU", "8TI.F", "8TI.HA", "8TI.HM", "8TI.MU", "8TI.XETRA", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.896, "pos": 0.104}}, {"date": "2024-02-07T11:36:03+00:00", "title": "Ford shares surge on dividend boost, lower EV spending", "content": "(Reuters) - Ford Motor shares surged 6% in premarket trading on Wednesday after the automaker increased its dividend for the first quarter and decided to scale back investments in new capacity for loss-making electric vehicles (EV).\n\nOn Tuesday, the automaker disclosed its plans to return an extra 18 cents per share in dividend on top of the regular 15 cents to investors, joining rival General Motors in returning cash to investors. GM shares were also up 1.8%.\n\nThe dividend payout is aimed at enhancing the firm's payout ratio and distributing a portion of its substantial automotive cash balance, which stands at $28.7 billion, to shareholders, David Whiston, analyst at Morningstar said in a note.\n\n\"With this much cash plus credit lines giving over $46 billion of year-end total automotive liquidity, we think Ford can handle most bad 2024 macroeconomic news without sacrificing investing for the future,\" Whiston added.\n\nThe Dearborn, Michigan-based company said it was targeting $2 billion in cost reduction, in a bid to offset expenses related to the labor contract deal reached with the United Auto Workers union.\n\nFord will reduce investments in new EV capacity to align with a decrease in demand, as consumers opt for hybrid vehicles and family SUVs due to price and charging concerns.\n\nThe next generation of Ford EVs will be launched \"only when they can be profitable,\" Marin Gjaja, head of the Model E EV business, told analysts on Tuesday.\n\n\"We remain underweight on Ford, as we see pricing and cost reductions assumptions as optimistic,\" Wells Fargo analysts wrote in a note.\n\nThe carmaker also reported an adjusted profit of 29 cents per share for fourth quarter ended December, beating analysts' estimates of 14 cents.\n\nShares of Ford trade about 6.81 times forward profit estimates, above rival GM's 4.26 multiple.\n\n(Reporting by Shivansh Tiwary in Bengaluru; Editing by Shailesh Kuber)", "link": "https://finance.yahoo.com/news/ford-shares-surge-dividend-boost-113603066.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.964, "neg": 0.025, "neu": 0.866, "pos": 0.108}}, {"date": "2024-02-07T11:30:09+00:00", "title": "Futures flat with focus on earnings, rate-cut expectations", "content": "(Reuters) - U.S. stock index futures were muted on Wednesday though shares of Ford and Snap saw significant moves following their quarterly results, while investors were on the look out for clues from policymakers on the outlook for interest-rate cuts.\n\nFord Motor jumped 6.2% in premarket trading after the auto giant said it will return more cash to shareholders via dividend, dimming the gloom of a quarterly loss. Peer General Motors also added 1.8%.\n\nOn the flip side, Snap slumped 30.7% on missing Wall Street estimates for quarterly revenue, as the Snapchat owner continued to struggle to compete against larger rivals for digital advertising revenue. Peer Pinterest also shed 4%.\n\nAmong major corporate results due before the opening bell are Alibaba, CVS Health, Fox Corp and Uber Technologies.\n\nWith over half of S&P 500 companies now having reported earnings, 81.2% surpassed expectations, according to LSEG data on Tuesday. Overall, S&P 500 companies' earnings are expected to have risen 8.1% in the fourth quarter from the year-ago quarter.\n\nWall Street hit a banal patch this week following a stellar performance in the months before that saw the benchmark S&P 500 and the blue-chip Dow extend a bull-market run on the back of widely resilient corporate reports and optimism around interest rate cuts this year.\n\nWith Chair Jerome Powell ruling out a March rate reduction, traders are awaiting fresh clues from central bankers on the timing of the policy easing cycle, most of whom have refrained from issuing a timeline against the backdrop of a resilient economy.\n\n\"Market sentiment has been more 'glass half full' as fresh comments from policymakers poured out about the progress made on inflation,\" said Susannah Streeter, head of money and markets, Hargreaves Lansdown.\n\n\"Nevertheless, they have all warned that there is still work to be done, a message likely to be drummed home when other Fed governors speak later today.\"\n\nStory continues\n\nFocus is squarely on remarks from Fed officials including Governor Adriana Kugler, voting member Thomas Barkin and Susan Collins expected through the day.\n\nAt 5:48 a.m. ET, Dow e-minis were down 37 points, or 0.1%, S&P 500 e-minis were down 3.25 points, or 0.07%, and Nasdaq 100 e-minis were up 1 points, or 0.01%.\n\nAmong other big movers, New York Community Bancorp lost 8.8% and was set to extend a week-long sell-off after analysts expressed caution about \"governance risks\" at the bank and as Moody's downgraded the lender's long-term debt ratings to junk status.\n\nVF Corp missed expectations for its third-quarter results, and said CFO Matt Puckett will step down later this year, sending the Vans sneaker maker's shares down 9.5%.\n\nEnphase Energy surged 13.4% after the solar inverter maker said it expects inventory levels to normalize and demand for its products to pick up by the end of the second quarter.\n\n(Reporting by Johann M Cherian in Bengaluru; Editing by Maju Samuel)", "link": "https://finance.yahoo.com/news/futures-flat-focus-earnings-rate-113009619.html", "symbols": ["1SI.F", "1SI.STU", "1SI.XETRA", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA", "SNAP.US"], "tags": [], "sentiment": {"polarity": 0.026, "neg": 0.055, "neu": 0.889, "pos": 0.056}}, {"date": "2024-02-07T11:23:44+00:00", "title": "US STOCKS-Futures flat with focus on earnings, rate-cut expectations", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nFutures: Dow slips 0.10%, S&P off 0.07%, Nasdaq flat\n\nFeb 7 (Reuters) - U.S. stock index futures were muted on Wednesday though shares of Ford and Snap saw significant moves following their quarterly results, while investors were on the look out for clues from policymakers on the outlook for interest-rate cuts.\n\nFord Motor jumped 6.2% in premarket trading after the auto giant said it will return more cash to shareholders via dividend, dimming the gloom of a quarterly loss. Peer General Motors also added 1.8%.\n\nOn the flip side, Snap slumped 30.7% on missing Wall Street estimates for quarterly revenue, as the Snapchat owner continued to struggle to compete against larger rivals for digital advertising revenue. Peer Pinterest also shed 4%.\n\nAmong major corporate results due before the opening bell are Alibaba, CVS Health, Fox Corp and Uber Technologies.\n\nWith over half of S&P 500 companies now having reported earnings, 81.2% surpassed expectations, according to LSEG data on Tuesday. Overall, S&P 500 companies' earnings are expected to have risen 8.1% in the fourth quarter from the year-ago quarter.\n\nWall Street hit a banal patch this week following a stellar performance in the months before that saw the benchmark S&P 500 and the blue-chip Dow extend a bull-market run on the back of widely resilient corporate reports and optimism around interest rate cuts this year.\n\nWith Chair Jerome Powell ruling out a March rate reduction, traders are awaiting fresh clues from central bankers on the timing of the policy easing cycle, most of whom have refrained from issuing a timeline against the backdrop of a resilient economy.\n\n\"Market sentiment has been more 'glass half full' as fresh comments from policymakers poured out about the progress made on inflation,\" said Susannah Streeter, head of money and markets, Hargreaves Lansdown.\n\nStory continues\n\n\"Nevertheless, they have all warned that there is still work to be done, a message likely to be drummed home when other Fed governors speak later today.\"\n\nFocus is squarely on remarks from Fed officials including Governor Adriana Kugler, voting member Thomas Barkin and Susan Collins expected through the day.\n\nAt 5:48 a.m. ET, Dow e-minis were down 37 points, or 0.1%, S&P 500 e-minis were down 3.25 points, or 0.07%, and Nasdaq 100 e-minis were up 1 points, or 0.01%.\n\nAmong other big movers, New York Community Bancorp lost 8.8% and was set to extend a week-long sell-off after analysts expressed caution about \"governance risks\" at the bank and as Moody's downgraded the lender's long-term debt ratings to junk status.\n\nVF Corp missed expectations for its third-quarter results, and said CFO Matt Puckett will step down later this year, sending the Vans sneaker maker's shares down 9.5%.\n\nEnphase Energy surged 13.4% after the solar inverter maker said it expects inventory levels to normalize and demand for its products to pick up by the end of the second quarter. (Reporting by Johann M Cherian in Bengaluru; Editing by Maju Samuel)", "link": "https://finance.yahoo.com/news/us-stocks-futures-flat-focus-112344449.html", "symbols": ["0R30.LSE", "1SI.F", "1SI.STU", "1SI.XETRA", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA", "SNAP.US", "VFC.US", "VFP.BE", "VFP.DU", "VFP.F", "VFP.STU"], "tags": [], "sentiment": {"polarity": 0.026, "neg": 0.052, "neu": 0.895, "pos": 0.053}}, {"date": "2024-02-07T10:02:00+00:00", "title": "These Stocks Are Moving the Most Today: Ford, Snap, Enphase, NYCB, Fortinet, Alibaba, Disney, and More", "content": "Ford posts better-than-expected fourth-quarter adjusted earnings and sales, while Snap’s disappointing outlook sinks the stock. Alibaba, CVS Health, Walt Disney, and PayPal report earnings Wednesday.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e17a38cd-7e1e-37ac-9814-d1eb360d0c81/these-stocks-are-moving-the.html", "symbols": ["0IR9.LSE", "8SO.F", "8SO.STU", "DIS.MX", "DIS.NEO", "DIS.SN", "DIS.US", "DISB34.SA", "DISN.BA", "E0P.F", "ENPH.US", "F.MX", "F.US", "F1TN34.SA", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU"], "tags": [], "sentiment": {"polarity": -0.494, "neg": 0.11, "neu": 0.89, "pos": 0}}, {"date": "2024-02-07T00:30:07+00:00", "title": "Ford Motor Company (F) Reports Q4 Earnings: What Key Metrics Have to Say", "content": "For the quarter ended December 2023, Ford Motor Company (F) reported revenue of $43.3 billion, up 3.6% over the same period last year. EPS came in at $0.29, compared to $0.51 in the year-ago quarter.\n\nThe reported revenue represents a surprise of +14.08% over the Zacks Consensus Estimate of $37.96 billion. With the consensus EPS estimate being $0.12, the EPS surprise was +141.67%.\n\nWhile investors closely watch year-over-year changes in headline numbers -- revenue and earnings -- and how they compare to Wall Street expectations to determine their next course of action, some key metrics always provide a better insight into a company's underlying performance.\n\nAs these metrics influence top- and bottom-line performance, comparing them to the year-ago numbers and what analysts estimated helps investors project a stock's price performance more accurately.\n\nHere is how Ford Motor Company performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\n\nWholesale Units - Ford Blue: 758 thousand compared to the 663.93 thousand average estimate based on three analysts. Wholesale Units - Ford Pro: 361 thousand compared to the 313 thousand average estimate based on three analysts. Wholesale Units - Ford Model e: 34 thousand versus the three-analyst average estimate of 43.93 thousand. Revenues- Company excluding Ford Credit: $43.30 billion versus $37.76 billion estimated by three analysts on average. Revenues- External Revenues- Ford Blue: $26.20 billion versus $23.13 billion estimated by two analysts on average. Revenues- Ford Credit: $2.70 billion compared to the $2.50 billion average estimate based on two analysts. Revenues- Ford Pro: $15.40 billion compared to the $13.54 billion average estimate based on two analysts. Revenues- External Revenues- Ford Model e: $1.60 billion compared to the $1.60 billion average estimate based on two analysts. Adjusted EBIT- Corporate Other: -$230 million versus -$247.84 million estimated by three analysts on average. Adjusted EBIT- Ford Blue: $813 million compared to the $879.98 million average estimate based on three analysts. Adjusted EBIT- Ford Credit: $280 million versus $214.57 million estimated by three analysts on average. Adjusted EBIT- Ford Pro: $1.81 billion compared to the $1.23 billion average estimate based on three analysts.\n\nStory continues\n\nView all Key Company Metrics for Ford Motor Company here>>>\r\n\r\nShares of Ford Motor Company have returned -3.2% over the past month versus the Zacks S&P 500 composite's +5.3% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/ford-motor-company-f-reports-003007410.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.978, "neg": 0, "neu": 0.935, "pos": 0.065}}, {"date": "2024-02-07T00:00:00+00:00", "title": "3 Stocks to Snap Up Before Any Interest Rates Cuts", "content": "The stock market is likely to climb when interest rates are cut later this year. Here are three stocks to buy before interest rate cuts.", "link": "https://investorplace.com/2024/02/3-stocks-to-snap-up-before-any-interest-rates-cuts/", "symbols": ["BAC.US", "ENPH.US", "F.US"], "tags": [], "sentiment": {"polarity": 0.402, "neg": 0.137, "neu": 0.671, "pos": 0.192}}, {"date": "2024-02-07T00:00:00+00:00", "title": "More Bad News for Tesla Stock: Ford and Toyota Are Thriving", "content": "Ford and Toyota demonstrated that hybrid vehicles are taking legacy automakers to the next level. That's bad news for Tesla stock. ", "link": "https://investorplace.com/2024/02/more-bad-news-for-tesla-stock-ford-and-toyota-are-thriving/", "symbols": ["F.US", "TM.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": -0.542, "neg": 0.149, "neu": 0.851, "pos": 0}}, {"date": "2024-02-06T22:30:04+00:00", "title": "Ford Motor Company (F) Beats Q4 Earnings and Revenue Estimates", "content": "Ford Motor Company (F) came out with quarterly earnings of $0.29 per share, beating the Zacks Consensus Estimate of $0.12 per share. This compares to earnings of $0.51 per share a year ago. These figures are adjusted for non-recurring items.\n\nThis quarterly report represents an earnings surprise of 141.67%. A quarter ago, it was expected that this company would post earnings of $0.40 per share when it actually produced earnings of $0.39, delivering a surprise of -2.50%.\n\nOver the last four quarters, the company has surpassed consensus EPS estimates three times.\n\nFord Motor Company , which belongs to the Zacks Automotive - Domestic industry, posted revenues of $43.3 billion for the quarter ended December 2023, surpassing the Zacks Consensus Estimate by 14.08%. This compares to year-ago revenues of $41.8 billion. The company has topped consensus revenue estimates four times over the last four quarters.\n\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\n\nFord Motor Company shares have lost about 4.9% since the beginning of the year versus the S&P 500's gain of 3.6%.\n\nWhat's Next for Ford Motor Company?\n\nWhile Ford Motor Company has underperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\n\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\n\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\n\nStory continues\n\nAhead of this earnings release, the estimate revisions trend for Ford Motor Company: mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $0.48 on $38.13 billion in revenues for the coming quarter and $1.77 on $159.31 billion in revenues for the current fiscal year.\n\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Automotive - Domestic is currently in the top 43% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nOne other stock from the same industry, Vroom (VRM), is yet to report results for the quarter ended December 2023.\n\nThis company is expected to post quarterly loss of $0.37 per share in its upcoming report, which represents a year-over-year change of +21.3%. The consensus EPS estimate for the quarter has remained unchanged over the last 30 days.\n\nVroom's revenues are expected to be $231.74 million, up 10.7% from the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nVroom, Inc. (VRM) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/ford-motor-company-f-beats-223004566.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.012, "neu": 0.892, "pos": 0.096}}, {"date": "2024-02-06T21:41:41+00:00", "title": "Ford Stock Jumps After Stronger-Than-Hoped Earnings, 2024 Outlook", "content": "Ford earnings are expected to clock their first decline in five quarters when the company reports late Tuesday.\n\nContinue reading", "link": "https://finance.yahoo.com/m/29623023-3e7d-3cba-b4ba-aa7c04df8f1d/ford-stock-jumps-after.html", "symbols": ["0QXR.IL", "7203.TSE", "8TI.BE", "8TI.DU", "8TI.F", "8TI.HA", "8TI.HM", "8TI.MU", "8TI.XETRA", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-02-06T21:36:13+00:00", "title": "Ford posts $523 million 4Q net loss on accounting charge for pensions but beats analyst estimates", "content": "DETROIT (AP) — Ford Motor Co. swung to a net loss in the fourth quarter due to a large accounting charge on pension plans and the effects of a six-week strike at multiple factories by the United Auto Workers union.\n\nThe Dearborn, Michigan, automaker posted a $523 million net loss from October through December versus a $1.26 billion profit for the same period a year ago.\n\nExcluding one time items, the company made 29 cents per share, beating Wall Street estimates of 12 cents, according to analysts polled by FactSet.\n\nRevenue for the period was $46 billion, up 4% from a year ago, beating estimates of $43 billion.\n\nFord reported a $1.7 billion noncash accounting loss during the quarter on remeasurement of pension and other post-retirement employee benefits.\n\nThe company predicted it would have pretax earnings this year in a range of $10 billion to $12 billion.\n\nBased on strong free cash flow, Ford announced a supplemental dividend of 18 cents per share, on top of the normal 15 cents per share.\n\nFord shares were up 6.6% in extended trading on Tuesday. The company released earnings just after the markets closed.\n\nChief Financial Officer John Lawler said about 58,000 UAW-represented workers will get profit-sharing checks averaging $10,400 on March 14. The checks will vary by number of hours worked, and for the first time, temporary workers will be eligible.\n\nFord said earlier that the strike cost the company $1.7 billion in lost profits and cut sales to dealers by 100,000 vehicles. Most of the loss happened in the fourth quarter.\n\nLawler said the company would have had a strong quarter without the lost profits and strike settlement costs that were booked late in the year.\n\nFord said the strike caused it to lose production of high-profit trucks and SUVs. UAW workers shut down the company’s largest and most profitable factory in Louisville, Kentucky, which makes big SUVs and heavy-duty pickup trucks.\n\nThe UAW strike began Sept. 15, targeting assembly plants and other facilities at Ford, General Motors and Jeep maker Stellantis. The strike ended at Ford on Oct. 25.\n\nStory continues\n\nFord and the other companies agreed to new contracts with the UAW that raise top assembly plant worker pay by about 33% by the time the deals expire in April of 2028. The contracts also ended some lower tiers of wages, gave raises to temporary workers and shortened the time it takes for full-time workers to get to the top of the pay scale.\n\nAt the end of the contract, top-scale assembly workers will make about $42 per hour, plus they’ll get annual profit-sharing checks.\n\nFord said the contract will add about $900 to the cost of each vehicle, and it will try to offset that with productivity gains and expense reductions.", "link": "https://finance.yahoo.com/news/ford-posts-523-million-4q-213613003.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.888, "neg": 0.077, "neu": 0.832, "pos": 0.092}}, {"date": "2024-02-06T21:30:59+00:00", "title": "Ford earnings top estimates, announces supplemental dividend", "content": "Ford Motor (F) posted fourth quarter results that topped analyst estimates on both the top and bottom lines. Adjusted earnings per share was $0.29 compared to estimates of $0.13 and revenue of $46 billion topped expectations of $40.34 billion. The automaker's adjusted EBIT projection for 2024 was also better than Wall Street expected. In addition, Ford announced a supplemental dividend of $0.18 per share.\n\nYahoo Finance Live's Julie Hyman and Josh Lipton report the breaking numbers.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Stephanie Mikulich", "link": "https://finance.yahoo.com/video/ford-earnings-top-estimates-announces-213059118.html", "symbols": ["0P4F.LSE", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.796, "neg": 0, "neu": 0.917, "pos": 0.083}}, {"date": "2024-02-06T21:27:24+00:00", "title": "Ford Beats Expectations, Sees More Profit Growth Ahead", "content": "(Bloomberg) -- Ford Motor Co., buffeted by electric vehicle losses and rising labor costs, posted fourth quarter results that soundly beat expectations and forecast higher profits in 2024.\n\nMost Read from Bloomberg\n\nTrump Denied Immunity in DC Election Case by Appeals Court Xi to Discuss China Stocks With Regulators as Rescue Bets Build King Charles Treated for Cancer in New Royal Health Scare Wall Street Snubs China for India in a Historic Markets Shift Treasuries Rally Before Record 10-Year Bond Sale: Markets Wrap\n\nThe automaker Tuesday posted adjusted earnings per share of 29 cents, more than double the 13 cents analysts expected on average. Fourth quarter revenue of $46 billion surpassed the $40.3 billion analysts expected.\n\nFor the current year, Ford forecast earnings of $10 billion to $12 billion before interest and taxes, compared with $10.4 billion on that basis in 2023. That result was on the high end of the $10 billion to $10.5 billion the company predicted in November, when it lowered guidance following a six-week strike the by the United Auto Workers union.\n\nFord shares pared a gain of as much as 8.8% in postmarket trading, rising 6.3% to $12.83 as of 4:26 p.m. in New York. The stock closed regular trading down 1% on the year.\n\nAs electric vehicle sales slow, Ford Chief Executive Officer Jim Farley is attempting to thread the needle between scaling back the company’s EV spending by $12 billion while dialing up output of traditional internal combustion engine models, which generate profits needed to fund future growth. The automaker just halved production of electric F-150 Lightning pickups, while boosting output of its highly profitable Bronco sport-utility vehicles and Ranger pickup trucks.\n\n“They have a very strong combustion engine business they can fall back on to help subsidize the transition to EVs and also make money now,” David Whiston, an analyst with Morningstar Inc. in Chicago, said in an interview before Ford posted results. “They absolutely should be trying to crank out a ton of Broncos right now.”\n\nStory continues\n\nEV Red Ink\n\nThe automaker lost $4.7 billion on electric vehicles last year before interest and taxes, more than the $4.5 billion EV deficit Farley predicted in July. That translates to a loss of roughly $38,000 on each battery powered model Ford sold last year, according to an analysis by Bloomberg Intelligence analyst Joel Levington, who noted those losses are “unsustainable.”\n\nIn the fourth quarter, Ford’s EV unit, known as Model e, posted a loss of $1.57 billion, which was greater than the $1.34 billion loss analysts expected.\n\n“The Model e unit may improve its loss per vehicle by more than $10,000 in 2024,” Levington wrote in a Feb. 1 note. “Yet at an estimated $28,000 loss per unit, the segment will slice more than $4 billion off Ford’s profitability in addition to capital investments.”\n\nThe Dearborn, Michigan-based automaker also faces higher labor costs than its crosstown rival General Motors Co., which wowed Wall Street last week with a 2024 forecast of $12 billion to $14 billion in earnings before interest and taxes. GM has said the contract it struck with the UAW will add about $575 in costs per car, while Ford predicts an increase of up to $900 per vehicle due to the record deal that increases workers’ wages by 33% over four and a half years.\n\n“GM is better set up to absorb those labor costs because they already had a healthier cost base in North America,” Whiston said. “And Ford has more UAW employees in the US than GM.”\n\nIn its traditional internal combustion engine business, known as Ford Blue, the company earned $813 million before interest and taxes in the fourth quarter, less than the $866.5 million analysts expected. Ford’s US sales rose less than 1% in the fourth quarter as the UAW strike cost it production of high profit models such as the F-Series Super Duty pickup truck and the Explorer SUV.\n\nIn its commercial business, known as Ford Pro, the automaker earned $1.81 billion before interest and taxes, more than the $1.43 Billion analysts expected. Bloomberg Intelligence predicts Ford Pro will see margins expand this year while its Ford Blue unit will experience margin pressure as pricing drops because dealers have replenished their lots with inventory after pandemic-related shortages.\n\n“Ford profit is on a tightrope as the transition to electric vehicles takes longer than expected, requiring right-sizing to cut EV losses while managing increased pricing competition for Ford Blue,” BI analysts Steve Man and Peter Lau wrote in a Feb. 2 note. “Our scenario sees US electric-vehicle sales climbing 9% this year after growing at a compounded annual rate of 65% over the past three years.”\n\n--With assistance from Ed Ludlow.\n\n(Updates from fourth paragraph with postmarket shares; adds details from earnings release.)\n\nMost Read from Bloomberg Businessweek\n\nInside a Private Jet Club Where Everything Went Wrong The Person I Hired Is Now My Boss. What Happens Now? Is It Morning in Joe Biden’s America? Bloomberg New Economy Is Looking for World-Changing Leaders  Powell Wants Fed to Stay Out of Election Crosshairs. Good Luck With That\n\n©2024 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/ford-beats-expectations-sees-more-212724807.html", "symbols": ["8GM.BE", "8GM.F", "8GM.HM", "8GM.MU", "8GM.STU", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.058, "neu": 0.837, "pos": 0.105}}, {"date": "2024-02-06T21:23:22+00:00", "title": "Ford earnings: Automaker easily beats on Q4 revenue; 2024 profit outlook tops expectations", "content": "Ford (F) shares are pulling higher after hours after the automaker reported fourth quarter sales that easily topped expectations and projected a full-year profit outlook that beat estimates, though the company still sees more losses for its EV unit. The results come after GM reported strong results and profit guidance last week that indicated strength in the overall US auto sector.\n\nFord reported top-line revenue of $46.0 billion vs $40.35 billion estimated by Bloomberg, which is $2 billion more than a year ago despite the lingering effects of the United Auto Workers (UAW) strike in early Q4. In terms of profitability, Ford reported adjusted EPS of $0.29 vs $0.13 estimated, on adjusted EBIT (earnings before interest and taxes) of $1.1 billion, vs the $988.2 million expected.\n\nFor the year, Ford notched $10.3 billion adjusted EBIT, at the higher end of its full-year 2023 adjusted EBIT outlook of $10.0 billion to $10.5 billion (which include $1.7 billion in strike-related lost profits.) Ford reinstated its 2023 profit outlook following the ratification of its labor deal with the UAW.\n\nAs for its 2024 full-year outlook, Ford projected adjusted EBIT of $10 billion to $12 billion, which came in below Ford's pre-UAW strike 2023 profit outlook of $11 billion to $12 billion, but higher than estimates of $9.24 billion. Ford rival GM issued 2024 profit guidance that matched its initial pre-UAW strike outlook for 2023.\n\n\"The guidance presumes flat to modestly higher full-year U.S. industry volume, with overall lower vehicle pricing,\" the company said in a statement.\n\nFord also declared a first-quarter regular dividend of $0.15 per share and a supplemental dividend of $0.18 per share.\n\nFord CFO Jim Lawler said in a statement that Ford will improve capital efficiency by both selectively reducing investments and \"raising the bar\" on expected returns for new initiatives. “The objective is to improve total adjusted return on invested capital from about 14% in 2023 to 20% over the next couple of years,” Lawler said. “Simply ‘good’ isn’t good enough and investments are going to projects that have credible plans to deliver their targeted returns.”\n\nStory continues\n\nLast year Ford divided into business units — Ford Blue for the traditional gas-powered business, Ford Model e for the EV division, and Ford Pro for its commercial and super duty truck business. Across those business lines Ford reported:\n\nFord Blue\n\nRevenue: $26.2 billion vs. $24.52 billion est. EBIT: $813 million vs. $866.5 million est.\n\nFord Model e\n\nRevenue: $1.6 billion vs. $1.91 billion est. EBIT: $1.57 billion loss vs. $1.34 billion loss est.\n\nFord Pro\n\nRevenue: $15.4 billion vs. $13.86 billion est. EBIT: $1.81 billion vs. $1.43 billion est.\n\nFor the year Ford's Model e unit recorded an EBIT loss of $4.7 billion, which the company said reflected \"an extremely competitive pricing environment, along with strategic investments in the development of clean-sheet, next-generation EVs.\"\n\nFor 2024, Ford is projecting the Model e unit to record an EBIT loss of $5.0 to $5.5 billion - indicating wider losses in the business unit compared to 2023.\n\nEarlier in January Ford moved 1,400 workers off F-150 Lightning EV production and cut a shift as the company adjusted supply to what appears to be slowing demand for the strongly reviewed, but steeply priced, EV pickup. “We continue to see growth, just at a slower pace. We’re adjusting to that growth,\" Ford Model e spokesperson Martin Günsberg said to Yahoo Finance. Unsold 2024 F150 Raptor pickup truck sits at a Ford dealership Sunday, Jan. 21, 2024, in Broomfield, Colo. (David Zalubowski/AP Photo) (ASSOCIATED PRESS)\n\nWith regards to Ford's Model e business, last quarter, Ford said the company would \"push out\" $12 billion in EV investments when that capacity is needed. Ford also delayed the construction of its new battery plant in Michigan (which would use licensed technology from China’s CATL), and scaled back battery’s output. The factory is still scheduled to open in 2026.\n\nFord also saw declining sales of its EVs in January of this year, with EV sales dropping over 10%, mainly led by decreasing sales of the Mustang Mach-E, which lost federal EV tax credit eligibility on Jan. 1. The company did see overall auto sales climb, however, with hybrid sales jumping over 40%. Ford has said it will push to bring more hybrids to the market to meet customer demand.\n\nFord’s strength in January was a continuation of what the automaker was seeing in 2023 as well. Last month the company reported US total sales jumped 7.1% to approximately 1,995,912 vehicles, making 2023 the Dearborn-based automaker’s best year since 2020. Ford noted strong sales in its trucks business, with 1,081,777 trucks and vans sold in 2023 — up 13%. Across its nameplates, Ford saw noted growth in the Bronco Sport (up 28.1%), Edge (up 24.1%), and Lincoln Navigator (up 32.9%), among others.\n\nFord’s sales of hybrids and EVs were also a highlight, with sales up 25.3% and 17.9% in 2023, respectively.\n\nPras Subramanian is a reporter for Yahoo Finance. You can follow him on Twitter and on Instagram.\n\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/ford-earnings-automaker-easily-beats-on-q4-revenue-2024-profit-outlook-tops-expectations-185831679.html", "symbols": ["0P4F.LSE", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.04, "neu": 0.863, "pos": 0.096}}, {"date": "2024-02-06T21:14:07+00:00", "title": "Ford sends a truckload of cash back to shareholders, shares rise", "content": "By Joseph White and Nathan Gomes\n\nDETROIT (Reuters) -Ford Motor said on Tuesday it will return more cash to shareholders, starting with an extra 18 cents-per-share dividend in the first quarter, joining General Motors in giving investors more of the cash spinning from North American combustion trucks.\n\nFord shares were up 6.5% in after-hours trading after gaining 4.1% during the regular session.\n\nThe automaker forecast $10 billion to $12 billion in pretax profit for 2024, after earning $10.4 billion before taxes last year. Profit from Ford's Pro commercial vehicle business and Ford Blue combustion vehicle units offset steep losses from Model E electric vehicle operations.\n\nFord's North American truck and SUV business - both commercial and consumer - will contribute to projected free cash flow of $6 billion to $7 billion this year. Ford has committed to return to investors 40% to 50% of free cash flow.\n\n\"Whenever that (regular) dividend doesn’t reach 40-50% we will provide a supplemental dividend,\" Chief Financial Officer John Lawler told reporters on a conference call on Tuesday.\n\n\"Consistency is going to be very important,\" he said.\n\nFord's electric vehicle operations will continue to be a cash drain.\n\nModel E lost an average of more than $47,000 per vehicle in the fourth quarter, Ford reported. The company projected a wider pretax loss of between $5 billion and $5.5 billion this year.\n\nFord's next generation of EVs \"will be profitable and return their cost of capital,\" Lawler said.\n\n\"The EV business needs to stand on its own, it needs to be profitable and provide a return\" above its cost of capital independent from emissions compliance benefits, he said.\n\nEvery electric F-150 Lightning Ford sells allows it to sell 12 combustion pickup trucks and stay in compliance with U.S. emissions rules, Lawler said.\n\nFord Pro, the automaker's commercial business, will be a key driver of profit and potential cash returns to investors this year. Ford Pro is forecast to earn $8 billion to $9 billion this year, up from $7.2 billion in pretax profit last year. Ford's rival, GM, last week delivered an optimistic outlook for 2024, and Chief Executive Mary Barra signaled shareholders will get more of the cash spinning from sales of GM's combustion trucks and SUVs through share buybacks. Cost cuts and demand for crossover SUVs and pickup trucks helped automakers offset inflationary headwinds and early signs of EV demand cooling. Consumers opted for hybrid vehicles and family SUVs instead of EVs for convenience and relative ease in terms of maintenance. In response, Ford and GM, which were putting together ambitious EV plans, have begun leaning toward their higher-margin hybrid and gas-powered models.\n\n(Reporting by Joe White in Detroit and Nathan Gomes in BengaluruEditing by Shinjini Ganguli, Sayantani Ghosh and Matthew Lewis)", "link": "https://ca.finance.yahoo.com/news/ford-offer-regular-supplemental-dividend-211407895.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.026, "neu": 0.876, "pos": 0.098}}, {"date": "2024-02-06T21:07:22+00:00", "title": "Hertz Global stock posts gains despite steep Q4 loss", "content": "Hertz (HTZ) posted a larger-than-forecasted loss in the fourth quarter, weighed down by the trimming down of its EV fleet.\n\nYahoo Finance's Pras Subramanian breaks down the details.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Angel Smith\n\nVideo Transcript\n\nJULIE HYMAN: Shares of Hertz bouncing back from a record low earlier today. The car rental company reported a wider than expected fourth quarter loss related to its electric vehicle fleet. With more, we're joined by Yahoo Finance's Pras Subramanian. Pras, speaking of Tesla--\n\n[CHUCKLES]\n\n--what can you tell us about Hertz?\n\nPRAS SUBRAMANIAN: Yeah. You know, Hertz, they bet big on Tesla. And now they're sort of suffering from that big sort of buy. Back in 2021, they had a big-- big marketing campaign, Tom Brady going all in on EVs. And now they're-- they're backtracking here because of the fact that they've suffered really steep repair costs for these cars. When they do get into accidents, they're expensive to repair.\n\nThe biggest thing, I think, is the residual value losses in the fleet. So a big part of their business is selling off those cars after a few years. And if you're suffering huge losses in terms of value, they have to stem that. And they decided Stephen Scherr, the CEO, was like, we need to do this now.\n\nSold about a third of their EV fleet, 20,000 Teslas. Said that they might have to do more if it warrants it. And you know, like I said, it's a-- it's a kind of a fall from grace from the once big bet on EVs to now. They still want to-- they still want to rent them out in certain markets where supply and demand are matched. And I think it sort of speaking to where we are as a country with EV adoption, where certain parts of the country are into it and some parts aren't.\n\nJOSH LIPTON: And another big name after the bell here, Pras, Ford. Reporting results, what do you got to look out there? What's the focus?\n\nStory continues\n\nPRAS SUBRAMANIAN: Yeah, three big things I think. Number one, profit outlook. We saw GM really have a strong sort of-- they basically reinstated their pre-UAW 2023 strike outlook for adjusted EBITDA. So we'll see Ford will-- will do that. We're looking for a number around $11 to $12 billion there in full year EBITDA.\n\nLooking at their EV game plan, they pushed back about $12 billion of spending last year. Are they going to keep doing that? Are they going to pull some of that forward? What do they see there with EV demand and that sort of thing? And I spoke to Jim Farley about a month ago. And he said that he thinks that growth is still happening, just a bit slower.\n\nAnd finally, the hybrid pivot. They talk about how they're going to make every car a hybrid if they can, et cetera. That's what they want to do. They want to have offer you gas-powered, hybrid, EV. The only issue is that they just killed the Explorer Hybrid because it wasn't that efficient. So you kind of got to make it work. It's got to make sense for the hybrid powertrain to work in the car and all that sort of thing. So we'll hear more about what they-- how they intend to do that.\n\nJULIE HYMAN: Great roadmap. Thanks, Pras.\n\nJOSH LIPTON: All right, we'll be watching. Thank you, Pras.\n\nPRAS SUBRAMANIAN: Thanks.", "link": "https://finance.yahoo.com/video/hertz-global-stock-posts-gains-210722369.html", "symbols": ["0P4F.LSE", "AZK0.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA", "HTZ.US"], "tags": [], "sentiment": {"polarity": 0.934, "neg": 0.056, "neu": 0.856, "pos": 0.088}}, {"date": "2024-02-06T21:05:00+00:00", "title": "Ford+ Delivers Solid 2023, Provides Outlook for Healthy ’24; Company Declares Regular, Supplemental Stock Dividends", "content": "DEARBORN, Mich., February 06, 2024--(BUSINESS WIRE)--Ford Motor Company (NYSE:F) today reported its 2023 fourth quarter financial results. Click here or visit media.ford.com to view the news release. Visit shareholder.ford.com for the slide presentation and access the webcast to the Ford earnings call, which begins at 5:00 p.m. ET. The call will feature Jim Farley, president and CEO; John Lawler, chief financial officer; and other members of the Ford senior management team.\n\nAbout Ford Motor Company\n\nFord Motor Company (NYSE: F) is a global company based in Dearborn, Michigan, committed to helping build a better world, where every person is free to move and pursue their dreams. The company’s Ford+ plan for growth and value creation combines existing strengths, new capabilities and always-on relationships with customers to enrich experiences for customers and deepen their loyalty. Ford develops and delivers innovative, must-have Ford trucks, sport utility vehicles, commercial vans and cars and Lincoln luxury vehicles, along with connected services. The company does that through three customer-centered business segments: Ford Blue, engineering iconic gas-powered and hybrid vehicles; Ford Model e, inventing breakthrough EVs along with embedded software that defines exceptional digital experiences for all customers; and Ford Pro, helping commercial customers transform and expand their businesses with vehicles and services tailored to their needs. Additionally, Ford provides financial services through Ford Motor Credit Company. Ford employs about 177,000 people worldwide. More information about the company and its products and services is available at corporate.ford.com.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20240206875498/en/\n\nContacts\n\nMedia \r\nT.R. Reid\r\n1.313.319.6683\r\ntreid22@ford.com\n\nEquity Investment\r\nCommunity \r\nLynn Antipas Tyson\r\n1.914.485.1150\r\nltyson4@ford.com\n\nFixed-Income\r\nInvestment\r\nCommunity \r\nJessica Vila-Goulding\r\n1.313.248.3896\r\njvila5@ford.com\n\nShareholder\r\nInquiries \r\n1.800.555.5259 or\r\n1.313.845.8540\r\nstockinf@ford.com", "link": "https://finance.yahoo.com/news/ford-delivers-solid-2023-provides-210500047.html", "symbols": ["0P4F.LSE", "F.US"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0, "neu": 0.876, "pos": 0.124}}, {"date": "2024-02-06T18:16:57+00:00", "title": "7 EV Stocks to Buy on the Dip: February 2024", "content": "Discerning investors are always looking for the most promising EV stocks to buy in the electrifying stock market race. Amidst a backdrop of tumbling shares, with Tesla’s dramatic downturn setting the pace, the electric vehicle sector finds itself at a critical juncture. However, opportunities are charging up despite the sector’s recent setbacks, including missed sales targets and dwindling valuations.\n\nHence, for those eyeing the horizon, the current dip is a signal to invest strategically. The long-term potential of the EV market remains robust and now is the most opportune time to identify which EV stocks are poised to accelerate as the market gears up for a resurgence.\n\nEV Stocks to Buy: Albemarle (ALB) Albemarle (ALB) logo on a mobile phone screen\n\nSource: IgorGolovniov/Shutterstock.com\n\nAlbemarle (NYSE:ALB) stands at the forefront of the lithium revolution, which should benefit from the expected five-fold surge in global demand by 2030, mainly driven by the EV battery market. Despite recent headwinds reflected in subpar results, the company’s strategic move to triple its lithium conversion capacity to 600ktpa by 2027 showcases a bold commitment to seizing the EV market’s long-term upward ascent. This expansion, aligning with the anticipated resurgence in lithium prices, heralds a future of robust cash flows for its business.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nMoreover, despite the headwinds, Albemarle’s resilience shines through its financial guidance, projecting a substantial operating cash flow of $600 to $800 million for 2023. With a commendable 29-year streak of dividend growth and an appealing yield of 1.40%, all while trading at an attractive 1.4 times forward sales, ALB demonstrates an incredible blend of growth potential and steadfast shareholder value.\n\nRivian (RIVN) Rivian (RIVN) All Electric R1T Pickup Truck in a forest green color\n\nSource: Roschetzky Photography / Shutterstock.com\n\nRivian (NASDAQ:RIVN) is an EV trailblazer, navigating through a year brimming with promise, presenting a compelling narrative for prospective investors. Its ambitious stride towards establishing its second EV plant in Georgia speaks volumes about its dedication to scaling up and innovating in its niche. Amidst broader market apprehensions over EV demand, highlighted by Ford’s (NYSE:F) recent production recalibrations, Rivian stands out with its powerful R1T truck model continuing to attract consumer interest.\n\nStory continues\n\nThe backing of industry giants including Amazon (NASDAQ:AMZN) and AT&T (NYSE:T) further accentuates Rivian’s stature in the EV realm, reflecting a strong vote of confidence in its tech prowess and market potential. Currently trading at a modest 1.4 times book value, Rivian’s stock appears to be an undervalued gem in especially when considering Tipranks analysts’ projection of a significant 62% upside.\n\nSolid Power (SLDP) Smartphone with logo of American battery company Solid Power Inc. on screen in front of business website. Focus on center-left of phone display.\n\nSource: T. Schneider / Shutterstock.com\n\nSolid Power (NASDAQ:SLDP) ventures boldly into the high-stakes solid-state battery sector, positioning it as one of the spearheading businesses in the emerging sphere. The company’s strategic partnership with BMW (OTCMKTS:BMWYY), marked by the licensing of its cell design and manufacturing process, underscores a remarkable trajectory toward commercialization by 2026. This collaboration is further validated by the company’s milestone delivery of its first A-1 EV cells to BMW, a critical step in its automotive qualification that could dramatically redefine market dynamics upon successful validation testing.\n\nMoreover, Solid Power’s deepened alliance with SK On further cements its strategic footprint, entrusting its cell designs and production processes to a partner with a massive global reach. Establishing a pilot cell production line for SK On in Korea fortifies this partnership and significantly enhances Solid Power’s capacity to meet the burgeoning demand for advanced battery solutions.\n\nLi Auto (LI) Li Auto (Li Xiang) brand logo and electric car in store. A Chinese EV(electric vehicle) company\n\nSource: Robert Way / Shutterstock.com\n\nLi Auto (NASDAQ:LI) is a juggernaut in the Chinese electric vehicle landscape, which is positioned incredibly well to harness the burgeoning Asian market. The company’s ambitious strategy to expand its electric model lineup to 11 by 2025, from a current count of four, indicates a vigorous growth trajectory. Moreover, this expansion is complemented by developing an impressive 300 high-speed supercharging stations across China.\n\nFurthermore, marked by the delivery of over 50,000 vehicles after last year, the company plans to double monthly deliveries to 100,000 in 2024, underscoring its operational excellence. With a track record of meeting targets and the impending launch of Li MEGA, set to add another chapter to its growth story, Li Auto emerges as a compelling player in the EV sector.\n\nPolestar Automotive (PSNY) A Polestar (PSNY) sign at the area at Polestar powerstop in Mjölby.\n\nSource: Jeppe Gustafsson / Shutterstock.com\n\nPolestar Automotive (NASDAQ:PSNY), the UK’s rising star in the EV domain, radiates promise with two major catalysts likely to pay many dividends for its investors. The company’s strategic vision of achieving cash flow break-even by 2025, backed by its effective cost management efforts and operational leverage, lays a solid foundation for growth. The recent launch of Polestar 4, coupled with the eagerly anticipated debut of Polestar 5 this year, positions the firm to ramp up its delivery numbers meaningfully.\n\nPolestar’s foray into the luxury SUV segment with the Polestar 3 is adding a new dimension to its portfolio. Additionally, this SUV, boasting a commendable 300-mile range and earning accolades for its performance and aesthetics, could be a game-changer for the firm. Moreover, its ambitious delivery target, scaling from 60,000 vehicles in 2023 to 160,000 by 2025, underscores a trajectory of accelerated long-term growth. Backed by a sizeable liquidity balance of $951.1 million, Polestar’s strategic moves, mainstream model launches, and positive market reception herald a new era of luxury and innovation in its niche.\n\nLithium Americas (LAC) smartphone with logo of Canadian company Lithium Americas Corp on screen\n\nSource: Wirestock Creators / Shutterstock.com\n\nLithium Americas (NYSE:LAC) emerges as a deeply undervalued gem in the lithium sector, with its stock plummeting by double-digit margins last year, an overreaction to the fleeting dim outlook for lithium. The market is overlooking the colossal intrinsic value of its much-talked-about Thacker Pass project, which boasts an after-tax net present value of $5.7 billion, dwarfing its current market valuation of $676.8 million. This disparity sets the stage for explosive long-term growth, with prospects of multi-bagger returns as the lithium market rebounds.\n\nBolstered by General Motors‘ (NYSE:GM) huge $650 million investment and a decade-long offtake agreement for phase one production, LAC boasts top-line certainty and a remarkable 40-year mine life. With Thacker Pass as the only fully permitted lithium project in the U.S. and analysts projecting a striking 166.8% upside potential for LAC stock, the firm is primed for a meteoric ascent.\n\nPanasonic Holdings (PCRFY) A Panasonic (PCRFY) sign hanging in Beijing, China. generation z\n\nSource: testing/Shutterstock.com\n\nPanasonic Holdings (OTCMKTS:PCRFY) is a promising prospect in the realm of EV battery innovation. Its ambitious blueprint to substantially increase EV battery capacity to a staggering 200GWh by the financial year 2031 heralds a powerful growth period, quadrupling its current capacity and signaling a massive leap in sales generation. This ambitious growth is matched by a commitment to EBITDA margin enhancement, painting a picture of a company growing in scale and improving in efficiency.\n\nAt the heart of Panasonic’s strategy lies a relentless pursuit of innovation, mainly in developing batteries with superior energy density. It aims to achieve an impressive 1,000 Wh/L by 2031, a 25% bump from present levels, setting the stage for groundbreaking advancements in battery technology. Additionally, its compelling forward price-to-sales ratio of 0.38 times and a solid dividend yield of 2.34% add to its allure and the ability to deliver substantial value to its stakeholders.\n\nOn the date of publication, Muslim Farooque did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines\n\nMuslim Farooque is a keen investor and an optimist at heart. A life-long gamer and tech enthusiast, he has a particular affinity for analyzing technology stocks. Muslim holds a bachelor’s of science degree in applied accounting from Oxford Brookes University.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\n\nThe post 7 EV Stocks to Buy on the Dip: February 2024 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-ev-stocks-buy-dip-181657657.html", "symbols": ["0HC7.LSE", "2015.HK", "A1LB34.SA", "ALB.US", "AMC.F", "AMC.STU", "AMZN.US", "F.US", "GM.US", "L87A.F", "LAC.US", "LI.US", "PSNY.US", "RIVN.US", "SLDP.US", "T.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.013, "neu": 0.823, "pos": 0.164}}, {"date": "2024-02-06T17:31:41+00:00", "title": "Ford Earnings Due After A Major Hybrid Rival Projects Record Profits", "content": "Ford earnings are expected to clock their first decline in five quarters when the company reports late Tuesday.\n\nContinue reading", "link": "https://finance.yahoo.com/m/29623023-3e7d-3cba-b4ba-aa7c04df8f1d/ford-earnings-due-after-a.html", "symbols": ["0QXR.IL", "7203.TSE", "8TI.BE", "8TI.DU", "8TI.F", "8TI.HA", "8TI.HM", "8TI.MU", "8TI.XETRA", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2024-02-06T16:30:00+00:00", "title": "Toyota Stock Surges Toward a Record. Why Can’t Ford and GM Catch Any Love?", "content": "You’d never know it by looking at the stock prices of General Motors or Ford Motor but the traditional car business is just fine. What’s more, Toyota raised its operating profit guidance to about $33 billion from $30 billion for its full fiscal year ending in March. Overall, it’s tough to argue with Toyota’s latest earnings report and the overall profit picture it paints.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4e6c6cff-a090-3cdb-9de0-60357719d561/toyota-stock-surges-toward-a.html", "symbols": ["7203.TSE", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA", "TM.US", "TMCO34.SA", "TMN.MX", "TOM.BE", "TOM.DU", "TOM.F", "TOM.HM", "TOM.MU", "TOMA.F"], "tags": [], "sentiment": {"polarity": 0.723, "neg": 0.064, "neu": 0.805, "pos": 0.131}}, {"date": "2024-02-06T13:01:37+00:00", "title": "Can General Motors' Rally Continue?", "content": "Shares of General Motors Co. (NYSE:GM) have moved sharply higher over the past three months, delivering a total return of nearly 40%. The stock has benefited from a number of positive developments, including an end to the UAW strike against the company, a massive accelerated share repurchase program and strong 2024 guidance provided by management.\n\nWhile a significant number of shares have already been delivered under the ASR, the banks managing the program still have a significant number of shares which need to be repurchased to complete the program. Consensus fiscal 2024 estimates remain well below the company's recent guidance, which sets the automaker up to potentially deliver better-than-expected earnings per share for the year. Additionally, despite the recently rally, the stock trades at under 5 times forward earnings compared to an average price-earnings ratio of 6.80 over the past few years. For these reasons, I believe GM shares can continue to move higher from current levels.\n\nWarning! GuruFocus has detected 4 Warning Sign with GM. Can General Motors' Rally Continue?\n\nGM Data by GuruFocus\n\nRepurchase program will continue to be supportive of the stock\n\nOn Nov. 29, GM announced a $10 billion ASR program that represented about 25% of the company's shares outstanding at the time. On Dec. 1, the company advanced $10 billion to a group of banks and received approximately 215 million shares of stock with a value of $6.80 billion. Thus, these shares were repurchased at a price of roughly $31.60 per share. Final settlement of the transaction is expected to occur no later than Dec. 31, 2024. By this time, the banks managing the ASR will be required to deliver GM roughly an additional $3.20 billion worth of shares. The repurchase price will be based on the average daily volume weighted average price of GM shares during the term of the ASR agreements less a discount.\n\nGiven these facts, the banks managing the ASR will continue to be active buyers of GM shares throughout much of 2024 in order to acquire shares they need to deliver under the agreement. In addition to the ASR, GM has a remaining authorization of roughly $1.30 billion based on prior repurchase authorizations, which the company can complete if it chooses to do so based on market conditions.\n\nStory continues\n\nI view the repurchase program as a solid capital allocation decision given the stock's low valuation. Based on a forward price-earnings ratio of 4.50, GM is repurchasing shares at an earnings yield of more than 20%. Given the highly competitive nature of the auto business, I do not believe the company would be able to earn this level of return on capital by reinvesting in the business itself given the historically low ROIC that the company has generated.\n\nConsensus earnings estimates are below company guidance\n\nCurrently, Wall Street analysts' consensus for fiscal 2024 call for the company to report adjustd earnings of $7.80 per share. Comparably, during the company's fourth-quarter 2023 earnings release, the company guided for a range of $8.50 to $9.50 for the year. Based on this difference, I believe the company is poised to deliver better than consensus results.\n\nMoreover, the company's guidance itself may prove to be conservative. Historically, around 78% of companies in the S&P 500 have beaten their estimates on a quarterly basis. One reason for this is that company executives generally do not want to disappoint investors.\n\nIn early 2023, GM guided for 2023 adjusted earnings per share of $6 to $7 and ultimately delivered adjusted earings of $7.68. The beat came despite the fact the company faced a crippling UAW strike, which had a negative impact on the company.\n\nIf the company is able to deliver a similar beat on a percentage basis, as was the case in 2023, versus initial guidance midpoint, the adjusted earnings per share for 2024 would be approximately $10.60 per share.\n\nValuation is still compelling\n\nGM currently trades at roughly 5 times consensus 2024 earnings per shares. This compares to the broader market, which trades at approximately 22 times consensus 2024 earnings. Surely GM should trade at a multiple which is well below the broader market given the highly cyclical nature of its business and historically low return on invested capital. However, I think the current discount is too extreme. Over the past three years, the stock has traded at an average earnings multiple of 6.80 times. Additionally, GM's closest peer, Ford Motor Co. (NYSE:F), trades at roughly 6.60 times consensus 2024 earnings.\n\nThe stock currently has a GF Value of roughly $53 per share, which would imply a forward price-earnings ratio of roughly 6.80 times the current consensus and 5.90 times its 2024 guidance. In this case, I agree with the GF Value and believe the stock can trade in the $50 range. Can General Motors' Rally Continue? Can General Motors' Rally Continue?\n\nGM Data by GuruFocus\n\nKey risks to the bulls\n\nThe most significant risk the GM bulls face is a significant economic slowdown. The auto business is highly cyclical and thus GM would experience a hit to financial performance in the event of an economic slowdown. However, it should be noted the company currently has a very strong balance sheet with just over $36 billion in automotive liquidity. This liquidity buffer should allow the company to ride out an economic storm and make it through the cycle, but the stock price may suffer during the interim.\n\nAnother risk GM faces is potential market share losses to competitors as the automobile business is highly competitive and currently experiencing a secular shift toward electric vehicles. For 2023, GM reported total U.S. market share of 16.20%, which represents a roughly 0.30% increase from market share the previous year. The company's share of the EV market as of the fourth quarter of 2023 is estimated at 6.9% and thus, a rapid shift toward EVs has the potential to result in decreased market share for GM.\n\nConclusion\n\nGM shares have rallied sharply over the past three months due to a number of positive developments, but the bullish move may not be done.\n\nThe company's massive ASR program will continue to serve as an upside catalyst in 2024 as banks work to complete the necessary purchases. Additionally, consensus estimates for 2024 adjusted earnings per share remain well below company guidance, which is likely conservative. Thus, I believe the company is poised to deliver better-than-expected earnings results. Finally, GM's valuation remains fairly cheap despite the massive move higher over the past few months.\n\nFor these reasons, I believe the recent rally can continue.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/general-motors-rally-continue-130137847.html", "symbols": ["8GM.BE", "8GM.F", "8GM.HM", "8GM.MU", "8GM.STU", "F.US", "GM.MX", "GM.US", "GMCO34.SA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.028, "neu": 0.866, "pos": 0.106}}, {"date": "2024-02-06T12:01:33+00:00", "title": "Ford Stock Gets Pre-Earnings 'Top Pick' Status, As Hybrid Sales Boom", "content": "Ford Motor's electric vehicle sales tumbled in January but hybrids surged, a sales release on Friday showed. Ford stock tested a key technical level with earnings due. The sales release came a day after analysts at Morgan Stanley named Ford a new top pick among U.\n\nContinue reading", "link": "https://finance.yahoo.com/m/eb6cbcf2-6bae-3021-9f02-6e4734602b70/ford-stock-gets-pre-earnings.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.951, "pos": 0.049}}, {"date": "2024-02-06T11:10:00+00:00", "title": "7 Lithium Stocks to Buy on the Dip: February 2024", "content": "The spot price of lithium fell sharply in China last year, and this trend should continue throughout 2024, according to analysts. This means that there could be some potentially undervalued lithium stocks to buy to take advantage of this cyclical wobble in the lithium market.\n\nI expect that these lithium stocks will remain solid investments as the world’s transition to electric vehicles has only just begun. Most Wall Street analysts also remain bullish on the long-term potential of these companies as most have robust balance sheets and pay big dividends to investors. So here are seven of the best lithium stocks to buy.\n\nAlbemarle (ALB) Albemarle (ALB) logo on a mobile phone screen\n\nSource: IgorGolovniov/Shutterstock.com\n\nAlbemarle (NYSE:ALB) is a leading producer of lithium globally. ALB bulls cite its 41.03% five-year return and growing dividend as some of the key reasons to stay invested in the stock.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThis could be an exceptional year for ALB despite softening demand for lithium as China experiences headwinds. The company plans to adjust its capital expenditures to between $1.6 billion and $1.8 billion, down from approximately $2.1 billion in 2023.\n\nSpecific initiatives include commissioning the Meishan lithium conversion facility and targeting an annual reduction of approximately $95 million in costs. This is expected to increase its free cash flow, as it spent $1.91 billion in CAPEX for the last twelve months.\n\nWall Street is bullish on ALB this year as analysts have predicted that its share will rise by 65.84% within the next twelve months, making it one of the best lithium stocks to buy now.\n\nSociedad Química y Minera de Chile (SQM) a lithium mine, ATLX stock\n\nSource: Shutterstock\n\nSociedad Química y Minera de Chile (NYSE:SQM) is a major lithium producer with extensive reserves in the Atacama Desert in northern Chile.\n\nLast year was eventful for SQM stock, as the company entered into a long-term lithium agreement with LG Energy Solution and announced a lithium supply agreement with Ford (NYSE:F).\n\nStory continues\n\nThe company also issued U750 million of senior unsecured “Green Bonds,” which could increase its liquidity and financial position considerably.\n\nWhat I like about SQM is that it pays a substantial dividend, with a dividend yield of 4.88%. It has a very low payout ratio of just 14.51%, which suggests it could substantially lift its dividend without harming its cash position.\n\nLike with the other lithium stocks to buy in this article, Wall Street is bullish on SQM, too, as it has a rating of “Buy” and a projected upside of 73.72% for its stock price.\n\nArcadium Lithium (ALTM) a group of batteries\n\nSource: Shutterstock\n\nArcadium Lithium (NYSE:ALTM) is a newly formed entity resulting from the $10.6 billion merger of former companies Allkem and Livent.\n\nReuters described the result of the merger as creating the “world’s third-largest producer of the metal used to make electric vehicle batteries.”\n\nExperts cited the merger as capable of leveraging each entity’s unique strengths and reducing costs through a vertically integrated business model. The company reported $1.2 billion in revenue for FY2023, which included $441.71 million in net income.\n\nThe brand could see substantial growth in FY2025. Analysts expect that its top line will grow 39.51% to $2.33 billion, while its EPS will surge by an impressive 106.73% to 66 cents.\n\nIt should be noted, however, that ALTM’s EPS is expected to decrease by 63.21% in FY2024 before this EPS surge will happen. One can chalk up this decrease to a mix of softening demand for lithium as well as working out the kinks of the merger.\n\nPiedmont Lithium (PLL) Person holding cellphone with logo of US mining company Piedmont Lithium Inc. (PLL) on screen in front of business webpage. Focus on phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nPiedmont Lithium (NASDAQ:PLL) is focused on developing lithium resources in the United States. It has a geographically important location in North Carolina and has agreements in place with EV makers such as Tesla (NASDAQ:TSLA).\r\n\r\nDespite a challenging market environment marked by a significant decline in spot lithium prices last year, PLL stock reported revenues of $47.13 million last quarter and had a positive EPS of $1.19.\n\nLooking ahead, PLL is focusing on advancing its projects across North Carolina, Quebec, and Ghana to help it reach cash flow-positive status. The company’s FCF has been negative for the past twelve months, burning through $47.82 million.\n\nPart of its focus for 2024 will be its efforts in securing a significant quantity of potential spodumene concentrate production, which is essential for producing lithium hydroxide.\n\nLithium Americas (LAC) Person holding smartphone with logo of Canadian company Lithium Americas Corp (LAC) on screen in front of website Focus on phone display.\n\nSource: Wirestock Creators / Shutterstock.com\n\nLithium Americas (NYSE:LAC) is developing lithium projects in Argentina and Nevada.\n\nLAC focused on its Thacker Pass project in northern Nevada last year, which is poised to play a crucial role in bolstering North America’s lithium supply chain.\n\nOnce operational, the project is expected to contribute around $2 billion annually to the economy.\n\nThe company also has some potential government backing, as it has engaged with the U.S. Department of Energy’s Advanced Technology Vehicles Manufacturing Loan Program to potentially cover up to 75% of the capital costs for Thacker Pass.\n\nLAC stock is currently pre-revenue and pre-earnings, but it does have $200.50 million of cash and cash equivalent on its balance sheet, which could give it some much-needed stability.\n\nGanfeng Lithium (GNENF) Person holding mobile phone with logo of Chinese company Jiangxi Ganfeng Lithium Co. Ltd. (GNENF) on screen in front of web page. Focus on phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nAs one of China’s largest lithium compounds producers, Ganfeng Lithium (OTCMKTS:GNENF) has a diversified portfolio in lithium mining and refining.\n\nDespite the challenges facing lithium businesses in China, there are some positive developments on the horizon for GNENF stock.\n\nFor example, the company announced an increase in its stake in Mali Lithium, which is expected to be highly accretive for the company.\n\nThis is part of a broader move for Chinese companies to source their raw materials internally, and it could raise the ratio of self-sourced lithium raw materials to 70% in the long run for the business.\n\nGNENF stock is also exploring a spinoff for LiEnergy. This spinoff is intended to support the business development of Ganfeng LiEnergy and improve the operations of its battery business.\n\nStandard Lithium (SLI) Standard Lithium logo or icon on website page, Illustrative Editorial\n\nSource: Postmodern Studio / Shutterstock.com\n\nStandard Lithium (NYSE:SLI)  is engaged in lithium brine properties in the United States. Its flagship project is the Lanxess Project in southern Arkansas.\n\nThe company made some substantial progress last year. The company announced the completion of a Definitive Feasibility Study for its Phase 1A project and a Preliminary Feasibility Study for its South West Arkansas project. Both of these initiatives could boost its overall production output.\n\nLike other lithium stocks, SLI is currently pre-revenue and has no earnings. But this hasn’t stopped Wall Street from issuing bullish forecasts for its potential. It currently has a rating of “Strong Buy,” and there is an enormous 547.48% predicted upside for its stock price.\n\nOn the date of publication, Matthew Farley did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nMatthew started writing coverage of the financial markets during the crypto boom of 2017 and was also a team member of several fintech startups. He then started writing about Australian and U.S. equities for various publications. His work has appeared in MarketBeat, FXStreet, Cryptoslate, Seeking Alpha, and the New Scientist magazine, among others.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In.\n\nThe post 7 Lithium Stocks to Buy on the Dip: February 2024 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-lithium-stocks-buy-dip-111000575.html", "symbols": ["0HC7.LSE", "A1LB34.SA", "ALB.US", "ALTM.US", "AMC.F", "AMC.STU", "F.US", "LAC.US", "PLL.US", "QYM.BE", "QYM.F", "QYM.STU", "SLI.US", "SQM-A.SN", "SQM-B.SN", "SQM.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.012, "neu": 0.906, "pos": 0.082}}, {"date": "2024-02-05T22:44:31+00:00", "title": "Ford earnings, Fedspeak: What to Watch", "content": "Multiple companies will release their latest quarterly reports on Tuesday, February 6, including Eli Lilly (LLY), BP (BP), and Ford (F).\n\nA number of Federal Reserve officials will speak on Tuesday, including Cleveland Fed President Loretta Mester, Minneapolis Fed President Neel Kashkari, Boston Fed President Susan Collins, and Philadelphia Fed President Patrick Harker, potentially speaking on Chair Jerome Powell's recent comments about the latest policy decision from the Central Bank.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nEditor's note: This article was written by Nicholas Jacobino", "link": "https://finance.yahoo.com/video/ford-earnings-fedspeak-watch-224431098.html", "symbols": ["0HKP.LSE", "0P4F.LSE", "0RNH.LSE", "1SI.F", "1SI.STU", "1SI.XETRA", "7203.TSE", "B1PP34.SA", "BP-A.LSE", "BP-B.LSE", "BP.LSE", "BP.US", "BPAQF.US", "BPE.F", "BPE5.BE", "BPE5.DU", "BPE5.F", "BPE5.HM", "BPE5.MU", "BPE5.STU"], "tags": [], "sentiment": {"polarity": 0.077, "neg": 0, "neu": 0.987, "pos": 0.013}}, {"date": "2024-02-05T21:35:54+00:00", "title": "GM is in park with its driverless Cruise taxis. Should it stay there?", "content": "General Motors (GM) continues to see a future in its troubled Cruise robotaxi fleet — but in what form remains unclear.\n\n\"We're still very committed, and we still see that as a big growth opportunity for us,\" GM CFO Paul Jacobson said on Yahoo Finance Live (video above).\n\nThe support for the beleaguered Cruise — GM's self-driving division — came after GM told investors on its fourth quarter earnings release a week ago that it's aiming to slash expenses related to the brand by a whopping $1 billion this year.\n\nThis level of expense slashing at Cruise would suggest the potential for the robotaxi fleet to go away entirely and have its tech advancements folded into GM's cars and trucks or licensed out to other transportation parties.\n\nJacobson added that a more complete view of Cruise's operating structure will arrive later this year for investors.\n\n\"We're still focused on the tech,\" Jacobson said. \"We're still investing heavily in our engineering staff, and we're committed to [doing] that. We're going to reassess that strategy and think about what's the right way to roll it out and how ... we think about capital structure in the weeks and months ahead. There's more information to come later this year as we think about what the right approach to bring Cruise to the market is.\"\n\nFor now, Cruise remains in park after a rough 2023 of headlines and financial performance.\n\nOn Oct. 2, a Cruise vehicle ran over a woman in San Francisco. The woman was struck by a human-driven car and thrown in front of the self-driving Cruise vehicle, the LA Times reported. The Cruise robotaxi didn't process the incident correctly, which caused the woman severe injuries, as the car reportedly dragged her 20 feet.\n\nCalifornia’s Department of Motor Vehicles suspended Cruise's license to operate in the state. The agency determined that Cruise's vehicles are not safe for public operation. Cruise also misrepresented safety information about the driverless technology, the department said.\n\nStory continues\n\nCruise paused all its driverless operations.\n\nThe incident led to the departure of Cruise CEO Kyle Vogt, who boasted in 2022 that the brand would hit $1 billion in sales by 2025. It also led to a series of ongoing investigations and inquiries by various government agencies, according to Yahoo Finance's review of GM's new annual report.\n\n\"In addition, certain federal and state agencies, including the California DMV, the California Public Utilities Commission, NHTSA, the US Department of Justice, and the SEC, have opened investigations or made inquiries in connection with the incident,\" GM outlined in the report. \"We and Cruise are investigating these matters internally and intend to cooperate with all government regulators and agencies in connection with these matters. At this time, we are not able to predict when Cruise will resume driverless testing or commercial AV operations.\"\n\nGM acquired Cruise in 2016 for $1.1 billion. In 2021, Cruise played a starring role in GM's guidance to double revenue by 2030. Cruise was projected to increase its sales to $50 billion by the end of the decade from virtually nothing at the time. General Motors continued its public support of Cruise but acknowledged it will be updating its strategy for the autonomous driving unit.\n\nAuto experts tell Yahoo Finance that Cruise's major stumbles highlight the challenges of safely scaling up driverless taxis and whether they need to exist at all. GM may be better served by following the path of its peers and permanently shelving Cruise, given the hit to public trust in the brand.\n\n\"Cruise is a distraction for General Motors,\" said Gregory Migliore, editor in chief of Autoblog, a sister publication to Yahoo Finance. \"It’s a troubled company whose time may never come.\"\n\nIf the headlines aren't enough for GM to wave goodbye to Cruise, then the numbers perhaps would do the trick.\n\nCruise generated a mere $102 million in sales last year and lost $2.7 billion on an adjusted operating basis, per GM's annual report. In 2023 and 2022, Cruise lost a combined $4.6 billion on an adjusted operating basis as GM invested in the segment's autonomous tech and platform more broadly.\n\nThe $102 million in sales for Cruise is a fraction of the $141.4 billion GM generated from selling cars, trucks, and SUVs in North America last year. GM has paused the operations of its Cruise robotaxi business. (Terry Chea/AP Photo, File) (ASSOCIATED PRESS)\n\n\"Cruise, and the now-defunct Argo AI, highlight the dangers of trying to create a market without demand,\" Migliore continued. \"Frankly, nobody is asking for robot taxis. Ford and Volkswagen were smart to pull the plug on Argo AI in 2022 and reallocate those resources to driver assistance technology consumers will actually get in cars. I think it’s curious GM has stayed with Cruise for so long, when the automaker has shown an ability to adapt in other areas, like its recent pivot back to hybrids.\"\n\nWith GM spending billions of dollars to roll out electric vehicles, an argument could be made that EVs should be the area of focus, not Cruise robotaxis that would somehow challenge nonexistent Tesla (TSLA) robotaxis.\n\nTo that end, GM's annual report shows the Cruise division has $1.3 billion in cash on hand that could likely be allocated to more productive venues.\n\nStaying committed to Cruise's original vision also doesn't align with a GM in the process of cutting billions in costs and being more shareholder friendly — as seen in a massive new $10 billion stock buyback.\n\n\"We see capital allocation as the primary catalyst that is likely to lead to a re-rating in the shares,\" JPMorgan analyst Ryan Brinkman explained in a note to clients.\n\nThere continues to be some support for Cruise on Wall Street, though it has waned considerably in the past 12 months of negative headlines.\n\n\"I think Cruise is essential to the future of GM, as autonomous is a next-generation technology that will transform the auto world,\" Wedbush analyst Dan Ives told Yahoo Finance. \"We see by 2030 10% of cars will be autonomous and GM wants in on that market with Tesla well ahead.\"\n\nIves gave GM stock an Outperform rating with a $40 price target, about 5.2% above current levels.\n\nBrian Sozzi is Yahoo Finance's Executive Editor. Follow Sozzi on Twitter/X @BrianSozzi and on LinkedIn. Tips on deals, mergers, activist situations, or anything else? Email brian.sozzi@yahoofinance.com.\n\nClick here for the latest technology news that will impact the stock market.\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/gm-is-in-park-with-its-driverless-cruise-taxis-should-it-stay-there-213554961.html", "symbols": ["0P4F.LSE", "0P6N.IL", "0P6O.LSE", "0R0E.LSE", "8GM.BE", "8GM.F", "8GM.HM", "8GM.MU", "8GM.STU", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA", "GM.MX"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.045, "neu": 0.861, "pos": 0.094}}, {"date": "2024-02-05T18:58:31+00:00", "title": "Ford Q4 earnings preview: 2024 profit outlook, updated EV/hybrid gameplan key items to watch", "content": "Ford (F) is on deck to report results for the fourth quarter and the full year after the bell on Tuesday, with its changing EV game plan in focus as the company shifts to hybrid production. The results come after GM reported strong results and profit guidance that indicated strength in the overall US auto sector.\n\nFor the quarter, Ford is expected to report top line revenue of $40.35 billion as compiled by Bloomberg, a result that would be 3.5% lower than a year ago as the effects of the United Auto Workers (UAW) strike lingered in early Q4. In terms of profitability, the consensus estimate is for Ford to report adjusted EPS of $0.13, on adjusted EBIT (earnings before interest and taxes) of $988.2 million.\n\nLast year Ford divided into business units — Ford Blue for the traditional gas-powered business, Ford Model e for the EV division, and Ford Pro for its commercial and super duty truck business. Per Bloomberg consensus:\n\nFord Blue is slated to report $24.52 billion in revenue, with EBIT of $866.5 million Model e is expected to bring in $1.91 billion in revenue, with an EBIT loss of $1.34 billion Ford Pro at $13.86 billion in revenue, with EBIT of $1.43 billion\n\nIn terms of guidance, Ford reinstated its 2023 profit outlook following the ratification of its labor deal with the UAW. Ford said it anticipated full-year 2023 adjusted EBIT of $10.0 billion to $10.5 billion, and said this figure would include $1.7 billion in strike-related lost profits.\n\nWith GM issuing 2024 profit guidance that matched its initial pre-UAW strike outlook for 2023, investors will be watching to see if Ford can do the same, or even improve. Prior to the strike, Ford saw its 2023 profit outlook at $11 billion to $12 billion.\n\nIn focus is Ford’s Model e EV business, one that has seen significant changes over the last year as growth in the business has slowed. Last quarter, Ford CFO John Lawler said the company would \"push out\" $12 billion in EV investments when that capacity is needed. Ford also delayed the construction of its new battery plant in Michigan (which would use licensed technology from China’s CATL), and scaled back battery’s output. The factory is still scheduled to open in 2026.\n\nStory continues\n\nEarlier in January Ford moved 1,400 workers off F-150 Lightning EV production and cut a shift as the company adjusted supply to what appears to be slowing demand for the strongly reviewed, but steeply priced, for the EV pickup. “We continue to see growth, just at a slower pace. We’re adjusting to that growth,\" Ford Model e spokesperson Martin Günsberg said to Yahoo Finance. Unsold 2024 F150 Raptor pickup truck sits at a Ford dealership Sunday, Jan. 21, 2024, in Broomfield, Colo. (AP Photo/David Zalubowski) (ASSOCIATED PRESS)\n\nFord also saw declining sales of its EVs in January of this year, with EV sales dropping over 10%, mainly led by decreasing sales of the Mustang Mach-E, which lost federal EV tax credit eligibility on January 1st. The company did see overall auto sales climb, however, with hybrid sales jumping over 40%. Ford has said it will push to bring more hybrids to the market to meet customer demand.\n\nFord’s strength in January was a continuation of what the automaker was seeing in 2023 as well. Last month the company reported US total sales jumped 7.1% to approximately 1,995,912 vehicles, making 2023 the Dearborn-based automaker’s best year since 2020. Ford noted strong sales in its trucks business, with 1,081,777 trucks and vans sold in 2023 — up 13%. Across its nameplates, Ford saw noted growth in the Bronco Sport (up 28.1%), Edge (up 24.1%), and Lincoln Navigator (up 32.9%), among others.\n\nFord’s sales of hybrids and EVs were also a highlight, with sales up 25.3% and 17.9% in 2023, respectively.\n\nPras Subramanian is a reporter for Yahoo Finance. You can follow him on Twitter and on Instagram.\n\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/ford-q4-earnings-preview-2024-profit-outlook-updated-evhybrid-gameplan-key-items-to-watch-185831255.html", "symbols": ["0P4F.LSE", "F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.025, "neu": 0.887, "pos": 0.089}}, {"date": "2024-02-05T14:40:10+00:00", "title": "Is Ford Motor (F) Stock Undervalued Right Now?", "content": "Here at Zacks, our focus is on the proven Zacks Rank system, which emphasizes earnings estimates and estimate revisions to find great stocks. Nevertheless, we are always paying attention to the latest value, growth, and momentum trends to underscore strong picks.\n\nConsidering these trends, value investing is clearly one of the most preferred ways to find strong stocks in any type of market. Value investors use fundamental analysis and traditional valuation metrics to find stocks that they believe are being undervalued by the market at large.\n\nOn top of the Zacks Rank, investors can also look at our innovative Style Scores system to find stocks with specific traits. For example, value investors will want to focus on the \"Value\" category. Stocks with high Zacks Ranks and \"A\" grades for Value will be some of the highest-quality value stocks on the market today.\n\nOne company value investors might notice is Ford Motor (F). F is currently sporting a Zacks Rank of #2 (Buy) and an A for Value.\n\nF is also sporting a PEG ratio of 1.14. This figure is similar to the commonly-used P/E ratio, with the PEG ratio also factoring in a company's expected earnings growth rate. F's PEG compares to its industry's average PEG of 2.43. Over the past 52 weeks, F's PEG has been as high as 1.65 and as low as 0.72, with a median of 1.13.\n\nFinally, we should also recognize that F has a P/CF ratio of 3.86. This data point considers a firm's operating cash flow and is frequently used to find companies that are undervalued when considering their solid cash outlook. This company's current P/CF looks solid when compared to its industry's average P/CF of 14.86. Over the past 52 weeks, F's P/CF has been as high as 12.84 and as low as 3.10, with a median of 4.88.\n\nThese are only a few of the key metrics included in Ford Motor's strong Value grade, but they help show that the stock is likely undervalued right now. When factoring in the strength of its earnings outlook, F looks like an impressive value stock at the moment.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/ford-motor-f-stock-undervalued-144010704.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.007, "neu": 0.835, "pos": 0.158}}, {"date": "2024-02-05T13:56:00+00:00", "title": "Why Earnings Season Could Be Great for Ford Motor (F)", "content": "Investors are always looking for stocks that are poised to beat at earnings season and Ford Motor Company F may be one such company. The firm has earnings coming up pretty soon, and events are shaping up quite nicely for their report.\r\n\r\nThat is because Ford Motor is seeing favorable earnings estimate revision activity as of late, which is generally a precursor to an earnings beat. After all, analysts raising estimates right before earnings — with the most up-to-date information possible — is a pretty good indicator of some favorable trends underneath the surface for F in this report.\r\n\r\nIn fact, the Most Accurate Estimate for the current quarter is currently at 14 cents per share for F, compared to a broader Zacks Consensus Estimate of 13 cents per share. This suggests that analysts have very recently bumped up their estimates for F, giving the stock a Zacks Earnings ESP of +6.55% heading into earnings season.\n\nFord Motor Company Price and EPS Surprise Ford Motor Company Price and EPS Surprise\n\nFord Motor Company price-eps-surprise | Ford Motor Company Quote\n\nWhy is this Important?\n\nA positive reading for the Zacks Earnings ESP has proven to be very powerful in producing both positive surprises, and outperforming the market. Our recent 10-year backtest shows that stocks that have a positive Earnings ESP and a Zacks Rank #3 (Hold) or better show a positive surprise nearly 70% of the time, and have returned over 28% on average in annual returns (see more Top Earnings ESP stocks here).\r\n\r\nGiven that F has a Zacks Rank #2 (Buy) and an ESP in positive territory, investors might want to consider this stock ahead of earnings. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nClearly, recent earnings estimate revisions suggest that good things are ahead for Ford Motor, and that a beat might be in the cards for the upcoming report.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nStory continues\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/why-earnings-season-could-great-135600197.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.BE", "FMC1.DU", "FMC1.F", "FMC1.HM", "FMC1.MU", "FMC1.STU", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0, "neu": 0.814, "pos": 0.186}}]