[{"date": "2023-11-10T23:12:00+00:00", "title": "Illumina, Inc. investors: Please contact the Portnoy Law Firm to recover your losses", "content": "LOS ANGELES, Nov.  10, 2023  (GLOBE NEWSWIRE) -- The Portnoy Law Firm advises Illumina, Inc. (“Illumina” or the “Company”) (NASDAQ: ILMN) investors that a lawsuit filed on behalf of investors that purchased Illumina securities between May 1, 2023 and October 16, 2023, inclusive (the “Class Period”).\n\nInvestors are informed that they must petition the Court within 60 days from the issuance of this notice if they wish to act as the lead plaintiff in this case.\n\nInvestors are encouraged to contact attorney Lesley F. Portnoy, by phone 844-767-8529 or email: lesley@portnoylaw.com, to discuss their legal rights, or click here to join the case via www.portnoylaw.com. The Portnoy Law Firm can provide a complimentary case evaluation and discuss investors’ options for pursuing claims to recover their losses.\n\nIllumina disclosed on August 10, 2023, after market hours, that the SEC was examining the company's declarations about its recent purchase of GRAIL, Inc., including issues related to the behavior and remuneration of some Illumina and GRAIL managers.Following this announcement, Illumina's share price dropped by $4.64, or 2.5%, ending at $180.48 on August 11, 2023.Later, on October 17, 2023, Carl Icahn filed a lawsuit against current and former Illumina directors, accusing them of breaching their fiduciary responsibilities. Although the lawsuit was initially sealed, Reuters reported that Icahn, at the 13D Monitor Active-Passive Investor Summit in New York, stated the lawsuit concerned Illumina's completion of its acquisition of cancer diagnostic test producer Grail.Subsequently, Illumina's stock price fell again by $7.42, or 5.6%, closing at $124.45 per share on October 18, 2023.The lawsuit in this class action claims that during the Class Period, the Defendants provided false and/or misleading statements and failed to reveal crucial negative information about Illumina's business, operations, and future. Specifically, it alleges that the Defendants did not inform investors that: (1) some company insiders had personal financial reasons for acquiring GRAIL; (2) Icahn's criticism, contrary to Illumina's attempts to downplay it, was accurate in identifying a misalignment between insiders’ interests and the Company’s; and (3) consequently, the Defendants' optimistic comments about Illumina's business, operations, and prospects were significantly misleading and/or lacked a solid foundation.\n\nThe lawsuit contends that when these undisclosed details became public, investors suffered financial losses.\n\nPlease visit our website to review more information and submit your transaction information.\n\nThe Portnoy Law Firm represents investors in pursuing claims against caused by corporate wrongdoing. The Firm’s founding partner has recovered over $5.5 billion for aggrieved investors. Attorney advertising. Prior results do not guarantee similar outcomes.\n\nLesley F. Portnoy, Esq.\r\nAdmitted CA and NY Bar\r\nlesley@portnoylaw.com\r\n310-692-8883\r\nwww.portnoylaw.com\n\nAttorney Advertising", "link": "https://www.globenewswire.com/news-release/2023/11/10/2778540/0/en/Illumina-Inc-investors-Please-contact-the-Portnoy-Law-Firm-to-recover-your-losses.html", "symbols": ["ILMN.US"], "tags": ["$ILMN", "CLASS ACTION", "LAW & LEGAL ISSUES", "PORTNOY LAW"], "sentiment": {"polarity": -0.926, "neg": 0.092, "neu": 0.843, "pos": 0.065}}, {"date": "2023-11-10T22:12:01+00:00", "title": "S&amp;P 500 Gains and Losses Today: Hologic Announces Strong Results, Stock Buyback", "content": "The S&P 500 gained 1.6% on Friday, Nov. 10, 2023, rallying back from Thursday's selloff as bond yields retreated from higher levels seen following comments from the Fed chair.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6c4b46d2-3f19-39bf-a307-225d30ded7aa/s%26p-500-gains-and-losses.html", "symbols": ["AVGO.US", "AVGO34.SA", "GSPC.INDX", "HO1.F", "HOLX.US", "ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0, "neu": 0.92, "pos": 0.08}}, {"date": "2023-11-10T20:33:01+00:00", "title": "Illumina Shares Hit a 10-Year Low as the Company's Customers Pull Back on Spending", "content": "Illumina missed revenue forecasts and cut its full-year outlook, citing \"challenging\" macroeconomic conditions.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a969e515-f556-3892-8f02-7c2f843fa983/illumina-shares-hit-a-10-year.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.511, "neg": 0.249, "neu": 0.751, "pos": 0}}, {"date": "2023-11-10T17:01:22+00:00", "title": "Midday Movers: Hologic and Meta Platforms Gain, Illumina Sinks", "content": "U.S. equities advanced at midday, bouncing back from Thursday's declines as market participants kept a close eye on Treasury yields and comments from Fed officials.\n\nContinue reading", "link": "https://finance.yahoo.com/m/0e9f17a7-17b1-3185-8291-a64fbab2f3df/midday-movers%3A-hologic-and.html", "symbols": ["FB2A.F", "FB2A.XETRA", "GSPC.INDX", "HO1.F", "HOLX.US", "ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0, "neu": 0.863, "pos": 0.137}}, {"date": "2023-11-10T15:42:32+00:00", "title": "DNA-Reading Giant Illumina Crashes As Macro Pressures Guidance — Again", "content": "Illumina stock crashed Friday after the DNA-reading behemoth slashed its outlook as pressures continue to build on life sciences companies.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a2613d78-68f2-372a-9302-352d4ecf58e3/dna-reading-giant-illumina.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.494, "neg": 0.174, "neu": 0.826, "pos": 0}}, {"date": "2023-11-10T14:46:00+00:00", "title": "Illumina Stock Is the Worst Performer in the S&amp;P 500. Grail Isn’t the Only Issue.", "content": "The gene-sequencing company cuts its financial forecasts, prompting analysts to reduce their stock price targets.\n\nContinue reading", "link": "https://finance.yahoo.com/m/7e429482-9479-3fff-9925-8994989a6718/illumina-stock-is-the-worst.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.296, "neg": 0.121, "neu": 0.879, "pos": 0}}, {"date": "2023-11-10T14:45:30+00:00", "title": "Stocks to Watch Friday: Illumina, Trade Desk, Meta", "content": "**↘️** [**Illumina (ILMN)**](https://www.wsj.com/market-data/quotes/ILMN): Shares dropped 12% after the maker of gene-sequencing products offered a gloomier outlook for sales and profits. **↘️** [**Trade Desk (TTD)**](https://www.\n\nContinue reading", "link": "https://finance.yahoo.com/m/59183977-b4e6-335d-90d4-3ce77975ae62/stocks-to-watch-friday%3A.html", "symbols": ["ILMN.US", "ILU.F", "NC0.F", "NC0B.F", "NC0E.F", "NWS.AU", "NWS.US", "NWSA.US", "NWSLV.AU", "PLUG.US", "PLUN.F", "PLUN.XETRA", "TT8.F", "TT8.STU", "TTD.US", "U.US"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0.074, "neu": 0.774, "pos": 0.152}}, {"date": "2023-11-10T13:01:06+00:00", "title": "Q3 2023 Illumina Inc Earnings Call", "content": "Participants\n\nJacob Thaysen; CEO & Director; Illumina, Inc.\n\nJoydeep Goswami; CFO, Chief Strategy & Corporate Development Officer; Illumina, Inc.\n\nSallilyn Schwartz; VP of IR; Illumina, Inc.\n\nCatherine Walden Ramsey Schulte; Senior Research Analyst ; Robert W. Baird & Co. Incorporated, Research Division\n\nConor Noel McNamara; Analyst; RBC Capital Markets, Research Division\n\nDaniel Anthony Arias; MD & Senior Analyst; Stifel, Nicolaus & Company, Incorporated, Research Division\n\nDaniel Gregory Brennan; MD and Senior Tools & Diagnostics Analyst; TD Cowen, Research Division\n\nDaniel Louis Leonard; Research Analyst; UBS Investment Bank, Research Division\n\nKyle Alexander Mikson; Director & Senior Equity Research Analyst; Canaccord Genuity Corp., Research Division\n\nMichael Leonidovich Ryskin; MD & Research Analyst; BofA Securities, Research Division\n\nPuneet Souda; Senior MD of Life Science Tools and Diagnostics & Senior Research Analyst; Leerink Partners LLC, Research Division\n\nRachel Marie Vatnsdal Olson; Analyst; JPMorgan Chase & Co, Research Division\n\nSung Ji Nam; Analyst; Scotiabank Global Banking and Markets, Research Division\n\nTejas Rajeev Savant; Equity Analyst; Morgan Stanley, Research Division\n\nVijay Muniyappa Kumar; Senior MD and Head of Medical Supplies & Devices and Life Science Tools & Diagnostics Team; Evercore ISI Institutional Equities, Research Division\n\nPresentation\n\nOperator\n\nGood day, ladies and gentlemen, and welcome to the Third Quarter 2023 Illumina Earnings Conference Call. (Operator Instructions) Please be advised that today's conference is being recorded. \r\nI would now like to hand the conference over to Salli Schwartz, Vice President of Investor Relations.\n\nSallilyn Schwartz\n\nHello, everyone, and welcome to our earnings call for the third quarter of 2023. During the call today, we will review the financial results we released after the close of the market and offer commentary on our commercial and regulatory activity, after which we will host a question-and-answer session. Our earnings release can be found in the Investor Relations section of our website at illumina.com. \r\nParticipating for Illumina today will be Jacob Thaysen, Chief Executive Officer; and Joydeep Goswami, Chief Financial Officer and Chief Strategy and Corporate Development Officer. Jacob will provide an update on the state of Illumina's business, and Joydeep will review our financial results, which include GRAIL. \r\nAs a reminder, GRAIL must be held and operated separately and independently from Illumina pursuant to the transitional measures ordered by the European Commission, which prohibited our acquisition of GRAIL under the EU merger regulation. \r\nThis call is being recorded, and the audio portion will be archived in the Investors section of our website. \r\nIt is our intent that all forward-looking statements regarding our financial results and commercial activity made during today's call will be protected under the Private Securities Litigation Reform Act of 1995. Forward-looking statements are subject to risks and uncertainties. Actual events or results may differ materially from those projected or discussed. All forward-looking statements are based upon current available information, and Illumina assumes no obligation to update these statements. \r\nTo better understand the risks and uncertainties that could cause actual results to differ, we refer you to the documents that Illumina files with the Securities and Exchange Commission, including Illumina's most recent Forms 10-Q and 10-K. \r\nWith that, I'll now turn the call over to Jacob.\n\nStory continues\n\nJacob Thaysen\n\nThank you, Salli. Good day, everyone, and thank you for joining today's call. As you know, I assumed the role as Illumina's CEO a little over 6 weeks ago. It is an honor to lead this company. I joined Illumina after more than a decade at Agilent, where I ran both the Diagnostic and Genomics Group; and more recently, Agilent's largest business, the Life Science and Applied Markets Group. I have long admired Illumina for its role in building the genomics market, and I'm incredibly excited to be here. \r\nDuring my first weeks, I prioritized getting to know our employees and meeting with several of our customers. Illumina has a highly capable team, and I have been impressed with their level of passion and commitment to our work. Both our employees and our customers are driven to move genomics forward. \r\nLike our team, I'm passionate about genomics and the role that this field can play in health care and personalized medicine, particularly in the oncology space. This is a massive opportunity, and Illumina will remain the key player even as others enter the market. Illumina's infrastructure that they have built over 2.5 decades, our compelling offerings that sets the global standard and our deep commitment to innovation for the future will continue to drive the use of genomics and multiomics around the world. \r\nTurning to our third quarter results. In Q3, Illumina delivered revenue of approximately $1.12 billion, flat year-over-year or up 1% on a constant currency basis. This was a disappointing result. The macroeconomic environment remains challenging for our industry and for our customers with customers increasingly cautious and constrained in their purchasing decisions. \r\nDespite a lower gross margin year-over-year, tight management of our operating expenses allowed us to deliver diluted non-GAAP EPS of $0.33, also approximately flat year-over-year. While we cannot control external environment, Illumina's management team and I remain focused on supporting our customers and our own operational execution. \r\nPart of my comprehensive review of the business includes reexamining our strategic initiatives and our targets for long-term revenue growth and operating margins. We will lay out our new targets for you later next year. \r\nA key priority for me is to get clarity on the GRAIL situation. Therefore, I have requested and the Board has established a special committee to expedite decisions on GRAIL. Furthermore, we have retained advisers and are preparing for sale and capital markets transactions. We expect to file a Form 10 on a confidential basis with the SEC. Hereafter, we will contact third parties as investment capital sources or as potential purchases as our appeals are ongoing. \r\nI know there have been questions regarding our appeals. These appeals are not just about GRAIL. They provide Illumina with flexibility for any divestiture of GRAIL and also for future transactions. The appeals will not impact our ability to move swiftly. Make no mistake, I'm here to focus on the core business, which I will talk more about after Joydeep's remarks. Joydeep?\n\nJoydeep Goswami\n\nThank you, Jacob. I'll start by reviewing our consolidated financial results, followed by segment results for core Illumina and GRAIL and then conclude with my remarks on our current outlook for 2023. I will be discussing non-GAAP results, which includes stock-based compensation. I encourage you to review the GAAP reconciliation of these non-GAAP measures, which can be found in today's release and in the supplementary data available on our website. \r\nAs Jacob noted, in the third quarter, consolidated revenue of $1.12 billion was flat year-over-year and up 1% on a constant currency basis. Consolidated revenue was down 5% from the second quarter of 2023. Although we correctly anticipated a sequential decrease in high-throughput consumables revenue due to the NovaSeq X transition, we placed fewer NovaSeq X instruments than we expected in the quarter as customers purchase constraints led to lengthened sales cycles. \r\nNon-GAAP net income was $52 million or $0.33 per diluted share, which included dilution from GRAIL's non-GAAP operating loss of $155 million for the quarter. Despite our lower revenue, non-GAAP EPS exceeded our expectations primarily due to continued execution of expense-reduction initiatives and a higher gross margin than we forecast. \r\nGAAP net loss was $754 million or $4.77 per diluted share, which included goodwill and intangible impairments of $821 million related to the GRAIL segment. These impairments were primarily the result of a decrease in Illumina's consolidated market capitalization and a higher discount rate used for the fair value cancellation of the GRAIL segment. \r\nOur non-GAAP tax rate was 39.7% for the quarter, which decreased from 43.2% in Q3 2022 with both quarters reflecting the impact of R&D capitalization requirements. The year-over-year decrease was primarily due to a decrease in the non-GAAP tax expense, impact of R&D capitalization requirements given increased amortization of capitalized R&D expenses. Our non-GAAP weighted average diluted share count for the quarter was approximately 158 million. \r\nMoving to segment results. Core Illumina revenue of $1.11 billion was flat year-over-year on both a reported and constant currency basis and included anticipated reductions of approximately 7 percentage points from 2 primary categories: one, the decrease in COVID surveillance and the effect of sanctions in Russia that together represent approximately 3.5 percentage points; and two, the year-over-year reduction in China revenue, that also is approximately 3.5 percentage points. \r\nCOVID surveillance contributed approximately $4 million in total revenue in Q3 2023 compared to $28 million in Q3 2022. Core Illumina sequencing consumables revenue of $695 million was down 4% year-over-year. The decrease was primarily driven by a 12% decline in sales to research customers. These customers were impacted by the NovaSeq X transition and are reducing NovaSeq 6000 consumables purchases before they have fully ramped up activity on NovaSeq X. \r\nTotal sequencing consumables revenue was also impacted by the COVID, Russia and China factor, I noted previously, as well as the impact of macroeconomic conditions and customers' purchasing power and project planning. Strength in sales to clinical customers partially offset the decline in research with clinical sequencing consumables growing 10% year-over-year, led by continued momentum in oncology and genetic disease testing. \r\nTurning to sequencing activity. Total sequencing gigabase output connected high- and mid-throughput instruments grew 5% from Q2 2023 and 29% year-over-year. We are encouraged by the trends we are seeing across both research and clinical high-throughput customers that have a NovaSeq X installed. As expected, these customers show higher overall growth in sequencing output than high-throughput customers that have not yet adopted the NovaSeq X, both on a quarter-over-quarter and a year-over-year basis. \r\nAs a reminder, we believe this data is a useful reference that shows the general activity trends across our installed base and is directionally correlated with revenue over time. \r\nSequencing instruments revenue for core Illumina of $179 million grew 10% year-over-year driven primarily by NovaSeq X, which more than offset the decline in NovaSeq 6000 shipments. Growth in high-throughput instruments was partially offset by the expected decline in mid-throughput due to increasing capital purchase and cash flow constraints that continue to impact our customers' purchasing behaviors globally as well as by local competition in China. \r\nFor NovaSeq X, we exited Q3 with more than 310 orders since launch. Our shipments of 97 NovaSeq X instruments in Q3 brought our total installed base to 273 instruments. Core Illumina sequencing service and other revenue of $142 million was up 15% year-over-year driven primarily by higher instrument service contract revenue on a growing installed base as well as an increase in lab services revenue. \r\nMoving to regional results for core Illumina. All regions continued to be impacted by 2 key issues: one, tighter funding and budget pressures that are impacting customer purchasing power and project planning; and two, the impact of high-throughput customers transitioning to NovaSeq X as customers continue to reduce NovaSeq 6000 consumables purchases before they have fully ramped up activity on NovaSeq X. \r\nAmericas revenue of $650 million grew 10% year-over-year, attributed to NovaSeq X placements as well as clinical testing volume driving greater consumables revenue. Clinical sequencing consumable shipments grew more than 20% year-over-year. \r\nEurope revenue of $260 million was flat year-over-year or up 1% on a constant currency basis. Growth in sequencing consumables was driven by mid-teens growth in clinical and strength in mid-throughput consumables, offset by the decline in COVID surveillance and the negative impact of exchange rates. \r\nFor sequencing instruments, growth in high throughput due to NovaSeq X placements was more than offset by a decline in mid-throughput instruments. EMEA revenue of $98 million declined 22% year-over-year or 19% on a constant currency basis, which included an 11 percentage point impact from sanctions in Russia. The year-over-year decrease was also driven by softness in Japan due to the macroeconomic factors I mentioned earlier as well as the expected slowdown in COVID surveillance. \r\nGreater China revenue of $98 million represented a 26% decrease year-over-year or 25% on a constant currency basis, reflecting continued macroeconomic and geopolitical challenges as well as local competition in mid-throughput. \r\nMoving to the rest of core Illumina P&L. Core Illumina non-GAAP gross margin of 66% decreased 290 basis points year-over-year primarily driven by product mix and less fixed cost leverage on lower manufacturing volumes as well as lower instrument margins and higher field service and installation costs due to the NovaSeq X launch, which is typical in a launch year. \r\nCore Illumina non-GAAP operating expenses of $481 million were down $33 million year-over-year and were lower than expected primarily due to continued expense-reduction initiatives. As a result of these factors, core Illumina non-GAAP operating margin was 22.5% in Q3 2023 compared to 22.6% in Q3 2022. Despite our lower gross margin, operating margin was approximately flat year-over-year due to our proactive cost management initiatives. \r\nTransitioning to financial results for GRAIL. GRAIL revenue of $21 million for the quarter grew 110% year-over-year driven primarily by adoption of Galleri. GRAIL non-GAAP operating expenses totaled $161 million and increased $12 million year-over-year driven primarily by efforts to scale GRAIL's commercial and R&D organizations. \r\nMoving to consolidated cash flow and balance sheet items. Cash flow provided by operations was $139 million. Third quarter 2023 capital expenditures were $45 million, and free cash flow was $94 million. We did not repurchase any common stock in the quarter. \r\nWe ended the quarter with approximately $933 million in cash, cash equivalents and short-term investments. During the third quarter of 2023, the company used $750 million in cash to repay the outstanding principal of convertible notes that matured in August 2023. \r\nMoving now to 2023 guidance. We now expect full year 2023 consolidated revenue to decline 2% to 3% from 2022, including core Illumina revenue that is down 3% to 4% year-over-year. As a reminder, these ranges include anticipated reductions from COVID surveillance of approximately 200 basis points, the impact on our business from sanctions in Russia of approximately 100 basis points, reductions in our business in China as well as a year-over-year negative impact from foreign exchange rates. \r\nGRAIL revenue is now expected to be at the low end of the range of $90 million to $110 million for 2023. \r\nFor fiscal 2023, we now expect core Illumina sequencing instrument revenue to decline 5% to 6% year-over-year driven by capital and cash flow constraints that have continued to impact our customers' purchasing behaviors globally as well as the decline in our business in China. The decrease from our prior guidance is primarily driven by our lower NovaSeq X shipment expectations for 2023. \r\nWe now expect to ship between 330 to 340 NovaSeq X instruments for the year as customers' purchasing constraints lead to lengthened sales cycles. We also now expect core Illumina sequencing consumables revenue to decline 5% to 6% year-over-year driven primarily by the decrease in NovaSeq 6000 consumables as customers transition to NovaSeq X, the impact of macroeconomic conditions on customer project planning and budgets, the effect of sanctions in Russia, the slowdown in COVID surveillance, and the decline in our business in China. The decrease from our prior guidance primarily reflects a slower ramp in NovaSeq X consumables, in part due to our lower placement expectations as well as the increasing impacts of macroeconomic constraints. \r\nWe now expect core Illumina total sequencing revenue to decline 3% to 4% year-over-year. This continues to include intercompany sales to GRAIL of approximately $30 million, which are eliminated in consolidation. We now expect consolidated non-GAAP operating margin of 4% to 4.5% and core Illumina non-GAAP operating margin of 19% to 19.5%. Our revised operating margins reflect our lower revenue expectations for the year, partially offset by continued expense-reduction initiatives. We now expect our non-GAAP tax rate to be approximately 39% for 2023 due to discrete tax benefit recognized in Q3 2023 related to prior year return adjustments. \r\nLastly, we now expect non-GAAP earnings per diluted share in the range of $0.60 to $0.70 for 2023, reflecting non-GAAP diluted shares outstanding of approximately 159 million shares. Dilution from GRAIL's non-GAAP operating loss is now expected to be approximately $660 million as GRAIL continues to manage its expense base in line of its latest revenue outlook. \r\nI will now turn it back over to Jacob for his closing remarks. Thank you.\n\nJacob Thaysen\n\nBefore we go to Q&A, I wanted to reiterate Illumina's commitment to supporting our customers in this difficult macroeconomic environment. While we cannot control for external factors, we can optimize our own actions to successfully navigate through this period and position the company for a return to accelerated growth on the other side. \r\nI know you're interested to hear our views for 2024. With the caveat that we haven't finished 2023, we're still looking at our budget for 2024. Our initial view is that 2024 results will look very similar to 2023. We don't expect near-term improvement to the macroeconomic environment, and geopolitical issues have been persistent. \r\nWe are encouraged with the early signs we're seeing for NovaSeq X utilization and the continued rollout of the X position us very well for the ramp in consumables and overall growth when the market conditions improve. This is clearly a dynamic situation, and we want to be able to develop our views in depth. Therefore, for 2024, we will not provide guidance before our Q4 earnings call in February. \r\nThe main reason that I joined Illumina was my strong conviction about the future of the core Illumina business. While over the coming months, I'll continue to listen and learn, I would also be focused on several key priorities. First, we need to drive our top line as much as possible in this environment. This means continued placements of the NovaSeq X and all of our instruments, laying the groundwork for increased consumables demand. \r\nWe'll continue working closely with our customers around the world, whether they are integrating new instruments into their workflows, starting new projects or building new tests or assays. \r\nSecond, we need to keep driving innovation that is highly focused on our customers with priorities. These innovations include automation and sample-to-answer solutions, served to strengthen our leadership position around the world. At the same time, we need to manage our R&D investments with discipline and rigor. \r\nWe most recently launched our 25B rating kit. This was highly anticipated by our customers, and it will unleash the full power of the NovaSeq X. \r\nThird, we need to focus our own operational excellence across geographies, functions and processes. Earlier this year, we announced a plan to reduce our annualized run rate expenses. Our team has executed well and has been able to reduce annualized run rate expenses by approximately $175 million, ahead of our original projection of more than $100 million. These savings will continue to support flexibility and further investment in high-growth areas and our margins. \r\nI'm committed to executing against all of these priorities with a strong sense of urgency. We are focused on delivering tangible improvements that support profitable long-term growth from Illumina and for our shareholders. \r\nI will now invite the operator to open for the line of Q&A.\n\nQuestion and Answer Session\n\nOperator\n\n(Operator Instructions) And our first question comes from Vijay Kumar with Evercore ISI.\n\nVijay Muniyappa Kumar\n\nJacob, welcome to Illumina. My maybe one question is on GRAIL, maybe a 2-parter here. I think the EC divestiture order asks for 2.5 years of cash outlay. What does that mean given GRAIL's current OpEx spending? Is that $1.75 billion of cash out there. And I think related to that, I saw you announced a special committee, who is on the special committee? What is the focus for this committee? Is there any more details and it sounded something different, I just wanted to understand what is different, what has changed?\n\nJacob Thaysen\n\nYes, Vijay. Thank you very much, and I'm really excited to be here at Illumina. And let me start with your second question, and then I'll have Joydeep step in also on talking about the -- what those 2.5 years means. But as I discussed here, coming into the company, I felt it was very important to get clarity on GRAIL. And it was very important for me to have the support for the Board and to make swift decisions to move forward. \r\nAnd thereby, we started a special committee with 3 of the Board members, including -- and then besides me, that is the chairing of that committee. So I have 3 Board members plus me, that will work with the management team to really walk through all the elements around the divestiture order to make sure we can make some fast decisions. \r\nWe need to make decisions which path we're going to follow. Is it going to be a trade sale, the spin, the split, with or without a sponsor? And of course, there's a lot of considerations related to that. That's really what the special committee is helping me and the rest of the management team to do. Joydeep?\n\nJoydeep Goswami\n\nYes, Vijay. So in the 2.5 years of cash support to GRAIL, we're still working with the European Commission on exactly what that means in terms of numerical number. So I'm not at liberty to disclose those details. We will come back with that once we have alignment. \r\nBut I think as Jacob alluded to, right, this is not something that we have to provide all on our own, right? We have several options now that we have worked with the EC to come out with a -- or to have a divestiture order that is in line with our expectations for flexibility to use even in the case of a spin or a split decision, we can get in a sponsor that can support all or part of the requirement for the 2.5 years of cash support or we can go to the markets and raise that money as well, right? So stay tuned on that one.\n\nOperator\n\nAnd our next question will come from Dan Brennan with TD Cowen.\n\nDaniel Gregory Brennan\n\nJacob, welcome. Maybe just -- I'll ask one. Obviously, it's all we have, but maybe a couple parter. So maybe, Jacob, obviously, you left a great job at Agilent before coming here. And certainly, would be interested to get your view on the growth rate and outlook for Illumina when you're ready to give that. But I'd be interested to get your view on kind of the overall NGS market in taking a job. Like thoughts on what type of growth characteristics you think are reasonable in that market? Because given the price cuts, there's just a lot of question on demand elasticity. \r\nSo I guess, first one is on the NGS overall market, few of view there. And then, b, I just had a question on the X specifically. I understand, obviously, has a lowering replacement number given customer constraints. But can you give any color on the orders or the backlog that you have as of right now? \r\nAnd then the final part would just be on guidance. Illumina has had a series of kind of guidance reductions. A lot of peers are facing the same issue, but you guys have had a more elongated period of this. So I'm just wondering kind of what changes can be made in order to hopefully better set guidance so that the risk of these reductions is elemented going forward.\n\nJacob Thaysen\n\nThanks, Dan. And I think I will have Joydeep also jumping in on some of those elements here. But let me just start by coming here into Illumina. And my observation both from when I was outside Illumina but also coming in, I think that the core business has a tremendous opportunity. I think there's a lot of opportunities in the NGS markets. And I think we are definitely through a tough period right now. I think the whole life science tools industry is seeing it. And certainly, here at Illumina, we're not immune for that. \r\nBut the growth rates, even though -- I will spend time here over the next period of time still learning the business and really understand the organization. So at this point of time, I don't have a final opinion about what the -- what I think is the right growth rate for the business and what we're committing to. But I will certainly come back later in '24 and share all of that with you when I'm ready for it. \r\nBut in the meantime, I think that the overall market is very healthy and there will be a lot of growth opportunities for Illumina going forward. And I can then say that my -- some of the findings coming into the company and really digging deep into our innovation engine and what our road maps look like. I'm very excited for the future of this company. I think we will continue to pioneer in this area. \r\nSo I think on guidance and, Joydeep, join in here also, but in the end, we wanted to make sure when we signal also from, especially '24 here, that at this point, we want to be prudent in how we set our -- it's not a guidance yet, but at least how we view '24 as we simply don't see any change -- short-term change in the economical environment. And therefore, we felt it was important for -- to go out now and share our observations. But Joydeep, do you want to?\n\nJoydeep Goswami\n\nNo. I think, Jacob, that's right. On the guidance piece, look, we made a commitment to you to come back to you with any read on the macroeconomics we see. And I think we've held up to that commitment. In fact, we may have been a little bit canary in the coal mine signaling some of this earlier to you, especially this year than others, right? \r\nOne of the things, of course, you did bring up was the elongated sort of lack of growth or the reduced growth that we have had. That is true. I think part of what hit us at the same time as a macroeconomic going down is the transition -- major transition on our platform, which has hit us as customers move from the 6000 to the expert. There's a gap between when they burn down some of their inventory on the X and then wait to fully ramp up on the X. So you will see that balance out over time. We don't have any doubts on that. \r\nAnd then on the X, I want to reemphasize, and I think you will have seen this from your channel checks as well, demand and interest in the innovation and the capabilities that the X brings remain strong. I think we are very excited about the launch of the 25b. And I think those of you who attended ASHG would have seen our customers interest in that and the data that's coming out of the 25B and the improvements that we continue to make on the software really resonate with our customers. So we remain very interested in that.\n\nOperator\n\nAnd our next question will come from Puneet Souda with Leerink Partners.\n\nPuneet Souda\n\nJacob, good to have you on board here. So if I could ask 2-part questions just with the 25B launch, can you talk a little bit about how -- and maybe Joydeep can chime in and talk about how the transformation is going to be sort of over the next couple of months. You obviously get a price uptick with the 25B, but not all customers are going to be able to essentially fill up that flow cell. So there is going to be a bit of an ebb and flow. So maybe if you could talk a little bit about that, at least qualitatively in the near term. \r\nAnd then a bigger competition question. Jacob, you've seen the LCMS business and other businesses in China. What do you imagine for China, for Illumina with one of the bigger competitors over there? How do you see Illumina's position in China longer term? \r\nAnd if I may just ask on -- again, on competition, one of your diagnostic customers, NIPT and MRD customer pointed out that they're validating different platforms. So again, what's your view on competition?\n\nJacob Thaysen\n\nThank you very much, Puneet. And again, I'm very pleased to be here. Let me start with the China question. Yes, you're right, I have certainly some experience of running businesses in China, very familiar with the Chinese -- the China itself and how to operate businesses there.\r\nSo what is, of course, more unique for Illumina than some of our -- some of the other life science tools companies is that Illumina has a Chinese competitor that have at least good enough sequencing capabilities here. But China continues to be an extremely important country for us. And we are right now working through and -- in China for China strategy to really be much better positioned in China going forward, and we are committing to China. And I think we can actually do really well in China.\r\nMany of our customers in China prefers to work with Illumina for what we stand for both quality but also that we are the number one brand out there. So we will continue to be very strong in China.\r\nGenerally speaking, on competition, yes, you're right. I mean there are competition out there. As you also know, I'm very familiar with being in a very competitive environment. And I think that with what Illumina has, which I think will serve us extremely well, is that we have a very strong brand. We have a very strong installed base. Almost all payables coming out is based on our technology.\r\nAnd also, of course, what I see internally with the road map we have for the pipeline of new products coming out, our innovation capabilities will continue to position us very extremely competitive in this environment. But of course, I understand and I'm fully aware that we will be in a very competitive situation forward. And in the end, I think that just keeps us really focused on our customers, and we'll do our best for our customers. So I'm here, I'm ready to fight for it.\n\nJoydeep Goswami\n\nYes. Maybe I'll tag on there. Let me start with the competition. We obviously, as Jacob said, take it seriously but also monitor it very carefully across the globe through what we're seeing out in the field. So I will say, outside of China, we have seen the competition. And share have been what we had expected, right? Obviously, with new market entrants, you will see a little bit of a decline in share, but it has been, outside of China, very much according to expectations.\r\nOn the 25B, Puneet, so let me start by saying what we have seen, and this is early indicator, is that when we look at sequencing activity growth, and we measure it by gigabase, we are seeing that customers who have adopted Dx have seen a faster growth rate in output, in sequencing output than customers who have not adopted Dx, right? So this is an encouraging sign that X is actually spurring more sequencing activity at these customers.\r\nAnd again, it's still very early days. They're ramping up. They're validating fully on their particular workflows. With 25B, I think you're right, it will spur even more capacity and experiments. We've heard customers that want to run very large single-cell experiments, for example, be very excited about this 25B and the capabilities that it brings. So we expect that to play out.\r\nI think when you get into the dynamics of whether you're running full flow cells or not, there is a very complex interaction of things that will lead to higher prices per gigabase until we fully load your flow cells. So we can get into that off-line. But we do expect those dynamics to be very similar to what you saw when you brought on NovaSeq 6000 and some of the other flow cells, et cetera.\n\nJacob Thaysen\n\nBut I think also, Joydeep, just to finish on the opportunity that we have seen, at least the customers that I've met here also in the clinical space, are very excited with the new flow cells as this opens up for new assays, new products offering that they haven't had before. So while it will take them a little while, of course, to validate and get up and running, we see many of them right now are rushing to be first to market with us.\n\nOperator\n\nAnd our next question will come from Dan Arias with Stifel.\n\nDaniel Anthony Arias\n\nJacob, just a follow-up on the special committee that will look at GRAIL. What's the general time line that they're expected to be on with respect to reaching a decision? And then can you update us on when the GRAIL team is expecting to see a readout for the NHS-Galleri study at this point?\n\nJacob Thaysen\n\nYes. So I can tell you that we are working as quickly as we can under the framework to look at the options here. And I can tell you the -- I'm as frustrated as all of you, and I look forward to get this behind us. So we are working on very tight time lines. At this point, I don't want to commit to anything because I want to make sure that I can deliver on my commitments on any time line here.\r\nSo by the way, I also want to share with you that this morning, we got the feedback from the ECJ that they have now put in a date for the hearing -- oral hearing, which would be mid-December. So it's good news in the way that things now are moving forward.\r\nAnd just on that, that the appeals are important to us, obviously, for the reason of GRAIL, but probably as important for ensuring that we have the flexibility for future transactions that we will look into. So -- and obviously, also, we can get rid of the fine and so on. So that's why the appeals continues to be important.\n\nJoydeep Goswami\n\nNHS GRAIL readout timing, I think as I stated before that's -- the final expectation on that is some point in 2024, and they will have an early readout as well -- a preliminary readout before that.\n\nOperator\n\nAnd we have a question from Michael Ryskin with Bank of America.\n\nMichael Leonidovich Ryskin\n\nWelcome board. I guess I want to follow up on the earlier question about sort of underlying demand in the market and what gives you confidence in some of the longer-term view. And I guess I'll phrase it in terms of your update to the guide here in the third quarter. I mean you're citing some of the same macro headwinds that others are in terms of what's going on in China, in terms of broader funding concerns and budget tightness. And you're saying that that's sort of weighing on consumables purchases.\r\nBut at the same time, you're not getting the switchover to the Nova X because if you're looking at the order book, the orders have barely grown between 2Q and 3Q. You went from 260 to 310. So orders were up 50 units in the quarter and you placed 97. So it's not like there's a ton of demand growing for Nova X, and yet the Nova 6000 consumables seems to be really slowing. \r\nSo I'm just trying to reconcile that. I mean if people aren't sequencing on the Nova 6000 because they're gearing up for the Nova X, then you would at least see those orders grow. So how can you confidently state that some of this is that transition between instruments and not just less underlying demand in the market?\n\nJacob Thaysen\n\nYes. So let me just start again, address that the -- that we do see the demand in the market space. We also mentioned this overall that we see more gigabase growth rate. So we see definitely there's a lot of activities out there. And again, there's no doubt that the long-term perspective in this market is very healthy. I think what you're seeing is that we're running through and a very challenging environment that everybody else is seeing.\r\nAnd I think everybody -- also last year when they were providing guidance, they were probably optimistic that things will spring back in the second half. And everybody got surprised or at least -- that it didn't. So therefore, we are right now a little more prudent in how we look out in the future. So I think that's one element to it. But if you look into the specifics, I think Joydeep can provide little more insights.\n\nJoydeep Goswami\n\nYes. So I think the -- there's a couple of things when we look at why is it -- further -- the slowdown is further impacted by the transition, right? So definitely, Michael, there is an element of the overall macro slowdown.\r\nBut two things I will tell you about the transition, right? So we look very carefully at high-throughput customers that have purchased the X versus those that have not purchased an X. And we see definitely that the 6000 consumables slowdown is much more pronounced to these customers that have bought the X, right? So that gives us a very good control mechanism of isolating the impact of transition versus the broader macroeconomic trends.\r\nAnd again, realize that they're still ramping up with the X and the 25B. Really for many of these customers that are early adopters, they're really the higher users -- the higher-output users for the NovaSeq X, right? So you will see that transition coming, the ramp-up on the X consumables coming, especially after the launch of the 25B. But it will take them a few months to get up to full capacity once they've validated their workflows.\n\nOperator\n\nAnd our next question comes from Tejas Savant with Morgan Stanley.\n\nTejas Rajeev Savant\n\nJacob, welcome to Illumina. I had a couple of questions for you here, starting on the GRAIL side of things. Looks like you're expecting this ECJ decision in mid-'24. So can you just walk us through the implications of that in terms of what the committee can really do ahead of that time frame?\r\nAnd then beyond the ongoing sort of court cases and figuring out if it end and how to divest this asset, how are you thinking about monetizing the data value that's embedded within GRAIL? Is that an active discussion that's being had at the Board level within this committee as well?\r\nAnd the final part of my question really is a broader one on core Illumina. Where are you in terms of the key leadership roles. Are those -- do you feel like you have a settled team yet? Or could we see some sort of significant changes in the months ahead?\n\nJacob Thaysen\n\nYes. So let me start by addressing the GRAIL situation. And as I think I mentioned before, that's why I put the committee in place or special committee in place is that we have the European divestiture order. And obviously, while we still run the appeals, we will do everything within the framework to move as quickly as possible. As I also mentioned in my remarks is that as soon as we have filed the Form 10, we will go out there and start to talk to potential acquirer and so on -- also looking for the spin and so on.\r\nSo we are moving as quick as we can within that framework. And we will move -- yes, again, we will move as much as we can here. So there's really nothing that holds us back from -- the appeals really runs in parallel. So there's nothing that it prevents us from moving as quick as we can within that. So I think that's -- on that, if you look at the monetization of GRAIL, I don't know, Joydeep, do you have any, thinking about that?\n\nJoydeep Goswami\n\nI think mostly, it's -- you're talking about GRAIL data here. So this is one of the options that obviously the committee will consider and we will consider as a team. But it also really depends on the divestiture option that's chosen and what we agree going back and forth with the European Commission here. So it is one of the things that is absolutely in consideration of the various options that Jacob mentioned that the committee is going to bring on.\n\nJacob Thaysen\n\nYes. And then the last question, I think, was on the leadership team, and I will put it more broadly saying that I will be performing a comprehensive business view over the next period of time. Again, I've been here 40 days, and I'm really impressed with the team and the talented people we have in the organization. But I will, of course, keep you updated on what my thinking is, why we move forward here in '24.\n\nOperator\n\nAnd we have a question from Dan Leonard with UBS.\n\nDaniel Louis Leonard\n\nNow that you're sort of transitioning to maybe a bit more of a hand-to-mouth demand cycle for the X given that you don't have much backlog left, I was hoping you could elaborate what the pipeline looks like. Any metrics you could offer? And is it possible you could quantify how much is the sales cycle lengthening? Is it double what it used to be? Is it some different multiple? Just anything you could help us contextualize that?\n\nJacob Thaysen\n\nI think that, again, I would like to invite Joydeep in to provide a little more insights on where we are. But I can say, generally speaking, the sales cycles is extended quite a lot from what we're used to, not only because it takes time to make the decision, but also to get it through all the levels that there's much more scrutiny on all levels in the decision-making. And we've seen that. I mean we see that in Illumina, but I think that's a general thing that is happening in the industry right now. But Joydeep, do you want to...\n\nJoydeep Goswami\n\nI just want to corroborate, Jacob, what you said, right? We see strong interest in the X. And obviously, with the launch of the 25B, that has perked up even more. And the pipeline continues to have hundreds of opportunities there, right? So we're not suffering decline in the pipeline. We continue to add opportunities for the pipeline.\r\nWhat has been -- because of the macroeconomic situation is a little bit more challenging for us is converting those, that pipeline into orders as quickly as we had imagined, right? So that is the lengthening of the sales cycle that you talked about. And we expect that, that will continue for us and for others for a little bit of time into the future here, right, till macroeconomic conditions return.\r\nBut there's no doubt that they're not -- it's not that the demand is shifting to some other technology or some other instrument. It is still very much centered on the X, and we still continue to have conversations with our customers to get them there. And once they have bought it to really ramp them up and get them ramped up as quickly as possible so that they can pull through the consumables as quickly as possible.\n\nJacob Thaysen\n\nYes. And again, I mean, as Joydeep was saying, we have a healthy pipeline. And just as an evidence that this is moving, we just here -- over the last few days, we received a 10 order -- or 10 pieces -- or was it 10-instrument order on X so -- from one of our biggest customers. So we're definitely seeing that there is really customers who really like the X and can really see that it can be utilized very nicely.\n\nJoydeep Goswami\n\nYes. Jacob, that's a good point. That's a fleet expansion order. So they've had experience with the X, and they are doubling down, right, so.\n\nOperator\n\nAnd we have a question from Sung Ji Nam with Scotiabank.\n\nSung Ji Nam\n\nWelcome, to Jacob. Just a quick one on GRAIL. Kind of what's the key driver of the guidance, the updated guidance being at the low end of the prior range?\n\nJacob Thaysen\n\nJoydeep?\n\nJoydeep Goswami\n\nI can handle this. Yes, so again, it's mostly 2 things. So they did have this particular year, some challenges with their PDX revenue. This is the pharma services revenue. And then Galleri sales are -- while they're growing nicely, have been lower than their initial expectations, right? So both those have impacted it.\n\nJacob Thaysen\n\nBut still a healthy growth.\n\nJoydeep Goswami\n\nStill a very healthy growth. We're seeing that at 100%-ish.\n\nOperator\n\nAnd our next question comes from Kyle Mikson with Canaccord.\n\nKyle Alexander Mikson\n\nWelcome, Jacob. Two-part question. First on GRAIL, second on core. On the GRAIL funding in conjunction with the divestiture, if it is a capital mortgage transaction, the company is going to need 2.5 years of cash. I think that was touched on earlier. You could provide that via equity raise or debt issuance. Could you just walk through what your exact options are to produce that capital if you don't do equity or debt offering?\r\nAnd then on the core business. You guys mentioned the initial view on 2024, is that -- it look similar to 2023. Does that mean that revenue is going to be flat year-over-year for the third year in a row? And then maybe you could just comment on orders and placements for next year. Like could placements grow in '24?\n\nJacob Thaysen\n\nYes. So let me start by the second question here. And again, we will come up with a full guidance in our Q4 '23 call in February. But I'm just sharing you with the initial view we have on '24 right now. And due to the macroeconomic environment, we want to -- and we don't see that change right now.\r\nIf it changes during '24, obviously, we will see more momentum in the business. But I felt it was important to share with all of you right now on how we see the year. There are more details behind it, but we're still working through the rest of this year and we're still finalizing the, of course, 2024 budget also. So it's too early for me to share details about the debt here.\r\nBut what I can tell you, as we said before, is that we still have a strong pipeline on X particularly. And we expect -- and we're just seeing that the sales cycle is taking longer than we expected. But you should actually see that the consumables is starting to pick up in '24 also.\n\nJoydeep Goswami\n\nAnd on the GRAIL, I think I've mentioned this earlier, look, there are several options now on the table that we could help pay for the 2.5 years of funding requirements, right? So for example, if we went for a spin, there are options around the sponsored spin where a sponsor could put in a fair chunk of the money on -- some or all of the money that is required for that funding.\r\nThe other one, which is more of a capital markets transaction, which is more of a split kind of option, where you could go and raise money in capital markets for GRAIL and IPO market for GRAIL. So we're looking through and working through those various options. They are, of course, dependent on specific market conditions and interest in GRAIL from private placement. So we'll keep you posted on that as we go out to the market and consider those options.\n\nOperator\n\nAnd we'll take a question from Catherine Schulte with Baird.\n\nCatherine Walden Ramsey Schulte\n\nWelcome, Jacob. I guess just on your comments on '24, when you say results might look similar to '23. In that case, I guess, how do you view core Illumina op margins? Would those also look similar to '23? Or given some of the cost reductions that you guys have talked about, do you think there's room for improvement there?\n\nJacob Thaysen\n\nYes. Thanks for that. So I think right now, that Illumina have a wonderful model, actually. I think we have really strong operating gross margins. So obviously, with growth, we can really fuel that to the bottom also. But in a flat environment and with, of course -- we are seeing that more challenges. So right now, we're expecting to be flat both on top line and on the bottom line.\n\nJoydeep Goswami\n\nYes. And I think you're right. We do expect to see an improvement in gross margins next year, obviously, with more consumables mix in there. Off the cost reductions that we have made this year, I just want to remind you that some of that -- a substantial portion of that, has already been recognized this year. So there won't be incremental to next year as we go through.\r\nAnd then offsetting those 2 positives is we do expect that the variable compensation of sort of rationalization and year-on-year comp on that will be -- will eat away into that goodness that you've had and coupled with merit increases and inflation, right? So -- and again, we did not pay executives the stock-based compensation and variable compensation this year as our performance has not been up to par. So we do expect that, that will come back into next year as we correct some of that.\n\nJacob Thaysen\n\nBut I think -- on that, I think I'm everything I see here, as I mentioned, also the gross margins are strong in the company, but there's a lot we can do to continue to improve that. So I don't see anything that is -- for me, at least coming in here, see there's any difference in the thesis about Illumina going back to what has been historical margins. And we will work on that.\r\nI think historically, we have been -- the logic has been this will come through growth. And clearly, we need growth to drive some of that. But we were also really focus on operational excellence to build that going forward.\n\nOperator\n\nAnd our next question comes from Conor McNamara with RBC Capital Markets.\n\nConor Noel McNamara\n\nJacob, welcome to San Diego. If I look at kind of what you've said about 2024 from pre-pandemic levels from 2019 to 2024, that would imply an annual growth rate on the core business of about 5%, which is roughly in line with the overall life science tools market despite the fact that you guys have consistently spent about 20% of sales in R&D.\r\nSo if I'm an investor looking at Illumina, should I think of this as an EBIT margin expansion story from here where you bring R&D down in line with peers? Or do you think that you guys -- you can drive a return to growth above historic life science tools growth levels?\n\nJacob Thaysen\n\nYes, that -- I mean, again, I want to be careful on coming with too many comments right now, I'm 40 days into my work here -- to my job here. But I think I still believe that Illumina has a better growth opportunity than many of the other life science tools company. And I will come back and give you more insights when I'm ready for it in -- later in 2024. \r\nBut I don't think that Illumina is in a place where it's in the level of many of the other companies right now. But it's too early for me to give you a clear guidance. But yes, so wait and see.\n\nOperator\n\nAnd our next question will come from Rachel Vatnsdal with JPMorgan.\n\nRachel Marie Vatnsdal Olson\n\nWelcome to Illumina, Jacob. So first up, I just wanted to ask on core Illumina margins, follow up on some of the earlier questions. Specifically, it looks like that implied 4Q margin step down for core Illumina. But also given the lower placement number, your mix should be more skewed towards consumables than typical in 4Q. So is there anything else that we should look at from a onetime perspective or anything else on the puts and takes on that margin implied for 4Q?\n\nJacob Thaysen\n\nJoydeep, do you want to take that?\n\nJoydeep Goswami\n\nYes. So Rachel, a couple of things, right? So we -- you will see margins and operating margins decline. We are seeing a step-down in revenue from Q3 into Q4. So that's one element of that.\r\nThe second element is gross margins are impacted for several reasons, right? One, that we do see every time you see a reduction in volume, you have less absorption of fixed cost. So you have that flowing into it. The second piece is around, yes, we are seeing some shift from instruments into consumables. But we are seeing a reduction because of the transition effects of NovaSeq 6000 consumables, which are highly profitable. And so you're seeing a little bit of margin -- gross margin decline because of that.\r\nAnd then the third is we have some components of strategic deal revenue that we have coming in, in Q4 versus Q3. And that is also pulling down our gross margin. So those 3 components are really what are impacting the gross margin component.\r\nAnd then in the operating margin side, I think we obviously are getting some of the benefits of the cost action that we saw. But we did have some movement of R&D-specific timing investments that moved from Q3 into Q4. So that is taking down our -- taking up our Q4 operating expense a little bit compared to what we had in Q3.\n\nOperator\n\nThank you. And that does conclude our question-and-answer session. I will now hand the call back over to Jacob Thaysen for closing remarks.\n\nJacob Thaysen\n\nThank you, everyone. As we finish the year and move into 2024, I want to reiterate the great foundation that we have here, both in the infrastructure that we have built and in the significant markets that we serve. It is clear to me that there is a tremendous opportunity to create value for our customers and our partners worldwide and, of course, for our shareholders.\r\nThank you again. We're looking forward to see you at upcoming conferences and other events. Thank you.\n\nOperator\n\nThank you. That does conclude today's conference. We do thank you for your participation. Have an excellent day.", "link": "https://finance.yahoo.com/news/q3-2023-illumina-inc-earnings-130106704.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.019, "neu": 0.873, "pos": 0.108}}, {"date": "2023-11-10T12:52:00+00:00", "title": "Illumina (ILMN) Q3 Earnings Surpass Estimates, '23 View Cut", "content": "Illumina Inc. ILMN reported adjusted earnings per share (EPS) of 33 cents in the third quarter of 2023, beating the Zacks Consensus Estimate of 13 cents by a staggering margin. However, the bottom line declined 3% from the year-ago quarter’s figure.\n\nThe adjustments exclude the impact of GRAIL pre-acquisition net operating losses on GILTI, the utilization of U.S. foreign tax credits and incremental non-GAAP tax expenses, among others. Including one-time items, the company’s GAAP loss per share was $4.8 compared with the year-ago quarter’s loss of $24.3.\n\nRevenues\n\nIn the quarter under review, Illumina’s revenues were $1.12 billion, up 0.4% year over year (up 1% at CER). The top line missed the Zacks Consensus Estimate by 1%.\n\nSegment Details\n\nPost the acquisition of GRAIL on Aug 18, 2021, Illumina has two reportable segments, Core Illumina and GRAIL.\n\nCore Illumina sequencing service and other revenues were $142 million (up 15% year over year). This was driven primarily by higher instrument service contract revenues on a growing installed base, as well as an increase in lab services revenues.\n\nIllumina, Inc. Price, Consensus and EPS Surprise Illumina, Inc. Price, Consensus and EPS Surprise\n\nIllumina, Inc. price-consensus-eps-surprise-chart | Illumina, Inc. Quote\n\nSequencing Instrument revenues for Core Illumina of $179 million grew 10% year over year. The increase was primarily led by strength in NovaSeq X shipments, which more than offset the decline in NovaSeq 6000 shipments.\n\nCore Illumina sequencing service and other revenues were $142 million (up 15% year over year). This was driven primarily by higher instrument service contract revenue on a growing installed base, as well as an increase in lab services revenue.\n\nGRAIL contributed $21 million to revenues during the reported quarter compared with $10 million in the year-ago period.\n\nMargins\n\nThe adjusted gross margin (excluding amortization of acquired intangible assets) was 65.3% in the reported quarter, highlighting a contraction of 310 basis points (bps) year over year. The decline is attributed to product mix and less fixed cost leverage on lower manufacturing volumes, as well as lower instrument margins and higher field service and installation costs due to the NovaSeq X launch.\n\nStory continues\n\nResearch and development expenses decreased 3.1% year over year to $315 million, whereas SG&A expenses came in at $303 million compared with $146 million in the year-ago quarter. Adjusted operating costs increased 31.2% to $618 million. The adjusted operating profit in the quarter was $113 million, down 61.3% year over year.\n\nFinancial Update\n\nIllumina exited the third quarter of 2023 with cash and cash equivalents plus short-term investments of $933 million compared with $1.56 billion at the end of the second quarter of 2023. The company did not repurchase any common stock in the quarter.\n\nCumulative net cash provided by operating activities at the end of the third quarter of 2023 was $254 million compared with $245 million in the last year’s comparable period.\n\n2023 Guidance\n\nIllumina updated its 2023 outlook. The company expects 2023 consolidated revenues to decrease 2-3% (the earlier guidance was nearly 1% growth) compared with the previous year. The Zacks Consensus Estimate for the same is currently pegged at $4.60 billion.\n\nAdjusted EPS for 2023 is expected in the range of 60 cents to 70 cents (the previous guidance was 75 cents to 90 cents). The Zacks Consensus Estimate for the same is currently pegged at 78 cents.\n\nCore Illumina revenues are now expected to decrease 3-4% year over year (earlier projection was flat revenue growth). GRAIL revenues are anticipated to be at the low end of the $90 million to $110 million range (earlier projection, between $90 million-$110 million).\n\nKey Announcements\n\nThroughout the third quarter, Illumina headlined on many occasions. Notably, the company launched TruSight Oncology 500 (TSO 500) ctDNA Version 2, a liquid biopsy assay that enables comprehensive genomic profiling of circulating tumor DNA. Major improvements include a faster turnaround time of less than four days, higher sensitivity with lower input requirements and a more streamlined workflow.\n\nThe company also announced the opening of a new office and state-of-the-art Illumina Solutions Center in Bengaluru, India, to grow the genomics market in the most populous country in the world. The expansion will help unlock opportunities for advancing healthcare and combat the effects of climate change in South Asia.\n\nOur Take\n\nIllumina delivered better-than-expected third-quarter 2023 earnings, while revenues were a miss. Core Illumina’s performance across all regions was affected by tighter funding and budget pressures impacting customers’ purchasing power, as well as the high-throughput customers transitioning to NovaSeq X. Contraction in margins, as well as a reduced full-year outlook, is also discouraging.\n\nOn a positive note, Illumina has been executing well in its plan to reduce the analyzed run rate expenses, having reduced by approximately $175 million, which is ahead of the original projection of more than $100 million. This appears promising.\n\nZacks Rank & Key Picks\n\nIllumina currently carries a Zacks Rank #3 (Hold).\n\nSome better-ranked stocks in the broader medical space that have announced quarterly results are DexCom DXCM, Medpace MEDP and The Ensign Group ENSG.\n\nDexCom, carrying a Zacks Rank of 2 (Buy), reported a third-quarter 2023 adjusted EPS of 50 cents, beating the Zacks Consensus Estimate by 47.1%. Revenues of $975 million outpaced the consensus mark by 4%. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nDexCom has a long-term estimated growth rate of 33.6%. DXCM’s earnings surpassed estimates in all the trailing four quarters, the average surprise being 36.4%.\n\nMedpace reported a third-quarter 2023 adjusted EPS of $2.22, beating the Zacks Consensus Estimate by 8.8%. Revenues of $492.5 million surpassed the Zacks Consensus Estimate by 3.4%. It currently carries a Zacks Rank #2.\n\nMedpace has an estimated earnings growth rate of 16.2% for the next year. MEDP’s earnings surpassed estimates in all the trailing four quarters, the average surprise being 14.6%.\n\nThe Ensign Group reported a third-quarter 2023 adjusted EPS of $1.20, beating the Zacks Consensus Estimate by 1.7%. Revenues of $940.8 million surpassed the Zacks Consensus Estimate by 0.2%. It currently carries a Zacks Rank #2.\n\nThe Ensign Group has a long-term estimated growth rate of 15%. ENSG’s earnings surpassed estimates in all the trailing four quarters, the average surprise being 1.5%.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nIllumina, Inc. (ILMN) : Free Stock Analysis Report\n\nDexCom, Inc. (DXCM) : Free Stock Analysis Report\n\nThe Ensign Group, Inc. (ENSG) : Free Stock Analysis Report\n\nMedpace Holdings, Inc. (MEDP) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/illumina-ilmn-q3-earnings-surpass-125200942.html", "symbols": ["DC4.F", "DXCM.US", "EGB.F", "ENSG.US", "ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.042, "neu": 0.872, "pos": 0.086}}, {"date": "2023-11-10T10:04:59+00:00", "title": "Illumina shares slip after genetic testing group lowers profit guidance", "content": "Investing.com -- Shares in Illumina (NASDAQ:ILMN) shed more than a tenth of their value in early U.S. trading on Friday after the genetic testing company lowered its annual income guidance for a second consecutive quarter.\n\nIn a trading update, the California-based life sciences firm said it now expects to report adjusted earnings per share of $0.60 to $0.70 in its 2023 fiscal year, down from its prior outlook of $0.75 to $0.90.\n\nIllumina also warned of a \"challenging\" operating environment, although Chief Executive Officer Jacob Thaysen said he remained confident that the company will be able to navigate these issues and position itself for long-term success.\n\nThird-quarter sales edged up by 0.4% compared to the same period last year to $1.12 billion, narrowly missing Bloomberg consensus estimates of $1.13 billion.\n\nSales of its core products, which include instruments used in gene sequencing, dropped by 2.3% year-on-year to $941.0 million, below expectations of $953.4M. Illumina had previously flagged that demand would be hit by a sluggish post-pandemic recovery in China and weak consumer spending.\n\nDuring the quarter, the group also logged $712M and $109M in impairments related to its Grail unit.\n\nLast month, New York-listed Illumina was ordered by European antitrust regulators to sell Grail after the company completed its $7.1B purchase of the cancer test maker in 2021 without approval from Brussels. The EU had earlier fined Illumina €432M (€1 = $1.0673) in July for defying its rules.\n\nThe group has also faced blowback from its shareholders over the deal. Activist investor Carl Icahn sued the board of directors at Illumina in October, reportedly accusing them of violating their fiduciary duty.\n\nRelated Articles\n\nIllumina shares slip after genetic testing group lowers profit guidance\n\nGermany stocks lower at close of trade; DAX down 0.77%\n\nFrance stocks mixed at close of trade; CAC 40 down 0.96%", "link": "https://finance.yahoo.com/news/illumina-shares-slip-genetic-testing-100459339.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.72, "neg": 0.085, "neu": 0.857, "pos": 0.058}}, {"date": "2023-11-10T07:38:37+00:00", "title": "Wynn Resorts, Illumina, Plug Power fall premarket; Apple rises", "content": "Investing.com -- U.S. futures traded in a mixed fashion Friday, ending the week amid a degree of uncertainty after a relatively hawkish speech by Fed Chair Jerome Powell.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nApple (NASDAQ:AAPL) stock rose 0.2% after the iPhone maker agreed to pay $25 million to settle claims by the U.S. Department of Justice that the company illegally favored immigrant workers for certain jobs.\n\nWalt Disney  (NYSE:DIS) stock fell 0.2% after the entertainment giant announced the postponement of the launch dates of several movies, including “Deadpool 3”, due to the recently ended Hollywood strike.\n\nWynn Resorts (NASDAQ:WYNN) stock fell 4.8% despite hospitality workers reaching a tentative labor deal with the casino operator, ending the threat of a strike, as investors fretted over the uneven nature of its recovery in the important Macau region.\n\nIllumina (NASDAQ:ILMN) stock slumped over 11% after the gene-testing company cut its annual profit forecast for the second straight quarter, hurt by weakness in demand for its sequencing instruments, consumables and services.\n\nPlug Power  (NASDAQ:PLUG) stock plummeted over 30% after the hydrogen fuel-cell firm's third-quarter revenue missed estimates,causing it to pull its 2023 guidance, citing “unprecedented supply challenges.”\n\nUnity Software (NYSE:U) stock fell over 14% after the video game software developer failed to provide full-year guidance after third-quarter revenue missed expectations following slowing new game launches and weakness in China amid a government crackdown on gaming.\n\nTrade Desk (NASDAQ:TTD) stock slumped over 24% after the advertising software maker disappointed with its revenue guidance for the upcoming quarter, tied to the auto and Hollywood strikes.\n\nDiageo  (LON:DGE) ADRs slumped over 14% after the U.K. drinks giant warned that it expects organic operating profit to drop in the first half of its current financial year, citing anticipated \"material weakness\" in Latin America and the Caribbean.\n\nStory continues\n\nRelated Articles\n\nWynn Resorts, Illumina, Plug Power fall premarket; Apple rises\n\nUAW workers at GM's Flint assembly narrowly vote against new labor deal\n\nGoldman Sachs to transfer GM and Apple credit card portfolios amid strategic shift", "link": "https://finance.yahoo.com/news/wynn-resorts-illumina-plug-power-073837303.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "DEO.US", "DEON.MX", "DGE.LSE", "DGEAF.US", "DGED.LSE", "DIS.MX", "DIS.US", "DISB34.SA", "GUI.F", "GUI.XETRA", "GUIA.F", "ILMN.US"], "tags": [], "sentiment": {"polarity": -0.933, "neg": 0.118, "neu": 0.815, "pos": 0.067}}, {"date": "2023-11-09T23:30:09+00:00", "title": "Illumina (ILMN) Q3 Earnings: How Key Metrics Compare to Wall Street Estimates", "content": "For the quarter ended September 2023, Illumina (ILMN) reported revenue of $1.12 billion, up 0.4% over the same period last year. EPS came in at $0.33, compared to $0.34 in the year-ago quarter.\n\nThe reported revenue represents a surprise of -1.16% over the Zacks Consensus Estimate of $1.13 billion. With the consensus EPS estimate being $0.13, the EPS surprise was +153.85%.\n\nWhile investors scrutinize revenue and earnings changes year-over-year and how they compare with Wall Street expectations to determine their next move, some key metrics always offer a more accurate picture of a company's financial health.\n\nSince these metrics play a crucial role in driving the top- and bottom-line numbers, comparing them with the year-ago numbers and what analysts estimated about them helps investors better project a stock's price performance.\n\nHere is how Illumina performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\n\nGeographic Revenue- Europe, Middle East, and Africa: $260 million compared to the $288.25 million average estimate based on two analysts. Geographic Revenue- Greater China: $98 million compared to the $118.03 million average estimate based on two analysts. The reported number represents a change of -26.3% year over year. Geographic Revenue- Asia: $98 million compared to the $112.35 million average estimate based on two analysts. Geographic Revenue- United States: $650 million versus $616.89 million estimated by two analysts on average. Compared to the year-ago quarter, this number represents a +9.8% change. Revenue- GRAIL: $21 million versus $23.34 million estimated by six analysts on average. Revenue- Core Illumina: $1.11 billion compared to the $1.12 billion average estimate based on five analysts. Revenue- Service and other revenue: $178 million compared to the $175.45 million average estimate based on five analysts. The reported number represents a change of +17.1% year over year. Revenue- Microarrays- Instruments: $3 million versus the five-analyst average estimate of $4.83 million. The reported number represents a year-over-year change of -40%. Revenue- Microarrays- Consumables: $71 million versus the five-analyst average estimate of $76.43 million. The reported number represents a year-over-year change of -6.6%. Revenue- Sequencing- Consumables: $695 million versus the five-analyst average estimate of $690.38 million. The reported number represents a year-over-year change of -4.1%. Revenue- Sequencing- Instruments: $179 million versus $175.78 million estimated by five analysts on average. Compared to the year-ago quarter, this number represents a +10.5% change. Revenue- Product revenue: $941 million versus the four-analyst average estimate of $945.31 million. The reported number represents a year-over-year change of -2.3%.\n\nStory continues\n\nView all Key Company Metrics for Illumina here>>>\r\n\r\nShares of Illumina have returned -19.7% over the past month versus the Zacks S&P 500 composite's +1.8% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nIllumina, Inc. (ILMN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/illumina-ilmn-q3-earnings-key-233009964.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.982, "neg": 0, "neu": 0.926, "pos": 0.074}}, {"date": "2023-11-09T22:49:43+00:00", "title": "Illumina cuts annual profit forecast for second straight quarter", "content": "(Reuters) - U.S. genetic testing Illumina on Thursday trimmed its annual profit forecast for the second straight quarter, hurt by weakness in demand for its sequencing instruments, consumables and services.\n\nShares of the San Diego, California-based company fell about 9% to $97.51 in extended trading, after it also missed Wall Street estimates for third-quarter sales.\n\nThe U.S. life sciences firm in the last quarter had flagged weakness in demand for its genetic testing tools and diagnostics products over protracted recovery in China, cautious consumer spending and lengthened sales cycles.\n\nSales at its core business, which advances sequencing instruments, consumables and services for genetic analysis, were $941 million in the third quarter, compared with LSEG estimates of $963.80 million.\n\nIllumina also disclosed it recognized $712 million in goodwill and $109 million in intangible asset impairment related to the Grail segment, in the quarter.\n\nThe company's deal for cancer test maker Grail is facing pressure from antitrust regulators. Illumina said last month it would divest Grail in 12 months, according to the terms of the European Commission's order, if it does not win its challenge in court.\n\nIllumina sees full-year adjusted profit per share to be between $0.60 and $0.70, versus its prior forecast range of $0.75 to $0.90.\n\nIt makes tools and provides sequencing services to hospitals, biotech and pharmaceutical companies for disease research and drug development process. It also makes and sells molecular diagnostic tests.\n\nIts total revenue was $1.12 billion for the third quarter, compared with analysts' average estimate of $1.13 billion.\n\nIt expects FY23 consolidated revenue to decrease 2% to 3% from FY22.\n\nOn an adjusted basis, the company earned 33 cents per share during the quarter, versus analysts' estimate of 12 cents per share.\n\n(Reporting by Pratik Jain in Bengaluru; Editing by Shilpi Majumdar)", "link": "https://finance.yahoo.com/news/illumina-cuts-annual-profit-forecast-224943464.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.626, "neg": 0.078, "neu": 0.863, "pos": 0.059}}, {"date": "2023-11-09T21:05:00+00:00", "title": "Illumina Reports Financial Results for Third Quarter of Fiscal Year 2023", "content": "Welcomed new CEO Jacob Thaysen, Ph.D., who started with Illumina on September 25, 2023 With respect to GRAIL, continue to proceed quickly: retained advisors and preparing for sale and capital markets transaction options for GRAIL, including filing a Form 10, in accordance with the European Commission's divestiture order; a Board special committee has been established to expedite decisions; in parallel, ongoing appeals preserve flexibility for any divestiture of GRAIL and future transactions  Revenue of $1.12 billion for Q3 2023, flat compared to Q3 2022 (up 1% on a constant currency basis) and down 5% from Q2 2023 Shipped 97 NovaSeq X instruments in Q3 2023; now expect to ship 330 to 340 instruments for fiscal year 2023 GAAP diluted loss per share of $(4.77) for Q3 2023, which included goodwill and intangible impairments of $821 million related to the GRAIL segment, compared to GAAP diluted loss per share of $(24.26) for Q3 2022, which included goodwill impairment of $3.91 billion related to the GRAIL segment Non-GAAP diluted earnings per share of $0.33 for Q3 2023, compared to non-GAAP diluted earnings per share of $0.34 for Q3 2022 Now expect fiscal year 2023 consolidated revenue to decrease 2% to 3% from 2022, including Core Illumina revenue to decrease 3% to 4% from 2022 and GRAIL revenue at the low end of the $90 million to $110 million range Now expect GAAP diluted loss per share of $(6.67) to $(6.57) for fiscal year 2023, which includes goodwill and intangible impairments of $821 million related to the GRAIL segment Now expect non-GAAP diluted earnings per share of $0.60 to $0.70 for fiscal year 2023\n\nSAN DIEGO, Nov. 9, 2023 /PRNewswire/ -- Illumina, Inc. (Nasdaq: ILMN) (\"Illumina\" or the \"company\") today announced its financial results for the third quarter of fiscal year 2023, which include the consolidated financial results for GRAIL.\n\n\"While the environment remains challenging, I am confident in our ability to navigate it and position the company for long-term success,\" said Jacob Thaysen, Chief Executive Officer. \"I came to Illumina for the opportunity presented by our core business. While I evaluate the company's strategy, we will remain focused on driving on further placements of the NovaSeq X, which will boost consumables demand. We will also continue optimizing our operations and drive stronger execution.\"\n\nStory continues\n\nThird quarter consolidated results\n\nGAAP Non-GAAP (a) Dollars in millions, except per share amounts Q3 2023 Q3 2022 Q3 2023 Q3 2022 Revenue $  1,119 $  1,115 $  1,119 $  1,115 Gross margin 61.1 % 64.3 % 65.4 % 68.4 % Research and development (\"R&D\") expense $     315 $     325 $     312 $     324 Selling, general and administrative (\"SG&A\") expense $     303 $     146 $     328 $     336 Goodwill and intangible impairment $     821 $  3,914 $       — $       — Legal contingency and settlement $        (1) $      (11) $       — $       — Operating (loss) profit $    (754) $ (3,657) $       93 $     102 Operating margin (67.3) % (327.9) % 8.3 % 9.2 % Tax (benefit) provision $      (28) $     144 $       35 $       40 Tax rate 3.6 % (4.0) % 39.7 % 43.2 % Net (loss) income $    (754) $ (3,816) $       52 $       54 Diluted (loss) earnings per share $   (4.77) $ (24.26) $    0.33 $    0.34\n\n(a) See the tables included in the \"Results of Operations - Non-GAAP\" section below for reconciliations of these GAAP and non-GAAP financial measures.\n\nDuring the third quarter of 2023, the company recognized $712 million in goodwill and $109 million in intangible asset (IPR&D) impairment related to the GRAIL segment. The goodwill impairment was primarily due to a decrease in the company's consolidated market capitalization and a higher discount rate selected for the fair value calculation of the GRAIL reporting unit. The IPR&D impairment was primarily due to a decrease in projected cash flows and a higher discount rate selected for the fair value calculation of the GRAIL IPR&D asset. During the third quarter of 2022, the company recognized $3.91 billion in goodwill impairment related to the GRAIL segment.\n\nCapital expenditures for free cash flow purposes were $45 million for Q3 2023. Cash flow provided by operations was $139 million, compared to cash flow used in operations of $(52) million in the prior year period, which included a one-time payment related to the litigation settlement with BGI. Free cash flow (cash flow provided by (used in) operations less capital expenditures) was $94 million for the quarter, compared to $(119) million in the prior year period. Depreciation and amortization expenses were $108 million for Q3 2023. At the close of the quarter, the company held $933 million in cash, cash equivalents and short-term investments. During the third quarter of 2023, the company used $750 million in cash to repay the outstanding principal of convertible notes that matured in August 2023.\n\nThird quarter segment results\n\nIllumina has two reportable segments, Core Illumina and GRAIL.\n\nCore Illumina\n\nGAAP Non-GAAP (a) Dollars in millions Q3 2023 Q3 2022 Q3 2023 Q3 2022 Revenue (b) $  1,106 $  1,110 $  1,106 $  1,110 Gross margin (c) 64.7 % 67.9 % 66.0 % 68.9 % R&D expense $     238 $     253 $     235 $     252 SG&A expense $     216 $       66 $     246 $     262 Legal contingency and settlement $        (1) $      (11) $       — $       — Operating profit $     262 $     445 $     249 $     251 Operating margin 23.7 % 40.1 % 22.5 % 22.6 %\n\n(a) See Table 3 included in the \"Results of Operations - Non-GAAP\" section below for reconciliations of these GAAP and non-GAAP financial measures. (b) Core Illumina revenue for Q3 2023 was flat as compared to Q3 2022, and flat on a constant currency basis. Amounts for Q3 2023 and Q3 2022 included intercompany revenue of $8 million and $5 million, respectively, which is eliminated in consolidation. (c) The year-over-year decrease in gross margin was primarily driven by less fixed cost leverage on lower manufacturing volumes, product mix, as well as lower instrument margins and higher field service and installation costs due to the NovaSeq X launch, which is typical in a launch year.\n\nGRAIL\n\nGAAP Non-GAAP (a) In millions Q3 2023 Q3 2022 Q3 2023 Q3 2022 Revenue $       21 $          10 $       21 $          10 Gross (loss) profit $     (27) $        (32) $         6 $            1 R&D expense $       79 $          74 $       79 $          74 SG&A expense $       87 $          81 $       82 $          75 Goodwill and intangible impairment $     821 $     3,914 $       — $          — Operating loss $ (1,015) $    (4,101) $   (155) $      (148)\n\n(a) See Table 3 included in the \"Results of Operations - Non-GAAP\" section below for reconciliations of these GAAP and non-GAAP financial measures.\n\nAs previously stated, Illumina is committed to moving as quickly as possible through the legal and regulatory processes associated with its acquisition of GRAIL. At this point, Illumina expects decisions on its appeals from the US Court of Appeals for the Fifth Circuit by the end of 2023 and from the European Court of Justice (ECJ) in mid-2024.\n\nKey announcements by Illumina since Illumina's last earnings release\n\nReceived order from the European Commission to divest GRAIL; Illumina is committed to resolving all issues in a timely manner, with the objective of achieving the maximum value for shareholders and the best outcome for GRAIL Launched TruSight Oncology 500 (TSO 500) ctDNA Version 2, a liquid biopsy assay that enables comprehensive genomic profiling of circulating tumor DNA; key improvements include a faster turnaround time of less than four days, higher sensitivity with lower input requirements, and a more streamlined workflow Opened new office and state-of-the-art Illumina Solutions Center in Bengaluru, India to grow the genomics market in the most populous country in the world, unlocking opportunities for advancing health care and combating the effects of climate change in South Asia Appointed Jacob Thaysen, Ph.D. as Chief Executive Officer and Dr. Steve Barnard as Chief Technology Officer Launched the 25B flow cell (300-cycle kit) for the NovaSeq X, enabling customers to generate tens of thousands of whole genomes per year at the lowest cost per sample of any Illumina platform\n\nA full list of recent Illumina announcements can be found in the company's News Center.\n\nKey announcements by GRAIL since Illumina's last earnings release\n\nCollaboration with HCA Healthcare, Inc. to make GRAIL's Galleri® multi-cancer early detection (MCED) available to patients who meet screening criteria at select HCA Healthcare physician practices Published final results from PATHFINDER Study, which demonstrated that an earlier version of Galleri identified many cancer types that do not currently have recommended screening tests, enabled targeted cancer diagnostic evaluations, and supported diagnostic resolution for the majority of participants in less than three months Expanded pilot with Point32Health to offer Galleri to members meeting eligibility requirements, making Point32Health the first commercial health plan in the U.S. to offer Galleri in addition to recommended cancer screenings\n\nA full list of recent GRAIL announcements can be found in GRAIL's Newsroom.\n\nFinancial outlook and guidance\n\nThe non-GAAP financial guidance discussed below reflects certain pro forma adjustments to assist in analyzing and assessing our core operational performance, including the company's Core Illumina and GRAIL segments. Please see our Reconciliation of Consolidated Non-GAAP Financial Guidance included in this release for a reconciliation of these GAAP and non-GAAP financial measures.\n\nFor fiscal year 2023, the company now expects consolidated revenue to decrease 2% to 3% compared to fiscal year 2022. The company now expects Core Illumina revenue to decrease 3% to 4% compared to fiscal year 2022. GRAIL revenue is now expected to be at the low end of the $90 million to $110 million range.\n\nThe company now expects GAAP diluted loss per share of $(6.67) to $(6.57) and non-GAAP diluted earnings per share of $0.60 to $0.70.\n\nConference call information\n\nThe conference call will begin at 2 p.m. Pacific Time (5 p.m. Eastern Time) on Thursday, November 9, 2023. Interested parties may access the live teleconference through the Investor Info section of Illumina's website at investor.illumina.com. Alternatively, individuals can access the call by dialing 866.400.0049 or +1.323.794.2149 outside North America, both using conference ID 1991305. To ensure timely connection, please dial in at least ten minutes before the scheduled start of the call.\n\nA replay of the conference call will be posted on Illumina's website after the event and will be available for at least 30 days following.\n\nStatement regarding use of non-GAAP financial measures\n\nThe company reports non-GAAP results for diluted earnings per share, net income, gross margin, operating expenses, including research and development expense, selling general and administrative expense, and from time to time, as applicable, legal contingencies and settlement, and goodwill and intangible impairment, operating income (loss), operating margin, gross profit (loss), other income (expense), tax provision, constant currency revenue growth, and free cash flow (on a consolidated and, as applicable, segment basis for our Core Illumina and GRAIL segments) in addition to, and not as a substitute for, or superior to, financial measures calculated in accordance with GAAP. The company's financial measures under GAAP include substantial charges such as amortization of acquired intangible assets among others that are listed in the itemized reconciliations between GAAP and non-GAAP financial measures included in this press release, as well as the effects of currency translation. Management has excluded the effects of these items in non-GAAP measures to assist investors in analyzing and assessing past and future operating performance, including in the non-GAAP measures related to our Core Illumina and GRAIL segments. Additionally, non-GAAP net income and diluted earnings per share are key components of the financial metrics utilized by the company's board of directors to measure, in part, management's performance and determine significant elements of management's compensation.\n\nThe company encourages investors to carefully consider its results under GAAP, as well as its supplemental non-GAAP information and the reconciliation between these presentations, to more fully understand its business. Reconciliations between GAAP and non-GAAP results are presented in the tables of this release.\n\nUse of forward-looking statements\n\nThis release may contain forward-looking statements that involve risks and uncertainties. Among the important factors to which our business is subject that could cause actual results to differ materially from those in any forward-looking statements are: (i) changes in the rate of growth in the markets we serve; (ii) the volume, timing and mix of customer orders among our products and services; (iii) our ability to adjust our operating expenses to align with our revenue expectations; (iv) our ability to manufacture robust instrumentation and consumables; (v) the success of products and services competitive with our own; (vi) challenges inherent in developing, manufacturing, and launching new products and services, including expanding or modifying manufacturing operations and reliance on third-party suppliers for critical components; (vii) the impact of recently launched or pre-announced products and services on existing products and services; (viii) our ability to modify our business strategies to accomplish our desired operational goals; (ix) our ability to realize the anticipated benefits from prior or future actions to streamline and improve our R&D processes, reduce our operating expenses and maximize our revenue growth; (x) our ability to further develop and commercialize our instruments, consumables, and products, including Galleri, the cancer screening test developed by GRAIL, to deploy new products, services, and applications, and to expand the markets for our technology platforms; (xi) the risks and costs associated with our ongoing inability to integrate GRAIL due to the transitional measures imposed on us by the European Commission as a result of their prohibition of our acquisition of GRAIL and orders issued by the European Commission and the Federal Trade Commission requiring that we divest GRAIL; (xii) the risks and costs associated with the integration of GRAIL's business if we are ultimately able to integrate GRAIL; (xiii) the risk that disruptions from the consummation of our acquisition of GRAIL and associated legal or regulatory proceedings, including appeals, or obligations will harm our business, including current plans and operations; (xiv) the risk of incurring additional fines associated with the consummation of our acquisition of GRAIL and the possibility that we may be required to divest all or a portion of the assets or equity interests of GRAIL on terms that could be materially worse than the terms on which we acquired GRAIL; (xv) our ability to obtain approval by third-party payors to reimburse patients for our products; (xvi) our ability to obtain regulatory clearance for our products from government agencies; (xvii) our ability to successfully partner with other companies and organizations to develop new products, expand markets, and grow our business; (xviii) uncertainty, or adverse economic and business conditions, including as a result of slowing or uncertain economic growth, COVID-19 pandemic mitigation measures, or armed conflict; (xix) the application of generally accepted accounting principles, which are highly complex and involve many subjective assumptions, estimates, and judgments and (xx) legislative, regulatory and economic developments, together with other factors detailed in our filings with the Securities and Exchange Commission, including our most recent filings on Forms 10-K and 10-Q, or in information disclosed in public conference calls, the date and time of which are released beforehand. We undertake no obligation, and do not intend, to update these forward-looking statements, to review or confirm analysts' expectations, or to provide interim reports or updates on the progress of the current quarter.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. In 2023 we celebrate 25 years of innovation, which has established us as a global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical, and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture, and other emerging segments. To learn more, visit www.illumina.com and connect with us on X (Twitter), Facebook, LinkedIn, Instagram, TikTok, and YouTube.\n\nAbout GRAIL\n\nGRAIL is a healthcare company whose mission is to detect cancer early, when it can be cured. GRAIL is focused on alleviating the global burden of cancer by developing pioneering technology to detect and identify multiple deadly cancer types early. The company is using the power of next-generation sequencing, population-scale clinical studies, and state-of-the-art computer science and data science to enhance the scientific understanding of cancer biology, and to develop its multi-cancer early detection blood test. GRAIL is headquartered in Menlo Park, CA with locations in Washington, D.C., North Carolina, and the United Kingdom. GRAIL, LLC, is a wholly-owned subsidiary of Illumina, which currently must be held and operated separately and independently from Illumina pursuant to transitional measures ordered by the European Commission, which prohibited our acquisition of GRAIL on September 6, 2022. For more information, please visit www.grail.com.\n\nIllumina, Inc.\n\nCondensed Consolidated Balance Sheets\n\n(In millions) October 1,\r\n2023 January 1,\r\n2023 ASSETS (unaudited) Current assets: Cash and cash equivalents $            927 $         2,011 Short-term investments 6 26 Accounts receivable, net 690 671 Inventory, net 615 568 Prepaid expenses and other current assets 268 285 Total current assets 2,506 3,561 Property and equipment, net 1,040 1,091 Operating lease right-of-use assets 581 653 Goodwill 2,527 3,239 Intangible assets, net 3,029 3,285 Other assets 439 423 Total assets $       10,122 $       12,252 LIABILITIES AND STOCKHOLDERS' EQUITY Current liabilities: Accounts payable $            240 $            293 Accrued liabilities 1,242 1,232 Term notes, current portion — 500 Convertible senior notes, current portion — 748 Total current liabilities 1,482 2,773 Operating lease liabilities 698 744 Term notes 1,489 1,487 Other long-term liabilities 555 649 Stockholders' equity 5,898 6,599 Total liabilities and stockholders' equity $       10,122 $       12,252\n\nIllumina, Inc.\n\nCondensed Consolidated Statements of Operations\n\n(In millions, except per share amounts)\n\n(unaudited) Three Months Ended Nine Months Ended October 1,\r\n2023 October 2,\r\n2022 October 1,\r\n2023 October 2,\r\n2022 Revenue: Product revenue $            941 $            963 $        2,864 $        3,039 Service and other revenue 178 152 518 462 Total revenue 1,119 1,115 3,382 3,501 Cost of revenue: Cost of product revenue (a) 293 280 884 866 Cost of service and other revenue (a) 95 72 285 210 Amortization of acquired intangible assets 47 46 143 125 Total cost of revenue 435 398 1,312 1,201 Gross profit 684 717 2,070 2,300 Operating expense: Research and development (a) 315 325 1,013 975 Selling, general and administrative (a) 303 146 1,127 865 Goodwill and intangible impairment 821 3,914 821 3,914 Legal contingency and settlement (1) (11) 14 598 Total operating expense 1,438 4,374 2,975 6,352 Loss from operations (754) (3,657) (905) (4,052) Other expense, net (28) (15) (45) (116) Loss before income taxes (782) (3,672) (950) (4,168) (Benefit) provision for income taxes (28) 144 36 97 Net loss $          (754) $        (3,816) $         (986) $      (4,265) Loss per share: Basic $         (4.77) $        (24.26) $        (6.23) $      (27.13) Diluted $         (4.77) $        (24.26) $        (6.23) $      (27.13) Shares used in computing loss per share: Basic 158 157 158 157 Diluted 158 157 158 157\n\n(a) Includes stock-based compensation expense for stock-based awards:\n\nThree Months Ended Nine Months Ended October 1,\r\n2023 October 2,\r\n2022 October 1,\r\n2023 October 2,\r\n2022 Cost of product revenue $                7 $                7 $            22 $            20 Cost of service and other revenue 2 2 5 4 Research and development 36 37 117 112 Selling, general and administrative 41 37 142 130 Stock-based compensation expense before taxes $              86 $              83 $           286 $           266\n\nIllumina, Inc.\n\nCondensed Consolidated Statements of Cash Flows\n\n(In millions)\n\n(unaudited) Three Months Ended Nine Months Ended October 1,\r\n2023 October 2,\r\n2022 October 1,\r\n2023 October 2,\r\n2022 Net cash provided by (used in) operating activities ...\n\n$            139 $            (52) $           254 $           245 Net cash used in investing activities (54) (250) (146) (489) Net cash (used in) provided by financing activities (707) 28 (1,183) 44 Effect of exchange rate changes on cash and cash equivalents (4) (15) (9) (32) Net decrease in cash and cash equivalents (626) (289) (1,084) (232) Cash and cash equivalents, beginning of period 1,553 1,289 2,011 1,232 Cash and cash equivalents, end of period $            927 $         1,000 $           927 $        1,000 Calculation of free cash flow: Net cash provided by (used in) operating activities $            139 $            (52) $           254 $           245 Purchases of property and equipment (45) (67) (144) (198) Free cash flow (a) $              94 $          (119) $           110 $            47\n\n(a) Free cash flow, which is a non-GAAP financial measure, is calculated as net cash provided by (used in) operating activities reduced by purchases of property and equipment. Free cash flow is useful to management as it is one of the metrics used to evaluate our performance and to compare us with other companies in our industry. However, our calculation of free cash flow may not be comparable to similar measures used by other companies.\n\nIllumina, Inc.\n\nResults of Operations - Revenue by Segment\n\n(Dollars in millions)\n\n(unaudited) Three Months Ended Nine Months Ended October 1,\r\n2023 October 2,\r\n2022 % Change October 1,\r\n2023 October 2,\r\n2022 % Change Consolidated revenue $         1,119 $         1,115 — $         3,382 $       3,501 (3) % Less: Hedge gains 5 16 9 32 Consolidated revenue, excluding hedge effect 1,114 1,099 3,373 3,469 Less: Exchange rate effect 4 — (35) — Consolidated constant currency revenue (a) $         1,110 $         1,099 1 % $         3,408 $       3,469 (2) % Core Illumina revenue $         1,106 $         1,110 — $         3,341 $       3,487 (4) % Less: Hedge gains 5 16 9 32 Core Illumina revenue, excluding hedge effect 1,101 1,094 3,332 3,455 Less: Exchange rate effect 4 — (35) — Core Illumina constant currency revenue (a) $         1,097 $         1,094 — $         3,367 $       3,455 (3) %\n\n(a) Constant currency revenue growth, which is a non-GAAP financial measure, is calculated using comparative prior period foreign exchange rates to translate current period revenue, net of the effects of hedges.\n\nIllumina, Inc.\n\nResults of Operations - Non-GAAP\n\n(In millions, except per share amounts)\n\n(unaudited) TABLE 1: CONSOLIDATED RECONCILIATION BETWEEN GAAP AND NON-GAAP DILUTED (LOSS) EARNINGS PER \r\nSHARE: Three Months Ended Nine Months Ended October 1,\r\n2023 October 2,\r\n2022 October 1,\r\n2023 October 2,\r\n2022 GAAP loss per share - diluted $         (4.77) $        (24.26) $        (6.23) $       (27.13) Cost of revenue (b) 0.30 0.29 0.93 0.79 R&D expense (b) 0.02 0.01 0.11 0.01 SG&A expense (b) (0.15) (1.22) 0.64 (0.82) Goodwill and intangible impairment (b) 5.20 24.89 5.19 24.89 Legal contingency and settlement (b) (0.01) (0.07) 0.09 3.81 Other expense, net (b) 0.14 0.04 0.23 0.53 GILTI and U.S. foreign tax credits (c) 0.24 0.19 0.40 0.38 Incremental non-GAAP tax expense (d) (0.65) 0.48 (0.68) (0.48) Income tax provision (e) 0.01 — 0.05 0.03 Effect of dilutive shares (f) — (0.01) — (0.03) Non-GAAP earnings per share - diluted (a) $           0.33 $           0.34 $          0.73 $          1.98 GAAP diluted shares 158 157 158 157 Non-GAAP dilutive shares (f) — 2 — 2 Non-GAAP diluted shares 158 159 158 159\n\nTABLE 2: CONSOLIDATED RECONCILIATION BETWEEN GAAP AND NON-GAAP NET (LOSS) INCOME: Three Months Ended Nine Months Ended October 1,\r\n2023 October 2,\r\n2022 October 1,\r\n2023 October 2,\r\n2022 GAAP net loss $          (754) $        (3,816) $         (986) $       (4,265) Cost of revenue (b) 48 46 147 124 R&D expense (b) 3 1 17 1 SG&A expense (b) (24) (191) 102 (129) Goodwill and intangible impairment (b) 821 3,914 821 3,914 Legal contingency and settlement (b) (1) (11) 14 598 Other expense, net (b) 22 7 36 83 GILTI and U.S. foreign tax credits (c) 38 30 63 60 Incremental non-GAAP tax expense (d) (102) 74 (108) (77) Income tax provision (e) 1 — 9 5 Non-GAAP net income (a) 52 54 115 314 Add: interest expense on convertible notes, net of tax (g) — 1 — 1 Non-GAAP net income for diluted earnings per share $             52 $              55 $           115 $           315\n\nAll amounts in tables are rounded to the nearest millions, except as otherwise noted. As a result, certain amounts may not recalculate using the rounded amounts provided. (a) Non-GAAP net income and diluted earnings per share exclude the effects of the pro forma adjustments as detailed above. Non-GAAP net income and diluted earnings per share are key components of the financial metrics utilized by the company's board of directors to measure, in part, management's performance and determine significant elements of management's compensation. Management has excluded the effects of these items in these measures to assist investors in analyzing and assessing our past and future operating performance. (b) Refer to the Itemized Reconciliations between GAAP and Non-GAAP Results of Operations for the components of these amounts. (c) Amounts represent the impact of GRAIL pre-acquisition net operating losses on GILTI and the utilization of U.S. foreign tax credits. (d) Incremental non-GAAP tax expense reflects the tax impact of the non-GAAP adjustments listed. (e) Amounts represent the difference between book and tax accounting related to stock-based compensation cost. (f) In loss periods, GAAP basic loss per share and diluted loss per share are identical since the effect of potentially dilutive shares is anti-dilutive and therefore excluded. For non-GAAP diluted earnings per share, the impact of potentially dilutive shares from our convertible senior notes and equity awards is included and is calculated based on the sum of weighted-average common shares and potentially dilutive shares outstanding during Q3 2022 and YTD 2022. (g) Amount represents interest expense on the 2023 Convertible Senior Notes, net of any income tax effects, which is added back to the numerator used to calculate non-GAAP diluted earnings per share, for purposes of the if-converted method, as it would have a dilutive effect on the calculation of non-GAAP diluted earnings per share.\n\nIllumina, Inc.\n\nResults of Operations - Non-GAAP (continued)\n\n(Dollars in millions)\n\n(unaudited) TABLE 3: ITEMIZED RECONCILIATION BETWEEN GAAP AND NON-GAAP RESULTS OF OPERATIONS AS A PERCENT \r\nOF REVENUE: Three Months Ended October 1, 2023 Core Illumina GRAIL Eliminations Consolidated GAAP gross profit (loss) (b) $   715 64.7 % $           (27) $              (4) $    684 61.1 % Amortization of acquired intangible assets 14 1.2 % 33 — 47 4.2 % Restructuring (g) 1 0.1 % — — 1 0.1 % Non-GAAP gross profit (a) $   730 66.0 % $               6 $              (4) $    732 65.4 % GAAP R&D expense $   238 21.5 % $             79 $              (2) $    315 28.1 % Restructuring (g) (3) (0.3) % — — (3) (0.3) % Non-GAAP R&D expense $   235 21.2 % $             79 $              (2) $    312 27.8 % GAAP SG&A expense $   216 19.5 % $             87 $              — $    303 27.0 % Amortization of acquired intangible assets — — (1) — (1) (0.1) % Contingent consideration liabilities (c) 110 9.9 % — — 110 9.8 % Acquisition-related expenses (d) (27) (2.3) % (3) — (30) (2.6) % Restructuring (g) (54) (4.9) % (1) — (55) (4.9) % Proxy contest 1 0.1 % — — 1 0.1 % Non-GAAP SG&A expense $   246 22.3 % $             82 $              — $    328 29.3 % GAAP goodwill and intangible impairment $      — — $           821 $              — $    821 73.4 % Goodwill impairment (i) — — (712) — (712) (63.6) % Intangible (IPR&D) impairment (i) — — (109) — (109) (9.8) % Non-GAAP goodwill and intangible impairment $      — — $             — $              — $       — — GAAP legal contingency and settlement $      (1) (0.2) % $             — $              — $       (1) (0.1) % Legal contingency and settlement (h) 1 0.2 % — — 1 0.1 % Non-GAAP legal contingency and settlement $      — — $             — $              — $       — — GAAP operating profit (loss) $   262 23.7 % $       (1,015) $              (1) $   (754) (67.3) % Cost of revenue 15 1.3 % 33 — 48 4.3 % R&D costs 3 0.4 % — — 3 0.3 % SG&A costs (30) (2.7) % 6 — (24) (2.3) % Goodwill and intangible impairment — — 821 — 821 73.4 % Legal contingency and settlement (1) (0.2) % — — (1) (0.1) % Non-GAAP operating profit (loss) (a) $   249 22.5 % $         (155) $              (1) $      93 8.3 % GAAP other (expense) income, net $    (33) (3.0) % $               5 $              — $     (28) (2.6) % Strategic investment related loss, net (e) 19 1.8 % — — 19 1.8 % Gain on Helix contingent value right (f) (5) (0.5) % — — (5) (0.4) % Unrealized foreign currency loss on EC fine (j) 8 0.7 % — — 8 0.7 % Non-GAAP other (expense) income, net (a) $    (11) (1.0) % $               5 $              — $       (6) (0.5) %\n\nIllumina, Inc.\n\nResults of Operations - Non-GAAP (continued)\n\n(Dollars in millions)\n\n(unaudited) TABLE 3 (CONTINUED): ITEMIZED RECONCILIATION BETWEEN GAAP AND NON-GAAP RESULTS OF OPERATIONS \r\nAS A PERCENT OF REVENUE: Three Months Ended October 2, 2022 Core Illumina GRAIL Eliminations Consolidated GAAP gross profit (loss) (b) $   753 67.9 % $       (32) $              (4) $    717 64.3 % Amortization of acquired intangible assets 12 1.0 % 33 — 46 4.1 % Non-GAAP gross profit (a) $   765 68.9 % $          1 $              (4) $    763 68.4 % GAAP R&D expense $   253 22.8 % $        74 $              (2) $    325 29.1 % Acquisition-related expenses (d) (1) (0.1) — — (1) — Non-GAAP R&D expense $   252 22.7 % $        74 $              (2) $    324 29.1 % GAAP SG&A expense $     66 5.9 % $        81 $              (1) $    146 13.1 % Amortization of acquired intangible assets — — (1) — (1) (0.1) % Contingent consideration liabilities (c) 219 19.7 % — — 219 19.6 % Acquisition-related expenses (d) (23) (2.1) % (5) — (28) (2.5) % Non-GAAP SG&A expense $   262 23.6 % $        75 $              (1) $    336 30.1 % GAAP legal contingency and settlement $    (11) (1.0) % $         — $              — $     (11) (1.0) % Legal contingency and settlement (h) 11 1.0 % — — 11 1.0 % Non-GAAP legal contingency and settlement $      — — $         — $              — $       — — GAAP goodwill and intangible impairment $      — — $    3,914 $              — $  3,914 351.0 % Goodwill impairment (i) — — (3,914) — (3,914) (351.0) % Non-GAAP goodwill and intangible impairment $      — — $         — $              — $       — — GAAP operating profit (loss) $   445 40.1 % $  (4,101) $              (1) $  (3,657) (327.9) % Cost of revenue 12 1.0 % 33 — 46 4.1 % R&D costs 1 0.1 % — — 1 — SG&A costs (196) (17.5) % 6 — (191) (17.0) % Legal contingency and settlement (11) (1.0) % — — (11) (1.0) % Goodwill impairment — — 3,914 — 3,914 351.0 % Non-GAAP operating profit (loss) (a) $   251 22.6 % $     (148) $              (1) $    102 9.2 % GAAP other (expense) income, net $    (15) (1.4) % $          1 $              — $     (15) (1.3) % Strategic investment related loss, net (e) 2 0.2 % — — 2 0.2 % Loss on Helix contingent value right (f) 5 0.5 % — — 5 0.4 % Non-GAAP other (expense) income, net (a) $      (8) (0.7) % $          1 $              — $       (8) (0.7) %\n\nIllumina, Inc.\n\nResults of Operations - Non-GAAP (continued)\n\n(Dollars in millions)\n\n(unaudited) TABLE 3 (CONTINUED): ITEMIZED RECONCILIATION BETWEEN GAAP AND NON-GAAP RESULTS OF OPERATIONS \r\nAS A PERCENT OF REVENUE: Nine Months Ended October 1, 2023 Core Illumina GRAIL Eliminations Consolidated GAAP gross profit (loss) (b) $ 2,161 64.7 % $      (77) $            (14) $  2,070 61.2 % Amortization of acquired intangible assets 43 1.3 % 100 — 143 4.3 % Restructuring (g) 4 0.1 % — — 4 0.1 % Non-GAAP gross profit (a) $ 2,208 66.1 % $       23 $            (14) $  2,217 65.6 % GAAP R&D expense $   771 23.1 % $     254 $            (12) $  1,013 30.0 % Acquisition-related expenses (d) (1) — — — (1) — Restructuring (g) (16) (0.6) % — — (16) (0.5) % Non-GAAP R&D expense $   754 22.5 % $     254 $            (12) $     996 29.5 % GAAP SG&A expense $   857 25.7 % $     271 $              (1) $  1,127 33.3 % Amortization of acquired intangible assets (1) — (3) — (4) (0.1) % Contingent consideration liabilities (c) 82 2.5 % — — 82 2.3 % Acquisition-related expenses (d) (64) (1.9) % (11) — (75) (2.1) % Restructuring (g) (72) (2.3) % (3) — (75) (2.2) % Proxy contest (29) (0.9) % — — (29) (0.9) % Non-GAAP SG&A expense $   773 23.1 % $     254 $              (1) $  1,026 30.3 % GAAP goodwill and intangible impairment $      — — $     821 $              — $     821 24.3 % Goodwill impairment (i) — — (712) — (712) (21.1) % Intangible (IPR&D) impairment (i) — — (109) — (109) (3.2) % Non-GAAP goodwill and intangible impairment $      — — $        — $              — $       — — GAAP legal contingency and settlement $     14 0.4 % $        — $              — $      14 0.4 % Legal contingency and settlement (h) (14) (0.4) % — — (14) (0.4) % Non-GAAP legal contingency and settlement $      — — $        — $              — $       — — GAAP operating profit (loss) $   519 15.5 % $ (1,424) $              — $   (905) (26.8) % Cost of revenue 47 1.4 % 100 — 147 4.4 % R&D costs 17 0.5 % — — 17 0.5 % SG&A costs 84 2.6 % 18 — 102 3.0 % Goodwill and intangible impairment — — 821 — 821 24.3 % Legal contingency and settlement 14 0.4 % — — 14 0.4 % Non-GAAP operating profit (loss) (a) $   681 20.4 % $    (485) $              — $     196 5.8 % GAAP other (expense) income, net $    (53) (1.6) % $         8 $              — $     (45) (1.3) % Strategic investment related loss, net (e) 36 1.1 % — — 36 1.0 % Gain on Helix contingent value right (f) (8) (0.2) % — — (8) (0.2) % Unrealized foreign currency loss on EC fine (j) 8 0.2 % — — 8 0.2 % Non-GAAP other (expense) income, net (a) $    (17) (0.5) % $         8 $              — $       (9) (0.3) %\n\nIllumina, Inc.\n\nResults of Operations - Non-GAAP (continued)\n\n(Dollars in millions)\n\n(unaudited) TABLE 3 (CONTINUED): ITEMIZED RECONCILIATION BETWEEN GAAP AND NON-GAAP RESULTS OF OPERATIONS \r\nAS A PERCENT OF REVENUE: Nine Months Ended October 2, 2022 Core Illumina GRAIL Eliminations Consolidated GAAP gross profit (loss) (b) $ 2,405 69.0 % $      (91) $            (14) $  2,300 65.7 % Amortization of acquired intangible assets 24 0.7 % 101 — 124 3.5 % Non-GAAP gross profit (a) $ 2,429 69.7 % $       10 $            (14) $  2,424 69.2 % GAAP R&D expense $   740 21.2 % $     245 $            (10) $     975 27.8 % Acquisition-related expenses (d) (1) — — — (1) — Non-GAAP R&D expense $   739 21.2 % $     245 $            (10) $     974 27.8 % GAAP SG&A expense $   656 18.8 % $     210 $              (1) $     865 24.7 % Amortization of acquired intangible assets (1) — (3) — (4) (0.1) % Contingent consideration liabilities (c) 230 6.6 % — — 230 6.6 % Acquisition-related expenses (d) (86) (2.5) % (9) — (96) (2.8) % Non-GAAP SG&A expense $   799 22.9 % $     198 $              (1) $     995 28.4 % GAAP legal contingency and settlement $   598 17.1 % $        — $              — $     598 17.1 % Legal contingency and settlement (h) (598) (17.1) % — — (598) (17.1) % Non-GAAP legal contingency and settlement $      — — $        — $              — $       — — GAAP goodwill and intangible impairment $      — — $   3,914 $              — $  3,914 111.8 % Goodwill impairment (i) — — (3,914) — (3,914) (111.8) % Non-GAAP goodwill and intangible impairment $      — — $        — $              — $       — — GAAP operating profit (loss) $   411 11.8 % $ (4,460) $              (3) $ (4,052) (115.7) % Cost of revenue 24 0.7 % 101 — 124 3.5 % R&D costs 1 — — — 1 — % SG&A costs (143) (4.0) % 12 — (129) (3.7) % Legal contingency and settlement 598 17.1 % — — 598 17.1 % Goodwill impairment — — 3,914 — 3,914 111.8 % Non-GAAP operating profit (loss) (a) $   891 25.6 % $    (433) $              (3) $     456 13.0 % GAAP other (expense) income, net $  (117) (3.4) % $         1 $              — $   (116) (3.3) % Strategic investment related loss, net (e) 75 2.2 % — — 75 2.2 % Loss on Helix contingent value right (f) 8 0.2 % — — 8 0.2 % Non-GAAP other (expense) income, net (a) $    (34) (1.0) % $         1 $              — $     (33) (0.9) %\n\nAll amounts in tables are rounded to the nearest millions, except as otherwise noted. As a result, certain amounts may not recalculate using the rounded amounts provided. Percentages of revenue are calculated based on the revenue of the respective segment. (a) Non-GAAP gross profit, included within non-GAAP operating profit (loss), is a key measure of the effectiveness and efficiency of manufacturing processes, product mix and the average selling prices of our products and services. Non-GAAP operating profit (loss) and non-GAAP other (expense) income, net exclude the effects of the pro forma adjustments as detailed above. Management has excluded the effects of these items in these measures to assist investors in analyzing and assessing past and future operating performance, including in the non-GAAP measures related to our Core Illumina and GRAIL segments. (b) Reconciling amounts are recorded in cost of revenue. (c) Amounts consist primarily of fair value adjustments for our contingent consideration liability related to GRAIL. (d) Amounts consist primarily of legal expenses related to the acquisition of GRAIL. (e) Amounts consist primarily of mark-to-market adjustments and impairments from our strategic investments. (f) Amounts consist of fair value adjustments related to our Helix contingent value right. (g) Amounts for Q3 2023 consist primarily of lease and other asset impairments and amounts for YTD 2023 consist primarily of employee severance costs and lease and other asset impairments related to restructuring activities. (h) Amount for Q3 2023 consists of a gain related to a patent litigation settlement. The amount for YTD 2023 also consists of a loss related to a patent litigation settlement in Q1 2023 and an adjustment recorded in Q2 2023 to our accrual for the fine imposed by the European Commission in July 2023. Amounts in YTD 2022 consist of an expense of $145 million related to the settlement of our litigation with BGI, which includes a gain of $11 million recorded in Q3 2022 as a result of releasing $6 million of previously recorded litigation accrual and $5 million of a gain contingency recognized in Q3 2022. In addition, the amount in YTD 2022 consists of an accrual of $453 million, recorded in Q2 2022, for the fine imposed by the European Commission. (i) Amounts for Q3 2023 and YTD 2023 consist of goodwill and IPR&D intangible asset impairments related to our GRAIL segment. Amounts for Q3 2022 and YTD 2022 consist of goodwill impairment related to our GRAIL segment. (j) Amounts consist of an unrealized mark-to-market loss on hedge entered into in Q3 2023 associated with the EC fine, partially offset by an unrealized gain related to foreign currency balance sheet remeasurement of the EC fine liability.\n\nIllumina, Inc.\n\nResults of Operations - Non-GAAP (continued)\n\n(Dollars in millions)\n\n(unaudited) TABLE 4: CONSOLIDATED ITEMIZED RECONCILIATION BETWEEN GAAP AND NON-GAAP TAX PROVISION \r\n(BENEFIT): Three Months Ended Nine Months Ended October 1,\r\n2023 October 1,\r\n2023 GAAP tax (benefit) provision $       (28) 3.6 % $         36 (3.8) % Incremental non-GAAP tax expense (b) 102 108 Income tax provision (c) (1) (9) GILTI and U.S. foreign tax credits (d) (38) (63) Non-GAAP tax provision (a) $         35 39.7 % $         72 38.3 % Three Months Ended Nine Months Ended October 2,\r\n2022 October 2,\r\n2022 GAAP tax provision $       144 (4.0) % $         97 (2.3) % Incremental non-GAAP tax expense (b)  (74) 77 Income tax provision (c) — (5) GILTI and U.S. foreign tax credits (d) (30) (60) Non-GAAP tax provision (a)  $         40 43.2 % $       109 25.8 %\n\n(a) Non-GAAP tax provision excludes the effects of the pro forma adjustments as detailed above. Management has excluded the effects of these items in this measure to assist investors in analyzing and assessing past and future operating performance. (b) Incremental non-GAAP tax expense reflects the tax impact of the non-GAAP adjustments listed in Table 2. (c) Amounts represent the difference between book and tax accounting related to stock-based compensation cost. (d) Amounts represent the impact of GRAIL pre-acquisition net operating losses on GILTI and the utilization of U.S. foreign tax credits.\n\nIllumina, Inc. Reconciliation of Consolidated Non-GAAP Financial Guidance (unaudited)\n\nOur future performance and financial results are subject to risks and uncertainties, and actual results could differ materially from the guidance set forth below. Some of the factors that could affect our financial results are stated above in this press release. More information on potential factors that could affect our financial results is included from time to time in the public reports filed with the Securities and Exchange Commission, including Form 10-K for the fiscal year ended January 1, 2023 filed with the SEC on February 17, 2023, Form 10-Q for the fiscal quarter ended April 2, 2023, and Form 10-Q for the fiscal quarter ended July 2, 2023. We assume no obligation to update any forward-looking statements or information.\n\nTABLE 5: RECONCILIATION BETWEEN GAAP AND NON-GAAP DILUTED (LOSS) EARNINGS PER SHARE GUIDANCE: Fiscal Year\n\n2023 Consolidated GAAP diluted loss per share $(6.67) - $(6.57) Amortization of acquired intangible assets 1.23 Goodwill and intangible impairment (b) 5.15 Legal contingency and settlement (c) 0.09 Acquisition-related expenses (d) 0.48 Strategic investment related loss, net (e) 0.22 Gain on Helix contingent value right (f) (0.05) Unrealized foreign currency loss on EC fine (g) 0.05 Restructuring (h) 0.59 Contingent consideration liabilities (i) (0.51) GILTI and U.S. foreign tax credits (j) 0.41 Incremental non-GAAP tax expense (k) (0.63) Income tax provision (l) 0.06 Proxy contest 0.18 Consolidated non-GAAP diluted earnings per share (a) $0.60 - $0.70\n\n(a) Non-GAAP diluted earnings per share excludes the effects of the pro forma adjustments as detailed above. Non-GAAP diluted earnings per share is a key component of the financial metrics utilized by the company's board of directors to measure, in part, management's performance and determine significant elements of management's compensation. Management has excluded the effects of these items in this measure to assist investors in analyzing and assessing our past and future operating performance. (b) Amount consists of goodwill and IPR&D intangible asset impairments related to our GRAIL segment recognized in Q3 2023. (c) Amount consists of a gain related to a patent litigation settlement in Q3 2023, an adjustment in Q2 2023 to our accrual for the fine imposed by the European Commission and a loss related to a patent litigation settlement in Q1 2023. (d) Amount consists primarily of legal expenses incurred through Q3 2023 related to the acquisition of GRAIL. (e) Amount consists primarily of mark-to-market adjustments and impairments recognized through Q3 2023 on our strategic investments. (f) Amount consists of fair value adjustments recognized through Q3 2023 on our Helix contingent value right. (g) Amount consists of an unrealized mark-to-market loss on hedge entered into in Q3 2023 associated with the EC fine, partially offset by an unrealized gain related to foreign currency balance sheet remeasurement of the EC fine liability. (h) Amount consists primarily of employee severance costs and lease and other asset impairments incurred through Q3 2023 related to restructuring activities. (i) Amount consists primarily of fair value adjustments recognized through Q3 2023 for our contingent consideration liability related to GRAIL. (j) Amount represents the impact of GRAIL pre-acquisition net operating losses on GILTI and the utilization of U.S. foreign tax credits. (k) Incremental non-GAAP tax expense reflects the tax impact related to the non-GAAP adjustments listed. (l) Amount represents the difference between book and tax accounting related to stock-based compensation cost recognized through Q3 2023.\n\nInvestors:\r\nSalli Schwartz\r\n+1.858.291.6421\r\nir@illumina.com\n\nMedia:\r\nDavid McAlpine\r\n+1.347.327.1336\r\npr@illumina.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/illumina-reports-financial-results-for-third-quarter-of-fiscal-year-2023-301983971.html\n\nSOURCE Illumina, Inc.", "link": "https://finance.yahoo.com/news/illumina-reports-financial-results-third-210500784.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.04, "neu": 0.872, "pos": 0.088}}, {"date": "2023-11-09T15:32:53+00:00", "title": "Strong week for Illumina (NASDAQ:ILMN) shareholders doesn't alleviate pain of five-year loss", "content": "We think intelligent long term investing is the way to go. But unfortunately, some companies simply don't succeed. For example the Illumina, Inc. (NASDAQ:ILMN) share price dropped 64% over five years. That's an unpleasant experience for long term holders. And some of the more recent buyers are probably worried, too, with the stock falling 49% in the last year. Furthermore, it's down 40% in about a quarter. That's not much fun for holders.\n\nThe recent uptick of 3.8% could be a positive sign of things to come, so let's take a look at historical fundamentals.\n\nView our latest analysis for Illumina\n\nIllumina wasn't profitable in the last twelve months, it is unlikely we'll see a strong correlation between its share price and its earnings per share (EPS). Arguably revenue is our next best option. Generally speaking, companies without profits are expected to grow revenue every year, and at a good clip. That's because it's hard to be confident a company will be sustainable if revenue growth is negligible, and it never makes a profit.\n\nIn the last half decade, Illumina saw its revenue increase by 8.8% per year. That's a pretty good rate for a long time period. The share price return isn't so respectable with an annual loss of 10% over the period. It seems probably that the business has failed to live up to initial expectations. That could lead to an opportunity if the company is going to become profitable sooner rather than later.\n\nYou can see below how earnings and revenue have changed over time (discover the exact values by clicking on the image). earnings-and-revenue-growth\n\nIllumina is a well known stock, with plenty of analyst coverage, suggesting some visibility into future growth. If you are thinking of buying or selling Illumina stock, you should check out this freereport showing analyst consensus estimates for future profits.\n\nA Different Perspective\n\nIllumina shareholders are down 49% for the year, but the market itself is up 17%. Even the share prices of good stocks drop sometimes, but we want to see improvements in the fundamental metrics of a business, before getting too interested. Unfortunately, last year's performance may indicate unresolved challenges, given that it was worse than the annualised loss of 10% over the last half decade. We realise that Baron Rothschild has said investors should \"buy when there is blood on the streets\", but we caution that investors should first be sure they are buying a high quality business. Before spending more time on Illumina it might be wise to click here to see if insiders have been buying or selling shares.\n\nStory continues\n\nOf course Illumina may not be the best stock to buy. So you may wish to see this freecollection of growth stocks.\n\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.", "link": "https://finance.yahoo.com/news/strong-week-illumina-nasdaq-ilmn-153253502.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0.06, "neu": 0.819, "pos": 0.121}}, {"date": "2023-11-09T10:54:52+00:00", "title": "Q3 2023 Somalogic Inc Earnings Call", "content": "Participants\n\nAdam Taich; Interim CEO; SomaLogic, Inc.\n\nEliot M. Lurier; Interim CFO; SomaLogic, Inc.\n\nKyle Boucher; Associate; TD Cowen, Research Division\n\nKyle Alexander Mikson; Director & Senior Equity Research Analyst; Canaccord Genuity Corp., Research Division\n\nUnidentified Analyst\n\nNoah Corin\n\nPresentation\n\nOperator\n\nGood afternoon, and welcome to SomaLogic's Third Quarter 2023 Earnings Conference Call. (Operator Instructions) As a reminder, this call is being recorded for replay purposes. I would now like to call over to Noah Corin with Gilmartin Group Investor Relations for introductory comments.\n\nNoah Corin\n\nThank you. Today, SomaLogic released financial results for the quarter ended September 30, 2023. A copy of the press release is available on the company's website. \r\nBefore we begin, I'd like to remind you that management will make forward-looking statements during this call within the meaning of federal securities laws, which are made pursuant to the safe harbor provisions of the Private Securities Litigation Reform Act of 1995. \r\nAny statements contained in this call that relate to expectations or predictions of future events, results or performance are forward-looking statements. All forward-looking statements, including, without limitation, those relating to our market opportunity, gross margin and future financial performance, protein content and database growth, customer base, diagnostic pipeline, expectations for hiring and growth in our organization, are based upon our current estimates and various assumptions. \r\nThese statements involve material risks and uncertainties that could cause actual results or events to materially differ from those anticipated or implied by these forward-looking statements. Accordingly, you should not place undue reliance on these statements. For a list and description of the risks and uncertainties associated with our business, please refer to the Risk Factors section of our latest Form 10-Q and 10-K filed with the Securities and Exchange Commission. \r\nIn addition, today's discussion will include references to non-GAAP financial measures, including adjusted EBITDA. This non-GAAP measure is presented for supplemental informational purposes only and should not be considered a substitute for financial information presented in accordance with GAAP. Please see our press release on file with the SEC as of this afternoon for a reconciliation between GAAP net loss and non-GAAP adjusted EBITDA. \r\nThis call contains time-sensitive information and is accurate as of the live broadcast today, November 8, 2023. SomaLogic disclaims any intention or obligation, except as required by law, to update or revise any financial projections or forward-looking statements, whether because of new information, future events or otherwise. \r\nAnd with that, I will now turn the call over to Adam Taich, Interim Chief Executive Officer.\n\nStory continues\n\nAdam Taich\n\nThanks, Noah. Good afternoon, and thank you for joining SomaLogic's Third Quarter 2023 Earnings Conference Call. I'm pleased to report another solid quarter marked by consistent progress on our commercial initiatives and increased operational rigor throughout the organization. \r\nDespite a challenging macroeconomic environment, we achieved third quarter revenue of $22 million, reflecting 14% year-over-year growth when excluding nonrecurring licensing revenue that we received in the third quarter of last year. Given our progress, we are raising our full year 2023 revenue expectations to $82 million to $85 million from the prior range of $80 million to $84 million. \r\nBefore turning to our results in more detail, I'd like to highlight our recent merger announcement. In early October, following a comprehensive review of strategic options, we announced our intention to combine in an all-stock merger with Standard BioTools, a leading provider of mass cytometry and microfluidic technologies. The merger establishes a leading platform of multi-omic technologies to power research insights across a broad and growing market while expediting SomaLogic's path to scale and cash flow breakeven. \r\nIt expands our commercial reach with cross-selling opportunities and complementary offerings. We believe the combined business will be positioned to meaningfully accelerate our path to probability, and we continue to expect the merger to close in the first quarter of 2024. We expect our proxy to be on file shortly, which will provide additional background and details regarding the transaction. \r\nNow shifting to our third quarter results, starting with our core SomaScan services offering. Customer retention and acquisition remain the focus of our commercial efforts, and we are finding new ways to validate the therapeutic pipelines of our customers. For example, the recent rise in GLP-1 agonists have increased interest in the use of SomaScan to identify early indications of efficacy across clinical trial candidates. \r\nIn a recent paper published by Diabetes Care, investigators were able to identify meaningful changes in cardiovascular risk, glucose tolerance, liver fat, body fat and cardiopulmonary fitness as a result of weight loss intervention by utilizing the SomaScan platform. By attaining an early read on efficacy, pharma investigators can allocate resources to the most promising therapeutic candidates before expensive and time-consuming longitudinal studies are undertaken. This represents just one of the many promises of the SomaScan platform. \r\nIn the third quarter, we continued to execute on our authorized site strategy. The primary goal of this strategy is to expand the ways in which customers can adopt and utilize SomaScan. We've been especially focused on expansion in Europe and Asia Pacific, as it is often more difficult for customers in those regions to send samples into our world-class services lab in Boulder, Colorado. As we establish more sites and generate higher sample volumes, we expect our authorized sites to offer more predictable and higher-margin revenue while reducing sample delivery times for researchers globally. \r\nIn March, we shared that we had established 8 distinct authorized sites, and we committed to doubling that base by year-end. As of today, we have 14 sites up and running, and we remain on track to meet our commitment. \r\nTurning to progress with Illumina. In the third quarter, we also advanced our effort to grow our distributed business through our partnership with Illumina. The partnership is focused on delivering a co-exclusive, co-branded NGS-based distributed solution. \r\nOur work remains on track, and we continue to expect early access for customers in Q1 of 2024. This joint proteomics product will combine Illumina's market-leading installed base and commercial force with the breadth and depth of the SomaScan assay to deliver differentiated insights to researchers across a wide range of customer segments. \r\nWhile attending the American Society of Human Genetics meeting in Washington, D.C. last week, I had the opportunity to speak to a number of prospective customers who are really excited about being able to leverage their Illumina NGS instrumentation to gain deeper proteomic insights in their research. The energy around this effort is palpable, and the level of interest from customers is high. \r\nFinally, we are incredibly excited to announce the commercial launch of the 11K SomaScan assay. The new high-plex platform provides 11,000 total protein measurements and is the largest proteomics offering available on the market. We now have the ability to measure more than half of the human proteome in a single assay. \r\nFollowing the 7K SomaScan offering, our prior core technology, the 11K SomaScan platform is expected to give researchers a considerable edge in the discovery of biomarkers and drug targets for translational medicine. Proteins make up more than 90% of all known drug targets. And having a broader view of the human proteome provided by this expanded platform gives our customers more opportunities to make unique and novel biological discoveries. \r\nThe aptamer-based platform retains the previous version's low coefficient of variation, which is the standard measure of reproducibility versus the 10% to 20% in antibody-based platforms. This improves accuracy with fewer, smaller samples, which is often critical in population studies with limited sample volumes. \r\nAs early innovators in this space, we know that the discovery and development of disruptive therapeutics benefit substantially from a more complete view of the proteome. We look forward to driving adoption of this platform for the benefit of researchers across our customer base. \r\nNow before I turn the call over to Eliot Lurier, our Interim Chief Financial Officer, I'd like to reiterate that we are making strong progress towards our business objectives. And we remain excited for our future as part of the combined company with Standard BioTools. We look forward to the close of our merger and the realization of shareholder value that we can unlock together. \r\nWith that, I'll turn the call over to Eliot Lurier, our Interim Chief Financial Officer, to review our financials.\n\nEliot M. Lurier\n\nThank you, Adam. Revenue for the 3 months ended September 30, 2023, was $22 million as compared to $41.7 million in the third quarter of 2022, a 47% year-over-year decline on a GAAP basis. Excluding $22.3 million in royalty revenue in the third quarter of 2022 from NEB, our revenue increased by 14% year-on-year. \r\nOur underlying third quarter performance was driven by increasing adoption of the SomaScan platform as well as an increase in revenue through our authorized sites. Product revenue associated with our authorized site strategy was up close to $2.5 million versus Q3 '22 and up $0.5 million or 17% sequentially from Q2 of this year. \r\nGross margin for the third quarter of 2023 was 47.2%, a decrease from 72% in the prior year period. Excluding the NEB royalty revenue in the third quarter of 2022, gross margin increased by 7.4% year-on-year. As we noted earlier in the year, we continue to expect full year 2023 gross margins in the mid-40% range and expect our margin profile to improve long term from our combined distributed solution and future royalty revenues. \r\nTotal operating expenses for the third quarter of 2023 were $38.5 million, a 46% decrease from $70.7 million in the third quarter of 2022. R&D expenses for the third quarter of 2023 were $10.5 million compared to $19.4 million in the third quarter of 2022. \r\nSelling, general and administrative expenses for the third quarter of 2023 were $23.9 million compared to $49.5 million in the third quarter of 2022. Transaction expenses for the third quarter of '23 were $4.2 million compared to (inaudible) in the third quarter of 2022. Transaction costs in third quarter are related to our upcoming (technical difficulty) Q3 '22 were related to the (inaudible). \r\nLastly, I would like to note the prior year's operating expenses include (technical difficulty). Our third quarter results reflect substantial progress across ongoing expense reduction initiatives. We remain on track to recognize approximately $170 million in full year operating expenses. \r\nAdjusted EBITDA for the third quarter of 2023 was a loss of $20.1 million compared to an adjusted EBITDA loss of $30.2 million in the third quarter of 2022. Accounting for the NEB royalty in Q3 '22, the adjusted EBITDA would have been a loss of $52.5 million. \r\nWe ended the third quarter with $454 million of cash, cash equivalents and short-term investments. Our cash burn in the quarter was $20 million, reflecting a significantly sequential decrease as we implement greater spending control. \r\nWe anticipate ending the year with approximately $430 million in cash, equivalents and short-term investments, implying a significantly lower cash burn rate than we had originally guided for the year. Ending with our full year outlook, as Adam mentioned, we are raising our 2023 revenue guidance to $82 million to $85 million. \r\nAt this point, I'd like to turn the call back to Adam.\n\nAdam Taich\n\nThanks, Eliot. In a moment, I will turn the line over to our operator, Shannon, to open up the queue for questions. Before I do, I would like to ask that our audience to focus our questions on our third quarter business results and progress rather than on the announced merger with Standard BioTools as our proxy statement has not yet been filed. \r\nShannon, we're now ready for questions.\n\nQuestion and Answer Session\n\nOperator\n\n(Operator Instructions) Our first question comes from the line of Kyle Mikson with Canaccord Genuity.\n\nKyle Alexander Mikson\n\nSo looking at the enhanced (inaudible) library, I was just curious sort of new indications that you've seen (inaudible). I know it's, obviously, very early days. And I guess more so (inaudible).\n\nAdam Taich\n\nShannon, I think as you just saw from the -- Eliot and I are unable to -- we weren't able to hear the question.\n\nEliot M. Lurier\n\nWe're hearing a lot of background static.\n\nOperator\n\nKyle, could you please repeat your question?\n\nKyle Alexander Mikson\n\nYes. So (inaudible). So regarding the enhanced protein library, I was just curious what new indications that you're seeing researchers use the library for? I know it's early days, but just kind of curious kind of where -- what type of research to (inaudible)?\n\nAdam Taich\n\nYes. (inaudible) But we also wanted to ensure that we were looking on (inaudible) in the areas of scientific interest (inaudible) gathering proteins with new menu. I hope that's audible. And I'll defer that, Shannon, to you.\n\nKyle Alexander Mikson\n\nGot it. I could definitely hear you loud and clear. And then my other question just would be I guess looking at the performance, would you say that this (inaudible). Would you say some of this performance is driven more so the (inaudible) research or like on the biopharma?\n\nAdam Taich\n\nYes. I would say most of the -- we're seeing fantastic growth in both customer segments, but we're really starting to accelerate and penetrate more deeply in the biopharma. Those, as I've discussed earlier, can oftentimes (inaudible) along the road, and then you'll see those customer bases. And we're starting to see more and more growth different therapeutic areas (inaudible) discovery aspect all the way (inaudible) highlighted on GLP-1 in our comments. We're finding ourselves also in those clinical discussions as well.\n\nOperator\n\nOur next question is coming from the line of Dan Brennan with TD Cowen.\n\nKyle Boucher\n\nIt's Kyle on for Dan. I had one on the kits business in regards to the authorized sites. You said you're up to 14 sites. How is the activity level with each of those sites? And do you have plans to expand this in '24?\n\nAdam Taich\n\nYes. So (inaudible) some of those new sites that we've gotten up and running, but (inaudible) one of the things we've tried to do over the last several quarters is selecting great partner. And we've done so thus far. So activity level is great and (inaudible).\n\nKyle Boucher\n\nGot it. And how should we sort of think about the Q-over-Q growth in the kits business? It picked up sequentially. And I think you guys beat the quarter by about $1.5 million relative to The Street and raised the midpoint of the guide. Should we just carry the speed sort of over in Q4? The Street numbers look relatively fine where they are. How should we think about that?\n\nAdam Taich\n\nI apologize. Can you repeat the question?\n\nKyle Boucher\n\nYes, we might be having some technical difficulties here. So you beat the quarter by about $1.5 million rate at the midpoint of the guide, about $1.5 million. Are you comfortable where The Street is for the fourth quarter? Or I guess what are sort of the puts and takes of 4Q?\n\nAdam Taich\n\nYes. I think part of the reason that we increased guidance is we're expecting the fourth quarter to look more similar to the third quarter. And so we're feeling good about that. Our business (inaudible).\n\nOperator\n\n(Operator Instructions) Our next question comes from the line of Daniel Arias with Stifel.\n\nUnidentified Analyst\n\nIt's Paul on for Dan. Apologies if this has been asked. I'm having trouble hearing, but I think the audio (inaudible). Just wondering in terms of setting up these authorized sites, now that you're up to 14 becoming, I guess, a little more frequent. Can you talk about -- are you starting to see any improvement in terms of faster pace of training or customers staying up to speed and sort of in terms of the normalized pull-through. Is that kind of something that you're seeing as more and more authorized sites are getting out there? Or is it just more status quo as new customers (inaudible)?\n\nAdam Taich\n\nNo, I think (inaudible) as we learn (inaudible). We continue to increase in the site (inaudible).\n\nUnidentified Analyst\n\nOkay. Great. And then the last one is in terms of the guidance raise, is that something that -- is there a specific geography that's contributed more so to that? Or you're seeing more strength than you expected a quarter ago or is that relatively broad-based?\n\nAdam Taich\n\nIt's fairly broad based, to be honest with you. It isn't any ERP. In particular, I think (inaudible) so what we're seeing is really more broad-based growth as we extend our (inaudible) in Europe historically, we're seeing really nice uptick in (inaudible).\n\nOperator\n\nI would now like to turn the call back over to Adam Taich for closing remarks.\n\nAdam Taich\n\nGreat. Thanks, Shannon. And apologies for a little bit of technical difficulty right at the Q&A. I hope it's audible. I just really want to thank you for your time and your efforts to join this call. And we look forward to another strong quarter and closing the merger with Standard BioTools. Thank you so much.\n\nOperator\n\nThis concludes today's conference call. Thank you for participating. You may now disconnect.", "link": "https://finance.yahoo.com/news/q3-2023-somalogic-inc-earnings-105452921.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.019, "neu": 0.877, "pos": 0.104}}, {"date": "2023-11-08T17:16:20+00:00", "title": "6 Nasdaq 100 Stocks Down 40% or More that Will Soar As Much 367%", "content": "One knock against Wall Street analysts is they’re too bullish, especially when it comes to Nasdaq 100 stocks. No matter the market conditions, they seem able to find the silver lining. There are very few “sell” recommendations, with most stock endorsements being a “buy” or “strong buy.” Yet maybe they’re seeing something through those rose-colored glasses they wear.\n\nNasdaq 100 stocks are down 4% from recent highs in July but was technically in a correction toward the end of October. The tech-heavy index recently jumped higher on news from the Federal Reserve regarding interest rates, so there is good reason to see the positive side of things.\n\nHistory suggests that a bull market eventually erases every double-digit decline in the stock market. Also, we measure bear markets in months while bull markets are measured in years. So analysts have good reason to see the bright side of Nasdaq 100 stocks.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nNaturally, exuberance can be taken to an extreme. Sometimes caution is warranted. What follows are seven Nasdaq 100 stocks that Wall Street believes can soar as much as 367%!\n\nSirius XM Holdings (SIRI) Person holding mobile phone with logo of US broadcasting company Sirius XM Holdings Inc. (SIRI) on screen in front of web page. Focus on phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nSatellite radio operator Sirius XM Holdings (NASDAQ:SIRI) has not been kind to investors since the turn of the century. Shares occasionally spike higher, only to give up all the gains and then some.\n\nWe saw that this past July when they suddenly surged 40% higher in one day on a short squeeze play only to plunge lower immediately afterward.\n\nAt $4.71 per share as of this writing, Sirius stock is down 41% from that peak. That hasn’t stopped analysts from expecting good things still from the satellite radio star. The consensus estimate for Sirius is $7 per share, which implies a possible 50% return over the next year. On the high side, one analyst pegs it as an $8 stock, or nearly double where it sits today.\n\nWhile advertisers have been cautious, business is coming back. Sirius already booked more advertising in the first three quarters of 2023 than it did for all of 2022. Subscriptions grew to 34 million at the end of September while customer churn remains very low at 1.6%.\n\nStory continues\n\nSirius is also expanding the availability of its 360L audio platform by making it available to more OEM vehicle manufacturers.\n\nAnd then there’s the rumored merger with Liberty Media (NASDAQ:LSXMA)(NASDAQ:LSXMB)(NASDAQ:LSXMK) which already owns 83% of the company. There is uncertainty still about the combination, but it would bring Sirius fully under its corporate umbrella. The Liberty tracking stocks for Sirius would be combined with the satellite radio operator and then spun off into a new company.\n\nComplexity always creates doubt, but a successful merger and its turnaround plan gaining traction could allow Sirius XM Holdings to soar, which is why it’s one of the Nasdaq 100 stocks to buy now.\n\nWalgreens Boots Alliance (WBA) Walgreens (WBA) store exterior and sign in Pompano Beach, Florida\n\nSource: saaton / Shutterstock.com\n\nAiling pharmacy chain Walgreens Boots Alliance (NASDAQ:WBA) has also been on a long slide lower. Not just this year, but over at least the last decade.\n\nIt lost two-thirds of its value over that time but is down 50% from its recent 52-week high. There are a lot of reasons behind Walgreens’ slow death spiral, but the current slump surrounds the pharmacy’s decision not to sell its U.K. operations or its beauty care business.\n\nIt encouraged investors that Walgreens intended to focus on its domestic healthcare business. However, when the pharmacy reversed course and said it would not sell the Boots chain or No7 Beauty, they sold off the stock.\n\nYet keeping its eye on the U.S. healthcare market remains a priority for Walgreens. It owns almost two-thirds of Village MD, expanding its reach into primary, specialty care, and urgent care. And in January Village MD bought Summit Health, which owns CityMD. The $9 billion deal created one of the largest independent provider groups in the country.\n\nThat could be why analysts see Walgreens Boots Alliance having 96% upside. Even if it doesn’t get that high, the pharmacy’s 9.2% dividend yield buoys investor portfolios. Walgreens is the highest-yield Dividend Aristocrat and one of the Nasdaq 100 stocks worth holding onto while waiting for the turnaround to materialize.\n\nIllumina (ILMN) Illumina (ILMN) logo displayed on reddish stone facade building against blue sky background\n\nSource: shutterstock.com/JHVEPhoto\n\nGenetic testing outfit Illumina (NASDAQ:ILMN) was something of a market darling ever since its IPO in 2000. The sheen wore off in 2021, however, after Illumina defiantly acquired cancer test maker Grail for $7.1 billion despite regulatory objections.\n\nThe case is ongoing as Illumina challenges the European Union’s demand it divest Grail, but its CEO also subsequently resigned and the board faces a proxy fight and lawsuit from billionaire investor Carl Icahn.\n\nWith all those clouds hanging over Illumina’s head, it’s surprising analysts have a $259 per share price target on the stock. That suggests the genetic testing company could see shares surge 130% over the next year.\n\nIllumina has a new management team and plenty of money to pay the $453 million in fines the EU proposes. It is planning to launch a new flow cell for its latest gene sequencing machine. The NovaSeqX is off to a strong start with 10% penetration across its 1,000 or so existing customers.\n\nIt is also introducing two new sequencing kits usable with existing hardware. Although China has seen slower than expected growth, Illumina is also entering the India market where there is significant growth potential.\n\nIt won’t be a quick rebound, but the worst could be behind the genetic testing company. Illumina may just be able to achieve Wall Street’s goals.\n\nModerna (MRNA) Moderna logo is seen at the entrance to its headquarters in Cambridge, Massachusetts. Moderna, Inc., (MRNA) is an American pharmaceutical and biotechnology company.\n\nSource: Tada Images / Shutterstock.com\n\nInvestors might be surprised to see Moderna (NASDAQ:MRNA) shares fell 55% from recent highs. But Wall Street is convinced the biotech can recover the luster it held during the Covid pandemic. Analysts have a $222 per share one-year price target on the stock, indicating they think it can more than triple in value.\n\nIt looks like another tough slog. In financial results just published, Moderna posted a quarterly loss of $3.63 billion, or $9.53 per share. Half of that was from trashing expiring unused Covid-19 shots. It’s also scaling back vaccine manufacturing. People don’t feel the same need to vaccinate or get boosters as they did during the pandemic.\n\nHowever, the biotech said it expects to launch a vaccine in the U.S. next year to protect against respiratory syncytial virus. It is one of the key products Moderna is developing to jumpstart sales next year. That will put it in competition against GSK (NYSE:GSK) and Pfizer (NYSE:PFE). However, its RSV vaccine is 82.4% effective against the disease while Pfizer’s fell to 78.6% and GSK’s slipped to 84.6% from 94%.\n\nAs low as Moderna has fallen, investors might be just as surprised as it rebounds on better performances.\n\nJD.com (JD) JD.com (JD) logo displayed at the entrance to the company's Silicon Valley office.\n\nSource: Sundry Photography / Shutterstock.com\n\nChinese online marketplace JD.com (NASDAQ:JD) still suffers from the crackdown Beijing launched into tech stocks. While those investigations are winding down, China’s economy is slowing.\n\nThere is also significant geopolitical turmoil weighing on the stock, particularly as the U.S. and China spar over trade, Taiwan, and more recently, the Middle East.\n\nChina is no longer seen overtaking. Economists see China’s gross domestic product (GDP) slowing to 3.5% growth in 2030 and to 1% by 2050. Still, China is massive and its people want to spend. JD.com hosts the Chinese midyear shopping spectacle known as 618 (June 18).\n\nFirst launched in 2004 to celebrate the retailer’s founding, this year’s extravaganza ran for several weeks through mid-June. JD didn’t pin a dollar figure on sales, but did say it was a record.\n\nWall Street is looking for JD’s stock to soar to around $85 a share, a 214% increase from where it trades today. While the stock is down 60% from its January peak, making up a lot of the lost ground seems possible\n\nEnphase Energy (ENPH) mobile phone screen with Enphase Energy (ENPH) logo on it to represent renewable energy stocks\n\nSource: IgorGolovniov / Shutterstock.com\n\nIt’s been a long road lower for residential solar inverter leader Enphase Energy (NASDAQ:ENPH). The solar market is cyclical at best, and Enphase looks like it’s in one of the downward swings.\n\nShares are off 77% from its 52-week high. The good news is Wall Street thinks it can shine again very soon. Analysts set a $316 price target on the stock, or 300% above its current level.\n\nEnphase is one of just two dominant manufacturers of residential inverters and has a 50% share of the market. SolarEdge Technologies (NASDAQ:SEDG) is second with a 40% share and Tesla (NASDAQ:TSLA) is a distant third at 5%. Inverters convert the direct current (DC) produced by solar panels into the alternating current (AC) used in homes.\n\nAfter a difficult 2022, the U.S. solar industry is expected to rebound this year. Analysts forecast a record 32 gigawatts of production capacity will be added in 2023. They estimate operating capacity to grow from 153 GW today to 375 GW by 2028 as Covid-era supply constraints fade.\n\nThat bodes well for Enphase, but persistent inflation and high interest rates conspire against consumers adopting solar. Solar energy systems cost a lot of money, and financing them become uneconomical in the current environment.\n\nDespite that, Enphase is holding the line on pricing. It’s why the inverter leader says it is maintaining margin guidance north of 40%. It’s a plan with short-term pain, but possible long-term gain.\n\nAs it expands internationally gives it greater reach and softens the blow of any regional weakness. It might get uglier before it looks better, but investors should have a long-term outlook anyway.\n\nOn the date of publication, Rich Duprey held a LONG position in WBA stock. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nRich Duprey has written about stocks and investing for the past 20 years. His articles have appeared on Nasdaq.com, The Motley Fool, and Yahoo! Finance, and he has been referenced by U.S. and international publications, including MarketWatch, Financial Times, Forbes, Fast Company, USA Today, Milwaukee Journal Sentinel, Cheddar News, The Boston Globe, L’Express, and numerous other news outlets.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The #1 AI Investment Might Be This Company You’ve Never Heard Of The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 6 Nasdaq 100 Stocks Down 40% or More that Will Soar As Much 367% appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/6-nasdaq-100-stocks-down-171620367.html", "symbols": ["0QF.F", "ENPH.US", "GSK.US", "ILMN.US", "JD.US", "LSXMA.US", "LSXMB.US", "LSXMK.US", "MRNA.US", "PFE.US", "RDO.F", "SEDG.US", "SIRI.US", "TSLA.US", "W8A.F", "WBA.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.05, "neu": 0.825, "pos": 0.125}}, {"date": "2023-11-08T14:50:00+00:00", "title": "Global Precision Medicine Market Size Demonstrates Consistent Growth with a CAGR of 11.12%, with North America Taking a Leading Role", "content": "New York, United States, Nov.  08, 2023  (GLOBE NEWSWIRE) -- Precision medicine is a new approach to treating and preventing disease that considers each individual's genetic, environmental, and lifestyle differences. Giving the proper treatment to the right patient at the right time is the goal of precision medicine.\n\nAccording to Straits Research, “North America is dominating the market with the highest revenue and is expected to reach USD 97.32 billion in 2030, growing at a CAGR of 9.7% during the forecast period,”\n\nDownload Free Sample Report PDF @ https://straitsresearch.com/report/precision-medicine-market/request-sample\n\nKey Drivers\n\nDNA sequencing technology has undergone significant technological advancements, which have paved the way for a deeper understanding of some diseases like cancer. Depending on the genetic profiles of those individuals, the advancements have made it possible to develop treatments that are better suited to them. Patients with breast, lung, or colorectal cancer who have undergone genetic testing as part of routine patient care can measure this molecular transformation of medicine. As a result, the process's accuracy and the time required to finish it have increased. With the collection of more medical data, there has been an increase in understanding of how the treatment a patient receives affects the patient's overall health. It is possible to use precision medicine for preventive care when interventions target disease risk factors to lower the disease risk. One example of this would be the treatment of high blood pressure to prevent patients from experiencing heart attacks or strokes.\n\nGrowth Opportunities\n\nMost precision medicine providers focus on developed markets, leaving emerging markets untapped. Large populations at risk for diseases requiring gene sequencing in China, India, Australia, the Middle East, and Africa present an opportunity to expand the precision medicine market. Genetics and precision medicine have made significant progress in developing countries over the past decade regarding regulations, product approvals, and implementation of novel methods and procedures in healthcare.\n\nSearching for mendelian germline genetic mutations, such as those in cancer genetics, is likely the first step for emerging nations' public healthcare systems. Private healthcare investment funds help small innovative players develop new genetic tests in emerging regions. Developing nations' proper and uncomplicated approval of GINA helped ban genetic discrimination in health insurance and employment. This creates a modern and humanized genomic medicine environment in the country.\n\nRegional Analysis\n\nThe North American segment dominates the market with the highest revenue, and The United States dominates North America's precision medicine market. Advanced research and development in molecular diagnostics and targeted therapeutics have significantly aided our understanding of the biology of various infectious diseases and forms of cancer, such as lung cancer, breast cancer, and colorectal cancer.\n\nSeveral well-established diagnostics manufacturers in North America are focusing on expanding their portfolios of NGS-based molecular diagnostics and collaborating with service providers and pharmaceutical behemoths to co-market molecular diagnostics solutions alongside their complementary precision medicine solutions. In addition, the U.S. government finances new molecular diagnostics and precision medicine start-ups.\n\nKey Highlights\n\nThe global precision medicine market size is projected to reach USD 280.67 billion by 2030, growing at a CAGR of 11.12% during the forecast period (2022–2030).Based on the ecosystem, the global precision medicine market is segmented into sciences, precision diagnostics, precision therapeutics, and digital health and information technology. The precision therapeutics segment is dominating the market and is expected to grow at a CAGR of 11.62% during the forecast period.Based on application, the global precision medicine market is segmented into oncology, neurology/psychiatry, infectious diseases, gastroenterology, cardiovascular, endocrinology, rheumatology, etc. The oncology segment is the most dominant and is expected to grow at a CAGR of 11.21% during the forecast period.\n\nCompetitive Analysis\n\nThe global precision medicine market’s major key players are Bristol-Myers Squibb Company, Illumina, Inc., Pacific Biosciences of California, Inc., AstraZeneca PLC, Eli Lilly and Company, Merck & Co., Inc., Premaitha Health plc, QIAGEN N.V., Johnson and Johnson, and Asuragen, Inc.\n\nMarket News\n\nMay 2022- Illumina Introduced New Pan-Cancer Companion Diagnostic to Match Patients with Rare Genetic Mutations to Targeted Therapy. The first companion diagnostic claim for Illumina's TruSightTM Oncology Comprehensive (EU) test enables targeted therapy for patients with NTRK fusion cancer using Bayer's VITRAKVI® (larotrectinib).May 2022- Illumina and Allegheny Health Network Assessed In-House Comprehensive Cancer Genomic Profiling to Enhance Patient Care. Illumina, Inc. (NASDAQ: ILMN), a global leader in DNA sequencing and array-based technologies, and Allegheny Health Network (AHN), an integrated health system serving Western Pennsylvania, have partnered to evaluate the impact of in-house comprehensive genomic profiling (CGP) on patient care.June 2022- Bristol Myers Squibb Acquired Turning Point Therapeutics, a Leading Precision Oncology Company. Bristol Myers Squibb (NYSE: BMY) and Turning Point Therapeutics, Inc. (NASDAQ: TPTX) have announced a definitive merger agreement.\n\nGlobal Precision Medicine Market: Segmentation\n\nBy Ecosystem\n\nApplied SciencesPrecision DiagnosticsPrecision TherapeuticsDigital Health and Information Technology\n\nBy Application\n\nOncologyNeurology/psychiatryInfectious diseasesGastroenterologyCardiovascularEndocrinologyRheumatology\n\nBy Regions\n\nNorth AmericaEuropeAsia-PacificRest-of-the-World (ROW)\n\nGet Detailed Market Segmentation @ https://straitsresearch.com/report/precision-medicine-market/segmentation\n\nAbout Straits Research Pvt Ltd.\n\nStraits Research is a market intelligence company providing global business information reports and services. Our exclusive blend of quantitative forecasting and trends analysis provides forward-looking insight for thousands of decision-makers. Straits Research Pvt. Ltd. provides actionable market research data, specially designed and presented for decision making and ROI.\n\nWhether you are looking at business sectors in the next town or crosswise over continents, we understand the significance of being acquainted with the client’s purchase. We overcome our clients’ issues by recognizing and deciphering the target group and generating leads with utmost precision. We seek to collaborate with our clients to deliver a broad spectrum of results through a blend of market and business research approaches.\n\nFor more information on your target market, please contact us below:\n\nPhone: +1 646 480 7505 (the U.S.)\n\n+91 8087085354 (APAC)\n\n+44 208 068 9665 (the U.K.)\n\nEmail: sales@straitsresearch.com\n\nFollow Us: LinkedIn | Facebook | Instagram | Twitter", "link": "https://www.globenewswire.com/news-release/2023/11/08/2776407/0/en/Global-Precision-Medicine-Market-Size-Demonstrates-Consistent-Growth-with-a-CAGR-of-11-12-with-North-America-Taking-a-Leading-Role.html", "symbols": ["BMY.US", "ILMN.US", "TPTX.US"], "tags": ["HEALTH", "MARKET RESEARCH REPORTS", "OTHER NEWS", "PHARMA", "PRECISION MEDICINE MARKET SIZE", "PRECISION MEDICINE PROVIDERS", "PRECISION MEDICINE RESEARCH", "PRECISION MEDICINE SERVICES", "PRESS RELEASES", "RESEARCH ANALYSIS AND REPORTS", "STRAITS RESEARCH", "US"], "sentiment": {"polarity": 0.957, "neg": 0.06, "neu": 0.845, "pos": 0.095}}, {"date": "2023-11-08T00:00:00+00:00", "title": "6 Nasdaq 100 Stocks Down 40% or More that Will Soar As Much 367%", "content": "Wall Street is forever optimistic about the future for stocks and pegs these seven Nasdaq 100 stocks as ready for supersonic growth.", "link": "https://investorplace.com/2023/11/6-nasdaq-100-stocks-down-40-or-more-that-will-soar-as-much-367/", "symbols": ["ENPH.US", "ILMN.US", "JD.US", "MRNA.US", "SIRI.US", "WBA.US"], "tags": [], "sentiment": {"polarity": 0.751, "neg": 0, "neu": 0.72, "pos": 0.28}}]