[{"date": "2023-05-25T21:47:00+00:00", "title": "Illumina’s Fight With the FTC Over Blood Testing Could Reshape U.S. Merger Policy", "content": "The biotech is fighting U.S.and European regulators to save its deal for cancer screener Grail. The Supreme Court may have the last word.", "link": "https://finance.yahoo.com/m/60d8653e-e742-3811-959e-d2873c1aa0c5/illumina%E2%80%99s-fight-with-the-ftc.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.026, "neg": 0.211, "neu": 0.581, "pos": 0.208}}, {"date": "2023-05-25T21:04:09+00:00", "title": "Icahn scores partial Illumina win amid pressure to defend investment acumen", "content": "Carl Icahn secured a seat on Thursday for one of his three nominees to the board of gene sequencing machine maker Illumina Inc, a partial victory for the activist investor who is struggling to burnish his credentials following a shortseller attack on his company.", "link": "https://www.reuters.com/article/illumina-icahn/icahn-scores-partial-illumina-win-amid-pressure-to-defend-investment-acumen-idUSKBN2XG1L8", "symbols": ["IEP.US", "ILMN.US"], "tags": [], "sentiment": {"polarity": -0.494, "neg": 0.127, "neu": 0.815, "pos": 0.058}}, {"date": "2023-05-25T21:00:59+00:00", "title": "U.S. Equities End Mixed on Nvidia News, Debt Ceiling Worries", "content": "U.S. equities were mixed on Thursday, May 25, 2023 as Nvidia's results and outlook helped send the Nasdaq and S&P 500 higher, while the Dow fell on growing concerns about a possible government default.", "link": "https://finance.yahoo.com/m/adcfbaa3-1ada-3c39-b574-8d627e2df8d2/u.s.-equities-end-mixed-on.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0, "neu": 0.95, "pos": 0.05}}, {"date": "2023-05-25T18:59:37+00:00", "title": "UPDATE 2-Icahn scores partial Illumina win amid pressure to defend investment acumen", "content": "(Adds Teno statement in paragraph 9; SEC proxy rules in paragraph 10; executive pay vote in paragraph 11; updates shares)\n\nBy Svea Herbst-Bayliss\n\nNEW YORK, May 25 (Reuters) - Carl Icahn secured a seat on Thursday for one of his three nominees to the board of gene sequencing machine maker Illumina Inc, a partial victory for the activist investor who is struggling to burnish his credentials following a shortseller attack on his company.\n\nIllumina said Icahn nominee Andrew Teno won enough shareholder votes for election, confirming an earlier Reuters report. He will take the seat of board Chairman John Thompson, who failed to win reelection.\n\nIllumina's market value of $30 billion made the fight this year's largest proxy contest to go to a shareholder vote. Its shares closed down 9% at $193.53 on Thursday after Icahn failed in his bid to change the company's management by also ousting Chief Executive Francis deSouza from the board.\n\nIcahn had accused Illumina of poor oversight, especially with regard to its $7.1 billion acquisition of cancer test maker Grail. Illumina completed the deal despite opposition from U.S. and European antitrust regulators, who are now trying to force the company to unwind it. Icahn argued that Illumina lost $50 billion in value following the deal because investors worry that the company will be forced to divest Grail at a big loss.\n\nIcahn is battling to restore Wall Street's confidence in his investment acumen. Shares of investment company Icahn Enterprises LP have lost 60% of their value since May 2, when a Hindenburg Research report accused it of artificially inflating its dividend yield and the value of its assets. Icahn has denied the claims.\n\nIcahn Enterprises shares lost another 14% on Thursday, reaching their lowest level since 2004, after hedge fund veteran William Ackman tweeted more criticism about the company's finances.\n\nIcahn rejected an offer from Illumina earlier this year for a board seat for one of his nominees and another seat for an independent candidate that would have averted the proxy battle.\n\nThat arrangement would not necessarily have been the same as the outcome of the vote, given that it led to Thompson's ouster.\n\n\"I look forward to serving on behalf of all shareholders and stakeholders. I am happy to say that activism is alive and well at Icahn,\" Teno said in a statement.\n\nThe Illumina board battle was one of the first conducted under the U.S. Securities and Exchange Commission's universal proxy rules, which came into force last August. The rules allow shareholders to pick and choose among board director nominees in opposing slates, as opposed to voting only for entire slates. Some companies lobbied against the changes, arguing it favored activist investors.\n\nIllumina shareholders also voted against the pay arrangements of top executives in an another blow to the company. The vote was non-binding, but companies often take up such shareholder rulings. The CEO compensation package for deSouza reached $26.8 million in 2022, up from $14.3 million in 2021, according to a regulatory filing. (Reporting by Svea Herbst-Bayliss in New York; Editing by Greg Roumeliotis and Bill Berkrot)", "link": "https://finance.yahoo.com/news/1-icahn-wins-illumina-board-185937949.html", "symbols": ["IEP.US", "ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.824, "neg": 0.09, "neu": 0.839, "pos": 0.071}}, {"date": "2023-05-25T18:47:00+00:00", "title": "Icahn vs. Illumina Is a Split Decision: CEO Survives, Chairman Is Out", "content": "Activist investor Carl Icahn failed to topple the CEO of gene-sequencing giant Illumina in a proxy battle that culminated on Thursday afternoon, but succeeded in getting one of his three nominees onto the company’s board, and knocking out its chairman. The mixed decision represents a rebuke of Illumina (ticker: ILMN) CEO Francis deSouza, though not as severe a punishment as shareholders could have handed him. Icahn sought to replace deSouza as CEO, and one influential proxy advisor recommended that investors vote against his board nomination.", "link": "https://finance.yahoo.com/m/e9cc55c7-be22-3668-b940-d5a26c4be534/icahn-vs.-illumina-is-a-split.html", "symbols": ["IEP.US", "ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.858, "neg": 0.043, "neu": 0.812, "pos": 0.145}}, {"date": "2023-05-25T18:45:25+00:00", "title": "Illumina chair ousted in proxy battle with Carl Icahn", "content": "Vote to remove John Thompson is the culmination of one of the largest shareholder activism campaigns in years", "link": "https://finance.yahoo.com/m/d90c5007-4ae4-3717-b188-7a5f0f664987/illumina-chair-ousted-in.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-05-25T18:16:00+00:00", "title": "Illumina announces preliminary results of annual meeting", "content": "Illumina shareholders re-elect eight of nine Illumina directors\n\nSAN DIEGO, May 25, 2023 /PRNewswire/ -- Illumina (NASDAQ: ILMN), a global leader in DNA sequencing and array-based technologies, today announced that based on the preliminary results of its 2023 Annual Meeting, Illumina shareholders have voted to elect eight of nine Illumina director nominees – Francis deSouza, Robert Epstein, MD, Frances Arnold, PhD, Caroline Dorsa, Scott Gottlieb, MD, Gary Guthart, PhD, Philip Schiller, and Sue Siegel, as well as Andrew Teno, to the Board of Directors. The Board thanks John Thompson for his board tenure and extraordinary leadership.\n\nIllumina issued the following statement:\n\n\"Illumina thanks shareholders for their continued support of the company, which remains committed to its mission of improving human health by unlocking the power of the genome. We appreciate the constructive shareholder feedback throughout this process and are committed to delivering on our plan to accelerate shareholder value creation. We will continue to provide transparent and effective communication as we move forward together.\n\nWe would like to welcome Andrew Teno, a portfolio manager at Icahn Capital LP, to the Board and look forward to productive and collaborative engagement.\n\nWe also thank John Thompson for his years of service and contributions to Illumina as Chair of the Board. His deep executive experience and business knowledge were greatly valued during his tenure. John brought extensive technology leadership, including as a CEO at Symantec and Virtual Instruments, and Chairman of the Board at Microsoft, to Illumina. His depth and breadth of knowledge in technology and across a number of private and public sectors, as well as his financial expertise, greatly contributed to the Board's strategic leadership of the company.\"\n\nThe company also noted that shareholders approved the proposal to ratify auditors, one-year frequency on say-on-pay, and the stock incentive plan proposal; and shareholders did not approve the company's say-on-pay proposal.\n\nThe results announced today are considered preliminary and are subject to certification by the independent Inspector of Elections. The final certified results are expected to be provided in a Current Report filed on Form 8-K with the U.S. Securities and Exchange Commission within the next four business days.\n\nForward-Looking Statements\n\nThis communication contains \"forward-looking statements\" within the meaning of the Private Securities Litigation Reform Act of 1995, including statements regarding mandates, the future, business plans and other statements that are not historical in nature. These statements are made on the basis of Illumina's views and assumptions regarding future events and business performance and plans as of the time the statements are made. These forward-looking statements may be accompanied by such words as \"anticipate,\" \"believe,\" \"could,\" \"estimate,\" \"expect,\" \"forecast,\" \"intend,\" \"may,\" \"plan,\" \"potential,\" \"project,\" \"target,\" \"will\" and other words and terms of similar meaning. Illumina does not undertake any obligation to update these statements unless required by applicable laws or regulations, and you should not place undue reliance on forward-looking statements. Specific factors are set forth in Illumina's Annual Report on Form 10-K for the year ended January 1, 2023 under the caption \"Risk Factors\", in information disclosed in public conference calls, the date and time of which are released beforehand, and in filings with the Securities and Exchange Commission including, among others, quarterly reports on Form 10-Q.\n\nInvestors: Salli Schwartz\r\n858-291-6421\r\nIR@illumina.com\n\nMedia:\r\nDavid McAlpine\r\n347-327-1336\r\nPR@illumina.com\n\nSteve Lipin\r\nGladstone Place Partners\r\n212-230-5930 Cision\n\nView original content:https://www.prnewswire.com/news-releases/illumina-announces-preliminary-results-of-annual-meeting-301835034.html\n\nSOURCE Illumina, Inc.", "link": "https://finance.yahoo.com/news/illumina-announces-preliminary-results-annual-181600178.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.007, "neu": 0.892, "pos": 0.101}}, {"date": "2023-05-25T17:59:01+00:00", "title": "Icahn scores partial Illumina win amid pressure to defend investment acumen", "content": "By Svea Herbst-Bayliss\n\nNEW YORK (Reuters) -Carl Icahn secured a seat on Thursday for one of his three nominees to the board of gene sequencing machine maker Illumina Inc, a partial victory for the activist investor who is struggling to burnish his credentials following a shortseller attack on his company.\n\nIllumina said Icahn nominee Andrew Teno won enough shareholder votes for election, confirming an earlier Reuters report. He will take the seat of board Chairman John Thompson, who failed to win reelection.\n\nIllumina's market value of $30 billion made the fight this year's largest proxy contest to go to a shareholder vote. Its shares closed down 9% at $193.53 on Thursday after Icahn failed in his bid to change the company's management by also ousting Chief Executive Francis deSouza from the board.\n\nIcahn had accused Illumina of poor oversight, especially with regard to its $7.1 billion acquisition of cancer test maker Grail. Illumina completed the deal despite opposition from U.S. and European antitrust regulators, who are now trying to force the company to unwind it. Icahn argued that Illumina lost $50 billion in value following the deal because investors worry that the company will be forced to divest Grail at a big loss.\n\nIcahn is battling to restore Wall Street's confidence in his investment acumen. Shares of investment company Icahn Enterprises LP have lost 60% of their value since May 2, when a Hindenburg Research report accused it of artificially inflating its dividend yield and the value of its assets. Icahn has denied the claims.\n\nIcahn Enterprises shares lost another 14% on Thursday, reaching their lowest level since 2004, after hedge fund veteran William Ackman tweeted more criticism about the company's finances.\n\nIcahn rejected an offer from Illumina earlier this year for a board seat for one of his nominees and another seat for an independent candidate that would have averted the proxy battle.\n\nThat arrangement would not necessarily have been the same as the outcome of the vote, given that it led to Thompson's ouster.\n\n\"I look forward to serving on behalf of all shareholders and stakeholders. I am happy to say that activism is alive and well at Icahn,\" Teno said in a statement.\n\nThe Illumina board battle was one of the first conducted under the U.S. Securities and Exchange Commission's universal proxy rules, which came into force last August. The rules allow shareholders to pick and choose among board director nominees in opposing slates, as opposed to voting only for entire slates. Some companies lobbied against the changes, arguing it favored activist investors.\n\nIllumina shareholders also voted against the pay arrangements of top executives in an another blow to the company. The vote was non-binding, but companies often take up such shareholder rulings. The CEO compensation package for deSouza reached $26.8 million in 2022, up from $14.3 million in 2021, according to a regulatory filing.\n\n(Reporting by Svea Herbst-Bayliss in New York; Editing by Greg Roumeliotis and Bill Berkrot)", "link": "https://finance.yahoo.com/news/icahn-wins-one-board-seat-175901376.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.814, "neg": 0.092, "neu": 0.834, "pos": 0.074}}, {"date": "2023-05-25T17:45:00+00:00", "title": "Icahn Nominee Elected to Illumina’s Board", "content": "Shareholders selected one of the activist investor’s picks, who will replace on the board a director who had served as Illumina’s chairman.", "link": "https://finance.yahoo.com/m/6726738c-a58e-34f0-8784-879167ca2965/icahn-nominee-elected-to.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-05-25T17:25:42+00:00", "title": "Icahn Wins One Board Seat in Illumina Proxy Fight", "content": "(Bloomberg) -- Illumina Inc. shareholders voted to elect a board member nominated by activist shareholder Carl Icahn, a much-needed partial victory for the billionaire as his investment firm grapples with an attack by short-seller Hindenburg Research.\n\nMost Read from Bloomberg\n\nCathie Wood’s ARKK Dumped Nvidia Stock Before $560 Billion Surge Apple Plans to Turn Locked iPhones Into Smart Displays With iOS 17 JPMorgan Tells 1,000 First Republic Employees They'll Lose Their Jobs First Republic’s $35 Million Banker Outearned JPMorgan’s Dimon Before Bust Singapore Dollar at Record High Versus Ringgit on China Worries\n\nAndrew Teno, a portfolio manager at Icahn Capital, will join Illumina’s nine-person board as a director, the company said in a statement Thursday. Teno, one of Icahn’s three nominees, replaces Chairman John Thompson, who had been on Illumina’s board since 2021.\n\nThe other eight directors were re-elected to the board, the statement showed. That includes Illumina Chief Executive Officer Francis deSouza, whom Icahn had sought to oust from the board.\n\n“We would like to welcome Andrew Teno, a portfolio manager at Icahn Capital LP, to the board and look forward to productive and collaborative engagement,” Illumina said in a statement. “We appreciate the constructive shareholder feedback throughout this process and are committed to delivering on our plan to accelerate shareholder value creation.”\n\nIcahn’s Own Battle\n\nTeno’s appointment comes as Icahn Enterprises LP is being targeted by Hindenburg Research, which said in a report this month that the value of the investment firm was inflated and questioned its dividend payouts, a move that Icahn had used on many companies throughout his activism career.\n\nThe report sent Icahn Enterprises shares down more than 50% within weeks costing Icahn $15 billion in his net worth on paper.\n\nThe octogenarian had hit back on the report by calling it self serving. In an interview with Bloomberg News this month, he declined to address Hindenburg and its report directly and said he had other things on his mind including the Illumina proxy battle.\n\nRead more: Carl Icahn Is $15 Billion Poorer After Hunter Becomes the Hunted (1)\n\nIcahn Enterprises also reported that it had been contacted this month by the US Attorney’s Office for the Southern District of New York seeking information on some of its units.\n\nIcahn Nominees\n\nIcahn began pushing for board seats at Illumina in March, criticizing the DNA-sequencing company’s board and management for selling and then later buying back cancer-detection firm Grail Inc. at a higher price. He also blasted the company for going ahead with that transaction despite opposition from European regulators.\n\nTeno was one of Icahn’s three nominees to the Illumina board, alongside Vincent Intrieri, founder of VDA Capital management, and Jesse Lynn, general counsel of Icahn Enterprises.\n\nProxy advisory firm Institutional Shareholder Services had recommended that investors support Teno and withhold support for Thompson, while Glass Lewis & Co. recommended two of Icahn’s nominees.\n\nA proxy statement had revealed that Illumina and Icahn had discussed a settlement that would grant the activist shareholder one board seat while allowing him input on the selection of two additional board members, expanding the board to 11 people. The talks faltered after Icahn asked for the appointment of his two nominees with one independent director.\n\nTeno is also a director on the boards of Crown Holdings Inc. and Southwest Gas Holdings Inc.\n\nMost Read from Bloomberg Businessweek\n\nSergey Brin Has a Secret Plan to Put Airships Back in the Skies Adidas After Yeezy There’s Still Scary Stuff in Sunscreen Trump’s Grip on the GOP Tightens as the Field Widens The Man Who Spends $2 Million a Year to Look 18 Is Swapping Blood With His Father and Son\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/icahn-wins-one-board-seat-172542477.html", "symbols": ["IEP.US", "ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.758, "neg": 0.041, "neu": 0.902, "pos": 0.056}}, {"date": "2023-05-25T15:26:50+00:00", "title": "Bill Ackman Thinks Rival Icahn's Firm Still Overvalued, Nvidia Nears $1 Trillion Market Cap, Freshpet's Largest Shareholder Pushes For Board Overhaul: Today's Top Stories", "content": "Benzinga\n\nBill Ackman Thinks Rival Icahn's Firm Still Overvalued After Hindenburg Report: 'Reminds Me Somewhat Of Archegos'\n\nPershing Square Capital Management founder and CEO Bill Ackman weighed in on billionaire Carl Icahn and his company following the release of a short report by Hindenburg Research. Ackman commented that there were some interesting takeaways from the unfolding situation. Ackman commented on the situation, stating that the key lesson learned is that a controlling shareholder with a small float and significant dividends can cause the company's stock to trade at a large premium to its intrinsic value. He indicated that the best approximation of intrinsic value is the net asset value (NAV) per share.\n\nNvidia Nears $1 Trillion Market Cap: How Much It Needs To Gain Thursday To Hit Milestone\n\nNvidia Corp (NASDAQ: NVDA) stock skyrocketed immediately after the company reported a first-quarter beat and forecast strong revenue growth for the second quarter. Nvidia's market cap based on its after-hours price is about $940 billion, while at the regular session's closing price, its valuation was about $755 billion. For Nvidia to hit the $1 trillion market cap, the stock has to rally to $405.\n\nGrab Co-founder Tan Hooi Ling To Depart By 2023 End\n\nGrab Holdings Limited (NASDAQ: GRAB) co-founder Tan Hooi Ling prepared to relinquish her operational and board roles by 2023 end. Tan will transition into an advisory role with the ride-hailing and food-delivery company. She co-founded Grab with Anthony Tan, Group CEO, in 2012. Tan currently leads Grab's technology organization and is mentoring the next generation of technology leaders.\n\nAirbus Bags Order For 43 Helicopters From Air Corporate, Marks Its Largest Ever Commercial Helicopter Deal In Italy\n\nAirbus SE (OTC: EADSY) (OTC: EADSF) has received a firm order for 43 helicopters from business aviation operator Air Corporate in Italy. The financial terms were not disclosed. The order is Airbus' largest commercial helicopter deal in Italy. The deal was received on the final day of The 2023 European Business Aviation Convention & Exhibition.\n\nPalantir Technologies Powers Ukraine's Digital Transformation in Defense and Reconstruction Efforts\n\nPalantir Technologies Inc (NYSE: PLTR) stock is up Thursday after it disclosed a collaboration with the Ministry of Digital Transformation of Ukraine to support the defense and reconstruction of the country in the wake of the Russian invasion. The deal will pave the way for cooperation in critical areas like cataloging, assessing damage to buildings and infrastructure, and harnessing software to optimize reconstruction. It will support and coordinate a digitally-led reconstruction of Ukraine.\n\nMedtronic Stock Falls After Q4 Earnings and M&A Deal: Here's Why\n\nMedtronic Plc's (NYSE: MDT) Q4 FY23 sales of $8.54 billion, up 5.6% Y/Y as reported and organic, ahead of expectations, beating the consensus of $8.25 billion. The company expects FY24 organic revenue growth of 4.5%-4.5%, with adjusted EPS of $5.00-$5.10, compared to the consensus of $5.20. Medtronic has agreed to acquire Korea-based EOFlow Co Ltd, manufacturer of the EOPatch device — a tubeless, wearable, and fully disposable insulin delivery device.\n\nWhy Dollar Tree Shares Are Plunging Today\n\nDollar Tree Inc (NASDAQ: DLTR) reported first-quarter FY23 sales growth of 6% year-on-year to $7.32 billion, beating the consensus of $7.28 billion. Adjusted EPS of $1.47 missed the consensus of $1.52. Dollar Tree sees Q2 sales of $7 billion - $7.2 billion versus the consensus of $7.15 billion. The company expects Q2 EPS of $0.79 - $0.89, below the consensus of $1.22.\n\nFinancial Times\n\nSoftbank-Backed Arm Eyes Commercial Blockbuster Products Ahead Of IPO, Shelves Flagship Division\n\nSoftbank Group Corp (OTC: SFTBF) (OTC: SFTBY) owned chip designer Arm Ltd eased down on its \"blue sky\" research by shelving a flagship tech division and focusing on more commercially viable products ahead of its public listing. The chipmaker separated Arm Research in 2022 under CEO Rene Haas, which involved downsizing by 15%. Also, the company redeployed more than half the people working in Arm Research into other parts of the organization.\n\nWall Street Journal\n\nFreshpet's Largest Shareholder, Jana Partners, Pushes for Strategic Overhaul\n\nJana Partners plans to launch a proxy battle with Freshpet Inc (NASDAQ: FRPT) and nominate four directors. Jana is the largest shareholder in the pet food company, with an approximate stake of 9.3%. Jana says in the letter that more than half of Freshpet's independent directors \"pursued outside interests with corporate resources and key members of management.\"\n\nBloomberg\n\nVinFast Recalls 999 Of Its First SUVs To US Over Software Issue\n\nVietnamese electric vehicle manufacturer VinFast has recalled 999 sports utility vehicles (SUV) shipped to the U.S. The decision was made after malfunctioning software posed the risk of the car's main screen blanking out. The automaker is expected to produce an over-the-air software update that will help fix the issue.\n\nHere's How Apple Is Making iPhone More Useful Via iOS 17 When Lying Idle And A Lot More\n\nApple Inc (NASDAQ: AAPL) eyed a new interface for iPhones to make them more useful while lying idle via its iOS 17 software update, Dawn, which will reach consumers in 2023. The new interface will show information, including calendar appointments, the weather, and notifications in the style of a smart-home display. Apple plans to showcase the software launch alongside its mixed-reality headset at the Worldwide Developers Conference on June 5.\n\nReuters\n\nCarl Icahn's Power Play at Illumina: Potential Board Changes and Management Overhaul\n\nAccording to undisclosed sources, activist investor Carl Icahn is poised to secure enough shareholder support to place Andrew Teno, an Icahn nominee, to join the board of Illumina Inc (NASDAQ: ILMN). However, it should be noted that the tally has not yet been finalized, and shareholders still have the opportunity to modify their votes before the commencement of the company's annual shareholder meeting on Thursday.\n\nChevron Seeks Profitability Shift with Sale of Congo Operations for $1.5B\n\nChevron Corporation (NYSE: CVX) plans to sell its oil and gas assets in Congo to focus on more profitable production. The Congo assets could fetch up to $1.5 billion. The plan to sell its Congo-based operations is because the energy behemoth wants to shift its focus more towards newer operations and more profitable production.\n\nEV Startup Arrival Gets Hope For Survival From US IRA Subsidies\n\nArrival (NASDAQ: ARVL) reportedly expects its recently disclosed merger deal and significant subsidies from the US Inflation Reduction Act (IRA) to drive its business growth. Last month, the company announced a merger with Kensington Capital Acquisition Corp V (NYSE: KCGI). The merger will allow Arrival access to up to $283 million of cash to build a factory in Charlotte, North Carolina, to develop the company's XL van.\n\nSCMP\n\nAlibaba Gets Better of Amazon: US E-Commerce Giant Prepares To Shut China App Store Amid Rivalry and Regulatory Headwinds\n\nAmazon.Com Inc (NASDAQ: AMZN) looks to close its official app store in China on July 17, following plans to shut down its Kindle e-book service in 2022. The company also prepared to discontinue its Amazon Appstore, launched in 2011 as an alternative to Alphabet Inc (NASDAQ: GOOG) (NASDAQ: GOOGL) Google for Android phone users to install apps and games. The company did not provide any reason for the closure.\n\nPhoto by Insider Monkey via Flickr Creative Commons\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Bill Ackman Thinks Rival Icahn's Firm Still Overvalued, Nvidia Nears $1 Trillion Market Cap, Freshpet's Largest Shareholder Pushes For Board Overhaul: Today's Top Stories originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/bill-ackman-thinks-rival-icahns-152650606.html", "symbols": ["7FP.F", "AAPL.US", "AIR.F", "AIR.MC", "AIR.PA", "AIR.XETRA", "AIRA.F", "AMZN.US", "ARVL.US", "CVX.US", "DLTR.US", "EADSF.US", "EADSY.US", "FRPT.US", "GOOG.US", "GOOGL.US", "GRAB.US", "ILMN.US", "KCGI.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.021, "neu": 0.871, "pos": 0.108}}, {"date": "2023-05-25T14:19:13+00:00", "title": "Carl Icahn's Power Play at Illumina: Potential Board Changes and Management Overhaul", "content": "According to undisclosed sources, activist investor Carl Icahn is poised to secure enough shareholder support to place Andrew Teno, an Icahn nominee, to join the board of Illumina Inc (NASDAQ: ILMN).\n\nHowever, it should be noted that the tally has not yet been finalized, and shareholders still have the opportunity to modify their votes before the commencement of the company's annual shareholder meeting on Thursday, Reuters reported.\n\nAlso Read:Carl Icahn Admits Making A Mistake On Bearish Bet, Said He Should Have Kept His Own Advice.\n\nCarl Icahn accused Illuminadirectors of demanding extra personal liability insurance before agreeing to close the $8 billion purchase of cancer screening company Grail Inc as regulators were against the deal.\n\nIcahn, who holds a 1.4% stake in Illumina, has nominated three candidates for the board, which could potentially result in the removal of CEO Francis deSouza and Chairman John Thompson from Illumina's nine-member board.\n\nIn March, Carl Icahn clarified that he wanted management change with former CEO Jay Flatley to return and Grail Inc divested.\n\n\"They should bring Flatley back as CEO immediately,\" Mr. Icahn said in an interview, without specifying whether he has contacted the former CEO about the idea. \"He obviously knows the company and did a good job with it.\"\n\nPrice Action: ILMN shares are down 0.35% at $211.90 premarket on the last check Thursday.\n\nPhoto by Insider Monkey via Flickr Creative Commons\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Carl Icahn's Power Play at Illumina: Potential Board Changes and Management Overhaul originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/carl-icahns-power-play-illumina-141913633.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.978, "neg": 0.041, "neu": 0.823, "pos": 0.136}}, {"date": "2023-05-25T12:58:26+00:00", "title": "Midday movers: Nvidia, Illumina, American Eagle Outfitters and more", "content": "Investing.com -- Stocks are mixed on Thursday as tech gets a boost from Nvidia's strong outlook while Dow stocks are weaker on a lack of resolution in the debt ceiling negotiations. Here are the market movers for May 25.\n\nNVIDIA Corporation (NASDAQ:NVDA) shares jumped 25% after the chip maker forecast $11 billion in revenue in the current quarter because of surging demand for its chips that power artificial intelligence technology, especially the generative chatbots. Shares of Advanced Micro Devices (NASDAQ:AMD) rose 10%, while shares of Intel (NASDAQ:INTC) fell 6.6%. Illumina Inc (NASDAQ:ILMN) shares fell 8.6% as the gene sequencing company heads into a shareholder meeting where investors are going to vote on the outcome of a proxy fight by activist investor Carl Icahn. Shares of  Icahn Enterprises LP (NASDAQ:IEP) fell more than 20%.  American Eagle Outfitters Inc (NYSE:AEO) shares fell 13% after the retailer lowered its revenue outlook to flat to negative compared with its previous forecast for flat to slightly positive. Lower-income shoppers, feeling pinched by inflation, are holding back on apparel purchases.  Dollar Tree Inc (NASDAQ:DLTR) shares fell 15% after the discount retailer fell short of first-quarter expectations and cut its full-year profit outlook.\n\nSnowflake Inc (NYSE:SNOW) shares fell 16% after the cloud computing company gave softer-than-expected guidance for second-quarter revenue after beating estimates for the first quarter.\n\nRelated Articles\n\nMidday movers: Nvidia, Illumina, American Eagle Outfitters and more\n\nIcahn wins one board seat at Illumina\n\nChinese hackers that triggered US alarm hit defence targets -researchers", "link": "https://finance.yahoo.com/news/midday-movers-nvidia-illumina-american-125826629.html", "symbols": ["AEO.US", "AFG.F", "AMD.US", "DLTR.US", "IEP.US", "ILMN.US", "ILU.F", "INTC.US", "NVDA.US", "SNOW.US"], "tags": [], "sentiment": {"polarity": 0.936, "neg": 0.086, "neu": 0.766, "pos": 0.148}}, {"date": "2023-05-25T09:49:21+00:00", "title": "Exclusive-Icahn poised to win at least one seat on Illumina's board -sources", "content": "Activist investor Carl Icahn is set to win enough Illumina Inc shareholder support to install at least one of his three nominees to the gene sequencing machine maker's board, two people familiar with the matter said on Wednesday.", "link": "https://www.reuters.com/article/illumina-icahn/exclusive-icahn-poised-to-win-at-least-one-seat-on-illuminas-board-sources-idUSKBN2XG01N", "symbols": ["IEP.US", "ILMN.US"], "tags": [], "sentiment": {"polarity": 0.765, "neg": 0, "neu": 0.822, "pos": 0.178}}, {"date": "2023-05-25T00:53:22+00:00", "title": "EXCLUSIVE-Icahn poised to win at least one seat on Illumina’s board -sources", "content": "Activist investor Carl Icahn is set to win enough Illumina Inc shareholder support to install at least one of his three nominees to the gene sequencing machine maker’s board, two people familiar with the matter said on Wednesday.", "link": "https://www.reuters.com/article/illumina-icahn/exclusive-icahn-poised-to-win-at-least-one-seat-on-illuminas-board-sources-idUSL8N37L68H", "symbols": ["ILMN.US"], "tags": [], "sentiment": {"polarity": 0.765, "neg": 0, "neu": 0.822, "pos": 0.178}}]