[{"date": "2023-10-12T15:52:17+00:00", "title": "ChatGPT Parent OpenAI Aims At Budget-Friendly AI Innovations,  Novo Nordisk's Popular Diabetes Drug Ozempic Faces Counterfeit Threat in Germany: Today's Top Stories", "content": "Bloomberg\n\nApple and Suppliers Face Unanticipated Sales Slump Despite New Launches\n\nIn a surprising turn of events, Apple Inc (NASDAQ: AAPL) and its key suppliers in Taiwan are facing a significant sales slump despite the recent launch of the new iPhone and various Android devices. Taiwan Semiconductor Manufacturing Co (NYSE: TSM), the leading contract chipmaker, experienced a 13.4% sales drop, a figure that, while concerning, is better than initially feared.\n\nArm's Chinese Fortunes in Jeopardy? Inside the Rise of Borui Jingxin\n\nArm Holdings Plc (NASDAQ: ARM), a leading British semiconductor firm, is facing a potential challenge in its largest market. Several of its critical former employees from its Chinese venture have founded a new chip design company, Borui Jingxin, with the support of the local government. This move comes after Arm raised $5 billion in an initial public offering.\n\nBenzinga\n\nGoldman Sachs Divests GreenSky Platform To Sixth Street-Led Consortium, Anticipates Earnings Impact In Q3\n\nGoldman Sachs Group Inc (NYSE: GS) plans to sell the GreenSky platform and associated loan assets to a consortium of institutional investors led by Sixth Street. Goldman did not disclose the selling price. Goldman is poised to absorb an instant blow to its third-quarter earnings as a direct fallout from the GreenSky transaction. The deal will result in a $(0.19) earnings per share impact on Goldman Sachs' Q3, expected next week.\n\n500% Gain In Premarket Session - Here's Why Precision Medicine OpGen Stock Is Soaring\n\nOpGen Inc (NASDAQ: OPGN) stock is trading higher following two SEC filings from the precision medicine company. The company has received an advanced payment of €750,000 related to the sale of certain Unyvero A50 systems by Curetis to a strategic partner. OpGen also announced a Preferred Stock Purchase Agreement. It signed an agreement with a certain investor to acquire 1,000 shares priced at $1,000 each, with gross proceeds of $1 million.\n\nStory continues\n\nReuters\n\nChatGPT Parent OpenAI Aims At Budget-Friendly AI Innovations To Bring Down Costs\n\nChatGPT parent OpenAI will showcase significant enhancements for developers in the coming month. These updates aim to reduce the cost and increase the speed of creating software applications, marking a strategic move to attract more businesses to integrate its AI technology. Introducing memory storage to developer tools is a pivotal update, promising a drastic cost reduction for application creators.\n\nWill Illumina Give Up Cancer Test Maker Grail? Mulls $8B Acquisition's Fate Amid Antitrust Pressure\n\nIllumina Inc (NASDAQ: ILMN) reportedly said it will divest its controversial acquisition of Grail as expeditiously as possible if the life sciences company loses either of the final appeals in U.S. or European courts. Illumina is expected to get an order from EU antitrust later this week to sell Grail, which develops blood-based early cancer detection tests.\n\nNovo Nordisk's Popular Diabetes Drug Ozempic Faces Counterfeit Threat in Germany\n\nGermany's federal drug regulator, BfArM, has warned pharmacies and drug distributors in response to discovering counterfeit batches of Novo Nordisk's (NYSE: NVO) diabetes medication, Ozempic. Last week, authorities in the southwestern city of Freiburg's vicinity disclosed the discovery of counterfeit Ozempic but withheld specific details to protect an ongoing investigation by prosecutors. According to BfArM, the counterfeit injection pens closely resemble the authentic ones in terms of packaging but can be easily distinguished when compared to the design of the original product.\n\nEarnings\n\nDomino's Pizza Reports Q3 Earnings\n\nDomino's Pizza Inc (NYSE: DPZ) reported a third-quarter FY23 sales decline of 3.9% year-on-year to $1.03 billion, missing the analyst consensus of $1.05 billion. The revenue decrease was primarily due to lower supply chain and U.S. Company-owned store revenues. The decline in supply chain revenues was attributable to reduced market basket pricing to stores and lower order volumes. Domino's sees FY23 global net store growth to trend at or slightly below the low-end of its 5% to 7% two- to three-year outlook.\n\nWalgreens Q4 Profit, Annual Outlook Falls Short Of Expectations On Lower Demand For Covid Vaccines, Tests\n\nWalgreens Boots Alliance Inc's (NASDAQ:WBA) Q4 FY23 sales increased 9.2% Y/Y to $35.4 billion, up 8.3% on a constant currency basis, beating the consensus of $34.82 billion. Adjusted EPS decreased 18% to $0.67, reflecting a 23.5% headwind from significantly lower COVID-19 vaccine and testing volumes, missing the consensus of $0.69. Walgreens Boots Alliance forecasts FY24 adjusted EPS of $3.20-$3.50 compared to the consensus Of $3.73, and down from $3.98 in FY23.\n\nDelta Air Lines Reports Q3 Earnings\n\nDelta Air Lines Inc (NYSE: DAL) reported a Q3 FY23 adjusted operating revenue growth of 13% Y/Y to $14.55 billion and operating revenue of $15.49 billion, beating the consensus of $14.54 billion. Total passenger revenue was $13.1 billion, a 14% increase Y/Y. Cargo revenue decreased 36% Y/Y to $154 million. Delta Air Lines expects Q4 revenue growth of 9% - 12%, adjusted EPS of $1.05 - $1.30 versus $1.11 estimate and an adjusted operating margin of 9% - 11%.\n\nInfosys Reports Q2 Earnings\n\nInfosys Ltd (NYSE:INFY) reported second-quarter revenue growth of 3.6% year-on-year to $4.72 billion, beating the consensus of $4.61 billion. Revenues in CC terms grew by 2.5% Y/Y and 2.3% Q/Q. TCV of significant deal win was $7.7 billion. FY24 Revenue Outlook: Infosys cuts expectations - expects revenue growth of 1.0% - 2.5% in constant currency (prior 1.0% - 3.5%) vs. consensus $18.71 billion.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article ChatGPT Parent OpenAI Aims At Budget-Friendly AI Innovations, Novo Nordisk's Popular Diabetes Drug Ozempic Faces Counterfeit Threat in Germany: Today's Top Stories originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/chatgpt-parent-openai-aims-budget-155217174.html", "symbols": ["AAPL.US", "ARM.US", "DAL.MX", "DAL.US", "DKOB.F", "DMP.AU", "DMPZF.US", "DMZPY.US", "DOM.LSE", "DPUKY.US", "DPZ.US", "DPZUF.US", "EZV.F", "GOS.F", "GOS.XETRA", "GS-PA.US", "GS-PD.US", "GS-PK.US"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0.061, "neu": 0.836, "pos": 0.104}}, {"date": "2023-10-12T13:30:00+00:00", "title": "How Do Genetic Factors Play a Role in Chronic Pain and Opioid Use Disorder?", "content": "The winner of Illumina's Polygenic Risk Scores Research Grant aims to find out\n\nOriginally published on Illumina News Center\n\nNORTHAMPTON, MA / ACCESSWIRE / October 12, 2023 / Emma Johnson, PhD, assistant professor of Psychiatry at Washington University School of Medicine in St. Louis, was thrilled to win Illumina's Polygenic Risk Scores Research Grant Contest. The grant will provide 1008 samples of the Infinium™ Global Diversity Array with Polygenic Risk Score Content plus Illumina Polygenic Risk Score software-Predict module to generate polygenic risk scores (PRS) for pain and opioid use disorder.\n\n\"Polygenic risk scores represent a person's relative genetic liability for a behavior, disease, or psychiatric disorder, and are created using summary results from genome-wide association studies (GWAS),\" says Johnson. \"In this case, we're interested in using the results from GWAS for chronic pain and opioid use disorder-which have identified genetic variations between people who experience either chronic pain or opioid use disorder and those who don't-and using that data to create polygenic risk scores in a unique and diverse cohort.\"\n\nThe contest received submissions from noteworthy research groups in nine different countries spanning North and South America, Europe, and Asia. Each entry was judged on novelty, feasibility, scientific merit, potential impact on human health, and the authors' previous accomplishments.\n\nWhile chronic pain and opioid use are known to be genetically correlated, previous GWAS never investigated these disorders simultaneously in carefully characterized groups. Instead, the studies focused on the causal relationship between them.\n\nJohnson and collaborator Simon Haroutounian, PhD, chief of the Division of Clinical and Translational Research and chief of Clinical Pain Research at Washington University Pain Center, wondered if genetic factors might influence that relationship. For example, different genetics might affect the reward processes that govern how people perceive pain or respond to opioids.\n\nStory continues\n\n\"Dr. Haroutounian has been studying a unique cohort with deep clinical phenotyping for chronic pain, opioid use, and opioid craving, as well as symptoms of depression and anxiety,\" says Johnson. \"Also, the DNA has already been extracted from this diverse group of 1500 samples. Winning this contest will allow us to genotype just over a thousand of those samples. Then we'll use Illumina's PRS software with the Predict module to create scores for chronic pain and opioid use disorder.\"\n\nIn addition, the team, which also includes collaborator Arpana Agrawal, PhD, will perform a cross-trait multivariate genome-wide study to look at potential genetic factors that are shared across chronic pain and opioid use disorder. From there, they can link these PRS to baseline preoperative pain and acute and chronic postoperative pain, as well as anxiety, depression, pain ratings, and analgesic craving.\n\n\"This was the perfect opportunity to genotype this unique cohort to better understand the relationship between chronic pain, substance use, and other psychosocial factors,\" says Johnson. \"We hope this work will improve the management and treatment of chronic postsurgical pain, eventually giving clinicians a better tool to identify patients who might be at greater risk of developing an opioid use disorder alongside their chronic pain.\"\n\nThe Illumina Polygenic Risk Scores Research Grant was launched to recognize researchers who can drive advances in genetic risk prediction. Although PRS can impact complex disease research and healthcare in various ways, unraveling the complexities of the genome using the full potential of PRS-based research remains a developing field that is rich with opportunities for scientific advancements. To learn more about the contest, click here.\n\nTo learn more about the first genotyping-to-analysis solution from Illumina, click here.\n\nPhoto: Washington University collaborators Simon Haroutounian, PhD and Emma Johnson, Ph\n\nView additional multimedia and more ESG storytelling from Illumina on 3blmedia.com\n\nContact Info:\r\nSpokesperson: Illumina\r\nWebsite: https://www.3blmedia.com/profiles/illumina\r\nEmail: info@3blmedia.com\n\nSOURCE: Illumina\n\nView source version on accesswire.com: \r\nhttps://www.accesswire.com/792341/how-do-genetic-factors-play-a-role-in-chronic-pain-and-opioid-use-disorder", "link": "https://finance.yahoo.com/news/genetic-factors-play-role-chronic-133000027.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.9, "neg": 0.131, "neu": 0.751, "pos": 0.117}}, {"date": "2023-10-12T10:38:00+00:00", "title": "Illumina Ordered by EU to Unwind Grail Acquisition", "content": "The life-sciences maker must unwind its $7.1 billion acquisition of the cancer-test developer, the European Union’s competition watchdog said.\n\nContinue reading", "link": "https://finance.yahoo.com/m/fe86c696-429a-34b2-a092-76a84d58f09a/illumina-ordered-by-eu-to.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-12T10:36:45+00:00", "title": "EU orders biotech giant Illumina to unwind $7.1 billion purchase of cancer-screening company Grail", "content": "BRUSSELS (AP) — The European Union on Thursday ordered U.S. biotech giant Illumina to undo its $7.1 billion purchase of cancer-screening company Grail because it closed the deal without approval of regulators in the 27-nation bloc.\n\nThe EU already slapped a $475 million fine on Illumina over the summer for jumping the gun on the acquisition without its consent. Now, the order to unwind the deal “restores competition in the development of early cancer detection tests,” EU antitrust Commissioner Didier Reynders said.\n\n“By ordering Illumina to restore Grail’s independence, we ensure a level playing field in this crucial market to the ultimate benefit of European consumers,” he said.\n\nIllumina said it is reviewing the order to sell Grail. The company also has previously asked the EU’s highest court to rule on its challenge to the bloc's ability to review the merger.\n\nAllowing the deal to stand would have undermined the credibility of EU regulators. Companies almost invariably play by the rules and wait to complete an acquisition or merger until antitrust authorities have cleared it, according to the European Commission, the EU’s executive arm and top antitrust enforcer.\n\nIllumina announced the acquisition of Grail in 2020, but the commission said the company broke EU merger rules by completing the deal without its consent. The commission prohibited the deal in September 2022.\n\nThe EU accused Illumina and Grail of knowingly and deliberately merging before getting clearance in what amounted to a vital infringement of the rules.\n\nIllumina must “restore the situation prevailing before” the acquisition, regulators said, and how Illumina divests itself of Grail also needs EU approval.\n\nRegulators worldwide have targeted the deal. The Federal Trade Commission ordered Illumina to sell Grail earlier this year after finding the merger would “stifle competition and innovation in the U.S. market for life-saving cancer tests.”\n\nThe EU said the acquisition would squeeze out competitors and give Illumina too dominant of a position in the market.\n\nSan Diego-based Illumina is a major supplier of next-generation sequencing systems for genetic and genomic analysis, while Grail is a health company developing blood tests to try to catch cancer early.", "link": "https://finance.yahoo.com/news/eu-orders-biotech-giant-illumina-103645448.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.924, "neg": 0.086, "neu": 0.847, "pos": 0.067}}, {"date": "2023-10-12T09:56:36+00:00", "title": "Illumina ordered by EU antitrust regulators to sell Grail", "content": "By Foo Yun Chee\n\nBRUSSELS (Reuters) - U.S. genetic testing company Illumina has been ordered by EU antitrust regulators to sell cancer test maker Grail after it completed the deal before securing their approval.\n\nAntitrust watchdogs on both sides of the Atlantic have sharpened their scrutiny of pharma and biotech deals in recent years on fears that some of these may stifle innovation and reduce competition in the sector.\n\nThe gun-jumping cost Illumina a record EU antitrust fine of 432 million euros ($457 million) for such an offence.\n\nThe EU competition enforcer subsequently blocked the $7.1 billion deal in 2022 on concerns that Illumina would have an incentive to stop Grail's rivals from accessing its technology to develop competing blood-based early cancer detection tests.\n\n\"With today's decision, the Commission has adopted restorative measures requiring Illumina to divest Grail and restore the situation prevailing before the completion of the acquisition,\" the European Commission said in a statement on Thursday, confirming a Reuters story.\n\nThe EU watchdog ordered Illumina to restore Grail's independence to the same level as prior to its acquisition and to ensure that it is as viable and competitive as before the takeover.\n\nIllumina can choose to divest Grail via a trade sale, a capital markets transaction or other methods, but must do it within strict deadlines.\n\nThe company must keep Grail separate and viable until the sale is completed.\n\nIllumina said that it was currently reviewing the divestment order.\n\nThe company has sued the EU watchdog for blocking the deal, its decision to examine the case despite not meeting the EU merger criteria, an order to keep Grail separate so that it can unwind the deal and the gun-jumping decision.\n\n(Reporting by Foo Yun Chee; editing by Philip Blenkinsop)", "link": "https://finance.yahoo.com/news/illumina-ordered-eu-antitrust-regulators-095636026.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.535, "neg": 0.052, "neu": 0.898, "pos": 0.05}}, {"date": "2023-10-11T20:22:51+00:00", "title": "UPDATE 2-Illumina to divest cancer test maker Grail if it loses US or EU court appeal", "content": "(Adds details on divestiture in paragraph 2, background throughout)\n\nOct 11 (Reuters) - Illumina Inc said on Wednesday it will divest cancer test maker Grail as expeditiously as possible if the life sciences company loses either of the final appeals in U.S. or European courts.\n\nThe company also said that if it wins both the cases, it will reassess Grail's assets, which might result in integrating or divesting part or the entire unit. Reuters reported on Tuesday that Illumina is expected to get an order from EU antitrust later this week to sell Grail, which develops blood-based early cancer detection tests.\n\nIllumina completed its $7.1 billion takeover of Grail in August 2021, despite opposition from the European and U.S. regulators, and was fined a record 432 million euros ($458.65 million) by the EU earlier this year over the deal. The deal was opposed on concerns that the takeover would stifle competition in the U.S. market, giving Illumina an incentive to cut off Grail's rivals from accessing the genetic testing company's technology to develop early cancer detection tests.\n\nThe U.S. Federal Trade Commission (FTC) has also ordered Illumina to divest Grail, which the San Diego, California-based company appealed against in June.\n\nThe FTC, which enforces antitrust law in the United States, first filed a complaint in March 2021 to stop Illumina's bid for its former subsidiary, Grail.\n\nIn 2016, Illumina had spun off Grail, and retained a 12% stake. ($1 = 0.9419 euros) (Reporting by Sriparna Roy in Bengaluru; Editing by Shinjini Ganguli)", "link": "https://finance.yahoo.com/news/1-illumina-divest-grail-loses-202251730.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.869, "neg": 0.081, "neu": 0.866, "pos": 0.053}}, {"date": "2023-10-11T20:18:11+00:00", "title": "Illumina to divest cancer test maker Grail if it loses US or EU court appeal", "content": "(Reuters) -Illumina Inc said on Wednesday it will divest cancer test maker Grail as expeditiously as possible if the life sciences company loses either of the final appeals in U.S. or European courts.\n\nThe company also said that if it wins both the cases, it will reassess Grail's assets, which might result in integrating or divesting part or the entire unit.\n\nReuters reported on Tuesday that Illumina is expected to get an order from EU antitrust later this week to sell Grail, which develops blood-based early cancer detection tests.\n\nIllumina completed its $7.1 billion takeover of Grail in August 2021, despite opposition from the European and U.S. regulators, and was fined a record 432 million euros ($458.65 million) by the EU earlier this year over the deal.\n\nThe deal was opposed on concerns that the takeover would stifle competition in the U.S. market, giving Illumina an incentive to cut off Grail's rivals from accessing the genetic testing company's technology to develop early cancer detection tests.\n\nThe U.S. Federal Trade Commission (FTC) has also ordered Illumina to divest Grail, which the San Diego, California-based company appealed against in June.\n\nThe FTC, which enforces antitrust law in the United States, first filed a complaint in March 2021 to stop Illumina's bid for its former subsidiary, Grail.\n\nIn 2016, Illumina had spun off Grail, and retained a 12% stake.\n\n($1 = 0.9419 euros)\n\n(Reporting by Sriparna Roy in Bengaluru; Editing by Shinjini Ganguli)", "link": "https://finance.yahoo.com/news/illumina-divest-grail-loses-final-201811431.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.869, "neg": 0.085, "neu": 0.86, "pos": 0.055}}, {"date": "2023-10-11T20:05:00+00:00", "title": "Illumina Posted a Stewardship-Focused Presentation for Investors", "content": "SAN DIEGO, Oct. 11, 2023 /PRNewswire/ -- Illumina, Inc. (NASDAQ:ILMN) posted a stewardship-focused presentation for investors on the Events & Presentations section of its investor relations website, investor.illumina.com, on Wednesday, October 11, 2023. Members of Illumina's Board of Directors and senior management may use this presentation during meetings with investors.\n\nAbout Illumina\n\nIllumina is improving human health by unlocking the power of the genome. In 2023, we celebrate 25 years of innovation, which has established us as a global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and connect with us on Twitter, Facebook, LinkedIn, Instagram, TikTok and YouTube.\n\nInvestors:\r\nSalli Schwartz\r\n+1.858.291.6421\r\nir@illumina.com\n\nMedia:\r\nDavid McAlpine\r\n+1.347.327.1336\r\npr@illumina.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/illumina-posted-a-stewardship-focused-presentation-for-investors-301954069.html\n\nSOURCE Illumina, Inc.", "link": "https://finance.yahoo.com/news/illumina-posted-stewardship-focused-presentation-200500545.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.886, "neg": 0, "neu": 0.925, "pos": 0.075}}, {"date": "2023-10-10T21:26:17+00:00", "title": "Illumina to get EU order on Thursday to divest Grail, source says", "content": "By Foo Yun Chee\n\nBRUSSELS, Oct 10 (Reuters) - U.S. genetic testing company Illumina will on Thursday get an order from EU antitrust regulators to sell cancer test maker Grail, a year after the $7.1 billion deal was blocked, a person with direct knowledge of the matter said on Tuesday.\n\nThe European Commission vetoed the deal, concerned that Illumina would have an incentive to cut off Grail's rivals from accessing its technology to develop blood-based early cancer detection tests to compete with Grail.\n\nThe EC did not immediately respond to a request for comment.\n\nThe EU competition enforcer slapped a record 432 million-euro ($458 million) fine on Illumina in July for closing the deal before securing the regulatory green light.\n\nIllumina has challenged the EU veto of the deal, its decision to examine the deal despite not meeting the EU merger criteria and the EU order to keep Grail separate so that it can unwind the deal.\n\nThe U.S. Federal Trade Commission (FTC) has also ordered Illumina to divest Grail, which Illumina has appealed. ($1 = 0.9430 euro) (Reporting by Foo Yun Chee in Brussels Editing by Matthew Lewis)", "link": "https://finance.yahoo.com/news/illumina-eu-order-thursday-divest-212617059.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.827, "neg": 0.073, "neu": 0.887, "pos": 0.039}}, {"date": "2023-10-10T15:45:00+00:00", "title": "Q&amp;A: An Illumina Intern’s Shift From Academia to Industry", "content": "What's it like to step into the corporate world? One student describes her summer experience\n\nOriginally published on Illumina News Center\n\nNORTHAMPTON, MA / ACCESSWIRE / October 10, 2023 / When Adee Newman started her summer as a research associate Intern at Illumina in June 2023, she had no prior industry experience. Originally from Palo Alto, California, she spent two years at De Anza College before transferring to University of California, San Diego (UCSD). Currently, she is a master's student in biology with a research emphasis of epigenetics and genomics at UCSD.\n\nNewman's internship was based in San Diego, but she was able to work remotely. We caught up with her at the end of her internship last month to hear about her experience.\n\nHow did you first become aware of Illumina? Why did you apply for an internship?\r\nAdee Newman: We use Illumina sequencers in the lab that I do research in, which is how I first learned about Illumina. I saw a few ads for the internship on LinkedIn and Handshake and applied when I got a message from a recruiter. I was curious about experiencing industry so I can make an informed decision about my next career decision-so this felt like the perfect opportunity!\n\nHas anything surprised you about working in industry?\r\nAN: I wasn't sure what to expect the day-to-day to be like, but it has been wonderful. I appreciate the independent work, but it doesn't get lonely either, as we collaborate a lot. I've learned about organizational structures and various other career paths. There is no \"right way\" to go about your career path and you should keep an open mind when you are starting out! In speaking with people within the company I've received a lot of advice and fresh perspectives, which is unbelievably valuable to me at this point in my career.\n\nWhat kind of work are you doing?\r\nAN: I'm interning with the Clinical Affairs team and I've learned so much about clinical trials. My internship project was creating a process map of all the actions and activities that are required during a clinical trial, as well as reviewing the standard operating procedures and work instructions for the various activities. I also met with subject matter experts from various Clinical Affairs teams-protocol and clinical study report writing from Medical Writing, data handling from Clinical Data Management, and others-to better understand the process and better create a process map.\n\nStory continues\n\nWhat did you learn about clinical trials?\r\nAN: My favorite thing I learned is that we're able to have a direct impact on people and health outcomes much sooner just with how clinical trials work-it's so complex and has so much cross-functional collaboration, it basically looks like a Chutes and Ladders game. You can take some steps that can move you through the board faster, but if someone wants to change something or if there's an issue with a specific aspect, you might hit a chute and it could take you back almost to the start! Because of that, teamwork and collaboration are extremely important, and I love that about Clinical Affairs.\n\nAre you interested in pursuing any specific area in biotech? \r\nAN: I'd love to work on and support various clinical trials that focus on improving aspects of human health on a large scale. I think it would be amazing to work on a project that would help or provide a solution for a problem that affects a large population. It would also be great to work on oncology and companion diagnostics.\n\nHas your internship experience helped you determine the next steps in your career?\r\nAN: Yes! Hearing everyone's experiences has helped me decide that I will likely work for a few years before deciding if I want to continue or go back to academia. If you want to pursue academia, you should be passionate about it-otherwise it may not be the right career choice for you.\n\nWhat advice would you give students contemplating moving from academia to industry?\r\nAN: Give it a try! If you are curious about it, you should experience it for yourself so you know what you will be doing. It's one thing to hear from people, but another thing to see it for yourself. Don't be scared of stepping out of your comfort zone.\n\nIllumina's internship program introduces students to the corporate world while remaining centered around learning: learning about yourself, learning about the biotech and genomics industries, and learning from experienced professionals and leaders in your field. Each summer, our interns apply their knowledge to impactful projects and discover the various career paths available to them. The hands-on work, professional development workshops, and simple conversations with mentors and peers can influence one's path forward. Interested in experiencing life at Illumina? For more information about our summer internship program, please visit our intern careers page.\n\nA group of interns during a two-day meeting at Illumina's San Diego headquarters.\n\nView additional multimedia and more ESG storytelling from Illumina on 3blmedia.com.\n\nContact Info:\r\nSpokesperson: Illumina\r\nWebsite: https://www.3blmedia.com/profiles/illumina\r\nEmail: info@3blmedia.com\n\nSOURCE: Illumina\n\nView source version on accesswire.com: \r\nhttps://www.accesswire.com/791659/qa-an-illumina-interns-shift-from-academia-to-industry", "link": "https://finance.yahoo.com/news/q-illumina-intern-shift-academia-154500693.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.01, "neu": 0.845, "pos": 0.145}}, {"date": "2023-10-10T15:40:10+00:00", "title": "LGND vs. ILMN: Which Stock Should Value Investors Buy Now?", "content": "Investors looking for stocks in the Medical - Biomedical and Genetics sector might want to consider either Ligand Pharmaceuticals (LGND) or Illumina (ILMN). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look.\n\nThere are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The Zacks Rank favors stocks with strong earnings estimate revision trends, and our Style Scores highlight companies with specific traits.\n\nRight now, Ligand Pharmaceuticals is sporting a Zacks Rank of #1 (Strong Buy), while Illumina has a Zacks Rank of #4 (Sell). This means that LGND's earnings estimate revision activity has been more impressive, so investors should feel comfortable with its improving analyst outlook. But this is just one factor that value investors are interested in.\n\nValue investors are also interested in a number of tried-and-true valuation metrics that help show when a company is undervalued at its current share price levels.\n\nThe Style Score Value grade factors in a variety of key fundamental metrics, including the popular P/E ratio, P/S ratio, earnings yield, cash flow per share, and a number of other key stats that are commonly used by value investors.\n\nLGND currently has a forward P/E ratio of 11.56, while ILMN has a forward P/E of 165.51. We also note that LGND has a PEG ratio of 0.58. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. ILMN currently has a PEG ratio of 7.46.\n\nAnother notable valuation metric for LGND is its P/B ratio of 1.53. The P/B is a method of comparing a stock's market value to its book value, which is defined as total assets minus total liabilities. By comparison, ILMN has a P/B of 3.32.\n\nStory continues\n\nThese are just a few of the metrics contributing to LGND's Value grade of B and ILMN's Value grade of D.\n\nLGND is currently sporting an improving earnings outlook, which makes it stick out in our Zacks Rank model. And, based on the above valuation metrics, we feel that LGND is likely the superior value option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nLigand Pharmaceuticals Incorporated (LGND) : Free Stock Analysis Report\n\nIllumina, Inc. (ILMN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/lgnd-vs-ilmn-stock-value-154010701.html", "symbols": ["ILMN.US", "ILU.F", "LGDN.F", "LGND.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.004, "neu": 0.736, "pos": 0.26}}, {"date": "2023-10-10T04:02:36+00:00", "title": "Israel imposes ‘complete siege’ on Gaza", "content": "This is an audio transcript of the FT News Briefing podcast episode: ‘Israel imposes “complete siege” on Gaza’[MUSIC PLAYING]Marc Filippino Good morning from the Financial Times. Today is Tuesday, October 10th, and this is your FT News Briefing.\n\nContinue reading", "link": "https://finance.yahoo.com/m/fdd8bbd0-0549-38f5-b7bc-55bb2a2f72f6/israel-imposes-%E2%80%98complete.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.361, "neg": 0.033, "neu": 0.898, "pos": 0.069}}]