[{"date": "2023-09-05T20:15:57+00:00", "title": "Illumina Picks New CEO, but Shares Continue To Slide", "content": "Illumina on Tuesday named Agilent Technologies' Jacob Thaysen its CEO after a proxy battle with activist investor Carl Icahn led former head Francis deSouza to resign.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d29a0bbd-d386-3e47-aeea-b14d87692e63/illumina-picks-new-ceo%2C-but.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.612, "neg": 0.167, "neu": 0.833, "pos": 0}}, {"date": "2023-09-05T19:47:00+00:00", "title": "Illumina: Company Investigated by the Portnoy Law Firm", "content": "Investors can contact the law firm at no cost to learn more about recovering their losses\n\nLOS ANGELES, Sept.  05, 2023  (GLOBE NEWSWIRE) -- The Portnoy Law Firm advises Illumina, Inc. (\"Illumina\" or \"the Company\") (NASDAQ:ILMN) investors that the firm has initiated an investigation into possible securities violations and may file a class action on behalf of investors. Illumina investors that lost money on their investment are encouraged to contact Lesley Portnoy, Esq.\n\nInvestors are encouraged to contact attorney Lesley F. Portnoy, by phone 844-767-8529 or email: lesley@portnoylaw.com, to discuss their legal rights, or click here to join the case via www.portnoylaw.com. The Portnoy Law Firm can provide a complimentary case evaluation and discuss investors’ options for pursuing claims to recover their losses.\n\nThe company is being investigated for potential breaches of fiduciary duty on the part of its directors and management.\n\nPlease visit our website to review more information and submit your transaction information.\n\nThe Portnoy Law Firm represents investors in pursuing claims against caused by corporate wrongdoing. The Firm’s founding partner has recovered over $5.5 billion for aggrieved investors. Attorney advertising. Prior results do not guarantee similar outcomes.\n\nLesley F. Portnoy, Esq.\r\nAdmitted CA and NY Bar\r\nlesley@portnoylaw.com\r\n310-692-8883\r\nwww.portnoylaw.com\n\nAttorney Advertising", "link": "https://www.globenewswire.com/news-release/2023/09/05/2737844/0/en/Illumina-Company-Investigated-by-the-Portnoy-Law-Firm.html", "symbols": ["ILMN.US"], "tags": ["$ILMN", "CLASS ACTION", "LAW & LEGAL ISSUES", "PORTNOY LAW"], "sentiment": {"polarity": 0.228, "neg": 0.067, "neu": 0.854, "pos": 0.08}}, {"date": "2023-09-05T16:44:21+00:00", "title": "Markets Fall at Midday Amid Oil and Interest Rate Concerns", "content": "U.S. equities declined at midday on Tuesday, Sept. 5, 2023 amid worries about higher oil prices and interest rates.\n\nContinue reading", "link": "https://finance.yahoo.com/m/5caab7d6-3738-3efd-9563-c59a7f07810d/markets-fall-at-midday-amid.html", "symbols": ["GSPC.INDX", "ILMN.US", "ILU.F", "NTA.F", "NTAP.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0.113, "neu": 0.766, "pos": 0.121}}, {"date": "2023-09-05T15:40:07+00:00", "title": "EXEL vs. ILMN: Which Stock Is the Better Value Option?", "content": "Investors looking for stocks in the Medical - Biomedical and Genetics sector might want to consider either Exelixis (EXEL) or Illumina (ILMN). But which of these two stocks presents investors with the better value opportunity right now? Let's take a closer look.\n\nThere are plenty of strategies for discovering value stocks, but we have found that pairing a strong Zacks Rank with an impressive grade in the Value category of our Style Scores system produces the best returns. The proven Zacks Rank puts an emphasis on earnings estimates and estimate revisions, while our Style Scores work to identify stocks with specific traits.\n\nExelixis and Illumina are sporting Zacks Ranks of #2 (Buy) and #4 (Sell), respectively, right now. This means that EXEL's earnings estimate revision activity has been more impressive, so investors should feel comfortable with its improving analyst outlook. But this is just one factor that value investors are interested in.\n\nValue investors also try to analyze a wide range of traditional figures and metrics to help determine whether a company is undervalued at its current share price levels.\n\nOur Value category highlights undervalued companies by looking at a variety of key metrics, including the popular P/E ratio, as well as the P/S ratio, earnings yield, cash flow per share, and a variety of other fundamentals that have been used by value investors for years.\n\nEXEL currently has a forward P/E ratio of 23.10, while ILMN has a forward P/E of 202.05. We also note that EXEL has a PEG ratio of 1.12. This popular metric is similar to the widely-known P/E ratio, with the difference being that the PEG ratio also takes into account the company's expected earnings growth rate. ILMN currently has a PEG ratio of 9.10.\n\nAnother notable valuation metric for EXEL is its P/B ratio of 2.86. Investors use the P/B ratio to look at a stock's market value versus its book value, which is defined as total assets minus total liabilities. By comparison, ILMN has a P/B of 4.06.\n\nStory continues\n\nThese are just a few of the metrics contributing to EXEL's Value grade of B and ILMN's Value grade of D.\n\nEXEL sticks out from ILMN in both our Zacks Rank and Style Scores models, so value investors will likely feel that EXEL is the better option right now.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nExelixis, Inc. (EXEL) : Free Stock Analysis Report\n\nIllumina, Inc. (ILMN) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/exel-vs-ilmn-stock-better-154007790.html", "symbols": ["EX9.F", "EXEL.US", "ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.004, "neu": 0.766, "pos": 0.23}}, {"date": "2023-09-05T15:35:34+00:00", "title": "Is Illumina (ILMN) Too Good to Be True? A Comprehensive Analysis of a Potential Value Trap", "content": "Value-focused investors are always on the hunt for stocks that are priced below their intrinsic value. One such stock that merits attention is Illumina Inc (NASDAQ:ILMN). The stock, which is currently priced at $161.2, recorded a loss of 4.31% in a day and a 3-month decrease of 23.3%. The stock's fair valuation is $337.35, as indicated by its GF Value.\n\nUnderstanding the GF Value\n\nWarning! GuruFocus has detected 6 Warning Signs with ILMN. Click here to check it out.  ILMN 30-Year Financial Data The intrinsic value of ILMN\n\nThe GF Value represents the current intrinsic value of a stock derived from our exclusive method. The GF Value Line on our summary page gives an overview of the fair value that the stock should be traded at. It is calculated based on three factors:\n\nHistorical multiples (PE Ratio, PS Ratio, PB Ratio and Price-to-Free-Cash-Flow) that the stock has traded at. GuruFocus adjustment factor based on the company's past returns and growth. Future estimates of the business performance.\n\nWe believe the GF Value Line is the fair value that the stock should be traded at. If the stock price is significantly above the GF Value Line, it is overvalued and its future return is likely to be poor. On the other hand, if it is significantly below the GF Value Line, its future return will likely be higher. Is Illumina (ILMN) Too Good to Be True? A Comprehensive Analysis of a Potential Value Trap\n\nScrutinizing the Risks\n\nHowever, investors need to consider a more in-depth analysis before making an investment decision. Despite its seemingly attractive valuation, certain risk factors associated with Illumina (NASDAQ:ILMN) should not be ignored. These risks are primarily reflected through its low Piotroski F-score and high Beneish M-score. These indicators suggest that Illumina, despite its apparent undervaluation, might be a potential value trap. This complexity underlines the importance of thorough due diligence in investment decision-making.\n\nCompany Overview\n\nIllumina provides tools and services to analyze genetic material with life science and clinical lab applications. The company generates over 90% of its revenue from sequencing instruments, consumables, and services. Illumina's high-throughput technology enables whole genome sequencing in humans and other large organisms. Its lower throughput tools enable applications that require smaller data outputs, such as viral and cancer tumor screening. Illumina also sells microarrays (less than 10% of sales) that enable lower-cost, focused genetic screening with primarily consumer and agricultural applications.\n\nStory continues\n\nDespite the promising fair value of $337.35, Illumina's stock is currently priced at $161.2. This discrepancy, coupled with the company's low Piotroski F-score and high Beneish M-score, warrants a cautious approach. Is Illumina (ILMN) Too Good to Be True? A Comprehensive Analysis of a Potential Value Trap\n\nConclusion\n\nIn conclusion, while Illumina (NASDAQ:ILMN) appears to be undervalued at first glance, the potential risks associated with the stock suggest that it might be a value trap. The low Piotroski F-score and high Beneish M-score are red flags that investors should not ignore. Therefore, a prudent approach would be to conduct thorough due diligence before making an investment decision.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/illumina-ilmn-too-good-true-153534909.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.985, "neg": 0.085, "neu": 0.769, "pos": 0.146}}, {"date": "2023-09-05T15:33:00+00:00", "title": "Illumina Names Jacob Thaysen as New CEO", "content": "Jacob Thaysen was named to the role after Francis deSouza resigned from the gene-sequencing maker in June amid a fight with regulators.\n\nContinue reading", "link": "https://finance.yahoo.com/m/52eaca92-7545-325a-8c9c-429d844c3f98/illumina-names-jacob-thaysen.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.557, "neg": 0.18, "neu": 0.82, "pos": 0}}, {"date": "2023-09-05T14:36:52+00:00", "title": "Lowe's and Oracle upgrades, Illumina CEO: Market Movers", "content": "Stocks trend lower this morning entering the first trading of September, a historically weak month for markets. Lowe's (LOW) stock received an upgrade to Outperform from Bernstein analysts. Oracle (ORCL) shares are rising after Barclays upgraded the stock on the software company's cloud outlook amid AI trends. Illumina (ILMN) names Former Agilent (A) Vice President Jacob Thaysen as its new CEO.\n\nYahoo Finance Live details several trending stocks after Tuesday's opening bell.\n\nVideo Transcript\n\nBRAD SMITH: Stocks are lower to start off this holiday-abbreviated week. Investors could be in for a challenging few weeks ahead with September, historically, the weakest month for equities.\n\nThere's also plenty of data on the docket ahead for the Fed's September policy meeting.\n\nJULIE HYMAN: And on an individual basis, watching shares of Lowe's this morning. Bernstein upgrading the home improvement chain to outperform from market perform. Analysts there Dean Rosenblum saying in a note, he now sees an influx of positive trends that could expand the company's margins in the next two years.\n\nHe added that Lowe's growth could outpace that of competitor Home Depot. And the shares not getting the benefit here this morning.\n\nBRAD SMITH: Yeah. We're also watching Oracle after Barclays upgraded the stock from equal-weight to overweight and raised its price target to $150 citing the company's multi-year growth story. In a note, analysts saying that the giant's Cloud Infrastructure in this business partly fueled by emerging AI opportunities will be a key to the overall story.\n\nJULIE HYMAN: And shares of Illumina are on the move as well. They are trading lower by about 4% after the company announced former Agilent Senior Vice President Jacob Thaysen will take the helm as its new CEO. That's effective September 25.\n\nThe move comes months after a bout of leadership turmoil. Previous CEO Francis deSouza stepping down in June, just weeks after activist investor Carl Icahn tried and failed to oust him from the top spot.", "link": "https://finance.yahoo.com/video/lowes-oracle-upgrades-illumina-ceo-143652525.html", "symbols": ["A.US", "AG8.F", "GSPC.INDX", "ILMN.US", "ILU.F", "LOW.US", "LOWC34.SA", "LWE.F", "ORC.F", "ORC.XETRA", "ORCL.MX", "ORCL.US", "ORCL34.SA"], "tags": [], "sentiment": {"polarity": 0.891, "neg": 0.064, "neu": 0.833, "pos": 0.103}}, {"date": "2023-09-05T14:27:36+00:00", "title": "Illumina appoints new CEO after battle with investors", "content": "Biotech has been criticised for closing its $8bn acquisition of cancer test company Grail without regulatory approval\n\nContinue reading", "link": "https://finance.yahoo.com/m/745db86c-1fad-364d-af2b-117e38bcfd12/illumina-appoints-new-ceo.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.832, "neg": 0.355, "neu": 0.645, "pos": 0}}, {"date": "2023-09-05T14:03:37+00:00", "title": "Stocks to Watch Tuesday: Airbnb, Warner Bros., Blackstone", "content": "[**↗️**](https://www.wsj.com/market-data/quotes/BX) [**Blackstone (BX)**](https://www.wsj.com/market-data/quotes/BX)**,** [**Airbnb (ABNB)**](https://www.wsj.com/market-data/quotes/ABNB): Shares in both companies jumped after S&P Dow Jones Indices said late Friday that they would join the S&P 500 on Sept.\n\nContinue reading", "link": "https://finance.yahoo.com/m/2f913561-865d-3fce-9f42-49a713523a45/stocks-to-watch-tuesday%3A.html", "symbols": ["ABNB.US", "BBN1.F", "BX.US", "ILMN.US", "ILU.F", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.527, "neg": 0, "neu": 0.868, "pos": 0.132}}, {"date": "2023-09-05T13:28:00+00:00", "title": "Illumina Names New Chief Executive", "content": "Jacob Thaysen was named to the role after Francis deSouza resigned from the gene-sequencing maker in June amid a fight with regulators.\n\nContinue reading", "link": "https://finance.yahoo.com/m/52eaca92-7545-325a-8c9c-429d844c3f98/illumina-names-new-chief.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.557, "neg": 0.18, "neu": 0.82, "pos": 0}}, {"date": "2023-09-05T11:45:47+00:00", "title": "UPDATE 2-Illumina names Agilent exec Jacob Thaysen as CEO", "content": "(Adds background in paragraphs 2-4)\n\nSept 5 (Reuters) - Illumina Inc's board on Tuesday named Agilent Technologies' executive Jacob Thaysen as the U.S. genetic testing company's CEO, months after its former head stepped down following a proxy fight with billionaire Carl Icahn.\n\nIllumina had repurchased cancer diagnostic test maker Grail in 2021 despite opposition from the U.S. and European antitrust regulators — a decision that prompted Icahn to pursue a proxy fight, arguing the unit should be divested as it had cost investors billions of dollars.\n\nThe proxy battle ended with a May vote in which Icahn won enough shareholder support to oust the then board chair, John Thompson, and appoint his nominee, Andrew Teno, on the board.\n\nIllumina's former head Francis deSouza stepped down in June, marking another victory for the activist investor, even though deSouza had secured more than twice the number of shareholder votes than his challenger.\n\nThaysen, who has been part of the analytical instruments division leadership at Agilent since 2018, would take on his role at Illumina effective Sept. 25.\n\nFollowing this, ‍Charles Dadswell, who has been serving as Illumina's interim CEO since June, would resume his role of senior vice president and general counsel at Illumina.\n\n​ (Reporting by Manas Mishra and Bhanvi Satija in Bengaluru; Editing by Shilpi Majumdar)", "link": "https://finance.yahoo.com/news/1-illumina-names-agilent-exec-114547984.html", "symbols": ["A.US", "AG8.F", "ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.296, "neg": 0.066, "neu": 0.868, "pos": 0.065}}, {"date": "2023-09-05T11:40:49+00:00", "title": "Illumina names Agilent exec Jacob Thaysen as CEO", "content": "(Reuters) -Illumina Inc's board on Tuesday named Agilent Technologies' executive Jacob Thaysen as the U.S. genetic testing company's CEO, months after its former head stepped down following a proxy fight with billionaire Carl Icahn.\n\nIllumina had repurchased cancer diagnostic test maker Grail in 2021 despite opposition from the U.S. and European antitrust regulators — a decision that prompted Icahn to pursue a proxy fight, arguing the unit should be divested as it had cost investors billions of dollars.\n\nThe proxy battle ended with a May vote in which Icahn won enough shareholder support to oust the then board chair, John Thompson, and appoint his nominee, Andrew Teno, on the board.\n\nIllumina's former head Francis deSouza stepped down in June, marking another victory for the activist investor, even though deSouza had secured more than twice the number of shareholder votes than his challenger.\n\nThaysen, who has been part of the analytical instruments division leadership at Agilent since 2018, would take on his role at Illumina effective Sept. 25.\n\nFollowing this, ‍Charles Dadswell, who has been serving as Illumina's interim CEO since June, would resume his role of senior vice president and general counsel at Illumina.\n\n​\n\n(Reporting by Manas Mishra and Bhanvi Satija in Bengaluru; Editing by Shilpi Majumdar)", "link": "https://ca.finance.yahoo.com/news/illumina-names-agilent-exec-jacob-114049019.html", "symbols": ["A.US", "AG8.F", "ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.296, "neg": 0.068, "neu": 0.865, "pos": 0.067}}, {"date": "2023-09-05T11:30:00+00:00", "title": "Illumina's Board Appoints Jacob Thaysen, Ph.D. as its New Chief Executive Officer", "content": "SAN DIEGO, Sept. 5, 2023 /PRNewswire/ -- Illumina, Inc. (NASDAQ: ILMN), a global leader in DNA sequencing and array-based technologies, today announced that its Board of Directors has appointed Jacob Thaysen, Ph.D., senior vice president of Agilent Technologies and president of its Life Sciences and Applied Markets Group, as Chief Executive Officer, effective September 25, 2023. Illumina, Inc. Logo\n\nMr. Thaysen's extensive background and experience in genomics, life sciences, and technology fits closely with Illumina's mission. Since 2018, he has overseen the unit responsible for Agilent's market-leading analytical instrument portfolio, informatics, and cell analysis franchise. During that time, he drove the division's revenue and significantly improved its operating profit. In 2022, that division, Agilent's largest, had revenue of approximately $4 billion, more than 50,000 customers, and an operating margin of approximately 30%. Mr. Thaysen has driven the transformation of the analytical lab with a focus on implementing a complete digital laboratory ecosystem combined with innovative and smart instruments. Prior to leading Life Science and Applied Markets, Mr. Thaysen was president of Agilent's Diagnostics and Genomics Group from 2014 to 2018, during which time he nearly doubled that division's operating profit.\n\nMr. Thaysen received his M.Sc. and Ph.D. in physics from the Technical University of Denmark. He has a long history in clinical – specifically oncology – diagnostics, as well as experience in manufacturing, sales, research and development, and innovation. He is a well-respected member of Agilent's senior leadership team and has held a number of significant positions at Agilent over his ten-year tenure there.\n\nMr. Thaysen, age 48, will become a member of Illumina's Board of Directors upon joining the company. He will be relocating to the San Diego area from Northern California.\n\n\"After conducting a robust search process, we are thrilled to have found someone of Jacob's caliber to become chief executive of Illumina and help shape and lead the company into its next phase of growth,\" said Stephen P. MacMillan, Chair of the Board of Illumina. \"Jacob's unique combination of deep technological and commercial experience will be a great addition to Illumina. The Board is excited to work with Jacob. He brings a fresh perspective, a demonstrated track record driving profitable growth, and a strong commitment to create value for all of Illumina's stakeholders. We are confident that under his direction, Illumina can continue to execute on its goals and drive long-term shareholder value.\"\n\nStory continues\n\n\"Illumina's technology is at the forefront of sequencing and has set the pace for the industry. I am honored, privileged, and excited to lead such a great organization,\" said Mr. Thaysen. \"I'm planning to hit the ground running and looking forward to working with the incredibly talented teams at Illumina. Together, we will continue serving our customers as the industry standard and driving long-term value for our shareholders and other stakeholders.\"\n\nCharles Dadswell, interim CEO, will resume his position as Senior Vice President and General Counsel once Mr. Thaysen becomes CEO.\n\n\"I want to thank Chuck for his invaluable contribution as interim CEO during this important transition,\" said Mr. MacMillan. \"We asked Chuck to take on this role, and he has served the company well over the last few months.\"\n\nAbout Jacob Thaysen Jacob Thaysen will become Chief Executive Officer of Illumina effective September 25, 2023.\n\nFrom 2018 to 2023, he was senior vice president of Agilent and president of Agilent's Life Sciences and Applied Markets Group (LSAG) which consists of Agilent's market leading analytical instrument portfolio, informatics and cell analysis franchise. He drove the transformation of the analytical lab with focus on implementing a complete digital laboratory ecosystem combined with innovative and smart instruments. Furthermore, he built a leadership position for Agilent in live cell analysis through a series of acquisitions.\n\nFrom 2014 to 2018, Thaysen served as the president of Agilent's Diagnostics and Genomics Group (DGG) and was an integral part of Agilent's transition into a life sciences company. Through his strategy-driven business leadership, he built a solid foundation for growth for Agilent in diagnostics and clinical science.\n\nPrior to joining Agilent, Thaysen was corporate vice president of R&D at Dako, a Danish cancer diagnostic company. Before joining Dako, he served as management consultant at Copenhagen Consultancy Company (now Bain & Co). Early in his career, he was founder and chief technology officer of Cantion, a research and defense application development company based in Denmark.\n\nThaysen holds an M.Sc. and Ph.D. in physics from the Technical University of Denmark.\n\nAbout Illumina Illumina is improving human health by unlocking the power of the genome. In 2023 we celebrate 25 years of innovation, which has established us as a global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical, and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture, and other emerging segments. To learn more, visit illumina.com and connect with us on Twitter, Facebook, LinkedIn, Instagram, TikTok, and YouTube.\n\nInvestors:\r\nSalli Schwartz\r\n858-291-6421\r\nIR@illumina.com\n\nMedia:\r\nDavid McAlpine\r\n347-327-1336\r\nPR@illumina.com Jacob Thaysen Headshot Cision\n\nView original content to download multimedia:https://www.prnewswire.com/news-releases/illuminas-board-appoints-jacob-thaysen-phd-as-its-new-chief-executive-officer-301917362.html\n\nSOURCE Illumina, Inc.", "link": "https://finance.yahoo.com/news/illuminas-board-appoints-jacob-thaysen-113000146.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.005, "neu": 0.867, "pos": 0.128}}, {"date": "2023-09-05T09:34:20+00:00", "title": "Illumina appoints Jacob Thaysen as new CEO following proxy battle with Icahn", "content": "Investing.com -- Illumina Inc (NASDAQ:ILMN) has named Jacob Thaysen as its new chief executive officer, months after its former board chair was removed following a proxy battle with billionaire activist investor Carl Icahn.\n\nThe U.S. genetic testing firm said Thaysen, who is currently an executive at laboratory instrument provider Agilent Technologies (NYSE:A), will assume the role on September 25.\n\nShares in Illumina slipped by more than 3% in early U.S. trading on Tuesday. The stock has fallen by more than 14% over the past one-year period.\n\nPrior to Thaysen's appointment, the San Diego-based group became embroiled in a proxy fight with Icahn after its repurchase of cancer diagnostic test maker Grail in 2021 was opposed by regulators in the U.S. and Europe. Icahn called for the division to be divested, arguing that it was costing investors billions of dollars.\n\nIn May, Icahn gained enough backing from shareholders to secure the ouster of then Chair John Thompson and place his own nominee, Andrew Teno, on the board.\n\nFormer head Francis deSouza later resigned from the company in June despite having the support of twice as many shareholders as his challenger received in a proxy vote. Senior Vice President Charles Dadswell has served as CEO on an interim basis since deSouza's departure.\n\nRelated Articles\n\nIllumina appoints Jacob Thaysen as new CEO following proxy battle with Icahn\n\nMeadows, other Trump allies plead not guilty in Georgia election case\n\nHawaii, Maui sued for gross negligence in deadly wildfires by victim's family - court filing", "link": "https://finance.yahoo.com/news/illumina-appoints-jacob-thaysen-ceo-093420961.html", "symbols": ["A.US", "AG8.F", "ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.932, "neg": 0.091, "neu": 0.866, "pos": 0.042}}]