[{"date": "2023-12-19T21:42:08+00:00", "title": "S&amp;P 500 Gains and Losses Today: Enphase's Cost Cutting Charges Up Solar Stocks", "content": "The S&P 500 gained 0.6% on Tuesday, Dec. 19, 2023, amid optimism on Fed rate cuts, strong housing data, and the traditional \"Santa Claus rally.\"\n\nContinue reading", "link": "https://finance.yahoo.com/m/42aaedac-4f16-3343-869b-cf4cf0a38d99/s%26p-500-gains-and-losses.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "E0P.F", "ENPH.US", "F3A.F", "F3A.XETRA", "FA1.F", "FDS.US", "FSLR.MX", "FSLR.US", "GSPC.INDX", "ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.802, "neg": 0.064, "neu": 0.665, "pos": 0.272}}, {"date": "2023-12-19T21:05:00+00:00", "title": "Illumina To Webcast Upcoming Investor Conference", "content": "SAN DIEGO, Dec. 19, 2023 /PRNewswire/ -- Illumina, Inc. (NASDAQ: ILMN) today announced that its executives will be speaking at the following investor conference:\n\n42nd Annual J.P. Morgan Healthcare Conference on January 9, 2024\r\nPresentation at 9:00am Pacific Time (12:00pm Eastern Time) immediately followed by a Q&A Session to begin at approximately 9:20am Pacific Time (12:20pm Eastern Time)\n\nThe webcast can be accessed through the Investor Info section of Illumina's website at investor.illumina.com. A replay will be posted on Illumina's website after the event and will be available for at least 30 days following.\n\nAbout Illumina Illumina is improving human health by unlocking the power of the genome. In 2023, we celebrate 25 years of innovation, which has established us as a global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture and other emerging segments. To learn more, visit www.illumina.com and connect with us on X (Twitter), Facebook, LinkedIn, Instagram, TikTok and YouTube.\n\nInvestors:\r\nSalli Schwartz\r\n+1.858.291.6421\r\nir@illumina.com\n\nMedia:\r\nDavid McAlpine\r\n+1.347.327.1336\r\npr@illumina.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/illumina-to-webcast-upcoming-investor-conference-302019450.html\n\nSOURCE Illumina, Inc.", "link": "https://finance.yahoo.com/news/illumina-webcast-upcoming-investor-conference-210500812.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.886, "neg": 0, "neu": 0.941, "pos": 0.059}}, {"date": "2023-12-19T16:02:13+00:00", "title": "Carl Icahn to initiate proxy battle with Illumina — again", "content": "Activist investor Carl Icahn is gearing up to initiate another proxy fight at gene sequencing giant Illumina (ILMN) , aiming to appoint additional nominees to the company's board. This comes just months after shareholders elected one of his candidates amid criticisms of Illumina's acquisition of Grail.\n\nNow, Icahn is looking to elect more of his representatives in the boardroom as Illumina faces challenges following the Grail deal.\n\nYahoo Finance's Ines Ferré breaks down all the details.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nVideo Transcript\n\n[AUDIO LOGO]\n\nSEANA SMITH: Activist investor, Carl Icahn, is ready to launch another proxy battle with Illumina to put more of his nominees on the board of the gene sequencing company. Now, this comes months after shareholders elected one of his director candidates following regulatory roadblocks over the buyout of blood test maker, Grail. Yahoo Finance's Ines Ferre is here with more on the ins and outs of this activist investor battle, been studying it all morning. Ines, what can you tell us?\n\nINES FERRE: Yeah, so billionaire, Carl Icahn, isn't giving in up-- giving up on putting more of his nominees on that board. So Icahn has been a big critic of the $7 billion acquisition of Grail, the cancer detection test maker. Now the deal has brought nothing but regulatory problems for Illumina. Let's back up for a second, and put this all into context for you.\n\nIllumina took over Grail in August 2021, and it did so without securing regulatory approval from the European Union. So subsequently EU regulators blocked that deal on concerns that it was-- that it would stifle innovation. And the EU slapped a fine on Illumina, and then it ordered the company to unwind the Grail deal. Amid all this, you had Icahn-- Carl Icahn that sent a letter to the board saying that his nominees need to be on that board, and that they have experience with dealing with crisis.\n\nStory continues\n\nIcahn said he wanted to strike a deal and avoid a proxy battle in October, but shareholders voted in-- in Andrew Teno. He's a portfolio manager working for Icahn. So he has a win there, and he ousted the chairman. Illumina announced it is divesting Grail, and Icahn reportedly wants more of his people on the board now for the process. And going forward in a letter that was made public in a filing, Icahn wrote, \"It would be a great mistake to allow the legacy conflicted directors to influence Illumina given their history of reckless decision-making and value destruction.\n\nSo basically what he's saying is here. Look, he's been a very big critic of this deal. The deal went south because of the EU regulators. And he is criticizing the board, and he's criticizing the company for having made this deal in the first place and saying that the stock-- if you take a look at the stock, let's pull up the chart if we can for Illumina, the stock is down about 75% since that deal went through in 2021. And it's wiped out about $55 billion in value for shareholders. So he's very angry about that and that's why he wants his people on that board.\n\nBRAD SMITH: All right. This puts perhaps a big cap on. And who knows if there's some late year type of activist activity that's still yet to come forward. But this just the latest in a year full of activist campaigns as well. Yahoo Finance's own Ines Ferre. Thanks so much, Ines.", "link": "https://finance.yahoo.com/video/carl-icahn-initiate-proxy-battle-160213055.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.945, "neg": 0.088, "neu": 0.85, "pos": 0.062}}, {"date": "2023-12-19T14:45:00+00:00", "title": "A Lesser-Known Application of Genomics: Reducing Cow Burp Intensity", "content": "DataGene's Sustainability Index for dairy cattle herds combats this significant driver of global warming\n\nNORTHAMPTON, MA / ACCESSWIRE / December 19, 2023 / Illumina\n\nOriginally published on Illumina News Center\n\nMethane is 28 times more powerful a greenhouse gas than carbon dioxide: It's responsible for a third of global warming. A single cow can produce up to 500 liters of methane a day, or 160 kilograms per year, mostly through eructation (that is, belching). Multiply that by the planet's 1.4 billion cattle, and it might be a burp, not a butterfly wing, that causes a hurricane on the other side of the world.\n\nDairy foods continue to have an important role in feeding the world. It's not the cattle's fault that, by mass, there's more of them than any other mammal on earth (including us). Their digestive systems do what they can with the food we allot them. Given all this, what can researchers do to mitigate bovine belching? They can focus on cattle digestive systems. A cow's methane emissions are influenced by its gut microbiome, and evidence shows that their microbiome composition is influenced in turn by their genotype. Breeding cattle who simply emit less methane than their peers might be ideal-but this research is in its early stages.\n\nHow about focusing on cattle feed? Somestudies have found that adding the methane inhibitor 3-nitrooxypropanol (3-NOP) to a cow's diet reduces their methane output by up to 30%, with no apparent negative impact on their health or milk production. But these studies are also relatively recent, and 3-NOP warrants further research before it can be made commercially available at scale.\n\n\"That will help, and potentially be a much faster improvement,\" says Matthew Shaffer. \"Genetics is a long-term game. It takes time for genetics to work through the system. But the benefits of genetics are permanent and cumulative.\"\n\nShaffer is the CEO of DataGene, an initiative of Dairy Australia that's driving genetic gain and herd improvement in the country's dairy industry. DataGene publishes three indices that track desirable genetic traits among Australia's 1.4 million cattle: A Balanced Performance Index, for traits that affect their lifetime contribution to the farm business; a Health Weighted Index, which fast tracks genetic gain for fertility, feed efficiency, and disease resistance; and a Sustainability Index, which fast tracks genetic gain for reduced methane emissions intensity.\n\nStory continues\n\nThinking in these terms-not gross emissions, but emissions intensity-is another way to tackle the methane problem. Say you have two cows of the same weight, diet, and gross emissions, but every day one produces 20 liters of milk and the other 30 liters. The higher-producing cow dilutes their methane output across more production throughout their lifetime. \"If you need to supply 100 liters of milk, you get it with less methane,\" Shaffer explains. \"But with increased production comes other consequences, on fertility and other traits.\" For example, a longer-lived cow also has a reduced emissions intensity, because the first two years before she can begin producing milk constitutes a smaller percentage of her life. \"That's why emissions intensity is balanced within our index: so we don't cause other issues by chasing only production.\"\n\nGenomic sequencing has enabled dairy farmers to make breeding decisions much faster, with greater accuracy, based on genomic breeding values. No longer do they have to wait to see how productive, fertile, or hardy a bull's progeny are before they decide whether to use that bull for further breeding: These genomic breeding values can be calculated for animals as soon as they're born. This reduces the time between generations and, according to one estimate, saves bull breeding companies up to 92% of their costs.\n\nAustralian dairy farmers looking to order top-quality bull semen can use DataGene's apps to rank animals based on these indices, to fit their particular needs. They can also sequence their female animals simply by taking a small tissue sample, usually from an ear. They send the sample to a genomic service provider, who genotypes it and returns a genomic breeding value for that cow. Equipped with these values, farmers can make more informed decisions about which animals to keep in their herd.\n\n\"We couldn't do what we do without DairyBio, who provide a lot of the research and work closely with Illumina to add SNPs to their systems,\" Shaffer says, referring to the genetic markers that this genotyping looks for.\n\nDataGene's next big project is aggregating vast amounts of new sequencing data into their Central Data Repository (CDR). \"We're connecting the CDR to various equipment manufacturers to bring new data we've never seen before,\" Shaffer says. \"Some of it will be milking machine information from robots; some will be information from companies we don't currently have access to. It's really important to expand the CDR, which will enable us to produce better tools and analytics for farmers.\"\n\nIt's not always the case that a company CEO starts out on the \"shop room floor\" in the same industry. But Shaffer grew up milking cows by hand on his grandmother's farm; his first paying job was as a milker on a larger farm. \"So I've got milk in my veins, as it were,\" he jokes. But that means this work holds great personal meaning to him. \"What gets me up every morning is the desire to enable farmers to make better decisions and breed better animals, and the corollary impact that has on the environment and on people's health.\"\n\nWith the strength of knowledge from all these tools, breeding a more sustainable cow is not just a good idea-it's a mooovement. Photo: This Jersey is one of 1.4 million dairy cows in Australia, all of whom emit greenhouse gas.\n\nView additional multimedia and more ESG storytelling from Illumina on 3blmedia.com.\n\nContact Info:\r\nSpokesperson: Illumina\r\nWebsite: https://www.3blmedia.com/profiles/illumina\r\nEmail: info@3blmedia.com\n\nSOURCE: Illumina\n\nView the original press release on accesswire.com", "link": "https://finance.yahoo.com/news/lesser-known-application-genomics-reducing-144500610.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.021, "neu": 0.888, "pos": 0.091}}, {"date": "2023-12-19T10:30:28+00:00", "title": "The 2023 stock market rally isn't just about 7 stocks anymore", "content": "The 2023 stock market rally has entered ahealthier phase in the past month.\n\nWith sectors like financials (XLF) and small caps (^RUT) surging amid Fed pivot euphoria, the recent leg higher hasn't just been a story of seven large-cap tech stocks.\n\nResearch from Morgan Stanley chief investment officer Mike Wilson shows 78% of the S&P 500 (^GSPC) stocks were above their 200-day moving average last week, matching the highest levels of this year.\n\n\"Over the past month, we've experienced arguably the best stretch of breadth improvement in 2023,\" Wilson wrote in a note on Monday.\n\nThe notably bearish strategist described the broadening out as \"an encouraging sign,\" a nod to the fact that market breadth has been a key sticking point for many who have doubted the S&P 500's 2023 rally.\n\nMany have pointed to charts that show how gains in the \"Magnificent Seven\" tech stocks — Apple (AAPL), Alphabet (GOOGL, GOOG), Microsoft (MSFT), Amazon (AMZN), Meta (META), Tesla (TSLA), and Nvidia (NVDA) — carried the benchmark average for most of the year.\n\nIn early October, Charles Schwab chief investment strategist Liz Ann Sonders likened the Magnificent Seven's rise to an army. Those stocks were serving as generals leading the rally, but until the \"soldiers,\" or other stocks in the S&P 500, joined the front, the rally wouldn't be seen as strong.\n\nBut now, as the S&P 500 is once again pressing near all-time highs, the generals have brought support.\n\nAnalysis from Yahoo Finance's Jared Blikre shows the largest gainers in the S&P 500 over the last month are Bath & Body Works (BBWI), Illumina (ILMN), and Norwegian Cruise Lines (NCLH), all of which have risen more than 35%.\n\nMeanwhile, none of the Magnificent Seven have gained more than 8% over the last month. Tesla, which is up about 7.9% in that time, has led the Magnificent Seven but is barely in the top half of individual gainers in the S&P 500 since Nov. 17.\n\nStory continues\n\nSonders's colleague at Charles Schwab, senior investment strategist Kevin Gordon, said the market rally has become healthier and \"broadened out.\" Gordon pointed to the Russell 2000, which has gained nearly 15% in the last month.\n\n\"There's been so much argument over whether it is a sustainable bull market,\" Gordon told Yahoo Finance. \"And so far, that hasn't been the case. But now you're finally starting to get some action from [small caps], that you would typically see [in a bull market].\"\n\nGordon pointed out that this narrative has played out in markets already this year but proved to be a head fake late in the summer. But this second chance at a broadening of the rally could be different, according to Gordon.\n\nThe key will be a continuation of the current trend which has seen movement from the 2023 leading sectors like Technology (XLK), Communications Services (XLC), and Consumer Discretionary (XLY) into areas like Financials, Industrials (XLI), and Real Estate (XLRE).\n\nThis has played out amid the market surge over the past month with the latter three sectors among the highest gainers in the S&P 500. If that continues without the Magnificent Seven falling off a cliff, then the market rally may have reached its \"nirvana,\" Gordon said.\n\n\"We'll see if it actually pans out,\" Gordon said. \"But I think that if this signal from the market in the past month is to be believed in, it is continued, then that would tell me that the economic picture is getting a lot better for next year.\" A street sign for Wall Street hangs in front of the New York Stock Exchange on May 8, 2013. (REUTERS/Lucas Jackso/File Photo) (REUTERS / Reuters)\n\nJosh Schafer is a Reporter for Yahoo Finance.\n\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/the-2023-stock-market-rally-isnt-just-about-7-stocks-anymore-103028679.html", "symbols": ["1NC.F", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "FB2A.F", "FB2A.XETRA", "GOOG.MI", "ILMN.US", "ILU.F", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NCLH.US", "NVD.F", "NVD.XETRA", "NVDA.MX"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.02, "neu": 0.892, "pos": 0.088}}, {"date": "2023-12-19T10:30:28+00:00", "title": "The 2023 stock market rally isn't just about seven stocks anymore", "content": "The 2023 stock market rally has entered ahealthier phase in the past month.\n\nWith sectors like financials (XLF) and small caps (^RUT) surging amid Fed pivot euphoria, the recent leg higher hasn't just been a story of seven large cap tech stocks.\n\nResearch from Morgan Stanley chief investment officer Mike Wilson shows 78% of the S&P 500 (^GSPC) stocks were above their 200-day moving average last week, matching the highest levels of this year.\n\n\"Over the past month, we've experienced arguably the best stretch of breadth improvement in 2023,\" Wilson wrote in a note on Monday.\n\nThe notably bearish strategist described the broadening out as \"an encouraging sign,\" a nod to the fact that market breadth has been a key sticking point for many that have doubted the S&P 500's 2023 rally.\n\nMany have pointed to charts that show how gains in the Magnificent 7 tech stocks — Apple (AAPL), Alphabet (GOOGL, GOOG), Microsoft (MSFT), Amazon (AMZN), Meta (META), Tesla (TSLA), and Nvidia (NVDA) — carried the benchmark average for most of the year.\n\nIn early October, Charles Schwab chief investment strategist Liz Ann Sonders likened the Magnficient 7's rise to an army. The stocks were serving as generals leading the rally, but until the \"soldiers\", or other stocks in the S&P 500, joined the front, the rally wouldn't be seen as strong.\n\nBut now, as the S&P 500 is once again pressing near all-time highs, the generals have brought support.\n\nAnalysis from Yahoo Finance's Jared Blikre shows the largest gainers in the S&P 500 over the last month are Bath & Body Works (BBWI), Illumina (ILMN) and Norwegian Cruise Lines (NCLH), all of which have risen more than 35%.\n\nMeanwhile, none of the Magnificent 7 have gained more than 8% over the last month. Tesla, which is up about 7.9% in that time period, has led the Magnificent 7 but is barely in the top half of individual gainers in the S&P 500 since November 17.\n\nStory continues\n\nSonders' colleague at Charles Schwab, senior investment strategist Kevin Gordon, says the market rally has become healthier and \"broadened out.\" Gordon points to the Russell 2000 which has gained nearly 15% in the last month.\n\n\"There's been so much argument over whether it is a sustainable bull market,\" Gordon told Yahoo Finance. \"And so far, that hasn't been the case. But now you're finally starting to get some action from [small caps], that you would typically see [in a bull market.]\"\n\nGordon points out this narrative has played out in markets already this year but proved to be a head fake late in the summer. But this second chance at a broadening of the rally could be different according to Gordon.\n\nThey key will be a continuation of the current trend which has seen movement from the 2023 leading sectors like Technology (XLK), Communications Services (XLC) and Consumer Discretionary (XLY) into areas like Financials, Industrials (XLI) and Real Estate (XLRE).\n\nThis has played out amid the market surge over the past month with the latter three sectors among the highest gainers in the S&P 500. If that continues without the Magnificent 7 falling off a cliff, then the market rally may have reached its \"nirvana,\" Gordon said.\n\n\"We'll see if it actually pans out,\" Gordon said. \"But I think that if this signal from the market in the past month is to be believed in, it is continued, then that would tell me that the economic picture is getting a lot better for next year.\" FILE PHOTO: A street sign for Wall Street hangs in front of the New York Stock Exchange May 8, 2013. REUTERS/Lucas Jackso//File Photo (REUTERS / Reuters)\n\nJosh Schafer is a Reporter for Yahoo Finance.\n\nClick here for in-depth analysis of the latest stock market news and events moving stock prices.\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/the-2023-stock-market-rally-isnt-just-about-seven-stocks-anymore-103028409.html", "symbols": ["1NC.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "FB2A.F", "FB2A.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MI"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.018, "neu": 0.896, "pos": 0.087}}, {"date": "2023-12-19T05:00:04+00:00", "title": "Could the ‘trustbusters’ be making a comeback?", "content": "One scoop to start: Activist investor Cevian Capital has taken a €1.2bn stake in UBS, betting that the Swiss bank can double its valuation over the next three to five years. Global regulators had been on a losing streak lately, with back-to-back losses including Amgen’s $28bn takeover of fellow drugmaker Horizon Therapeutics and Microsoft’s $75bn purchase of game developer Activision Blizzard. Adobe on Monday abandoned its proposed $20bn acquisition of product design software company Figma, saying there was “no clear path to receive necessary regulatory approvals” from UK and EU watchdogs.\n\nContinue reading", "link": "https://finance.yahoo.com/m/79e5e21d-4d82-38d3-bc44-267a3e385c93/could-the-%E2%80%98trustbusters%E2%80%99-be.html", "symbols": ["FTCH.US", "ILMN.US", "ILU.F", "USX1.F", "X.BA", "X.MX", "X.US"], "tags": [], "sentiment": {"polarity": -0.625, "neg": 0.084, "neu": 0.873, "pos": 0.043}}, {"date": "2023-12-18T20:37:03+00:00", "title": "US Steel &amp; Nippon, Adobe, Illumina: Top M&amp;A announcements", "content": "Japanese steel producer Nippon Steel (5401.T) is set to acquire United States Steel (X) in a deal valued at up to $14.9 billion when accounting for debt. Adobe (ADBE) relinquishes its $20 billion takeover bid of collaborative design app Figma.\n\nLastly, biotech company Illumina (ILMN) plans to divest cancer test developer GRAIL following antitrust headwinds, planning to sell it for up to $7.1 billion.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/us-steel-nippon-adobe-illumina-203703179.html", "symbols": ["ADB.F", "ADBE.US", "ADBE34.SA", "ILMN.US", "ILU.F", "NISTF.US", "NPS.F", "NPSCY.US", "USX1.F", "X.BA", "X.MX", "X.US"], "tags": [], "sentiment": {"polarity": -0.296, "neg": 0.075, "neu": 0.862, "pos": 0.062}}, {"date": "2023-12-18T18:55:04+00:00", "title": "Illumina-Grail $8B Saga Ends After It Battles Regulators For 3 Years", "content": "On Sunday, gene-sequencing company Illumina Inc (NASDAQ: ILMN) agreed to divest cancer diagnostic test maker Grail Inc as the companies battled with the U.S. and European antitrust regulators for almost three years after announcing the acquisition.\n\nIn August 2021, in defiance of FTC and EU scrutiny, Illumina completed its $8 billion acquisition of Grail.\n\nThe divestiture will be executed through a third-party sale or capital markets transaction, consistent with the European Commission's divestiture order, to finalize the terms by the end of the second quarter of 2024.\n\nOn December 15, the U.S. Fifth Circuit Court of Appeals issued its decision in Illumina v. the Federal Trade Commission.\n\nAfter reviewing the Court's opinion, Illumina has elected not to pursue further appeals of the Fifth Circuit's decision.\n\nIn April, The Fed­er­al Trade Com­mis­sion or­dered Il­lu­mi­na to di­vest Grail, saying that the deal would stifle competition and innovation in the U.S. market for cancer tests.\n\nAs the company has previously stated, if it were unsuccessful with either its European Court of Justice jurisdictional appeal or in a final decision of the Fifth Circuit, it would divest GRAIL.\n\nGrail will continue to be held separately with committed funding from Illumina for Grail's business through the divestment process, the company said in a statement.\n\nIn July, Illumina was fined a record €432 million by the European Union for closing its takeover of Grail before securing EU antitrust approval.\n\nIllumina's former CEO Francis deSouza resigned as the company had been locked in a proxy battle with activist investor Carl Icahn over its $7.1 billion acquisition of cancer test maker Grail, which has faced regulatory hurdles.\n\nPrice Action: ILMN shares are up 1.46% at $128.95 on the last check Monday.\n\n\"ACTIVE INVESTORS' SECRET WEAPON\" Supercharge Your Stock Market Game with the #1 \"news & everything else\" trading tool: Benzinga Pro - Click here to start Your 14-Day Trial Now!\n\nThis article Illumina-Grail $8B Saga Ends After It Battles Regulators For 3 Years originally appeared on Benzinga.com\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/illumina-grail-8b-saga-ends-185504812.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.886, "neg": 0.079, "neu": 0.868, "pos": 0.053}}, {"date": "2023-12-18T17:46:17+00:00", "title": "Illumina Gives Up Fight With Regulators, Will Divest GRAIL", "content": "Illumina has decided to end its controversial purchase of GRAIL, and will divest itself of the cancer diagnostic test maker.\n\nContinue reading", "link": "https://finance.yahoo.com/m/13deada5-259a-35df-8bd7-1191ab52ce32/illumina-gives-up-fight-with.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.735, "neg": 0.237, "neu": 0.763, "pos": 0}}, {"date": "2023-12-18T17:00:00+00:00", "title": "Heard on the Street: Illumina Nears the End of Its Painful Grail Saga", "content": "Grail’s screening test, called Galleri, could one day help save countless lives by catching cancer in the bloodstream early. After losing in court [against the Federal Trade Commission](https://www.wsj.com/health/healthcare/court-sides-with-ftc-finding-illumina-grail-deal-anticompetitive-ad2efe8d), the company has finally [thrown in the towel](https://www.wsj.com/health/healthcare/illumina-to-divest-itself-of-cancer-test-maker-grail-3f74f1e8) on keeping Grail. The maker of gene-sequencing machines said Sunday it will pursue the divestiture of Grail through a third-party sale or capital markets transaction, with a goal of completing terms by the middle of 2024.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a4629592-2cb6-3c6d-9a99-a92492dedced/heard-on-the-street%3A-illumina.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.273, "neg": 0.087, "neu": 0.841, "pos": 0.073}}, {"date": "2023-12-18T16:10:12+00:00", "title": "Illumina Ends Its Controversial Grail Battle With A Divestiture; Shares Rise", "content": "Illumina stock rose Monday after the company said it would divest its cancer detection outfit, Grail, following a lengthy court battle.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1a19946d-df3b-3015-9284-345097574fa1/illumina-ends-its.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.791, "neg": 0.259, "neu": 0.741, "pos": 0}}, {"date": "2023-12-18T16:00:01+00:00", "title": "These Stocks Are Moving the Most Today", "content": "U.S. Steel is being acquired by Nippon Steel for $55 a share, Adobe terminates purchase of Figma, SunPower issues a going concern warning, and VF Corp says a security breach will impact its business.Read ...\n\nContinue reading", "link": "https://finance.yahoo.com/m/58238949-74b4-371d-a0d2-2d7ef4032569/these-stocks-are-moving-the.html", "symbols": ["GSPC.INDX", "ILMN.US", "ILU.F", "U1BE34.SA", "UBER.US", "UT8.F", "UT8.STU"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0.063, "neu": 0.816, "pos": 0.121}}, {"date": "2023-12-18T15:58:45+00:00", "title": "Icahn aims to remove Illumina's legacy directors - letter", "content": "By Svea Herbst-Bayliss\n\n(Reuters) - Activist investor Carl Icahn said on Monday that he plans to oust directors at Illumina, signalling plans to mount a second board challenge at the gene-sequencing company only months after shareholders elected one of his director candidates.\n\nIcahn disclosed his plans without offering details in a letter to other shareholders less than 24 hours after Illumina said it will divest blood test maker Grail.\n\nThe billionaire investor long criticized Illumina's Grail acquisition and made it a centrepiece of his previous proxy fight where Andrew Teno, a portfolio manager working for Icahn, won a seat.\n\nOn Monday Icahn cheered the decision but said the job at Illumina has not been fully completed.\n\n\"Our third goal is to remove these legacy conflicted directors,\" Icahn wrote in a letter that was made public in a regulatory filing. His first two goals were to push out former CEO Francis deSouza, who resigned in June, and get Illumina to divest Grail, the letter said.\n\nIcahn said Illumina's legacy directors cannot be trusted to oversee the disposal of Grail. \"It would be a great mistake to allow the legacy conflicted directors to influence Illumina given their history of reckless decision-making and value destruction,\" the letter said.\n\nIllumina's stock price climbed 1% in early trading to $128.38.\n\n(With additional reporting by Khushi Mandowara in Bengaluru; Editing by Arun Koyyur and Andrea Ricci)", "link": "https://finance.yahoo.com/news/icahn-aims-remove-illuminas-legacy-155845522.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.481, "neg": 0.061, "neu": 0.869, "pos": 0.07}}, {"date": "2023-12-18T14:42:19+00:00", "title": "Stocks to Watch Monday: U.S. Steel, Apple, Illumina, NIO", "content": "[**U.S. Steel (X)**](https://www.wsj.com/market-data/quotes/X): The company [agreed to sell itself to Japan's Nippon Steel for $14.1 billion](https://www.wsj.com/business/earnings/nippon-steel-to-acquire-u-s-steel-for-55-shr-854c6f73).\n\nContinue reading", "link": "https://finance.yahoo.com/m/cb40952e-632d-31d4-989d-d22d2cfd9200/stocks-to-watch-monday%3A-u.s..html", "symbols": ["CLF.MX", "CLF.US", "CVA.F", "ILMN.US", "ILU.F", "USX1.F", "VFC.US", "VFP.F", "VOD.LSE", "VOD.US", "VODI.F", "VODI.XETRA", "VODJ.F", "VODN.MX", "VODPF.US", "X.BA", "X.MX", "X.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-12-18T14:25:53+00:00", "title": "3 Charts For Investors to Watch Monday: Illumina, Roku, Bitcoin", "content": "Here's our daily look at three charts connected to recent news-driven price moves, with key technical levels to monitor. Illumina, Inc. (ILMN) shares tumbled 3.3% on Friday but were rising in premarket trading Monday after the gene sequencing company announced over the weekend that it will divest its Grail unit, which manufactures blood test kits to detect early signs of cancer. The decision follows Friday’s finding by the federal appeals court that the company's $7.1 billion acquisition of Grail in 2021 was anticompetitive.\n\nContinue reading", "link": "https://finance.yahoo.com/m/cee1eab6-b199-3c57-a8e5-36a7dc1c05ff/3-charts-for-investors-to.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.758, "neg": 0.067, "neu": 0.915, "pos": 0.018}}, {"date": "2023-12-18T11:38:00+00:00", "title": "Treasury Yield Curve May Flip in 2024. The Fallout for Recession and Stocks.", "content": "Fed’s Goolsbee says it’s premature to declare inflation tamed, senators push forward on border security and Ukraine funding, and other news to start your day.\n\nContinue reading", "link": "https://finance.yahoo.com/m/da6ac751-fa38-3023-9a82-55d9ef663595/treasury-yield-curve-may-flip.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0, "neu": 0.915, "pos": 0.085}}, {"date": "2023-12-18T10:19:00+00:00", "title": "These Stocks Are Moving the Most Today: Illumina, NIO, Roku, Uber, Broadcom, and More", "content": "Illumina plans to sell its Grail unit, NIO gets a $2.2 billion investment, Roku stock receives another downgrade to Sell, and Uber joins the S&P 500 on Monday.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9ce10f96-b732-3cb2-8235-a4ad66431606/these-stocks-are-moving-the.html", "symbols": ["AVGO.US", "AVGO34.SA", "ILMN.US", "ILU.F", "U1BE34.SA", "UBER.US", "UT8.F", "UT8.STU"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-12-18T09:48:00+00:00", "title": "Illumina to Sell Grail. It’s Giving Up on Its Biotech Antitrust Battle.", "content": "The biotech firm Illumina said it would sell or spin off subsidiary Grail after a battle with regulators. Grail, which is seeking to market blood tests for cancer, was wholly acquired by San Diego-based Illumina in 2021 for $7.1 billion. U.S. and European regulators objected to the deal, arguing it would stifle medical innovation.\n\nContinue reading", "link": "https://finance.yahoo.com/m/18b42a10-badf-3188-a377-bd5821a1e527/illumina-to-sell-grail.-it%E2%80%99s.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.813, "neg": 0.157, "neu": 0.802, "pos": 0.041}}, {"date": "2023-12-18T07:48:42+00:00", "title": "US Steel, Illumina, Nio rise premarket; Apple, Southwest, Roku fall", "content": "Investing.com -- U.S. futures largely edged higher Monday at the start of the final full trading week of the year, continuing the recent rally with more Fed policymakers due to speak.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nUnited States Steel Corporation (NYSE:X) stock soared 28% after Japan's Nippon Steel said it would buy the steelmaker in a deal worth $14.9 billion including debt.\n\nApple (NASDAQ:AAPL) stock fell 0.5% after Bloomberg reported that more Chinese agencies and state-backed companies have asked their staff to not bring iPhones to work.\n\nSouthwest Airlines (NYSE:LUV) stock fell 0.4% after the carrier agreed to a $140 million penalty over the December 2022 holiday meltdown that led to 16,900 flight cancellations and stranded 2 million passengers.\n\nIllumina (NASDAQ:ILMN) stock rose 5.3% after the gene sequencing company said it would divest cancer diagnostic test maker Grail after difficulties from U.S. and European antitrust enforcers.\n\nNio (NYSE:NIO) ADRs rose 9.2% after the Chinese electric vehicle manufacturer signed an agreement with CYVN Holdings, an investment vehicle based in Abu Dhabi, in which the latter agreed to invest $2.2 billion.\n\nWyndham Hotels & Resorts (NYSE:WH) stock rose 1% after the budget hotel operator asked its shareholders to reject the takeover offer from Choice Hotels (NYSE:CHH), citing a regulatory review of up to 24 months and lower valuation.\n\nSalesforce (NYSE:CRM) stock rose 1.1% after Wolfe Research upgraded its stance on the software company to ‘outperform’ from ’peer perform’, saying the outlook for the company improved significantly.\n\nRoku  (NASDAQ:ROKU) stock fell 2.8% after Seaport Research downgraded the streaming device maker to ‘sell’ from ‘neutral’, citing valuation with its shares having risen 135% year-to-date.\n\nPGT Innovations (NYSE:PGTI) stock rose 8.9% after door maker Masonite International (NYSE:DOOR), down 1.9%, said it will acquire the manufacturer and supplier of windows and doors for $3 billion in a bid to expand its business.\n\nStory continues\n\nRelated Articles\n\nUS Steel, Illumina, Nio rise premarket; Apple, Southwest, Roku fall\n\nEarnings call: 51Talk reports solid Q3 growth, eyes future AI enhancements\n\nWall St opens higher, all eyes on economic data", "link": "https://finance.yahoo.com/news/us-steel-illumina-nio-rise-074842479.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "CHH.US", "CRM.US", "DOOR.US", "ILMN.US", "ILU.F", "LUV.MX", "LUV.US", "NIO.US", "PGTI.US", "R35.F", "ROKU.US"], "tags": [], "sentiment": {"polarity": 0.765, "neg": 0.046, "neu": 0.881, "pos": 0.073}}, {"date": "2023-12-18T06:47:55+00:00", "title": "Illumina rises premarket after gene-sequencing group announces Grail divestiture", "content": "Investing.com -- Illumina (NASDAQ:ILMN) shares edged higher in premarket trading in New York on Monday, after the gene-sequencing device maker said it will offload cancer screening start-up Grail.\n\nIn a statement on Sunday, San Diego-based Illumina noted that divestiture will be executed through a \"third-party sale or capital markets transaction\" and is expected to be finalized by the end of the second quarter of next year.\n\n\"We are committed to an expeditious divestiture of [Grail] in a manner that allows its technology to continue benefitting patients,\" said Chief Executive Jacob Thaysen in the statement. \"The management team and I continue to focus on our core business and supporting our customers. I am confident in Illumina's opportunities and our long-term success.\"\n\nIllumina acquired Grail in 2021 in an agreement that valued the seller of a blood test designed for the early detection of cancer at $7.1 billion. However, the agreement has faced heavy scrutiny, particularly after it was completed without the formal approval of the European Commission. The divesiture of Grail would be \"consistent\" with an order from Brussels, Illumina noted.\n\nThe troubled deal has also faced pushback from the U.S. Federal Trade Commission, which flagged that Illumina could deny crucial inputs into cancer-detecting blood tests made by Grail's rivals.\n\nOn Friday, a federal appeals court found that while the FTC was right to issue the challenge, it must conduct a new review of the purchase. Illumina said it would not appeal the ruling.\n\nMany investors in Illumina, including billionaire Carl Icahn, have also voiced their opposition to the Grail deal. Earlier this year, Icahn, arguing that the acquisition amounted to a breach of Illumina's fiduciary duties, helmed a proxy battle that led to the resignation of former boss Francis deSouza.\n\nIllumina's share price has slumped by over 37% so far this year.\n\nStory continues\n\nRelated Articles\n\nIllumina rises premarket after gene-sequencing group announces Grail divestiture\n\nDow Jones, Nasdaq, S&P 500 weekly preview: Eyeing record highs\n\nAdobe, Figma to terminate $20 billion deal over regulatory hurdles", "link": "https://finance.yahoo.com/news/illumina-rises-premarket-gene-sequencing-064755445.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.474, "neg": 0.066, "neu": 0.854, "pos": 0.08}}, {"date": "2023-12-18T06:30:45+00:00", "title": "PRESS DIGEST- Wall Street Journal - Dec 18", "content": "Dec 18 (Reuters) - The following are the top stories in the Wall Street Journal. Reuters has not verified these stories and does not vouch for their accuracy.\n\n- Gene-sequencing company Illumina said on Sunday it will divest itself of cancer blood test maker Grail, following Illumina's loss in its legal battle against U.S. antitrust regulators and facing fierce opposition from activist investor Carl Icahn.\n\n- Mitsubishi UFJ Financial Group agreed to buy Link Administration in a deal valuing the Australian financial technology company's equity at A$1.2 billion ($805.20 million).\n\n- Building materials supplier Adbri said it has received a takeover offer from U.S.-based CRH and the Barro Group that values its equity at around $1.41 billion.\n\n- The high-profile case of leading China critic Jimmy Lai opened in Hong Kong on Monday as the newspaper tycoon went on trial under the national security law imposed by Beijing.\n\n- U.S. Senate negotiations on linking border security to Ukraine aid stalled on Sunday, making it less likely that a vote will occur before the Christmas recess.\n\n- Dozens of New York Times employees have formed a group to take a stand on journalistic independence as concerns grow about the potential influence of the labor union that represents the Times and other outlets.\n\n($1 = 1.4903 Australian dollars) (Compiled by Bengaluru newsroom)", "link": "https://finance.yahoo.com/news/press-digest-wall-street-journal-063045130.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.052, "neg": 0.065, "neu": 0.867, "pos": 0.068}}, {"date": "2023-12-18T06:24:43+00:00", "title": "Futures edge up, Illumina to divest Grail - what's moving markets", "content": "Investing.com -- U.S. stock futures are in the green prior to the beginning of the last full trading week before the Christmas holiday, with investors eyeing the outlook for potential Federal Reserve interest rate cuts next year. Elsewhere, gene-sequencing group Illumina (NASDAQ:ILMN) announces plans to divest blood cancer-test seller Grail following intense antitrust scrutiny and shares in China's SenseTime slip after it announces the death of its founder.\n\n1. Futures edge higher\n\nU.S. stock futures inched higher on Monday, pointing to a possible extension in a Christmastime rally that has been fueled by hopes for a Federal Reserve policy pivot next year.\n\nBy 05:01 ET (10:01 GMT), the Dow futures contract had gained 73 points or 0.2%, S&P 500 futures had risen by 12 points or 0.2%, and Nasdaq 100 futures had inched up by 23 points or 0.1%.\n\nThe main indices on Wall Street were mixed to end the previous week after New York Fed President John Williams noted that policymakers were not \"really talking about\" interest rate cuts \"right now.\" The comments served to temper hopes that the central bank would start to lower rates from more than two-decade highs as early as the spring.\n\nLast week, the Fed voted to keep borrowing costs steady at 5.25% to 5.50%. However, fresh quarterly projections showed that members, buoyed by signs of cooling inflation and resilient economic growth, were pricing in 75 basis points in cuts in 2024. The announcement helped lift the benchmark S&P 500, 30-stock Dow Jones Industrial Average, and tech-heavy Nasdaq Composite to their seventh consecutive week of gains. U.S. Treasury yields, which move inversely to prices, also slipped.\n\n2. Gold shines\n\nThe Fed's dovish outlook has also driven a jump in gold prices, putting the yellow metal on pace for its first annual increase since 2020.\n\nAccording to Investing.com's Fed Rate Monitor Tool, investors now see a roughly 65% chance that the bank will unveil a quarter-point rate reduction as soon as March next year, up from just under 42% in the prior week. The probability that the Fed will roll out a further cut in May stands at around 58%, well above last week's mark of about 24%.\n\nStory continues\n\nThese expectations have dented the appeal of holding zero-yield bullion. A slide in the U.S. dollar has also burnished gold, making it less expensive for overseas buyers. The dollar index, which tracks the greenback against a basket of other currencies, shed 1.3% last week.\n\nAt 05:01 ET on Monday, spot gold prices had risen by 0.2% to $2,023.13 per troy ounce.\n\n3. Illumina to divest Grail\n\nIllumina has said it will divest cancer-screening start-up Grail, as the gene-sequencing device maker looks to appease antitrust regulators in both the U.S. and Europe.\n\nIn a statement on Sunday, San Diego-based Illumina noted that divestiture will be executed through a \"third-party sale or capital markets transaction.\"\n\nIllumina acquired Grail in 2021 in an agreement that valued the seller of a blood test designed for the early detection of cancer at $7.1 billion. However, the agreement has faced heavy scrutiny, particularly after it was completed without the formal approval of the European Commission. The divesiture of Grail would be \"consistent\" with an order from Brussels, Illumina noted.\n\nThe troubled deal has also faced pushback from the U.S. Federal Trade Commission, which flagged that Illumina could deny crucial inputs into cancer-detecting blood tests offered by Grail's rivals.\n\nOn Friday, a federal appeals court found that while the FTC was right to issue the challenge, it must conduct a new review of the purchase. Illumina said it would not appeal the ruling.\n\nShares in Illumina edged higher in premarket trading in New York on Monday.\n\n4. SenseTime shares slip after AI firm announces death of co-founder\n\nShares in SenseTime Group (HK:80020) slumped on Monday, touching an all-time low, after the Chinese artificial intelligence business announced that founder Tang Xiao'ou had died.\n\nSenseTime (HK:0020) said over the weekend that Tang had died of an unspecified illness on Friday. He was 55 years old, CNBC reported.\n\nTang, a professor at the Chinese University of Hong Kong, set up SenseTime in 2014. Its AI-based content generation and facial recognition technology have since received strong demand from both the public and private sectors.\n\nBut the firm has also been blacklisted by U.S. authorities since 2019. Washington has alleged that SenseTime aided Beijing in running state surveillance of Uyghur minorities in China's Xinjiang region.\n\n5. Oil choppy\n\nOil prices were volatile on Monday, as traders weighed Russian export reductions and jitters over attacks on commercial vessels in the Red Sea with weak business morale data out of top European economy Germany and a fresh forecast from Goldman Sachs.\n\nBy 06:23 ET, the U.S. crude futures traded 0.5% higher at $72.17 a barrel, while the Brent contract climbed by 0.6% to $76.99 per barrel. Both benchmarks posted limited gains last week, stemming seven straight weeks of declines, thanks in large part to hopes for Fed rate cuts next year.\n\nCrude prices received support from Russia, which said on Sunday that it would deepen oil export cuts in December by around 50,000 barrels per day. Additionally, concerns are growing over the potential for disruption to global supplies as a number of shipping firms said they would avoid the Suez Canal given the increase in assaults on commercial vessels in the Red Sea by Houthi militants in Yemen.\n\nHowever, according to figures from the Ifo Institute, the mood amongst German companies unexpectedly worsened in December, with energy-intensive industries \"having a particularly tough time.\" The survey said that firms were \"more skeptical about the first half of 2024.\"\n\nAlso impacting sentiment was a decision by Goldman Sachs to trim its price expectations for Brent crude in 2024 by $10 per barrel to between $70 to $90. The bank said strong U.S. output could mitigate possible upward pressure on oil prices.\n\nRelated Articles\n\nFutures edge up, Illumina to divest Grail - what's moving markets\n\nFed's Mester says next phase is to see how long its policy needs to remain 'restrictive' - FT\n\nHigher rates trigger big retreat in global non-bank sector", "link": "https://finance.yahoo.com/news/futures-edge-illumina-divest-grail-062443066.html", "symbols": ["0020.HK", "80020.HK", "ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.631, "neg": 0.079, "neu": 0.84, "pos": 0.081}}, {"date": "2023-12-18T01:16:00+00:00", "title": "Illumina to Shed Cancer-Test Maker Grail After Antitrust Battle", "content": "Gene-sequencing company Illumina said Sunday it will divest itself of cancer blood test maker Grail, following Illumina’s loss in its legal battle against U.S. antitrust regulators. Illumina said it will pursue the divestiture through a third-party sale or capital markets transaction, with a goal of completing terms by the middle of next year. The decision represents a victory for antitrust authorities in the U.S. and Europe, and their tougher scrutiny of corporate combinations.\n\nContinue reading", "link": "https://finance.yahoo.com/m/dd6f93f3-60aa-35dd-b43d-80203e86719d/illumina-to-shed-cancer-test.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.796, "neg": 0.117, "neu": 0.843, "pos": 0.04}}, {"date": "2023-12-17T23:17:45+00:00", "title": "Biotech giant Illumina will unwind takeover of cancer-screening company Grail", "content": "SAN DIEGO, Calif. (AP) — Biotech giant Illumina says it will undo its $7.1 billion purchase of the cancer-screening company Grail after losing legal battles with antitrust enforcers in the U.S. and Europe.\n\nSan Diego-based Illumina said in a Sunday statement that it made its decision to divest Grail after a U.S. appeals court ruled Friday that the merger could violate antitrust laws.\n\nThe European Union in October ordered the deal to be unwound because it closed in 2021 without regulatory approval from the 27-nation bloc. The EU earlier slapped a $475 million fine on Illumina for jumping the gun on the acquisition without its consent.\n\nIlumina said Sunday it had already pledged to divest Grail if it was not successful with either the European Court of Justice or in the Louisiana-based Fifth Circuit Court of Appeals, where the U.S. Federal Trade Commission case seeking to block the deal was most recently considered.\n\nThe company said the divestiture will happen through a third-party sale or capital markets transaction by the end of the second quarter of 2024.\n\nIllumina is a major supplier of next-generation sequencing systems for genetic and genomic analysis. Grail, based in Menlo Park, California, is a health company developing blood tests to try to catch cancer early.\n\n“We are committed to an expeditious divestiture of GRAIL in a manner that allows its technology to continue benefitting patients,” llumina CEO Jacob Thaysen said in a statement.\n\nThaysen began leading the company in September after months of tumult over the legal challenges.", "link": "https://finance.yahoo.com/news/biotech-giant-illumina-unwind-takeover-231745589.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.852, "neg": 0.086, "neu": 0.86, "pos": 0.054}}, {"date": "2023-12-17T20:52:20+00:00", "title": "Illumina To Sell Grail After U.S. Antitrust Ruling", "content": "Illumina said Sunday it will the sell cancer detection startup after a U.S. appeals court said the $7.1 billion deal violated antitrust laws,\n\nContinue reading", "link": "https://finance.yahoo.com/m/1bed1965-b2f6-332f-a671-67b141f057b1/illumina-to-sell-grail-after.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.832, "neg": 0.262, "neu": 0.738, "pos": 0}}, {"date": "2023-12-17T20:38:05+00:00", "title": "UPDATE 2-Illumina to divest cancer test maker Grail after antitrust battles", "content": "(Adds background in paragraphs 4, 8-9, 12)\n\nDec 17 (Reuters) - Gene sequencing company Illumina said on Sunday it will divest cancer diagnostic test maker Grail after the companies battled both U.S. and European antitrust enforcers for more than two years and faced fierce opposition from activist investor Carl Icahn.\n\nThe divestiture will be executed through a third-party sale or capital markets transaction, San Diego-based Illumina said in a statement, adding that it would finalize the terms by second quarter of 2024.\n\nGrail, valued at $7.1 billion under Illumina's deal, is seeking to market a blood test that can diagnose many kinds of cancer, known as a liquid biopsy.\n\nIllumina had spun off Grail in 2016 but retained a 12% stake. It reacquired Grail in 2021 despite competition concerns.\n\nA U.S. appeals court on Friday ordered the Federal Trade Commission (FTC) to conduct a new review of Illumina’s purchase of Grail, saying the agency had applied the wrong legal standard in its arguments. But the court said the FTC had substantial evidence to show the deal would lessen competition and opened the door to the regulator pursuing a new legal strategy to block the deal.\n\nThe FTC was concerned that Illumina, the dominant provider of DNA sequencing of tumors and cancer cells that help match patients with treatments most likely to benefit them, might raise prices or refuse to sell to Grail's test rivals.\n\nEurope had proposed measures for Illumina to unwind its acquisition of Grail.\n\nIn July, Illumina was fined a record 432 million euros ($471 million) by the European Union for closing its takeover of Grail before securing EU antitrust approval.\n\nIllumina had said in October it would divest Grail in 12 months, according to the terms of the European Commission's order, if the company does not win its challenge in court.\n\nLast week, Illumina argued that it does no business in Europe and therefore the EU competition enforcer has no jurisdiction.\n\nStory continues\n\nIllumina's acquisition of Grail also came under pressure from investors, including billionaire Icahn, who led a successful board challenge in May. Icahn in October sued Illumina, accusing the company of breaching its fiduciary duties over the Grail deal.\n\nIllumina's stock price has tumbled more than 37% so far this year, and the board replaced the CEO soon after Icahn won one board seat.\n\nNeither Grail nor Icahn immediately responded to Reuters requests for comment.\n\n($1 = 0.9179 euros) (Reporting by Anirudh Saligrama and Diane Bartz; Additional reporting by Svea Herbst-Bayliss; Editing by Deepa Babington and Bill Berkrot)", "link": "https://finance.yahoo.com/news/1-illumina-divest-cancer-test-203805212.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.837, "neg": 0.096, "neu": 0.827, "pos": 0.077}}, {"date": "2023-12-17T19:50:14+00:00", "title": "Illumina to divest cancer test maker Grail after antitrust battles", "content": "(Reuters) -Gene sequencing company Illumina said on Sunday it will divest cancer diagnostic test maker Grail after the companies battled both U.S. and European antitrust enforcers for more than two years and faced fierce opposition from activist investor Carl Icahn.\n\nThe divestiture will be executed through a third-party sale or capital markets transaction, San Diego-based Illumina said in a statement, adding that it would finalize the terms by second quarter of 2024.\n\nGrail, valued at $7.1 billion under Illumina's deal, is seeking to market a blood test that can diagnose many kinds of cancer, known as a liquid biopsy.\n\nIllumina had spun off Grail in 2016 but retained a 12% stake. It reacquired Grail in 2021 despite competition concerns.\n\nA U.S. appeals court on Friday ordered the Federal Trade Commission (FTC) to conduct a new review of Illumina’s purchase of Grail, saying the agency had applied the wrong legal standard in its arguments. But the court said the FTC had substantial evidence to show the deal would lessen competition and opened the door to the regulator pursuing a new legal strategy to block the deal.\n\nThe FTC was concerned that Illumina, the dominant provider of DNA sequencing of tumors and cancer cells that help match patients with treatments most likely to benefit them, might raise prices or refuse to sell to Grail's test rivals.\n\nEurope had proposed measures for Illumina to unwind its acquisition of Grail.\n\nIn July, Illumina was fined a record 432 million euros ($471 million) by the European Union for closing its takeover of Grail before securing EU antitrust approval.\n\nIllumina had said in October it would divest Grail in 12 months, according to the terms of the European Commission's order, if the company does not win its challenge in court.\n\nLast week, Illumina argued that it does no business in Europe and therefore the EU competition enforcer has no jurisdiction.\n\nIllumina's acquisition of Grail also came under pressure from investors, including billionaire Icahn, who led a successful board challenge in May. Icahn in October sued Illumina, accusing the company of breaching its fiduciary duties over the Grail deal.\n\nStory continues\n\nIllumina's stock price has tumbled more than 37% so far this year, and the board replaced the CEO soon after Icahn won one board seat.\n\nNeither Grail nor Icahn immediately responded to Reuters requests for comment.\n\n($1 = 0.9179 euros)\n\n(Reporting by Anirudh Saligrama and Diane Bartz; Additional reporting by Svea Herbst-Bayliss; Editing by Deepa Babington and Bill Berkrot)", "link": "https://finance.yahoo.com/news/illumina-divest-cancer-test-maker-195014865.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": -0.837, "neg": 0.098, "neu": 0.824, "pos": 0.078}}, {"date": "2023-12-17T19:37:00+00:00", "title": "Illumina Announces Decision to Divest GRAIL", "content": "SAN DIEGO, Dec. 17, 2023 /PRNewswire/ -- Today, Illumina, Inc. (NASDAQ: ILMN) announced that the company will divest GRAIL.\n\nThe divestiture will be executed through a third-party sale or capital markets transaction, consistent with the European Commission's divestiture order, with the goal of finalizing the terms by the end of the second quarter of 2024.\n\nOn December 15, the U.S. Fifth Circuit Court of Appeals issued its decision in the matter of Illumina v. the Federal Trade Commission. Following a review of the Court's opinion, Illumina has elected not to pursue further appeals of the Fifth Circuit's decision. As the company has previously stated, if it was not successful with either its European Court of Justice jurisdictional appeal or in a final decision of the Fifth Circuit, it would divest GRAIL.\n\n\"We are committed to an expeditious divestiture of GRAIL in a manner that allows its technology to continue benefitting patients,\" said Jacob Thaysen, CEO of Illumina. \"The management team and I continue to focus on our core business and supporting our customers. I am confident in Illumina's opportunities and our long-term success.\"\n\nCautionary Note on Forward-Looking Statements This release may contain forward-looking statements that involve risks and uncertainties.\n\nAmong the important factors to which our business is subject that could cause actual results to differ materially from those in any forward-looking statements are: (i) our ability to agree on a divestment plan with the European Commission pursuant to the divestment order it has issued; (ii) our ability to timely execute a strategic alternative that maximizes the value of GRAIL to our stockholders given the parameters required by the divestment order; (iii) the risk that ongoing legal proceedings challenging the decisions of the European Commission and the U.S. Federal Trade Commission do not result in favorable outcomes for us; (iv) the risk that distractions associated with the potential divestment of GRAIL and associated legal proceedings or regulatory obligations will harm our business, including current plans and operations, together with other factors detailed in our filings with the Securities and Exchange Commission, including our most recent filings on Forms 10-K and 10-Q, or in information disclosed in public conference calls, the date and time of which are released beforehand. We undertake no obligation, and do not intend, to update these forward-looking statements, to review or confirm analysts' expectations, or to provide interim reports or updates on the progress of the current quarter.\n\nStory continues\n\nCautionary Note on Statements of Opinion In addition to forward-looking statements, this release contains statements of opinion with which all may not agree.\n\nAbout Illumina Illumina is improving human health by unlocking the power of the genome. Our focus on innovation has established us as a global leader in DNA sequencing and array-based technologies, serving customers in the research, clinical, and applied markets. Our products are used for applications in the life sciences, oncology, reproductive health, agriculture, and other emerging segments. To learn more, visit illumina.com and connect with us on X (Twitter), Facebook, LinkedIn, Instagram, TikTok and YouTube.\n\nInvestors:\r\nSalli Schwartz\r\n858-291-6421\r\nIR@illumina.com\n\nMedia:\r\nDavid McAlpine\r\n347-327-1336\r\nPR@illumina.com Cision\n\nView original content:https://www.prnewswire.com/news-releases/illumina-announces-decision-to-divest-grail-302017383.html\n\nSOURCE Illumina, Inc.", "link": "https://finance.yahoo.com/news/illumina-announces-decision-divest-grail-193700156.html", "symbols": ["ILMN.US", "ILU.F"], "tags": [], "sentiment": {"polarity": 0.97, "neg": 0.039, "neu": 0.875, "pos": 0.086}}]