[{"date": "2023-09-11T23:05:00+00:00", "title": "Three Takeaways from Elon Musk’s New Biography", "content": "The biography said Musk's decision-making was \"bold, stubborn, reckless, visionary,\" and \"at times surprisingly flexible.\"\n\nContinue reading", "link": "https://finance.yahoo.com/m/a0d0b34f-3464-3c25-bd8e-44c5a026144b/three-takeaways-from-elon.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.494, "neg": 0.25, "neu": 0.648, "pos": 0.102}}, {"date": "2023-09-11T21:58:46+00:00", "title": "Updated Covid vaccines, Oracle earnings, Tesla stock jumps: Top Stories", "content": "The U.S. Food and Drug Administration has approved updated Covid vaccines from Pfizer (PFE) and Moderna (MRNA) to combat new virus variants amid a surge in new cases and hospitalizations. Oracle (ORCL) shares moved lower in after-hours trading after reporting mixed fiscal first quarter results. Lastly, Tesla (TSLA) stock jumped after Morgan Stanley (MS) upgraded the stock to \"Overweight\" from \"Equal Weight\" and issued a $400 price target, citing a potential boost from its Dojo supercomputer. Yahoo Finance's Akiko Fujita breaks down the top stories of the day.", "link": "https://finance.yahoo.com/video/updated-covid-vaccines-oracle-earnings-215846161.html", "symbols": ["0QF.F", "MRNA.US", "ORC.F", "ORC.XETRA", "ORCL.MX", "ORCL.US", "ORCL34.SA", "PFE.F", "PFE.MX", "PFE.US", "PFE.XETRA", "PFIZ34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.599, "neg": 0.049, "neu": 0.849, "pos": 0.102}}, {"date": "2023-09-11T21:53:33+00:00", "title": "Biographer Walter Isaacson Dissects Why Elon Musk Is So Difficult", "content": "Walter Isaacson (right) interviews Elon Musk onstage during “The State of Innovation” at the Vanity Fair New Establishment Summit in 2014, Michael Kovac/Getty Images for Vanity Fair\n\nElon Musk’s biographer Walter Isaacson blames the Tesla (TSLA) and SpaceX CEO’s volatile personality for a lot of things, but still believes Musk will be remembered as a pioneer who brought society to a new era of exploration.\n\n“There’s no single Elon Musk. He has many personalities,” Isaacson said in an interview with CBS Sunday Morning that aired yesterday (Sept. 10). After observing the billionaire entrepreneur for two years, Isaacson says Musk can “go from being very giddy and funny to being deeply in engineering mode, and then suddenly the dark cloud happens.”\n\nReferring to Robert Louis Stevenson’s 1886 horror fiction, Isaacson added, “It’s almost like Dr. Jekyll and Mr. Hyde.”\n\nIt has been well documented by journalists and people who work for Musk how difficult a boss he can sometimes be, especially by the standards of the industries he operates in, like automobiles and aerospace. During an interview with CBS correspondent David Pogue at SpaceX’s factory in Texas, Isaacson said, “When Musk and I would walk along this corridor and he would see people being a little lethargic or not enough people [were present], he would say, ‘Where’s everybody? Let’s get moving, this needs to be done by tonight.’ That would never happen at Boeing.”\n\n“There are people who really try to avoid eye contact because he can be brutal, he can get really mad, he can unload on people,” Isaacson said.\n\nThe author said such a harsh management style is driven by a genuine urgency for humans to go to Mars and become multi-planetary, the core mission of SpaceX. He believes Musk’s adventurous spirit and lack of empathy are largely a result of his traumatic childhood memories, especially of his father, Errol Musk.\n\n“It has left deep scars on him, the way his father treated him when he was bullied on the schoolyard, when his face was pounded into the concrete steps, and his father took the side of the person who beat him up instead of Elon,” Isaacson said. “He says to me, ‘Yeah, I don’t have as much empathy. I’m not like you. I don’t want the person in front of me just to love me. I got to get this mission done.”\n\nStory continues\n\nIsaacson’s new book, Elon Musk, will arrive at bookstores nationwide on Sept. 12. He has been sharing snippets of the book on social media since August. Last week, Isaacson published an adapted excerpt in TIME magazine about Musk’s clash with other tech leaders over artificial intelligence. Musk commented on the article on X, formerly Twitter, “Not quite how I would tell the story, but very accurate for an observer who only saw part of the puzzle.”\n\nThis content is not available due to your privacy preferences.Update your settings here to see it.\n\nWhen Pogue asked Isaacson whether he admires Musk after having written a book about him, Isaacson replied, “A biographer has to show the light and the dark strands, and you’ve got to be critical of the dark strands, you’ve got to be admiring the light strands. But then the toughest thing is to show how they intertwine.”\n\n“He brought us to the era of electric vehicles when GM and Ford had given up. He said, ‘Yes, we can shoot astronauts into orbit’ when NASA had decommissioned the Space Shuttle,” Isaacson said of Musk’s legacy. “S0, 100 years from now, we’ll still be baffled in some ways about how dark he could be. But we’ll say, yeah he put his finger on the surface of history and the ripple came out.”\n\nTrending Observer Stories\n\nIn Philanthropy: Bernard Arnault's $10 Billion Donation and More Ford CEO Jim Farley Explains Why F-150 and Mustang Are the First to Go Electric OpenAI Abruptly Shuts Down ChatGPT Plagiarism Detector—And Educators Are Worried Starfield Review: This Game's Vast Universe Will Have You Feeling Like Han Solo Signs You Need to Detox Your Liver ASAP—And How to Do It\n\nRead the original story Biographer Walter Isaacson Dissects Why Elon Musk Is So Difficult and others by Sissi Cao at Observer.", "link": "https://finance.yahoo.com/news/biographer-walter-isaacson-dissects-why-215333915.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.917, "neg": 0.087, "neu": 0.84, "pos": 0.073}}, {"date": "2023-09-11T21:52:00+00:00", "title": "Tesla rival Volkswagen showcases a new sporty electric vehicle", "content": "When it comes to luxury electric vehicles, Tesla has a strong lineup of cars and SUVs to stay ahead of the competition for high-end vehicles. The Tesla Model S price was lowered recently to $74,990, while the Model S Plaid decreased to $89,990. Only weeks ago, the Model S was priced at $88,490 and the Model S Plaid was $108,490.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e10b2d9f-de48-3dd3-813d-cf114e16e390/tesla-rival-volkswagen.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0.025, "neu": 0.92, "pos": 0.055}}, {"date": "2023-09-11T21:51:00+00:00", "title": "Dow Up 3 Straight Sessions, Nasdaq Leads on Tesla Upgrade", "content": "Don’t look now, but the Dow has quietly put together a new three-day winning streak. All major indices closed in the green today, with the S&P 500 and Nasdaq notching back-to-back up-days. The Dow gained 87 points on the session, +0.25%, while the Nasdaq posted an impressive +156 points, +1.14%. The S&P and small-cap Russell 2000 gained +0.67% and +0.23%, respectively. The tech-heavy Nasdaq is the first of the major indices to swing back to positive over the past month of trading.\r\n\r\nAside from a Tesla TSLA upgrade from Morgan Stanley this morning — leading to +10% gains for the EV leader, on news that a potential half-trillion-dollar gain in market value on the company’s Dojo supercomputer, which was been compared favorably with Amazon’s AMZN AWS — there haven’t been much in terms of market catalysts for today’s trading. No major economic reports nor quarterly earnings results had hit the tape this morning.\r\n\r\nThis changed somewhat this afternoon, with Oracle’s ORCL fiscal Q1 results out after today’s close. As per normal, the tech giant beat expectations slightly on the bottom line, but only matched on the top. Earnings of $1.19 per share amounted to a 5-cent beat, while $12.45 billion in quarterly sales was exactly what the Zacks consensus had been. Cloud infrastructure reportedly grew +66% in the quarter — a high margin compared with Oracle’s competition.\r\n\r\nThis marks the fourth-straight earnings beat for the company, which has only missed on its bottom line twice in the past five years. Yet shares are trading down -5% on this earnings news, likely because the enterprise software major had already been trading at 22x earnings, and is up more than +50% year to date. It’s an emerging player in the A.I. space, so has benefitted from that tech-bull windfall that saw companies like NVIDIA NVDA lead the Nasdaq higher this year.\r\n\r\nWe’ll be quiet for the most part tomorrow, as well — no major economic prints are expected, Fed members are in a blackout period before next week’s FOMC meeting, and no big companies are reporting earnings — it being between general earnings seasons — until Thursday, when Adobe ADBE and Lennar Homes LEN come out with quarterly results. That said, there’s clearly been an upward bias, although it’s unclear how high market participants are likely to ride this wave on such scant data. Perhaps Wednesday’s CPI numbers will be the next catalyst.\r\n\r\nQuestions or comments about this article and/or author? Click here>>\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\n\nNVIDIA Corporation (NVDA) : Free Stock Analysis Report\n\nOracle Corporation (ORCL) : Free Stock Analysis Report\n\nAdobe Inc. (ADBE) : Free Stock Analysis Report\n\nLennar Corporation (LEN) : Free Stock Analysis Report\n\nTesla, Inc. (TSLA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/dow-3-straight-sessions-nasdaq-215100277.html", "symbols": ["ORC.F", "ORC.XETRA", "ORCL.MX", "ORCL.US", "ORCL34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.027, "neu": 0.813, "pos": 0.16}}, {"date": "2023-09-11T21:49:00+00:00", "title": "Tesla &amp; 2 Other Upgrades to Watch", "content": "Tesla TSLA shares soared in today’s session, adding 10% following a recent upgrade from Morgan Stanley’s Adam Jonas. The updated price target for Tesla shares now sits at $400 per share (street high), up from the previous $250 per share target.\n\nWe see analyst upgrades and downgrades daily, commonly coming paired with updated price targets. They can be helpful tools for investors, providing a more structured plan and helping to inject positivity surrounding future performance.\n\nOf course, stocks don’t straightforwardly reach price targets, as unforeseen circumstances can always influence performance. Overall, the shift in sentiment can be seen as a primary takeaway from these upgrades.\n\nOutside of Tesla, several other companies, including McDonald’s MCD and Owens Corning OC, have seen recent upgrades among analysts. Let’s take a closer look at each.\n\nTesla\n\nTesla’s upgrade was centered around optimism for its custom supercomputer, Dojo, which is expected to generate remarkable value for the EV titan as it continues its push into its ‘Full Self-Driving’ capabilities.\n\nThe supercomputer has been under considerable attention for some time now, especially as artificial intelligence (AI) grips the world. It’s a considerably bullish call, with the new $400 per share price target reflecting 53% upside from current levels.\n\nOwens Corning\n\nOwens Corning is a world leader in building materials systems and composite solutions. Goldman Sachs updated its price target for OC shares from $113 per share to $150 per share.\n\nThe company has enjoyed positive earnings estimate revisions across the board, helping land the stock into a favorable Zacks Rank #1 (Strong Buy). Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nOwens Corning recently posted quarterly results well above expectations, exceeding the Zacks Consensus EPS Estimate by more than 25% and delivering a 2% revenue surprise. Shares have been boosted following back-to-back releases, as we can see illustrated below.\n\nStory continues Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nMcDonald’s\n\nWe’re all familiar with McDonald’s, seeing those golden arches at seemingly every turn. Wells Fargo recently upgraded MCD shares to overweight from equal weight, with a $310 per share price target.\n\nLike OC, analysts have become bullish on McDonald’s earnings outlook, with earnings expectations increasing modestly across all timeframes. The stock is currently a Zacks Rank #2 (Buy). Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nThe company is forecasted to post solid growth in its current year, with Zacks Consensus Estimates suggesting 13% earnings growth on 10% higher revenues.\n\nBottom Line\n\nPrice targets can be helpful tools. Of course, it’s critical to note that not all stocks reach these forecasted levels, as unforeseen circumstances can always affect future performance.\n\nStill, the positivity surrounding upgrades can be seen as a solid takeaway. And positivity is precisely what Tesla TSLA shares enjoyed in today’s session, tacking on 10% in value.\n\nOutside of Tesla, McDonald’s MCD and Owens Corning OC have also received recent favorable upgrades.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nMcDonald's Corporation (MCD) : Free Stock Analysis Report\n\nTesla, Inc. (TSLA) : Free Stock Analysis Report\n\nOwens Corning Inc (OC) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/tesla-2-other-upgrades-watch-214900075.html", "symbols": ["O5Q.F", "OC.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.01, "neu": 0.796, "pos": 0.194}}, {"date": "2023-09-11T21:02:34+00:00", "title": "Dow Jones Futures: Tesla Stock Breaks Out; Key Inflation Reports, Apple iPhone 15 Event Next", "content": "Dow Jones futures: Tesla stock broke out past a new buy point in today's stock market. Apple's iPhone 15 event is up next.\n\nContinue reading", "link": "https://finance.yahoo.com/m/7274d717-f5fc-3551-9bbe-b7a651fc0cbb/dow-jones-futures%3A-tesla.html", "symbols": ["307.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "SHOP.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.422, "neg": 0.109, "neu": 0.891, "pos": 0}}, {"date": "2023-09-11T20:54:38+00:00", "title": "S&amp;P 500 Gains and Losses Today: Index Climbs Amid Signs Fed Could Pause Rate Increases", "content": "U.S. equities gained on Monday, Sept. 11, 2023, with the S&P 500 Index rising 0.7%, amid expectations Fed policymakers might not raise interest rates at their meeting next week.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1356060c-3ad4-3343-b7e6-93f5b3f4e150/s%26p-500-gains-and-losses.html", "symbols": ["JM2.F", "SJM.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.253, "neg": 0.048, "neu": 0.874, "pos": 0.078}}, {"date": "2023-09-11T20:36:06+00:00", "title": "Dow Jones Rallies; Elon Musk Makes This AI Boast As Tesla Stock Rockets; Uber Clears Buy Point", "content": "The Dow Jones rallied. Tesla stock soared past a buy point as Elon Musk boasted of value drivers, including AI. Uber stock cleared an entry.\n\nContinue reading", "link": "https://finance.yahoo.com/m/3742c77c-211f-3831-a718-6523871543e3/dow-jones-rallies%3B-elon-musk.html", "symbols": ["DJI.INDX", "GSPC.INDX", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.473, "neg": 0, "neu": 0.855, "pos": 0.145}}, {"date": "2023-09-11T20:35:00+00:00", "title": "S&amp;P 500: Tesla, Apple Chipmaker Lead Big Movers", "content": "Tesla led the S&P 500 Monday, surging on an upgrade. Apple chipmaker Qualcomm rose solidly. Aerospace giant RTX led losers.\n\nContinue reading", "link": "https://finance.yahoo.com/m/08576c67-2d89-3e3b-a68c-39c48274122c/s%26p-500%3A-tesla%2C-apple.html", "symbols": ["CVS.F", "CVS.MX", "CVS.US", "CVSH34.SA", "GSPC.INDX", "JM2.F", "QCI.F", "QCI.XETRA", "QCOM.MX", "QCOM.US", "SJM.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.527, "neg": 0.139, "neu": 0.861, "pos": 0}}, {"date": "2023-09-11T20:20:00+00:00", "title": "These Stocks Moved the Most Today: Tesla, Qualcomm, Disney, Hostess Brands, RTX, Meta, and More", "content": "Shares of Tesla were upgraded to Buy from Hold at Morgan Stanley, Qualcomm said it will supply modem chips for Apple's iPhones through 2026, and Disney and Charter reached an agreement to restore popular channels to the cable operator.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a10aa54c-d304-3da8-8a15-b1844cbf0dbd/these-stocks-moved-the-most.html", "symbols": ["9988.HK", "AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AHLA.F", "AHLA.XETRA", "APC.F", "APC.XETRA", "BABA.US", "BABA34.SA", "BABAF.US", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US"], "tags": [], "sentiment": {"polarity": 0.869, "neg": 0, "neu": 0.753, "pos": 0.247}}, {"date": "2023-09-11T20:10:11+00:00", "title": "Stock Market Today: Nasdaq Leads Broad Rally as Tesla Stock Soars", "content": "Tesla shares surged after receiving an AI-related upgrade, which helped boost the broader market.\n\nStocks closed higher Monday as market participants took a glass-half-full stance ahead of this Wednesday's key inflation report.\n\nThe Federal Reserve has repeatedly said it will remain data dependent in determining if more rate hikes are needed to bring inflation down to its 2% target. After raising interest rates in July, the central bank is widely expected to keep them unchanged at next week's meeting.\n\nAs such, investors are anxiously awaiting Wednesday morning's release of the August Consumer Price Index (CPI) report. Many experts believe headline CPI accelerated in August as gas prices jumped. However, the core CPI reading, which excludes volatile food and energy prices, is expected to decline on an annual basis vs July's figure.\n\nAhead of this highly anticipated event, futures traders are pricing in a 93% chance for a pause at the next Fed meeting later this month with low probabilities for any additional rate hikes through the rest of this year, according to CME Group.\n\nMorgan Stanley sees significant upside ahead for Tesla\n\nTesla (TSLA) was one of Monday's biggest gainers, with the mega-cap stock surging 10.1% after Morgan Stanley analyst Adam Jonas upgraded it to Overweight from Equal Weight, the equivalents of Buy and Hold, respectively. The analyst also boosted his price target on TSLA stock to $400 from $250, representing implied upside of nearly 50% to current levels.\n\nJonas is optimistic that Dojo, Tesla's new artificial intelligence (AI) supercomputer, will help propel growth in the company's software division, opening up new markets that extend beyond electric vehicles. Additionally, the analyst thinks Dojo has the capacity to add $500 billion to the company's enterprise value.\n\nSmucker scoops up Hostess Brands\n\nIn other single-stock news, Hostess Brands (TWNK) spiked 19.1% after J.M. Smucker (SJM) said it will buy the Twinkies maker for $5.6 billion in cash and stock. \"The acquisition adds a fast-growing, pure-play snacking company to SJM's portfolio, including exposure to indulgent and impulse snacking occasions,\" says CFRA Research analyst Arun Sundaram.\n\nStory continues\n\nHowever, SJM stock slumped 7.0% on the news as the purchase \"not only seems expensive and includes stock, but it seems to bear some resemblance to the Big Heart Pet Brands acquisition from 2015, which, safe to say, didn't go fully according to plan,\" Sundaram adds.\n\nElsewhere, Qualcomm (QCOM) rose 3.9% after Apple (AAPL, +0.7%) said it will buy the company's 5G modems for smartphones for at least another three years. Apple will remain in the headlines tomorrow, with the tech giant hosting its September event. The company is expected to unveil the latest versions of the iPhone and Apple Watch at the annual event.\n\nAs for the major indexes, the Nasdaq Composite rose 1.1% to 13,917, the S&P 500 added 0.7% to 4,487, and the Dow Jones Industrial Average gained 0.3% to 34,663.\n\nRelated content\n\nWhen Will Payouts Begin in $725M Facebook Settlement? Kiplinger's Weekly Earnings Calendar for This Week HHS Calls For Cannabis Reclassification: This Week in Cannabis Investing", "link": "https://finance.yahoo.com/news/stock-market-today-nasdaq-leads-201011709.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "JM2.F", "SJM.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.978, "neg": 0.009, "neu": 0.92, "pos": 0.07}}, {"date": "2023-09-11T19:11:58+00:00", "title": "AI supercomputer could boost Tesla’s valuation by $480bn, City predicts", "content": "tesla elon musk\n\nTesla shares have surged after a Wall Street bank predicted that the electric car company’s value would rise above $1.2 trillion (£958bn) because of investments in an artificial intelligence supercomputer.\n\nMorgan Stanley predicted that Tesla’s “Dojo” AI system used to train driverless cars could give the company an “asymmetric advantage” against rival carmakers.\n\nElon Musk, Tesla’s chief executive, has said that driverless software will make his cars significantly more valuable, although the arrival of autonomous Teslas have taken longer than he predicted.\n\nTesla has said it expects to invest more than $1bn in its Dojo supercomputer, a high-powered system using thousands of custom microchips that can process huge quantities of video footage collected by its cars.\n\nA “beta” version of the company’s Full Self Driving system is available to Tesla owners in the US and Canada, but Mr Musk has repeatedly predicted that the cars will soon be able to operate as fully fledged “robo-taxis”.\n\nMorgan Stanley analysts said revenues from this and licensing the technology to other carmakers means that Tesla’s share price would climb from $248.50 to $400. This would raise its market value from $789bn to $1.27 trillion. It said under a “bull case” scenario the company could be worth more than $1.7 trillion.\n\nTesla shares jumped by more than 9pc, giving it a value of around $850bn.\n\nMr Musk has increasingly sought to focus on artificial intelligence as more car manufacturers, particularly in China, develop electric vehicles.\n\nHe has unveiled a robot named Optimus that he says will be able to do “anything that humans don’t want to do”.\n\nTesla’s autonomous technology has earned the company repeated scrutiny from regulators. A more basic version, Autopilot, is the subject of multiple investigations over concerns ranging from phantom braking to failing to stop around emergency vehicles.\n\nHowever, many commentators have been impressed with improvements in the company’s Full Self Driving system, which is being tested by thousands of owners.\n\nTesla has turned to developing its own microchip for the Dojo system due to the high cost of in-demand processors made by Nvidia.\n\nMorgan Stanley analysts wrote: “Investors have long debated whether Tesla is an auto company or a tech company. We believe it’s both, but see the biggest value driver from here being software and services revenue.”", "link": "https://uk.finance.yahoo.com/news/ai-supercomputer-could-boost-tesla-191158473.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.98, "neg": 0.026, "neu": 0.869, "pos": 0.105}}, {"date": "2023-09-11T19:11:06+00:00", "title": "Dow Jones Fights For Key Level; Tesla Rockets Past Entry As Elon Musk Boasts Of These Value Drivers", "content": "The Dow Jones rallied. Tesla stock soared past an entry as Elon Musk boasted of value drivers, including AI. Meta stock surged.\n\nContinue reading", "link": "https://finance.yahoo.com/m/3742c77c-211f-3831-a718-6523871543e3/dow-jones-fights-for-key.html", "symbols": ["DJI.INDX", "GSPC.INDX", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0, "neu": 0.906, "pos": 0.094}}, {"date": "2023-09-11T19:08:03+00:00", "title": "Dow futures trade steady, Oracle sheds 8.7% after-hours", "content": "Investing.com - U.S. stock futures were little changed during Monday night trade after major benchmark averages posted a positive session, led by gains in Tesla Inc (NASDAQ:TSLA) after an upgrade from Morgan Stanley (NYSE:MS) analysts, with participants looking ahead to key inflation data set for release later in the week.\n\nBy 6:30pm ET (10:30pm GMT) Dow Jones Futures were flat while S&P 500 Futures and Nasdaq 100 Futures lost 0.1% apiece.\n\nIn extended deals, Oracle (NYSE:ORCL) lost 8.7% after the company reported Q1 EPS of $1.19 versus $1.15 expected on revenues of $12.5 billion versus $12.44 billion expected.\n\nAhead in Tuesday's trade, investors will be monitoring NFIB small business optimism, as well as the Fed's Redbook and budget balance.\n\nDuring Monday's session, the Dow Jones Industrial Average added 87.1 points or 0.3% to 34,663.7, the S&P 500 gained 30 points or 0.7% to 4,487.5 and the NASDAQ Composite lifted 156.4 points or 1.1% to 13,917.9.\n\nOn the bond markets, United States 10-Year rates were at 4.289%.\n\nRelated Articles\n\nDow futures trade steady, Oracle sheds 8.7% after-hours\n\nUAW says some progress in labor talks but wide divide remains\n\nNasdaq ends sharply higher as Tesla soars on AI optimism", "link": "https://finance.yahoo.com/news/dow-futures-trade-steady-oracle-190803407.html", "symbols": ["DJI.INDX", "IXIC.INDX", "MS.US", "ORC.F", "ORC.XETRA", "ORCL.MX", "ORCL.US", "ORCL34.SA", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.916, "neg": 0.016, "neu": 0.896, "pos": 0.088}}, {"date": "2023-09-11T19:00:14+00:00", "title": "Does Elon Musk Have Too Much Power? SpaceX Prevents Nuclear Escalation In Ukraine Conflict And Reconnects Maui Victims After Brutal Fire As Some Fear The Billionaire Has Too Much Power", "content": "SpaceX, led by visionary entrepreneur and Tesla Inc. CEO Elon Musk, has showcased its potential as a game-changer in both crisis response and geopolitics. Recent events have spotlighted the company's involvement in the Maui wildfire recovery efforts and a contentious episode related to the Ukraine-Russia conflict.\n\nDon’t Miss:\n\nUntil 2016 it was illegal for retail investors to invest in high-growth startups. Thanks to changes in federal law, this Kevin O’Leary-Backed Startup Lets You Become a Venture Capitalist With $100 Airbnb was worth $47 billion at IPO. This New ‘Airbnb For RV's' Platform Takes On The $540 Million RV Rental Market With 25% In Savings And $50,000 For Renters is open for anyone to invest.\n\nMaui Wildfire Crisis: SpaceX Offers A Lifeline\n\nThe devastating wildfires in Maui, Hawaii, have left a path of destruction, with numerous structures destroyed, critical infrastructure damaged and a rising death toll. Amid this tragedy, Musk announced on social media platform X, formerly Twitter, that SpaceX and Tesla are aiding in relief efforts.\n\nSpaceX's Starlink, an internet service powered by a constellation of satellites, has emerged as a vital asset in these trying times. The company disclosed that over 650 Starlink kits have been distributed to various organizations on Maui, facilitating recovery efforts. Organizations like Red Lightning Disaster Relief have procured these systems to reestablish vital communication lines.\n\nWhile the extent of the damage is still being assessed, with estimates ranging between $3.5 billion and $7 billion, the assistance from Musk's companies has provided a beacon of hope. Tesla's contribution is yet to be detailed, but several Tesla owners’ clubs are supporting relief initiatives in Maui.\n\nSpaceX And The Ukraine-Russia Dispute\n\nWhile SpaceX's involvement in Maui is largely seen in a positive light, the company has faced criticism regarding its role in the Ukraine-Russia conflict.\n\nStory continues\n\nA soon-to-be-published biography of Musk claims that he instructed engineers to disable the Starlink network over Russian-occupied Crimea. The move purportedly was to prevent a Ukrainian drone strike on Russia's Black Sea fleet. Musk's concern was that the attack could amplify hostilities, potentially leading to a catastrophic nuclear conflict.\n\nUkraine has vehemently criticized Musk's decision. Mykhailo Podolyak, an adviser to Ukrainian President Volodymyr Zelenskyy, took to X to express his dismay. He pointed out that Russia's naval fleet, spared from the drone attack, continued its assault on Ukrainian cities.\n\nMusk, in his defense, stated that Starlink was not deactivated. Instead, he had chosen not to activate certain regions to avoid direct involvement in the conflict. Musk's decision, while controversial, demonstrates the increasing influence of private enterprises in geopolitical affairs.\n\nConcerns Over Elon Musk's Influence\n\nMusk’s pivotal role in recent global events, particularly as highlighted in the Ukraine-Russia conflict, sparked concerns among analysts and observers regarding the concentration of power within private entities.\n\nWith SpaceX's Starlink technology possessing the capability to influence military operations, there's growing apprehension about the unchecked influence and decision-making power of individual corporate leaders. The ability of a single entrepreneur to potentially sway the course of international conflicts raises profound questions about the balance of power in the modern age, blurring the traditional lines between statecraft and corporate influence.\n\nMusk continues to become an increasingly powerful figure on a global scale. In many instances, his social media posts have moved markets by the tens of billions of dollars. Musk's lead on the \"World's Richest Person\" list continues to grow as Tesla stock approaches the $1 trillion mark and his other startup ventures grow in value. As his wealth increases to the size of many of the largest companies on the S&P 500 and Nasdaq Stock Exchange, it's likely his prominence and influence will continue to grow as well.\n\nSpaceX, with its groundbreaking technologies, has showcased its potential to be a force for good, as seen in Maui. However, as the Ukraine episode reveals, the company's global reach also presents ethical and political challenges. As the boundaries between state and corporate power blur, decisions made by influential figures like Musk are bound to spark both praise and scrutiny.\n\nSee more on startup investing:\n\nConsuming too much caffeine but still tired? This startup found The Secret Behind Why Your Coffee and CBD Might Not Be Working Gamers are selling their old gaming items for millions. Learn why everyday gamers and investors are claiming a stake in their side hustles and how they invested over $1.2 million in this startup\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Does Elon Musk Have Too Much Power? SpaceX Prevents Nuclear Escalation In Ukraine Conflict And Reconnects Maui Victims After Brutal Fire As Some Fear The Billionaire Has Too Much Power originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/does-elon-musk-too-much-190014452.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.943, "neg": 0.126, "neu": 0.761, "pos": 0.112}}, {"date": "2023-09-11T16:57:04+00:00", "title": "Tesla Doubles China Market Share While Its Chinese EV Rivals Expand To Europe", "content": "In August, China's passenger vehicle sales returned to year-on-year growth as they rose 2.2% YoY to 1.94 million units, as reported by the China Passenger Car Association (CPCA) on Friday. Last week, Tesla Inc (NASDAQ: TSLA) reported that its EV sales rose 9.3% YoY in August, with its market share of the Chinese EV market almost doubling from July as sales were boosted by lowered prices and increased production at its Shanghai plant.\n\nOptimistic Figures On The Chinese EV Front\n\nThis is the first monthly year-on-year gain since May with sales also increasing 8.5% quarter over quarter, or more precisely, from July. During the first eight months of 2023, sales rose 1.8% YoY to 13.38 million units.\n\nTesla’s August Figures\n\nIn August, Tesla increased its market share from July’s 7.5% to 13.2%, according to Reuters calculations based on the CPCA data. Tesla sales rose 8.5% quarter-over-quarter, from July. In August alone, Tesla sold 64,694 cars in China while delivering 65,316 of made-in-China Model Y. According to the CPCA, Tesla delivered 84,159 made-in-China EVs in August, which is a 31% rise from July when its Shanghai plant was shut temporarily to perform the necessary upgrades. Year to date, Tesla has built approximately 625,000 EVs in China, up from about 400,000 during 2022’s comparable period.\n\nAlso this week, Tesla unveiled a revamped Model 3 made at its Shanghai plant at this year’s auto show in Munich. This model comes with a lower range and a heftier price tag, but Tesla lowered its prices twice last month and announced further reduction last Friday.\n\nMeanwhile, Tesla’s Chinese EV Rivals Are Coming To Europe...\n\nLast Monday, Warren Buffett-backed Chinese EV giant BYD Company Limited (OTC: BYDDY) launched its Seal electric sedan for Europe at the IAA Mobility motor show in Munich. BYD came to the show with a strong EV lineup with as many as six models, clearly showing it will be going for its share of the European market pie. The Tesla rival showed its ambition to become an export juggernaut. BYD already overtook Volkswagen in China as the country’s best-selling brand and during the first eight months of 2023, BYD sold 1.8 million vehicles that include EVs and plug-in hybrids, which translates to an 83% YoY rise.\n\nStory continues\n\nIts smaller domestic rival Xpeng Inc (NYSE: XPEV) also revealed its European expansion plans during the show in Munich. Xpeng announced its plans to expand into Germany as early as next year. Xpeng is already selling two models in Norway, Sweden, Denmark and the Netherlands. The arrival of Tesla rivals, or more precisely Chinese EV firms, is seen as a big threat and last warning to European automakers who are moving too slowly towards the all-electric era. Although neither BYD nor Xpeng enjoy the brand recognition of legacy European automakers, their aggressive entry can certainly do a lot of harm to even the strongest automakers. Moreover, Xpeng has the back of Volkswagen who has almost a 5% stake in the company.  This year’s automotive show in Munich emphasized the strength of Chinese players on the EV battlefield with around 40% of the presenters being from Asia. Volkswagen already lost its China crown and now it will need to fight its Chinese EV rivals under its home turf like the rest of European legacy automakers, but Volkswagen is at least counting on the EV know-how of Xpeng. Tesla is no longer alone in runing the EV show.\n\nDISCLAIMER: This content is for informational purposes only. It is not intended as investing advice.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Tesla Doubles China Market Share While Its Chinese EV Rivals Expand To Europe originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/tesla-doubles-china-market-share-165704344.html", "symbols": ["002594.SHE", "1211.HK", "BY6.F", "BY6A.F", "BYDDF.US", "BYDDY.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA", "XPEV.US"], "tags": [], "sentiment": {"polarity": 0.981, "neg": 0.054, "neu": 0.849, "pos": 0.097}}, {"date": "2023-09-11T16:55:04+00:00", "title": "Dow Jones Leader Caterpillar, Tesla Stock In Or Near Buy Zones In Today's Stock Market", "content": "Dow Jones leader Caterpillar, along with Tesla stock and Amazon, are in or near buy zones in today's stock market action.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1ab8f8dd-44c2-3332-a9f0-44b41f5ed9b1/dow-jones-leader-caterpillar%2C.html", "symbols": ["4PN.F", "4PN.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "CARR.US", "CAT.MX", "CAT.US", "CAT1.F", "CAT1.XETRA", "CATR.PA", "DJI.INDX", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0, "neu": 0.928, "pos": 0.072}}, {"date": "2023-09-11T16:39:04+00:00", "title": "Markets Gain at Midday Amid Expectations Fed Might Not Hike Rates at Next Meeting", "content": "U.S. equities rose at midday on Monday, Sept. 11, 2023, amid expectations Fed policymakers might not raise interest rates at their meeting next week.\n\nContinue reading", "link": "https://finance.yahoo.com/m/3b8747d2-ece7-34dd-8c5c-aa8241515753/markets-gain-at-midday-amid.html", "symbols": ["CHTR.US", "CQD.F", "DIS.MX", "DIS.US", "DISB34.SA", "GSPC.INDX", "JM2.F", "SJM.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA", "WDP.F", "WDP.XETRA"], "tags": [], "sentiment": {"polarity": -0.15, "neg": 0.06, "neu": 0.94, "pos": 0}}, {"date": "2023-09-11T16:29:00+00:00", "title": "Bill Gates committed a cardinal sin in Elon Musk's eyes", "content": "An investment decision cost Gates a friendship with the world's richest man and placed him in Elon Musk's 'innermost circle of hell.'\n\nContinue reading", "link": "https://finance.yahoo.com/m/201e458c-da5a-3dca-b638-1af21f65a82f/bill-gates-committed-a.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.743, "neg": 0, "neu": 0.769, "pos": 0.231}}, {"date": "2023-09-11T16:12:27+00:00", "title": "Stock Market Today: Dow rides tesla, big tech gains higher; Apple event eyed", "content": "Investing.com -- The Dow closed higher Monday, as tesla and big tech combined to ensure stocks started the week on the front foot ahead of Apple's eagerly anticipated iPhone 15 launch due Tuesday and inflation data later this week.\n\nThe Dow Jones Industrial Average added 0.3%, 88 points, Nasdaq rallied 1.2%, and the S&P 500 rose 0.7%, the S&P 500 rose 0.7%.\n\nTesla accelerates on autonomous driving software optimism\n\nTesla (NASDAQ:TSLA) rose more than 10% after Morgan Stanley upgraded the electrical vehicle maker to overweight from equalweight, on optimism that its supercomputer Dojo -- which can process data from Tesla vehicles on the road to train AI models for self-driving cars -- could boost adoption of ‘robotaxis’ and network services, boosting Tesla’s market value by as much as $500 billion.\n\n“We believe that Dojo can add up to $500bn to Tesla's enterprise value, expressed through a faster adoption rate in Mobility (robotaxi) and Network Services (SaaS),” Morgan Stanley analysts wrote in a client note.\n\nQualcomm shines bright despite dull day for chips; Apple iPhone launch eyed\n\nQualcomm Incorporated (NASDAQ:QCOM), up about 4%, was the outperformer among chip stocks after the chipmaker expanded its deal to supply Appel with 5G modems for its iPhones through 2025.\n\nThe deal comes just a day ahead of Apple (NASDAQ:AAPL)'s launch event due Tuesday at 1pm ET when the company is expected to unveil the new the iPhone 15 that some on Wall Street expect spur a slew of upgrades from customers.\n\nWedbush estimates that about 25% of Apple’s 1.2 billion installed base has not upgraded their iPhone in 4 years, paving the way for Apple to capitalize on the opportunity by raising prices for the iPhone 15 pro and max models, setting up for a new \"mini super cycle.”\n\nMedia stocks rise as Disney, Charter end cable-fees beef\n\nDisney and Charter Communications (NASDAQ:CHTR) agreed to a deal to resolve a dispute over cable fees that had blocked Charter’s cable customers from watching several Disney-owed channels including ESPN and ABC this month.\n\nStory continues\n\nCharter, which had been pushing for concessions allowing its cable customers to choose which networks it wanted as part of their service, didn't close financial terms of the deal, but said some of its Spectrum customers would have access to ad-supported apps Disney+ and ESPN+ as part of their packages.\n\nThe move boosted sentiment on media stocks including Fox Corp Class A (NASDAQ:FOXA), Paramount (NASDAQ:PARA) and Warner Bros Discovery Inc (NASDAQ:WBD).\n\nDeal News: JM Smucker in 5.6 billion deal to buy Hostess\n\nJM Smucker (NYSE:SJM) struck a deal Monday to buy Hostess Brands (NASDAQ:TWNK) for $34.25 a share in a deal that valued that latter at about $5.6 billion. Smucker fell 6%, while Hostess jumped 19% to fresh 52-week high.\n\nJM Smucker came out on top amid competition from General Mills (NYSE:GIS) to buy the Hostess Brands, which returned to public markets in 2016 after going private.\n\nRelated Articles\n\nStock Market Today: Dow rides tesla, big tech gains higher; Apple event eyed\n\nJPMorgan CEO Jamie Dimon blasts draft US bank capital rules\n\nOracle sees revenue below estimates as cloud spending sputters", "link": "https://finance.yahoo.com/news/stock-market-today-dow-rides-161227731.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "CHTR.US", "CQD.F", "DJI.INDX", "FOXA.US", "GIS.US", "GSPC.INDX", "JM2.F", "PARA.US", "QCI.F", "QCI.XETRA", "QCOM.MX", "QCOM.US"], "tags": [], "sentiment": {"polarity": 0.983, "neg": 0.014, "neu": 0.903, "pos": 0.082}}, {"date": "2023-09-11T15:44:41+00:00", "title": "Let's put a stake in the 'great man' biography — starting with Isaacson's 'Elon Musk'", "content": "Elon Musk, seen in June, is the subject of Walter Isaacson's new 688-page biography. (Chesnot / Getty Images)\n\nThe opening pages of “Elon Musk,” the new doorstop biography from Walter Isaacson, the bestselling chronicler of the great innovative men of modern history, are jarring, especially to anyone expecting to be greeted with plucky tales of unlikely genius.\n\nOn the first page, we’re told that Musk, the CEO of Tesla and SpaceX, owner of X (formerly Twitter), and currently the world’s richest man, was born into a land of incredible violence in South Africa, “with machine gun attacks and knife killings common,” where boys have to “wade through pools of blood” on the way to concerts and are sent to wilderness camps that resemble “a paramilitary Lord of the Flies,” per Musk. Young Elon is bullied relentlessly — by his classmates but also by his abusive father — until he grows big enough to fight back.\n\nIntroducing the 688-page biography this way seems designed to address Musk’s recent turn towards combativeness and cruelty — if not justifying it, then offering a skeleton key to understanding where it’s rooted. But as we learn throughout the book, the Musks are persistent fabulists, prone to embellishment and fabrication, and this becomes the first of many narrative sequences that the reader must consider with an eye to truth versus narrative convenience.\n\nRead more:The biggest ideas and pettiest rages in Walter Isaacson's Elon Musk biography\n\nAnd Isaacson’s truth is, above all, selective. Given Musk’s recent coziness with white nationalists and peddlers of junk race science and his ongoing tirade against the Anti-Defamation League, whom he blames (rather than himself) for chasing advertisers from Twitter, it seems startling that nothing in those opening pages touches on his experiences with apartheid. Much of that horrendous violence unfolding in 1980s South Africa was precipitated by a brutally racist government; we discover only that it taught Musk to survive adversity. “My pain threshold is very high,” he tells Isaacson.\n\nWe do learn that Musk’s Canadian grandfather was involved in a fringe political party with antisemitic views and relocated his family to South Africa because he liked the government better — he is described as harboring “quirky conservative views” — and that Musk’s father is now outspokenly racist. But in a book that goes to great lengths to dissect the transmission of habits and ideas from father and son, Elon is allowed to stay mum.\n\nStory continues\n\nSilences like that come to haunt the capacious hull of “Elon Musk” — to the point that they risk drowning out the project altogether.\n\nAfter the burst of violence in the introduction, we move into more familiar territory, led on by Isaacson’s brisk, propulsive prose: Musk is a spacy, lonely outsider who is bright but has trouble making friends. He disappears into video games and science fiction and soon dreams of horizons far beyond his hometown, and sets out to North America with an entrepreneurial spirit in tow. He graduates with a dual degree in physics and economics from the University of Pennsylvania, gets accepted into a PhD program at Stanford, but decides instead to set out into the buzzing startup scene of Silicon Valley.\n\nHe founds Zip2 with his brother Kimbal, sells it, and makes a lot of money. He founds the first iteration of X.com, merges with PayPal, and makes even more. Initially the CEO of both companies, he’s pushed out of each — in a bit of foreshadowing, Musk is booted from PayPal because of his monomaniacal dedication to the porn-adjacent letter X, as well as the idea that PayPal should try to “take over the world’s financial system.” His dismissal, brought about in a coup led by Peter Thiel and other members of the so-called PayPal mafia, leaves him with a large pool of cash, an ax or two to grind and an aspiration to take on loftier goals.\n\nRead more:What drove Elon Musk — onetime Democratic 'fanboy' — to troll progressive politics\n\nHere the limitations of Isaacson’s project are revealed: Musk had pushed some of the worst ideas of his young career. From a business perspective, it seemed his colleagues were correct to oust him, preserve their product and make them all fabulously wealthy in an IPO and later sale to EBay. But here’s Isaacson’s diagnosis: “He was a visionary who didn’t play well with others.” The word \"visionary,\" in this application, is doing a lot of work.\n\nThe narrative is filled with moments of similar dissonance, with Isaacson quick to praise Musk’s incessant risk-taking after a disaster, or to excuse his rude behavior to underlings as necessary to get things done, or to nod along in prose while Musk announces his latest idea that will transform the world. He does occasionally push back, as when Musk claims the Hyperloop will change everything (“It did not change everything”), but Isaacson mostly accepts Musk’s confident prognostications as gospel.\n\nIsaacson — biographer of Steve Jobs, Albert Einstein, Henry Kissinger, Benjamin Franklin — is concerned with the study of world-moving men (and occasionally a woman). What makes innovators tick? What makes them so successful? (In the case of Musk, the prognosis can be summarized as: a large appetite for risk, a willingness to alienate colleagues, a detailed knowledge of industry and science, an ability to process work tasks like an algorithm and a predilection for drawing lessons from video games and “The Hitchhiker’s Guide to the Galaxy.”)\n\nRead more:Elon Musk confirms he and Grimes privately welcomed a third child, Techno Mechanicus\n\nThis sort of framing may have made sense in the early aughts, when so many were dizzy with optimism that Amazon’s everything store and the iPhone would transform the world for the better. It makes less sense 12 years after “Steve Jobs” — now that we’ve seen the toll the tech giants have levied on society: labor exploitation at Amazon, Uber and, yes, Tesla; misinformation and harassment on social media platforms like Facebook, Instagram and, yes, Twitter. These costs are almost entirely omitted from the equation of “Elon Musk.”\n\nThat may be because there is a tacit pact between author and subject in the Isaacson “great man” biography: The author will unearth unflattering personal anecdotes and share stories about the subject’s capacity to be cruel. In exchange, the subject’s greatness will be treated as an assumption, the raison d’etre for the book itself. In honor of Isaacson’s habit of using pithy, memorable phrases to describe a phenomenon, we might call it “the Isaacson Accord.”\n\nAnd so it is in “Elon Musk,” whose subject is described as “a visionary” and a “risk-taking innovator” and, most pointedly, “the one launching us toward Mars and an electric-vehicle future.” Musk’s many fans will surely take those descriptors as a given. But that seems all the more reason to challenge the assumptions. Because the Isaacson Accord turns out to be a devil’s bargain. We get a lot of palace intrigue, well-told anecdotes and some genuine insight into Musk’s familial psychology; but the good stuff almost comes in spite of Isaacson’s constant framing of Musk as a moody but brilliant world-mover.\n\nWorse, in exchange for unprecedented access, the Isaacson Accord demands that a lot of the most difficult and pressing questions go unasked and, therefore, unanswered.\n\nIsaacson repeatedly says one of Musk’s unparalleled strengths as a manager is his intimate knowledge of the factory floors where his products are made. Yet there is not a single mention of the sweeping allegations of racial discrimination at Tesla’s flagship Fremont factory that resulted in juries finding Tesla liable for millions in damages. Workers of color say they were called the N-word and saw swastikas painted on the bathroom. In 2021, Tesla was ordered to pay $137 million to one employee who suffered racist abuse, though that amount was later reduced.\n\nRead more:Walter Isaacson brings 'Elon Musk' to book club this fall\n\nLikewise, there is no examination of the union drives at Tesla plants, or the wrongful termination case Tesla lost after firing a worker involved in organizing. In all the discussion of Tesla’s self-driving Autopilot program, there is no mention of the blockbuster revelation from a former engineer that one of the first key promotions of Autopilot was staged, contributing to the false sense of security buyers had in the program.\n\nAnd while a major focus of the book is the impact of Musk’s abusive father and the traits that might have been passed down, Isaacson speeds past any explanation of the falling out with Musk’s trans daughter, Jenna, allowing Musk to file it away as her political views simply having grown too radical. Isaacson does not list her as a source in the book, as her twin brother, and does not say whether he tried to reach out. Musk’s story, about Jenna having succumbed to the “woke mind virus,” stands.\n\nNo biography can or should be totally comprehensive, but it’s pretty easy to conclude which sorts of topics and conversations Isaacson decided it would be best to avoid altogether. I started “Elon Musk” wondering if the world needed another book positioning Musk as a great man — Ashlee Vance’s book of the same title ably covered many of the same bases — and finished thinking it’s time to retire the entire genre of \"great innovator\" biographies, period.\n\nThe idea that the future is created by flawed geniuses who happen to accumulate great wealth is outmoded and simplistic, and it encourages a flattened view of how technology is developed and whom it impacts. Just scan the list of sources Isaacson includes in the book: executives, venture capitalists, founders and high-ranking engineers. Yes, Isaacson spoke to “adversaries” like Jeff Bezos and Bill Gates, but not (at least per the list) to line workers, not to Jenna, not to anyone whose family member died in an Autopilot crash, nor anyone who tried to organize a Tesla plant.\n\nThe bottom line: This is the story Musk himself wants told. Sure, he might have excluded a handful of the details that proved personally embarrassing, but nothing here challenges the idea that Elon Musk is an all-too-human hero valiantly trying to save humanity from the threats he sees cascading down upon us. It’s the book Musk would have written himself.\n\nSign up for our Book Club newsletter to get the latest Los Angeles book news, events and more.\n\nThis story originally appeared in Los Angeles Times.", "link": "https://finance.yahoo.com/news/lets-put-stake-great-man-154441230.html", "symbols": ["2PP.F", "2PP.XETRA", "PYPL.US", "PYPL34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.188, "neg": 0.107, "neu": 0.781, "pos": 0.111}}, {"date": "2023-09-11T15:32:59+00:00", "title": "Unveiling Tesla (TSLA)'s Value: Is It Really Priced Right? A Comprehensive Guide", "content": "Today, Tesla Inc (NASDAQ:TSLA) experienced a gain of 6.5%, marking a 3-month gain of 8.19%. With an Earnings Per Share (EPS) (EPS) of 3.53, the question arises: Is Tesla significantly undervalued? In this article, we will delve into the valuation analysis of Tesla, aiming to provide an answer to this question. We invite you to read on for a comprehensive examination of Tesla's market value.\n\nCompany Introduction\n\nWarning! GuruFocus has detected 2 Warning Sign with TSLA. Click here to check it out.  TSLA 30-Year Financial Data The intrinsic value of TSLA\n\nFounded in 2003, Tesla Inc is a California-based sustainable energy company. It aims to transition the world to electric mobility by manufacturing electric vehicles. Tesla also sells solar panels and solar roofs for energy generation, plus batteries for stationary storage for residential and commercial properties. In 2022, Tesla delivered over 1.3 million vehicles globally.\n\nAt its current price of $264.66 per share, Tesla has a market cap of $840 billion. However, according to the GF Value, an estimation of fair value, Tesla's intrinsic value stands at $456.92 per share, suggesting that the stock is significantly undervalued. Unveiling Tesla (TSLA)'s Value: Is It Really Priced Right? A Comprehensive Guide\n\nUnderstanding GF Value\n\nThe GF Value is a proprietary measure that represents the current intrinsic value of a stock. This measure is derived from three factors: historical multiples (PE Ratio, PS Ratio, PB Ratio, and Price-to-Free-Cash-Flow) that the stock has traded at, GuruFocus adjustment factor based on the company's past returns and growth, and future estimates of the business performance. The GF Value Line on our summary page provides an overview of the fair value that the stock should ideally be traded at.\n\nBased on the GF Value, Tesla (NASDAQ:TSLA) stock is believed to be significantly undervalued. This suggests that the long-term return of its stock is likely to be much higher than its business growth. Unveiling Tesla (TSLA)'s Value: Is It Really Priced Right? A Comprehensive Guide\n\nLink: These companies may deliver higher future returns at reduced risk.\n\nExamining Tesla's Financial Strength\n\nInvesting in companies with poor financial strength can lead to a higher risk of permanent loss of capital. Thus, it is crucial to review the financial strength of a company before deciding to buy its stock. Tesla's cash-to-debt ratio stands at 3.97, which is better than 79.98% of 1209 companies in the Vehicles & Parts industry. GuruFocus ranks the overall financial strength of Tesla at 9 out of 10, indicating strong financial health.\n\nStory continues Unveiling Tesla (TSLA)'s Value: Is It Really Priced Right? A Comprehensive Guide\n\nProfitability and Growth\n\nInvesting in profitable companies, especially those demonstrating consistent profitability over the long term, usually poses less risk. Tesla has been profitable for 3 out of the past 10 years. Over the past twelve months, the company had a revenue of $94 billion and an EPS of $3.53. Its operating margin is 13.49%, which ranks better than 87.84% of 1225 companies in the Vehicles & Parts industry. Overall, GuruFocus ranks Tesla's profitability at 5 out of 10, indicating fair profitability.\n\nOne of the most important factors in the valuation of a company is its growth. Companies that grow faster create more value for shareholders, especially if that growth is profitable. Tesla's average annual revenue growth is 36.4%, which ranks better than 93.83% of 1183 companies in the Vehicles & Parts industry. Its 3-year average EBITDA growth is 83.9%, which ranks better than 97.17% of 1060 companies in the same industry.\n\nROIC vs WACC\n\nAnother way to assess the profitability of a company is to compare its return on invested capital (ROIC) and the weighted cost of capital (WACC). The ROIC measures how well a company generates cash flow relative to the capital it has invested in its business. The WACC is the rate that a company is expected to pay on average to all its security holders to finance its assets. Ideally, the ROIC should be higher than the WACC. For the past 12 months, Tesla's ROIC is 24.6, and its WACC is 17.38. Unveiling Tesla (TSLA)'s Value: Is It Really Priced Right? A Comprehensive Guide\n\nConclusion\n\nIn conclusion, Tesla's stock is believed to be significantly undervalued. The company's financial condition is strong, and its profitability is fair. Its growth ranks better than 97.17% of 1060 companies in the Vehicles & Parts industry. For a more detailed examination of Tesla's financials, you can check out its 30-Year Financials here.\n\nTo find out the high-quality companies that may deliver above-average returns, please check out the GuruFocus High Quality Low Capex Screener.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/unveiling-tesla-tsla-value-really-153259578.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.023, "neu": 0.774, "pos": 0.203}}, {"date": "2023-09-11T15:29:48+00:00", "title": "S&amp;P 500 rises as tesla, big tech rack up gains", "content": "Investing.com -- The S&P 500 rose Monday, led by a rally in tesla and big tech as bullish bets on stocks emerged a day ahead of Apple’s eagerly anticipated iPhone 15 launch.\n\nThe S&P 500 rose 0.6%, the Dow Jones Industrial Average added 0.2%, 73 points, Nasdaq rallied 1%.\n\nTesla accelerates on autonomous driving software optimism\n\nTesla (NASDAQ:TSLA) rose more than 9% after Morgan Stanley upgraded the electrical vehicle maker to overweight from equalweight, on optimism that its supercomputer Dojo -- which can process data from Tesla vehicles on the road to train AI models for self-driving cars -- could boost adoption of ‘robotaxis’ and network services, boosting Tesla’s market value by as much as $500 billion.\n\n“We believe that Dojo can add up to $500bn to Tesla's enterprise value, expressed through a faster adoption rate in Mobility (robotaxi) and Network Services (SaaS),” Morgan Stanley analysts wrote in a client note.\n\nQualcomm shines bright despite dull day for chips; Apple iPhone launch eyed\n\nQualcomm Incorporated (NASDAQ:QCOM), up 4%, was the outperformer among chip stocks after the chipmaker agreed a deal to supply Appel with 5G modems for its iPhones through 2025.\n\nThe deal comes just a day ahead of Apple (NASDAQ:AAPL)'s launch event due Tuesday at 1pm ET when the company is expected to unveil the new the iPhone 15 that some on Wall Street expect spur a slew of upgrades from customers.\n\nWedbush estimates that about 25% of Apple’s 1.2 billion installed base has not upgraded their iPhone in 4 years, paving the way for Apple to capitalize on the opportunity by raising prices for the iPhone 15 pro and max models, setting up for a new \"mini super cycle.”\n\nMedia stocks rise as Disney, Charter end cable-fees beef\n\nDisney and Charter Communications (NASDAQ:CHTR) agreed to a deal to resolve a dispute over cable fees that had blocked Charter’s cable customers from watching several Disney-owed channels including ESPN and ABC this month.\n\nStory continues\n\nCharter, which had been pushing for concessions allowing its cable customers to choose which networks it wanted as part of their service, didn't close financial terms of the deal, but said some of its Spectrum customers would have access to ad-supported apps Disney+ and ESPN+ as part of their packages.\n\nThe move boosted sentiment on media stocks including Fox Corp Class A (NASDAQ:FOXA), Paramount (NASDAQ:PARA) and Warner Bros Discovery Inc (NASDAQ:WBD).\n\nDeal News: JM Smucker in 5.6 billion deal to buy Hostess\n\nJM Smucker (NYSE:SJM) struck a deal Monday to buy Hostess Brands (NASDAQ:TWNK) for $34.25 a share in a deal that valued that latter at about $5.6 billion. Smucker fell 6%, while Hostess jumped 19% to fresh 52-week high.\n\nJM Smucker came out on top amid competition from General Mills (NYSE:GIS) to buy the Hostess Brands, which returned to public markets in 2016 after going private.\n\nRelated Articles\n\nTesla jumps as analyst predicts $600 billion value boost from Dojo\n\nNasdaq ends sharply higher as Tesla soars on AI optimism", "link": "https://finance.yahoo.com/news/p-500-rises-tesla-big-152948537.html", "symbols": ["AAPL.US", "CHTR.US", "FOXA.US", "GIS.US", "PARA.US", "QCI.F", "QCI.XETRA", "QCOM.MX", "QCOM.US", "SJM.US", "TSLA.US", "TWNK.US", "WBD.US"], "tags": [], "sentiment": {"polarity": 0.99, "neg": 0.015, "neu": 0.884, "pos": 0.101}}, {"date": "2023-09-11T15:23:54+00:00", "title": "Tesla: Unmasking Musk", "content": "Tesla Inc (NASDAQ:TSLA) is experiencing sideways movement, creating a narrowing price range after the Department of Justice (DoJ) and Securities and Exchange Commission (SEC) initiated investigations against Tesla Inc (NASDAQ:TSLA) over the misappropriation of funds for Musks secret Glass House project.\n\nUndoubtedly, Musk has a long history of influencing Tesla Inc (NASDAQ:TSLA)s stock price due to his comments on social media and frequent interactions with regulators. However, savvy investors can consider this recurring phenomenon a good opportunity to accumulate shares.\n\nWarning! GuruFocus has detected 2 Warning Sign with TSLA. Click here to check it out.  TSLA 30-Year Financial Data The intrinsic value of TSLA\n\nTechnically, the stock is at a critical level. Here, the article analyzes recent fundamental developments along with a technical assessment of the stock to derive a decisive conclusion on the course of investment in Tesla Inc (NASDAQ:TSLA).\n\nThe \"No-Longer\" Secret Glass House Project\n\nThe \"secret glass house,\" known as \"Project 42,\" is a project that Tesla Inc (NASDAQ:TSLA) has been working on near its facilities in Austin, Texas. This project involves the construction of a glass structure, which was planned to include living spaces such as bedrooms, bathrooms, and a kitchen. The design concepts for this structure have been described as a \"twisted hexagon\" or a glass cube similar to Apple's 5th Avenue store.\n\nWhat makes Project 42 notable is that it has been investigated by two government agencies: the US Attorney's Office for the Southern District of New York and the SEC. The SEC is investigating whether Tesla Inc (NASDAQ:TSLA) used company funds for the project, while the US Attorney's Office is looking into whether Tesla Inc (NASDAQ:TSLA) CEO Elon Musk violated any laws by using company resources for personal benefit.\n\nImplications of the Federal Probes\n\nThe ongoing federal probes into Tesla Inc (NASDAQ:TSLA)'s potential misuse of company resources and battery range claims could have significant implications for its valuation and stock price. If these investigations reveal evidence of wrongdoing or misrepresentation by Tesla Inc (NASDAQ:TSLA), it may erode investor confidence and lead to negative sentiment surrounding the company.\n\nStory continues\n\nSpecifically, the probe into constructing a large glass house for Elon Musk's personal use could raise concerns about corporate governance and the allocation of company funds. Any findings of financial impropriety could lead to regulatory fines or legal penalties, impacting Tesla Inc (NASDAQ:TSLA)'s finances and potentially reducing its valuation in the short run.\n\nImpact on Tesla's Reputation\n\nMoreover, investigating battery range claims may affect Tesla Inc (NASDAQ:TSLA)'s reputation for product quality and transparency. If it is proven that Tesla Inc (NASDAQ:TSLA) deliberately misrepresented the range of its electric cars, it could lead to customer dissatisfaction and potential legal actions, which may harm sales and brand trust. Tesla: Unmasking Musk\n\nSource: tradingview.com\n\nAccelerated Revenue, Autonomous Driving Milestones, and a Bright Future Ahead\n\nTesla Inc (NASDAQ:TSLA)'s automotive and services revenue is aggressively increasing, with 46% and 47% YoY in Q2 2023, supported mainly by the strong trend in the global EV market and China's strong participation in EV sales. At the bottom line, the company's operational efficiency brought significant YoY growth in non-GAAP EPS and free cash flow of 20% and 62%, respectively, demonstrating a strong result from operations and a liquidity position that breeds further internal strength to expand.\n\nDelivery Targets and Autonomous Driving\n\nBeyond top- and bottom-line outperformance, other fundamentals are in play during the quarter. Tesla Inc (NASDAQ:TSLA) set a target of delivering 1.8 million vehicles in the current year. However, it anticipates a slight decrease in production during Q3 due to factory upgrades (summer shutdowns). These production and delivery numbers are critical indicators of the company's value growth, and it has already reached over 50% of the target during H1 2023. With over 300 million miles driven using Full Self-Driving ((FSD)) beta, Tesla Inc (NASDAQ:TSLA) has significantly solidified its autonomous driving capabilities.\n\nDojo Training Computer and Future Developments\n\nAdditionally, Tesla Inc (NASDAQ:TSLA)'s Dojo training computer is designed to reduce the cost of neural net training, a critical component for autonomous driving. The company expects to achieve an in-house neural net training capability of 100 exaflops by the end of the following year. The development of this technology can affect Tesla Inc (NASDAQ:TSLA)'s cost structure and competitiveness and support a leap forward in market valuation. Tesla: Unmasking Musk\n\nSource: digitalassets.tesla\n\nUpcoming Product Launches\n\nAlso, Tesla Inc (NASDAQ:TSLA) is preparing to launch the Cybertruck, a $25K affordable EV (a game changer for Tesla Inc (NASDAQ:TSLA)). The Cybertruck is highly anticipated in Tesla Inc (NASDAQ:TSLA)'s targeted market, and an obvious acceleration in revenue and market share in the highly competitive pickup truck segment (against legacy players like Ford and competition from Chinese EV makers) will benefit the company and stock considerably over the long term.\n\nFocus on Battery Production and Energy Storage\n\nFurthermore, Tesla Inc (NASDAQ:TSLA)'s focus on battery production includes the 4680 cells produced in Texas. The company achieved an 80% increase in cell production in Q2 and reduced cell COGS by 25%. Further developments in battery technology, such as silicon integration and in-house cathode production, can impact Tesla Inc (NASDAQ:TSLA)'s battery cost and energy density. On the other hand, Tesla Inc (NASDAQ:TSLA)'s energy storage products, including Megapack, are showing strong demand globally. The company is also growing its auto bidder contracts in wholesale markets. These products may boost Tesla Inc (NASDAQ:TSLA)'s energy generation and storage revenue with a definitive margin.\n\nThe Texas Factor\n\nFundamentally, the Texas factor is favorable for Tesla Inc (NASDAQ:TSLA), as the company scored a significant win in Texas with the approval of a plan that mandates its technology in EV charging stations for federal funding eligibility. Texas is a major beneficiary of the $5 billion U.S. highway electrification program, which could boost Tesla Inc (NASDAQ:TSLA)'s charging infrastructure and potentially increase its market share. Tesla: Unmasking Musk\n\nSource: counterpointresearch.com\n\nTechnical View: A Strong Entry Point for Long-Term Investors\n\nAll the above developments in Tesla Inc (NASDAQ:TSLA)s operational and business environment are shaping a strong entry point for long-term investors.\n\nIn the monthly time frame, Tesla Inc (NASDAQ:TSLA)s stock price has created a head and shoulders pattern with a neckline near $101 with Relative Strength Index ((RSI)) confirmation. Breaking the neckline is fundamentally less likely, as it may require a mega loss for Tesla Inc (NASDAQ:TSLA) in qualitative or quantitative measures. So, the neckline is becoming a critical support in the long term. Here, at the weekly timeframe, the stock price has changed polarity to $211 with a solid uptrend line.\n\nInvestment Strategy\n\nNow, putting the factors one by one will make the picture clear. The recent SEC and DOJ probe may create temporary downside pressure on the stock, bringing the price into an ideal buying range of $211$155. However, operational efficiency, profitability, and other fundamentals (product deliveries, charging network, and technology adoption by the government and other key EV players) may bring the price above $300 (shoulders) in the coming months.\n\nOverall, investors can take advantage of further dips (below $211, with RSI near 30) in the stock price, as beyond $300, the stock may create new highs over the long-term bullish trajectory. Tesla: Unmasking Musk\n\nSource: tradingview.com\n\nTakeaway\n\nIn conclusion, amid regulatory scrutiny, Tesla Inc (NASDAQ:TSLA) stands firm with unshakable financial fortitude and technological prowess. Despite the DOJ and SEC investigations casting shadows, the company's soaring revenue in automotive and services, bolstered by global EV demand and efficient operations, showcases its resilience.\n\nTesla Inc (NASDAQ:TSLA)'s upcoming game-changing products, the Cybertruck and the affordable EV promise a bright future, while advancements in autonomous driving and battery technology fuel growth prospects. In Texas, where Tesla Inc (NASDAQ:TSLA) secured a significant win, the road ahead is paved with potential as the state embraces the company's technology for electric vehicle charging stations. Finally, the stock's technical analysis reveals promising entry points for long-term investors.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/tesla-unmasking-musk-152354076.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.03, "neu": 0.835, "pos": 0.135}}, {"date": "2023-09-11T15:23:16+00:00", "title": "Why Tesla Stock Is Accelerating Today", "content": "A closely watched Wall Street analyst is bullish about Tesla's (NASDAQ: TSLA) supercomputing effort, predicting it could add upward of $500 billion to the company's enterprise value. Investors are taking note, sending Tesla shares up more than 7% as of 11:08 E.T. on Monday morning. Tesla is best known for its electric vehicles, but the company has long dabbled in other areas as well.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f42c45ab-8b98-316e-996e-6ab8a2d4ac96/why-tesla-stock-is.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.762, "neg": 0, "neu": 0.877, "pos": 0.123}}, {"date": "2023-09-11T15:16:00+00:00", "title": "Here's what needs to happen to achieve safe self-driving cars", "content": "Elon Musk's vision for Tesla is not just to revolutionize the push toward electric vehicles. Tesla has since released a few versions of advanced driver assist software, Autopilot and Full Self-Driving. The driver has to be ready to take over if necessary, as the self-driving software is still far from being safe and reliable, something Musk himself inadvertently proved during a recent demo of the tech.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4a47e28c-660f-3db2-809d-6bef97d57e7b/here%27s-what-needs-to-happen.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.813, "neg": 0, "neu": 0.868, "pos": 0.132}}, {"date": "2023-09-11T14:52:41+00:00", "title": "Dojo Could Boost Tesla Value by $500B: Morgan Stanley", "content": "Tesla Inc.'s Dojo supercomputer may add as much as $500 billion to the company's market value through faster adoption of robotaxis and network services, according to Morgan Stanley. Bloomberg's Ed Ludlow has more on the call by Adam Jonas. Follow Bloomberg for business news & analysis, up-to-the-minute market data, features, profiles and more: http://www.bloomberg.com Connect with us on... Twitter: https://twitter.com/business Facebook: https://www.facebook.com/bloombergbusiness/ Instagram: https://www.instagram.com/quicktake/?hl=en", "link": "https://finance.yahoo.com/video/dojo-could-boost-tesla-value-145241993.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0, "neu": 0.963, "pos": 0.037}}, {"date": "2023-09-11T14:45:00+00:00", "title": "Is Tesla a Buy Amid Key Upgrade on Autonomous Driving?", "content": "Questions will be centered around margin as it has moved to better compete and not surrender market share... especially in China.\n\nContinue reading", "link": "https://finance.yahoo.com/m/970f889d-d570-3435-a609-4e3832ab6226/is-tesla-a-buy-amid-key.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.44, "neg": 0, "neu": 0.884, "pos": 0.116}}, {"date": "2023-09-11T14:26:36+00:00", "title": "Tesla stock rises on upgrade, hope for Dojo supercomputer", "content": "Tesla’s (TSLA) stock is on the rise after Morgan Stanley upgraded the shares to \"Buy\" from \"Hold.\" Morgan Stanley analyst Adam Jonas also raised his price target on the stock from $200 to $400. Part of the reason is because Jonas is bullish on Tesla’s supercomputer, Dojo. When it comes to whether Tesla is an automobile company or a tech company, Jonas insists “it's both” due to the possibility of Dojo to be offered as a service on its own. Yahoo Finance Live breaks down the note.", "link": "https://finance.yahoo.com/video/tesla-stock-rises-upgrade-hope-142636260.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.974, "pos": 0.026}}, {"date": "2023-09-11T14:14:09+00:00", "title": "Tesla Stock Jumps After Morgan Stanley Says Share Price Could Hit $400 Due to Dojo Supercomputer", "content": "Tesla's shares jumped Monday after Morgan Stanley analysts upgraded the stock, citing the potential of the supercomputer that Tesla is developing. The Morgan Stanley team raised their price target on Tesla shares by 60% to $400, from $250, and recommended investors move to an \"overweight\" holding. The team includes Adam Jonas, one of the highest-profile Tesla analysts.\n\nContinue reading", "link": "https://finance.yahoo.com/m/38ffd51c-7297-3c50-ab84-32c1df4f1677/tesla-stock-jumps-after.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.637, "neg": 0, "neu": 0.9, "pos": 0.1}}, {"date": "2023-09-11T14:02:08+00:00", "title": "Tesla Stock: Buy, Sell, or Hold?", "content": "Fool.com contributor Parkev Tatevosian evaluates Tesla (NASDAQ: TSLA) stock to determine if it is an excellent bargain for long-term investors. *Stock prices used were the afternoon prices of Sept. 7, 2023.\n\nContinue reading", "link": "https://finance.yahoo.com/m/50a960c6-376d-3f3f-8de0-3ba75b332e01/tesla-stock%3A-buy%2C-sell%2C-or.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.671, "neg": 0, "neu": 0.849, "pos": 0.151}}, {"date": "2023-09-11T14:00:40+00:00", "title": "Dow Jones Rises As Inflation Data Looms; Tesla Stock Surges On Buy Rating", "content": "Dow Jones futures rose Monday, as Wall Street looks ahead to this week's inflation data. Tesla stock surged on an analyst upgrade.\n\nContinue reading", "link": "https://finance.yahoo.com/m/134ce0ec-188f-3f3d-82d5-afd8dca66a1b/dow-jones-rises-as-inflation.html", "symbols": ["307.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "ADB.F", "ADBE.US", "ADBE34.SA", "APC.F", "APC.XETRA", "CDNS.US", "CDS.F", "DJI.INDX", "IXIC.INDX", "NFC.F", "NFC.XETRA", "NFLX.MX", "NFLX.US", "NFLX34.SA", "SHOP.TO", "SHOP.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-09-11T14:00:23+00:00", "title": "Tesla Stock Upgrade Sees FSD Supercomputer Adding A Half-Trillion Dollars In Value", "content": "Morgan Stanley analysts believe Tesla's autonomous driving supercomputer can add $500 billion in value to the company.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e68c724e-7f79-3992-8b28-66f530d47844/tesla-stock-upgrade-sees-fsd.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0, "neu": 0.882, "pos": 0.118}}, {"date": "2023-09-11T14:00:00+00:00", "title": "Concerning News for Tesla Stock Investors", "content": "In this week's video, I cover need-to-know news related to Tesla (NASDAQ: TSLA) during the week of Sept. 4. Today's video will focus on Tesla's sales numbers in Europe and China, concern about the start of production in Mexico, its new supercharger deal, and a look at Tesla stock from a technical analysis standpoint.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4b29dccf-4d73-33a1-b0e2-b1e08dd085bf/concerning-news-for-tesla.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-09-11T13:53:00+00:00", "title": "Is Tesla Stock a Buy?", "content": "Thanks in part to a resurgence of stocks in 2023, Tesla (NASDAQ: TSLA) has seen its shares skyrocket this year. In the second quarter (ended June 30), Tesla's revenue of $24.9 billion represented a 47% year-over-year gain. For example, in 2021 and 2022, Tesla's sales jumped 71% and 51%, respectively.\n\nContinue reading", "link": "https://finance.yahoo.com/m/5fd64f22-cf5b-3b70-8069-55723ce5870c/is-tesla-stock-a-buy%3F.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.872, "neg": 0, "neu": 0.808, "pos": 0.192}}, {"date": "2023-09-11T13:42:00+00:00", "title": "EV Roundup: CHPT's Q2 Results, FSR's Production Ramp-Up Plans &amp; More", "content": "The electric vehicle (EV) charging stock, ChargePoint Holdings CHPT, released second-quarter fiscal 2024 results (ending Jul 31, 2023) last week. The EV startup, Fisker FSR, unveiled its European EV lineup in Munich, featuring the Ronin GT, PEAR city EV and Alaska pickup. Meanwhile, the company is also boosting production capacity for the Fisker Ocean SUV and expanding operations in North America and Europe. Amid the soaring popularity of EVs, Volkswagen VWAGY aims to launch 11 new electric cars by 2027. Meanwhile, Tesla TSLA slashed the prices of Models S and X. Honda HMC also made it to the top stories as it announced that it would embrace Tesla’s North American Charging Standard (“NACS”), seeking to provide its customers with a seamless charging experience and contribute to the growing electric mobility landscape in North America.\n\nWhile VWAGY and CHPT each carry a Zacks Rank #4 (Sell), HMC, TSLA and FSR each are Zacks #3 Ranked (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nLast Week’s Top Stories\n\nChargePoint incurred an adjusted quarterly loss of 24 cents per share, wider than the Zacks Consensus Estimate of a loss of 14 cents as well as the year-ago period’s loss of 19 cents. Revenues of $150.5 million missed the Zacks Consensus Estimate by 0.94% but grew 39% year over year. Revenues from networked charging systems amounted to $114.6 million, reflecting a 36% yearly increase. Subscription revenues reached $30 million, marking 48% growth from the corresponding quarter of the prior year. As of Jul 31, cash/cash equivalents of the firm stood at $233.5 million.\n\nFor the fiscal third quarter of 2024, ChargePoint envisions revenues in the band of $150-$160 million, indicating a year-over-year increase of 26% at the midpoint of the guidance. The adjusted gross margin is expected at 22-25%. The company forecasts adjusted operating expenses in the range of $81-$84 million. For the fiscal fourth quarter of 2024, non-GAAP operating expenses are anticipated between $79 million and $82 million. Fiscal 2024 revenues are forecast in the $605-$630 million band, indicating 32% year-over-year growth at the midpoint of the projection.\n\nStory continues\n\nFisker unveiled its European all-electric vehicle lineup, featuring the Ronin GT sports car, PEAR city EV and the Alaska pickup truck. Henrik Fisker, the CEO, presented the models at the pre-IAA Mobility 2023 event, highlighting their commitment to sustainability. The Ronin, an ultra-luxury model, will cost around €425,500/£371,900, with limited production of 999 vehicles and deliveries set for the second half of 2025. PEAR, expected to be available from mid-2025, will likely start at €32,900 with VAT in Germany and £30,900 with VAT in the UK. The Alaska pickup, expected in 2025, is anticipated to start at €49,900 with VAT in Germany and £47,900 with VAT in the UK.\n\nFisker is also increasing the production of its all-electric SUV, the Fisker Ocean. The production capacity will rise from 180 vehicles per day to around 300 per day in the fourth quarter of 2023. This expansion will serve customer deliveries across Europe (including Austria, Germany, France, and the UK), Canada and various U.S. regions. More than 3,000 vehicles have been manufactured to date, and Fisker expects to receive 5,000 Fisker Ocean One launch edition vehicles from the manufacturing partner Magna by Sep 30, 2023. Although the company aims to deliver most by September end, some deliveries may extend to October.\n\nVolkswagen announced plans to launch 11 new electric cars by 2027. The EVs, with a few new concepts, underscore the company’s long-term plan to offer a wide range of eco-friendly options. The German automaker plans to make its entire lineup in Europe electric by 2033. Until then, the automaker will continue to offer both combustion and hybrid models. To increase the efficiency of its popular models, Volkswagen will soon release a plug-in hybrid version of its Passat and Tiguan models with an electric range of about 100 km.\n\nVolkswagen also unleashed the ID. GTI concept. It is based on the company’s modular electric drive matrix platform and aims to leverage the popularity of the GTI brand to advance in the direction of an all-electric future. The \"I\" in GTI branding, which formerly stood for \"injection\", has now been updated to \"intelligence.\" Thomas Schafer, the CEO of Volkswagen Passenger Cars, said that the production version of ID. GTI would be revealed in 2026 and hit the market in 2027.\n\nTesla announced another round of price cuts for Model S/X. The EV king reduced the prices of Model S and X by 15-19% in the United States on all trim levels. Model S and Model X are now available at a base price of $74,990 (a 15% drop from $88,490) and $79,990 (an 18.8% decrease from $98,490), respectively. Also, base models now have a larger battery for both Model S and X, with an estimated EPA range of 405-348 miles, up from 320-269 miles, respectively.\n\nThe company also reduced the price of Full Self-Driving software by $3,000 from $15,000 in the United States for customers who make an upfront purchase. The price of the Plaid versions for both models dropped to $89,990 from $108,490. In China, the automaker is reducing the price of both models by about 7%.\n\nHonda announced its adoption of Tesla's NACS for its EV lineup in North America starting in 2025. This move follows a trend in the automotive industry where multiple manufacturers are embracing NACS. The Japanese automaker specified that all new EV models introduced in North America from 2025 onward will be equipped with the NACS standard. This will kick off with the launch of a new EV model slated for that year. Moreover, Honda's existing EV models introduced before 2025 will feature CCS ports but also be compatible with the NACS system through the use of an adapter.\n\nIn addition to its charger standard adoption, Honda is actively participating in a joint venture with other automakers, including BMW, GM, Kya, Hyundai, Mercedes-Benz, and Stellantis, to develop a robust high-voltage charging network across North America. By adopting NACS, Honda's customers will gain access to Tesla's Supercharger network in the future, enhancing the convenience of EV ownership. This strategic move aligns with the industry trend of major automakers, such as Ford, GM, Rivian, Volvo, and Mercedes-Benz, joining forces with Tesla to utilize NACS for their electric vehicles.\n\nPrice Performance\n\nThe following table shows the price movement of some of the major EV players over the last week and the six-month period. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nWhat’s Next in the Space?\n\nStay tuned for the announcements of upcoming EV models and any important updates on the red-hot industry.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nHonda Motor Co., Ltd. (HMC) : Free Stock Analysis Report\n\nTesla, Inc. (TSLA) : Free Stock Analysis Report\n\nFisker Inc. (FSR) : Free Stock Analysis Report\n\nVolkswagen AG Unsponsored ADR (VWAGY) : Free Stock Analysis Report\n\nChargePoint Holdings, Inc. (CHPT) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/ev-roundup-chpts-q2-results-134200746.html", "symbols": ["CHPT.US", "FSR.US", "HDMA.F", "HMC.US", "HNDAF.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.016, "neu": 0.897, "pos": 0.087}}, {"date": "2023-09-11T13:30:00+00:00", "title": "Prominent investment bank seeks to end the debate about Tesla's true value", "content": "Tesla's stock has rallied more than 100% throughout 2023 as the company has worked to cement itself as the leader in the electric vehicle sector. Jonas, upgrading his Tesla price target to $400 from $250, said in a note that Dojo, Tesla's custom supercomputer, can add up to $500 billion to Tesla's market value through quicker adoption of robotaxis and network services. \"Almost all of Tesla's value long-term will be from AI and robots, both vehicle and humanoid,\" Tesla Chief Elon Musk said in response to the report.\n\nContinue reading", "link": "https://finance.yahoo.com/m/2a241ede-a77d-3ba7-9d64-4134fe650538/prominent-investment-bank.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.586, "neg": 0, "neu": 0.948, "pos": 0.052}}, {"date": "2023-09-11T13:07:00+00:00", "title": "Apple Stock Rises. Why Tech Names From Tesla to Nvidia Can Breathe a Sigh of Relief.", "content": "Tech stocks tumbled last week, led lower by shares in Apple. But now the tech giant's stock is rising to start a new trading week.\n\nContinue reading", "link": "https://finance.yahoo.com/m/606667a7-63d1-3437-9189-a03c711e6676/apple-stock-rises.-why-tech.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "GSPC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0.077, "neu": 0.845, "pos": 0.077}}, {"date": "2023-09-11T13:00:17+00:00", "title": "5 Stocks to Buy on a Potential Debt Avalanche", "content": "Last week, yields on short-dated U.S. Treasuries quietly climbed to their highest point in almost 25 years.\n\nThe effects of that rise, however, have been anything but silent.\n\nThe average new mortgage rate now sits well over 7%; a home loan that would have cost $2,000 per month in 2021 would now set a new homebuyer back $5,660 monthly. And roughly 17% of all nonfinancial companies in the S&P 500 now spend at least a quarter of their operating income on servicing debts.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nThough the United States has seen high interest rates before, we’ve never seen rates rise so quickly in relative terms. Moving from a 2.6% mortgage rate to a 7% one increases the portion going into interest payments almost threefold.\n\nThis will prove a disaster for many overleveraged firms (not to mention the U.S. government). Entities that were expecting to spend $100 million per year on interest payments now face the prospect of paying $200 million… $300 million… or more. Many private equity-backed firms like Bed Bath & Beyond (OTCMKTS:BBBYQ) have already folded; some are even worried about the U.S. government making good on its dues.\n\nYet, rising rates can also send shares of some companies soaring, provided you know where to look. High borrowing costs are a boon to lenders, underleveraged companies, and any firm where banks foreclose on competitors.\n\nThis week, the writers at InvestorPlace.com, our free news site, explore five companies that will thrive as rates continue to inch ever higher…\n\n5 Stocks to Buy on a Potential Debt Avalanche: York Water (YORW) vats of water\n\nSource: nostal6ie / Shutterstock.com\n\nHigh interest rates are a surprisingly good thing for water utilities, a sector with regulatory limits on profitability. Return on equity at these firms are usually capped between 9.5% and 10.5%. That means rising rates (i.e., higher borrowing costs) becomes an opportunity to raise prices.\n\nNowhere is this clearer than at York Water (NASDAQ:YORW), a Pennsylvania-based water utility with a 200-year track record of dividends. In the second quarter of 2023, York Water earned $18.7 million in revenues and paid out $1.68 million in interest, earning its shareholders $6.5 million in net profits.\n\nStory continues\n\nOrdinarily, this would mark the upper limit to York Water’s profits. The company already earns slightly more than 10% returns on equity, limiting its ability to increase prices. But an increase in interest payments allows York to charge more for its services, which means higher future profits once rates fall again.\n\nThis week, InvestorPlace.com’s Rich Duprey also notes how York is a solid company with superior gross, operating, and net margins compared to virtually any other water utility.\n\n“If you want a reliable, unstoppable dividend force of nature in your portfolio, York Water is certainly the one for you,” Duprey writes.\n\nFor investors seeking a dependable source of income while protecting themselves from rising rates, York Water is hard to beat.\n\n2. Bank of America (BAC) A photo of the Bank of America (BAC) logo in neon red and blue on a tan wall.\n\nSource: Tero Vesalainen / Shutterstock.com\n\nTraditional banks thrive on high interest rates. These establishments take customer deposits at near-zero interest and lend them out for profit. The higher the lending rate, the better the net interest margin.\n\nOf course, the rise of alternative lenders has muddied the water. The failure of Silicon Valley Bank in March was initially sparked by investment losses from rising rates – the opposite of what banks usually face. Even blue-chip Charles Schwab (NYSE:SCHW) managed to get the formula wrong by overinvesting in rate-sensitive products.\n\nBut Bank of America (NYSE:BAC) has no such problem.\n\nAs Chris MacDonald notes this week at InvestorPlace.com, Bank of America has one of the sturdiest capital bases and best retail network of all American banks. Even Warren Buffett – a longtime critic of U.S. banks – is a shareholder.\n\nMacDonald writes:\n\nWarren Buffett continues to support Bank of America, holding a 13% stake worth over $32 billion. His endorsement and the retention of his shares, despite selling off other bank stocks, demonstrate his confidence in the bank’s strength and market position.\n\nThat’s because Bank of America has avoided the temptations that felled several regional banks this year. The company remains focused on its core business, and its large physical footprint gives the Charlotte, North Carolina-based bank an incredible supply of cheap capital (i.e., customer deposits) to keep thriving as rates stay high.\n\n3. Realty Income (O) realty income logo highlighted by a magnifying glass on a web browser\n\nSource: Shutterstock\n\n“The Three Little Pigs” might as well be a story of cutting corners in real estate. (My contractor might learn a thing or two.) Some firms, like China Evergrande Group (OTCMKTS:EGRNF) , are built out of straw, with debts so high that even a slight breeze will send the whole thing tumbling down.\n\nOthers are built out of sticks, which look fine until a Big Bad Wolf comes along. Luxury-home builder WCI Communities generated $187 million of profits as late as 2005 before declaring bankruptcy during the financial crisis.\n\nThen there’s Realty Income (NYSE:O), a solid house built out of bricks.\n\nRealty Income, America’s largest triple-net real estate investment trust (REIT), has a 50-year history of distributing monthly payments. It also has increased its dividend for over 25 consecutive years, as Bob Ciura notes for InvestorPlace.com.\n\nHere’s more from Cuira:\n\nRealty Income generates its growth through growing rents at existing locations, via contracted rent increases or by leasing properties to new tenants at higher rates but also by acquiring new properties. In the first quarter, the company invested $1.7 billion in 339 properties and properties under development or expansion. The initial weighted average cash lease yield for these investments was 7%.\n\nTriple-net leases are particularly desirable for investors, since these are long-term leases where tenants are responsible for all property expenses, such as real estate taxes and maintenance. This provides a dependable stream of income that can be funded by fixed-rate bonds, shielding investors from rate hikes.\n\nRealty Income also focuses on defensive sectors, which has made the firm one of only two REITs to be a dividend aristocrat and have a credit rating of A- or better.\n\nThe stability, however, does come with costs. Realty Income typically caps annual rent increases to 1% to maintain long-term tenants, which limits growth. Extended periods of high interest rates will also slow the real estate market because acquisitions become more expensive.\n\nStill, Realty Income remains one of the best REITs in the business for its conservative financing, A+ portfolio, and history of accretive acquisitions. If other REITs begin to wobble, Realty Income will be buying top-notch properties for pennies on the dollar for their investors.\n\n4. Volkswagen (VWAGY) A Volkswagen (VWAGY) logo on a sign in Turkey.\n\nSource: multitel / Shutterstock.com\n\nThis week, top InvestorPlace analyst Eric Fry notes how one company could dethrone Tesla as the king of EVs:\n\nMy top pick in the EV space is Volkswagen. …\n\nWhile it’s true that Tesla’s EV sales crushed Volkswagen’s in 2022 by nearly 130% (with Tesla reporting 1.31 million EV sales in 2022 and Volkswagen reporting 572,100), Tesla trails far behind Volkswagen on all other relevant metrics. The differences between the two automakers are enormous.\n\nI expect VW to continue outperforming Tesla in 2023 and beyond – by making a market-beating advance, as Tesla’s lavish valuation continues to shrivel.\n\nVolkswagen AG (OTCMKTS:VWAGY) also has a more mundane tailwind: its ability to withstand high interest rates.\n\nThe German firm is one of the least leveraged legacy carmakers in the world. Its interest payments consume less than 7% of gross income. Its 49X interest coverage ratio puts it well ahead of Stellantis (NYSE:STLA) (23X), General Motors (NYSE:GM) (13X) and Ford Motor (NYSE:F) (8.7X). Only Toyota Motors (NYSE:TM) scores better, thanks to generous help from the Japanese banking system.\n\nVolkswagen also generates a lot of cash for its market cap, giving it a significant advantage over “long duration” stocks like Tesla (NASDAQ:TSLA) whose success depends on profits further into the future. Rising rates make faraway cash flows worth less today, which increases the value of near-term cash flows in relative terms.\n\nThat gives the world’s largest automaker an astonishing amount of financial ammunition to grow its electric vehicle business. The EV revolution will be expensive, and Eric rightly points out that Volkswagen has the horsepower to make it work.\n\n5. Amazon (AMZN) Amazon LOGO ON THE SIDE OF A BUILDING.\n\nSource: Sundry Photography / Shutterstock.com\n\nFinally, InvestorPlace.com’s Jeremy Flint offers an alternative solution for investors worried about high interest rates:\n\nThey can outrun the problem with growth stocks.\n\nThat’s why Flint recommends Amazon.com (NASDAQ:AMZN) this week, a Magnificent 7 stock he calls a “no-brainer” buy.\n\nAmazon’s commitment to cloud services and artificial intelligence positions it as a long-term, stable player in the sector. Cloud revenue surged by 12% in the most recent quarter, offsetting modest retail growth. Amazon’s cloud-based AI endeavors have broad applications that will serve the stock well.\n\nEssentially, companies can sometimes grow so quickly that they overcome the downward pressure from rising discount rates. (As a reminder, discount rates and valuations move in opposite directions.)\n\nWall Street analysts now expect the tech giant to generate $28.3 billion in free cash flows this year, $46.9 billion in 2024, and $59.6 billion in 2025, a 45% average annual growth rate. With expansion that fast, another 1% to 2% increase in interest rates disappears to almost a rounding error.\n\nBeware of a Debt Avalanche\n\nIt’s hard to overstate the impact of rapid rate rises. Earlier this week, shares of meme stock AMC Entertainment (NYSE:AMC) plummeted 40% after management announced it would attempt to convert roughly $400 million of debt into equity. These refinancing efforts become essential once a company’s cost of debt rises too high. Those that fail to manage debts will go bankrupt, as Rite Aid (NYSE:RAD) is preparing to do.\n\nEven many financial companies are feeling the pinch. Since July, the KBW Nasdaq Bank Index has fallen 10% on fears of a corporate debt crisis. That’s the opposite of what should normally happen, because rising rates increase bank profitability, all else equal.\n\nThat tells us that a debt avalanche could happen. According to the Federal Reserve, nonfinancial corporations now owe $12.7 trillion in debt securities and loans, or 48% of GDP. That’s well above the 42% average seen between 1990 through 2020. Any misstep by the Fed could send a cascading debt crisis through the financial system.\n\nIt’s not surprising then that many investors are shifting away from the trend that worked in the first half of 2023 – investing in every AI stock out there – and becoming more selective.\n\nLuke Lango has something new to help with that. Two years ago, he embarked on a groundbreaking project that – instead of investing in AI – uses artificial intelligence to pinpoint the moment a stock is about to surge in price.\n\nLuke calls this new revolutionary AI program Prometheus, and he says it can give you the ultimate edge over the market.\n\nAnd after two years of running 329,646 back tests, fine tuning, and millions of dollars invested, the results are in… and during his live event next Tuesday, September 12, at 7 pm Eastern, he’ll show us numerous examples of Prometheus’ accuracy and the fast gains it could deliver.\n\nYou can learn more about this AI program and sign up for Luke’s live event here.\n\nAs of this writing, Tom Yeung held a LONG position in GM. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nTom Yeung is a market analyst and portfolio manager of the Omnia Portfolio, the highest-tier subscription at InvestorPlace. He is the former editor of Tom Yeung’s Profit & Protection, a free e-letter about investing to profit in good times and protecting gains during the bad.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 5 Stocks to Buy on a Potential Debt Avalanche appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/5-stocks-buy-potential-debt-130017631.html", "symbols": ["AMC.US", "AMZN.US", "BAC.US", "F.US", "GM.US", "O.US", "RAD.US", "RY6.F", "SCHW.US", "STLA.US", "TM.US", "TSLA.US", "VLKAF.US", "VLKPF.US", "VOW.F", "VOW.XETRA", "VOW3.F", "VOW3.XETRA", "VWAGY.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.062, "neu": 0.782, "pos": 0.157}}, {"date": "2023-09-11T12:52:00+00:00", "title": "US STOCKS-Wall St eyes higher open as Tesla rallies; inflation data in focus", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nTesla gains on Morgan Stanley upgrade\n\n*\n\nU.S.-listed China shares rise on fresh stimulus\n\n*\n\nHostess Brands up after J.M. Smucker's $5.6 bln buyout deal\n\n*\n\nFutures up: Dow 0.21%, S&P 0.50%, Nasdaq 0.77%\n\n(Updated at 8:30 a.m. ET/ 1230 GMT)\n\nBy Shristi Achar A and Shubham Batra\n\nSept 11 (Reuters) - Wall Street's main indexes were set to open higher on Monday following gains in megacaps led by Tesla, while investors awaited inflation data due later this week for clues on the U.S. Federal Reserve's interest-rate path.\n\nTesla jumped 6% in premarket trading as Morgan Stanley upgraded the EV maker to \"overweight\" from \"equal-weight\" due to potential growth in its market value because of Dojo, the firm's supercomputer.\n\nShares of other megacaps including Alphabet, Microsoft and Amazon rose between 0.4% and 0.8%.\n\nApple climbed 1.4% after a near 6% decline last week on China's restrictions of iPhone usage for government officials, and ahead of its fall event on Sept. 12.\n\nU.S. stocks logged weekly declines on Friday as strength in oil prices and stronger-than-expected economic data fueled concerns of sticky inflation and interest rates staying higher for longer.\n\nInvestors now await the crucial consumer and producer prices data as well as retail sales numbers due later this week.\n\nThe consumer price data on Wednesday will indicate whether the U.S. economy is on track for a so-called soft landing that could allow the Fed to bring down inflation without sharply impacting growth.\n\n\"The inflation numbers should be expected to be at least flat if not higher and most likely slightly higher as compared to the continued decline we've seen since last year, said Hugh Anderson, managing director at HighTower Advisors.\n\n\"I expect at least one more increase, but this is at best. Certainly no cuts, and I don't expect to see cuts for quite some time until we see a dramatic decline in employment.\"\n\nStory continues\n\nTraders see a 93% chance of the central bank holding its interest rates at current levels in the September meeting, while their odds for a pause in November stand at 55.4%, according to CME FedWatch Tool.\n\nTreasury yields inched up on Monday, with yields on 2-year note hovering around 4.9906%.\n\nFed officials have entered a blackout period, during which they usually do not make public comments, until the policy decision outcome on Sept. 20.\n\nAt 8:30 a.m. ET, Dow e-minis were up 71 points, or 0.21%, S&P 500 e-minis were up 22.25 points, or 0.5%, and Nasdaq 100 e-minis were up 118.25 points, or 0.77%.\n\nAmong other stocks, Hostess Brands jumped 18.4% premarket after J. M. Smucker said it would buy the Twinkies-maker in a $5.6 billion deal.\n\nData over the weekend showed China's consumer prices returned to positive territory in August, while factory-gate price declines slowed, as deflation pressures ease amid signs of stabilization in the economy.\n\nU.S.-listed shares of Chinese firms PDD Holdings, Xpeng, Baidu rose between 1.7% and 4.2%, while the iShares China Large-Cap ETF gained 1.5%.\n\nMeta Platforms added 1.3% after a report on Sunday said the firm was working on a new, more powerful artificial-intelligence system. (Reporting by Ankika Biswas, Shreyashi Sanyal and Shubham Batra in Bengaluru; Editing by Arun Koyyur and Vinay Dwivedi)", "link": "https://finance.yahoo.com/news/us-stocks-wall-st-eyes-125200888.html", "symbols": ["GSPC.INDX", "JM2.F", "SJM.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.99, "neg": 0.023, "neu": 0.875, "pos": 0.102}}, {"date": "2023-09-11T11:45:51+00:00", "title": "If You Invested $1 in Tesla 12 Years Ago, How Much Money Would You Have Now?", "content": "JohnnyGreig / Getty Images\n\nElectric vehicle giant Tesla has had a knack for being in the right place at the right time, having soared to the top of the global EV market because it was quicker out of the gate than competitors. But there was at least one instance when Tesla had bad timing: It chose to go public on a day that the Dow dropped more than 250 points.\n\nChatGPT Was Given $20K To Invest in Stocks and Crypto — Here’s How It Made $2,000 in a Month\r\nDiscover: 3 Things You Must Do When Your Savings Reach $50,000\n\nThe date was June 29, 2010, and Tesla shares sank early before rallying later in the day. Since then, the Elon Musk-led company has mostly seen its stock price soar ever higher.\n\nConsider: 10 Stocks That Could Be the Next Apple or Amazon\n\nWhen you account for stock splits, Tesla’s stock has risen more than 12,800% over the past dozen years alone, according to My Wall Street. If you were lucky enough to buy the company’s stock on the day it debuted, you’d be sitting in a very good financial position right now.\n\nEven if you had only invested a dollar in Tesla stock during its early days, you’d still have enough money to celebrate with an expensive dinner for two at an upscale restaurant.\n\nAs Benzinga reported, Tesla went public at a price of $17 per share, increased the size of the offering and priced above an expected range of $14 to $16. The stock closed up 40.5% to $23.84 on its first day of trading and continues to be a top performer today.\n\nMusk, who has never been accused of lacking confidence, told Bloomberg before the IPO that “when people see who’s invested in the initial public offering, it’s the smartest, most long-term thinking investors in the market … The smartest money in the world is betting on Tesla. They must have a reason for doing so.”\n\nGiven Tesla’s stock market performance, it’s hard to argue with Musk’s point — at least before a recent slump. Tesla shares have fallen by roughly one-third since peaking at $381.50 in November 2021 and currently trade near $248.\n\nStory continues\n\nIf you had invested $1 in Tesla 12 years ago, you would have $128.33 today, according to My Wall Street’s calculations as of Sept. 8. If you had invested $1 in TSLA 10 years ago, you would have $100.89 today.\n\nHowever, if you had waited to invest in Tesla within the past few years, your payoff would be a whole lot smaller. A $1 investment in the company five years ago would leave you with $10.98 today. It gets progressively worse from there.\n\nHere’s what you would today have if you invested $1 during the following time frames:\n\n4 years ago: $10.27 3 years ago: $8.17 2 years ago: $0.97 1 year ago: $0.65\n\nAs those numbers show, investing in Tesla over the last couple of years would have been a losing bet — and in the case of a year ago, a losing bet of more than one-third.\n\nJust be thankful you only invested one dollar. If you had invested $100,000 a year ago, that investment would now be worth less than $65,000.\n\nMore From GOBankingRates\n\n8 Essentials You'll Be Shocked You Can Buy at Dollar Tree Driver's License Scam Could Cost You Thousands: 13 Ways To Protect Yourself 3 Ways to Recession Proof Your Retirement 5 Best Ways To Stay Safer From Identity Theft When You're Online\n\nThis article originally appeared on GOBankingRates.com: If You Invested $1 in Tesla 12 Years Ago, How Much Money Would You Have Now?", "link": "https://finance.yahoo.com/news/invested-1-tesla-12-years-114551610.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.966, "neg": 0.047, "neu": 0.87, "pos": 0.083}}, {"date": "2023-09-11T11:44:29+00:00", "title": "Stocks to Watch Monday: Tesla, Qualcomm, Meta, Alibaba", "content": "↗️ [**Tesla (TLSA)**](https://www.wsj.com/market-data/quotes/TSLA): Shares in the electric carmaker rose more than 6% in premarket trading. Morgan Stanley analysts upgraded Tesla’s stock to “buy” from “hold,” citing its efforts to [develop an inhouse supercomputer](https://www.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9d0b0d30-3403-33f3-a95b-6ee26b153bca/stocks-to-watch-monday%3A.html", "symbols": ["5UR.F", "BABA34.SA", "JM2.F", "RTX.US", "SJM.US", "STT-PD.US", "STT-PG.US", "STT.MX", "STT.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA", "ZYA.F"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.941, "pos": 0.059}}, {"date": "2023-09-11T11:35:12+00:00", "title": "Elon Musk called Bill Gates ‘categorically insane’ and ‘an a****** to the core’ after he shorted Tesla stock", "content": "As Tesla CEO Elon Musk and Microsoft co-founder Bill Gates have both held the title of the richest man on earth, it's easy to think that the two would have plenty to talk about.\n\nIt could be their love of technology and A.I., perhaps philanthropy, or even the pressures which come with leading a global company.\n\nAs it turns out, they appear unable to stand each other.\n\nThe Musk vs Gates feud has publicly spilled over a number of times, though 67-year-old Gates has tended to be more complimentary about his rival than his younger counterpart has been about him.\n\nHowever, a new biography about the Starlink founder appears to have shed more light on the pair's tumultuous relationship, this time centering around an incident in which Gates shorted Musk-owned Tesla stocks.\n\nWalter Isaacson, Musk's biographer, wrote the pair met in March 2022 at the Tesla Gigafactory in Austin to talk about philanthropy.\n\nIt was during this meeting that the contentious subject of Gates betting against Tesla was brought up: the businessman had lost $1.5 billion by taking a bearish stance against the EV manufacturer.\n\nGates apologized to Musk for the move, but told Isaacson it did nothing to calm The Boring Company founder.\n\n“Once he heard I’d shorted the stock, he was super mean to me,\" Gates said to Isaacson. \"But he’s super mean to so many people, so you can’t take it too personally.”\n\nGates may have a point: Musk has openly threatened to turn up at Meta founder Mark Zuckerberg's house and fight him, and got into an argument with a disabled former Twitter employee on the social media site now known as X.\n\nAccording to an excerpt of Isaacson's biography shared with CNBC, Gates's justification of the bid against Tesla was that he believed the supply of EVs would soon outweigh demand, and so he would make money by making a bet against Musk's company.\n\nFor Musk, who believes Tesla is among the leading forces against climate change, Gates betting against an EV company while being an advocate for the environment is unforgivable.\n\nStory continues\n\nIsaacson, whose book is due to be published September 12, wrote Musk asked him after the meeting: \"How can someone say they are passionate about fighting climate change and then do something that reduced the overall investment in the company doing the most? It’s pure hypocrisy.\n\n\"Why make money on the failure of a sustainable energy car company?”\n\nA couple of weeks following the meeting, Gates reportedly texted Musk to follow up on some philanthropy proposals. Musk asked Gates if he still held a shorted position on Tesla, which the latter confirmed he did.\n\nAs a result Musk shut the conversation down, saying he couldn't take Gates's work on climate change seriously. The he messaged Isaacson: “At this point, I am convinced that he is categorically insane (and an asshole to the core). I did actually want to like him (sigh).”\n\nFor Gates's part, calling Musk \"mean\" is about as personal as the billionaire has got.\n\nOn the other hand, Musk has insulted everything from Gates's intelligence to his appearance—last year, around the time of this reported controversy, Musk tweeted a photo of Gates comparing his figure to that of a pregnant person.\n\nThis content is not available due to your privacy preferences.Update your settings here to see it.\n\nNeither Musk, approached via the X press office, nor Gates, approached via the Bill and Melinda Gates Foundation, responded to Fortune when contacted for comment.\n\n'He’s overboard on Mars'\n\nIsaacson's account of the meeting also highlights a number of other areas where the pair disagree.\n\nWhile Gates has reportedly donated more than $50 billion of his fortune through the Bill and Melinda Gates foundation, Isaacson writes that Musk had put $5.7 billion into a charitable fund for tax reasons.\n\nPhilanthropy is \"bulls***\" Musk reportedly told Isaacson, saying there's only 20 cents worth of impact for every dollar donated.\n\nBut another major difference, which Gates has highlighted in the past, is Musk's fixation on moving to another planet—Mars. The SpaceX founder has a long-standing vision of creating a self-sufficient city on the red planet, while Gates is more occupied with fixing the issues on Earth.\n\n“I’m not a Mars person,” Gates reportedly told Isaacson. “He’s overboard on Mars. I let him explain his Mars thinking to me, which is kind of bizarre thinking. It’s this crazy thing where maybe there’s a nuclear war on Earth and so the people on Mars are there and they’ll come back down and, you know, be alive after we all kill each other.”\n\nThis story was originally featured on Fortune.com\n\nMore from Fortune: \r\n5 side hustles where you may earn over $20,000 per year—all while working from home\r\nWant more for your money? These 14 savings accounts have rates of 5% APY (and higher)\r\nBuying a house? Here's how much to save\r\nThis is how much money you need to earn annually to comfortably buy a $600,000 home", "link": "https://finance.yahoo.com/news/elon-musk-called-bill-gates-113512272.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.903, "neg": 0.069, "neu": 0.847, "pos": 0.084}}, {"date": "2023-09-11T11:27:35+00:00", "title": "US STOCKS-Futures advance on Tesla boost, inflation data in focus", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nTesla gains on Morgan Stanley upgrade\n\n*\n\nBoeing rises after Vietnam Airlines jet deal\n\n*\n\nFutures up: Dow 0.23%, S&P 0.44%, Nasdaq 0.63%\n\n(Updated at 7:04 a.m. ET/ 1104 GMT)\n\nBy Ankika Biswas and Shristi Achar A\n\nSept 11 (Reuters) - Wall Street futures gained on Monday as Tesla shares rose, while investors awaited inflation data due later this week for clues on the U.S. Federal Reserve's interest-rate path.\n\nThe three major indexes logged weekly declines on Friday as strength in oil prices and stronger-than-expected economic data fueled concerns of sticky inflation and interest rates staying higher for longer.\n\nInvestors now await the crucial consumer and producer prices data as well as retail sales numbers due later this week.\n\nThe consumer price data on Wednesday will indicate whether the U.S. economy is on track for a so-called soft landing that could allow the Fed to bring down inflation without sharply impacting growth.\n\n\"This could be a defining period for stocks as we get some clarity on whether the rate hiking cycle is truly at or near its end or if there is more work to do in the battle against inflation,\" said Russ Mould, investment director at AJ Bell in a note.\n\n\"Until the market knows where the terminal interest rate lies and what the new normal is in terms of borrowing costs, we should probably steel ourselves for further volatility.\"\n\nTraders see a 93% chance of the central bank holding its interest rates at current levels in the September meeting, while their odds for a pause in November stand at 55.4%, according to CME FedWatch Tool.\n\nFed officials have entered a blackout period, during which they usually do not make public comments, until the policy decision outcome on Sept. 20.\n\nAt 7:04 a.m. ET, Dow e-minis were up 81 points, or 0.23%, S&P 500 e-minis were up 19.5 points, or 0.44%, and Nasdaq 100 e-minis were up 96.75 points, or 0.63%.\n\nStory continues\n\nTesla climbed 6.4% in premarket trading as Morgan Stanley upgraded the EV maker to \"overweight\" from \"equal-weight\" due to potential growth in its market value from Dojo, the firm's supercomputer.\n\nApple edged up 0.8% following a near 6% decline last week on China's restrictions of iPhone usage for government officials, ahead of its fall event on Sept. 12.\n\nHostess Brands jumped 14.9% as Jif peanut butter maker J.M. Smucker is nearing a deal to buy the Twinkies snack cakes owner for close to $5 billion, according to sources.\n\nShares of Boeing rose 1.4% after the White House said that Vietnam Airlines' deal to buy 50 737 Max jets from the planemaker was worth $7.8 billion.\n\nData over the weekend showed China's consumer prices returned to positive territory in August, while factory-gate price declines slowed, as deflation pressures ease amid signs of stabilization in the economy.\n\nU.S.-listed shares of Chinese firms PDD Holdings, Xpeng, Baidu rose between 1.9% and 4.7%, while the iShares China Large-Cap ETF gained 1.4%.\n\nMeta Platforms added 1.3% after a report on Sunday said the firm was working on a new, more powerful artificial-intelligence system. (Reporting by Ankika Biswas and Shreyashi Sanyal in Bengaluru; Editing by Arun Koyyur and Vinay Dwivedi)", "link": "https://finance.yahoo.com/news/us-stocks-futures-advance-tesla-112735166.html", "symbols": ["BA.MX", "BA.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "GSPC.INDX", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.018, "neu": 0.885, "pos": 0.097}}, {"date": "2023-09-11T11:11:14+00:00", "title": "5 Things to Know Before Markets Open", "content": "Tesla shares climbed on an analyst upgrade over its AI supercomputer and Hostess shares surged on a potential sale to J.M. Smucker in a merger of snack makers. Here’s what investors need to know today.\n\nContinue reading", "link": "https://finance.yahoo.com/m/cdd454e0-90cd-3a6d-9184-5c3512bf4a28/5-things-to-know-before.html", "symbols": ["9988.HK", "AAPL.MX", "AAPL.US", "AAPL34.SA", "AHLA.F", "AHLA.XETRA", "APC.F", "APC.XETRA", "BABA.US", "BABA34.SA", "BABAF.US", "FB2A.F", "FB2A.XETRA", "JM2.F", "SJM.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.527, "neg": 0, "neu": 0.882, "pos": 0.118}}, {"date": "2023-09-11T11:06:00+00:00", "title": "Apple Stock Is Rising. Why Tech Names From Tesla to Nvidia Can Breathe a Sigh of Relief.", "content": "Tech stocks tumbled last week, led lower by shares in Apple. But now the tech giant's stock is rising to start a new trading week.\n\nContinue reading", "link": "https://finance.yahoo.com/m/606667a7-63d1-3437-9189-a03c711e6676/apple-stock-is-rising.-why.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "GSPC.INDX", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0.077, "neu": 0.845, "pos": 0.077}}, {"date": "2023-09-11T11:00:29+00:00", "title": "The 3 Best Manufacturing Stocks to Buy Now: September 2023", "content": "Though manufacturing activity has moved geographically from the West to the East in recent history, the sector continues to play a vital role in the global economy, providing goods and services that meet the desires of consumers and businesses. However, manufacturing has also seen changes such as technological innovations and renewed geopolitical rivalries. Investors should be privy to these wider transformations and take advantage of them by picking the best performing manufacturing stocks in the market.\n\nThe below manufacturing stocks should be considered in September 2023 due to attractive growth prospects, competitive advantages and strong financial performance.\n\nLi Auto (LI) Li Auto (Li Xiang) brand logo and electric car in store. A Chinese EV(electric vehicle) company\n\nSource: Robert Way / Shutterstock.com\n\nAs the name suggests, Li Auto’s (NASDAQ:LI) is a manufacturing company that designs, constructs and delivers vehicles. In particular, Li Auto is one of leading electric vehicle (EV) manufacturers in China that focuses on producing smart SUVs with extended-range technology. The company’s flagship model is the Li L7, a five-seater premium SUV that can run on both electricity and gasoline and competes directly with Tesla’s (NASDAQ:TSLA) Model Y.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nLi Auto has been growing rapidly in recent years, as it benefits from the increasing demand for EVs in China. Consistent monthly sales growth continues to show Li Auto’s vehicles are in high demand in the world’s largest auto market. The company has also differentiated itself from its competitors by offering a unique range of extended technology that reduces range anxiety for customers.\n\nFrom a valuation perspective, Li Auto’s stock remains attractive. Despite shares having appreciated 95.6% YTD, the stock is trading at only 29.3x forward earnings, which still puts its valuation well below that of Tesla’s. Investors willing to bet on the dynamism of China’s EV sector should give Li Auto a look.\n\nLockheed Martin (LMT) An F-16 and an F-35 model at the background, at the Lockheed Martin exhibition stand in Thessaloniki International Fair.\n\nSource: Giannis Papanikos / Shutterstock.com\n\nStory continues\n\nOne of the top U.S. defense contractors, Lockheed Martin (NYSE:LMT), derived 73% of net sales from selling military equipment to the U.S. government in fiscal year 2022. The firm is also a global leader in aerospace and defense manufacturing, prodding products and services for military, civil and commercial customers worldwide.\n\nMoreover, Lockheed Martin has been benefiting from the strong and stable demand for its products and services from both domestic and international customers. Of course, much of this growth admittedly comes from the ever-burgeoning U.S. defense budget. Nonetheless, the contractor’s backlog of orders provides stability for its future revenue and earnings, and defense asset investors should take notice. A recent quarterly sales beat and raised guidance driven by higher weapons demand should keep investors upbeat for the firm’s near-and-medium term prospects.\n\nThough shares are slightly down year-to-date, the stock has risen 31.9% over the past five years, indicating the stock could be a decent long-term hold.\n\nTokyo Electron (TOELY) Male and Female Industrial Engineers in Hard Hats Discuss New Project while Using Laptop. They Make Showing Gestures.They Work in a Heavy Industry Manufacturing Factory. manufacturing stocks\n\nSource: Gorodenkoff via Shutterstock\n\nTokyo Electron (OTCMKTS:TOELY) is a leading Japanese manufacturing company at the center of advanced semiconductor production equipment space. The company offers a wide range of equipment products, such as coaters, developers, etchers, testers and inspection systems. These have all proven to be indispensable in designing and manufacturing semiconductor chips worldwide.\n\nRemarkably, Tokyo Electron has been able to overcome United States sanctions on certain semiconductor products being sold to China. Semiconductor companies being forced to hold back shipments in Q4 2022 caused a slight slip in demand. However, Tokyo Electron assured in its first quarter earnings report for its fiscal year 2024 that demand rebounded. That reflected in the company revising its growth outlook upward for the year. Furthermore, despite US-China geopolitical tensions and Japan also imposing some sale restrictions on novel semiconductor technologies, Tokyo Electron still sees China as an important market for its business, especially for legacy products.\n\nOn the over-the-counter market, Tokyo Electron’s shares are up 52.3% while on the Tokyo Stock Exchange shares have risen more than 70.0%. Tokyo Electron provides an invaluable product to the modern digital economy and will likely continue to do so in the near future. Potential investors should consider taking advantage of its relatively cheap valuation now.\n\nOn the date of publication, Tyrik Torres did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nTyrik Torres has been studying and participating in financial markets since he was in college, and he has particular passion for helping people understand complex systems. His areas of expertise are semiconductor and enterprise software equities. He has work experience in both investing (public and private markets) and investment banking.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post The 3 Best Manufacturing Stocks to Buy Now: September 2023 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-best-manufacturing-stocks-buy-110029963.html", "symbols": ["LI.US", "LMT.MX", "LMT.US", "LMTB34.SA", "LOM.F", "LOM.XETRA", "TKY.F", "TOELF.US", "TOELY.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.027, "neu": 0.862, "pos": 0.111}}, {"date": "2023-09-11T10:50:43+00:00", "title": "20 Most Environmentally Friendly States in America", "content": "In this article, we will be taking a look at the 20 most environmentally friendly states in America. If you wish to see the top ones, head straight to the 5 Most Environmentally Friendly States in America.\n\nClimate change contributed to 18 weather disasters, including major hurricanes, wildfires, tornadoes, drought and a fierce winter storm, in the United States in 2022 that cost the country more than $165 billion in damages and claimed at least 474 lives, according to latest report from the National Oceanic and Atmospheric Administration (NOAA).\n\nMost Americans are aware that their local communities are being impacted by global climate change either significantly or somewhat. Based on a new Pew Research Centre survey of more than 10,000 adults conducted this spring, 74% of Americans supported the United States taking steps to address global climate change and 67% backed an energy landscape that prioritizes renewable sources, like wind and solar, over the production of fossil fuels.\n\nRenewable energy sources are rapidly emerging as a big player in the energy sector as the majority of businesses and countries globally aspire to achieve net zero carbon emissions by 2050 due to the problem of climate change, rising costs of conventional energy, and robust incentives that the developed world is offering to consumers of renewable energy products. We previously mentioned in one of our articles that according to the International Energy Agency (IEA)’s World Energy Investment report, investments in the global energy sector are anticipated to be around $2.8 trillion in 2023, of which more than $1.7 trillion is estimated to go to clean technologies. Additionally, it is projected that between 2021 and 2023, investments in green energy will increase by 24%, led by renewables and electric cars, as opposed to 15% for fossil fuels.\n\nUS Clean Energy Industry\n\nRenewables are the fastest-growing energy source in the United States. Clean energy use grew by 42% between 2010 and 2020, making up 20% of utility-scale electricity production in the country. In addition, the country’s renewable electricity generation surpassed coal for the first-time last year, per the EIA data.\n\nStory continues\n\nThe federal statistical agency revealed that the growth in wind and solar significantly drove the increase in renewable energy, and contributed 14% of national power production in 2022, up from 12% the year before. Additionally, another 7% was added by hydropower, geothermal, and biomass, bringing the overall contribution of renewables to 21% in 2022, compared to 19% in 2021. At the same time, share of coal in power generation declined from 23% in 2021 to 20% in 2022.\n\nAmong individual states, Texas was the top wind-generating state last year, accounting for 26% of the national wind power. Following it were Iowa (10%), then Oklahoma (9%). Meanwhile, California, surpassed all other states in the production of solar energy. The state produced 26% of the national utility-scale solar electricity, followed by Texas and North Carolina, each with 16% and 8%, respectively.\n\nMoreover, solar energy is expected to account for more than half (54%) of the 54.5 GW of new utility-scale electric generating capacity projected to be added to the American power grid this year, followed by battery storage (17%). This shows a noteworthy shift in favor of renewable energy and highlights the significance of sustainable energy solutions, driven by strong demand and the Inflation Reduction Act, signed by the Biden Administration last year, which directs around $400 billion to renewable energy in the form of funding and tax credits.\n\nAdding to this, the United States' progress on renewable energy differs from state to state, and not all of them share the same level of urgency to switch from fossil fuels to renewable energy sources in order to cut carbon emissions. Reducing utility costs is one of the main drivers for homeowners to switch to renewable energy. Although federal tax credits are available to customers in every state, but certain states also offer robust incentives, including tax credits, rebates, property tax exemption, and low interest loans, that make going solar even more appealing.\n\nFor instance, residents in New York can qualify for a 25% tax credit on solar installations (up to $5,000), and sales tax exemptions. Similarly, homeowners in the state of Idaho may qualify for a tax deduction of 40% of the cost of a solar system applied the year of installation, and 20% for the following three years. It also has a State Energy Loan program that offers low-interest loans for homeowners installing solar panel systems. Furthermore, Maryland offers a great selection of solar incentives. Residential Clean Energy Grant Program of the state, which offers up to $1,000 for home solar installations, is one such incentive.\n\nIncentives like these benefit several companies like First Solar, Inc. (NASDAQ:FSLR) and Enphase Energy, Inc. (NASDAQ:ENPH), which provide solar energy solutions for domestic customers.\n\nDon’t Miss: 10 Solar Stocks Billionaires are Loading Up On\n\nFirst Solar, Inc. (NASDAQ:FSLR), Arizona-based solar company, designs, manufactures and sells PV solar modules. On July 27, First Solar, Inc. (NASDAQ:FSLR) posted earnings for the second quarter of 2023, reporting a GAAP EPS of $1.59, beating market estimates by $0.65. The revenue over the period was $811 million, up 30.6% compared to the revenue over the same period last year.\n\nEnphase Energy, Inc. (NASDAQ:ENPH), headquartered in Fremont, California, is a provider of photovoltaic solutions, with a key focus on the residential market. The company beat market expectations on earnings per share in the second fiscal quarter. According to Insider Monkey’s second quarter database, 50 hedge funds were bullish on Enphase Energy, Inc. (NASDAQ:ENPH) and disclosed positions worth $772.7 million in the company.\n\nHere is what Carillon Eagle Mid Cap Growth Fund had to say about Enphase Energy, Inc. (NASDAQ:ENPH) in its Q2 2023 investor letter:\n\n“Enphase Energy provides solar microinverters and energy storage solutions. The company’s shares lagged benchmark counterparts amid concerns surrounding a near-term moderation in the growth of residential solar installation in the United States. Despite this, the company possesses a market-leading position in its core microinverter product and remains wellpositioned over the long term to benefit from ongoing solar adoption trends. Additionally, Enphase is focused on growing its international presence while also unveiling new products that could provide the next tailwind to its growth story.”\n\nIt is pertinent to note that California, widely regarded as a leader in renewable energy and particularly in solar power, passed new rules last year to cut the benefits on the use of rooftop solar panels. Analysts believe that this decision will have an impact on residential solar power companies as well as other states.\n\nSome states give benefits to electrical vehicles buyers\n\nWhen we talk about ways to cut carbon emissions, its important to remember that electric vehicles (EVs) are the key technology to decarbonize road transport. The IRA guarantees up to $7,500 in tax credits for EVs that are manufactured in America, but many states across the United States, though not all, also provide incentives for the purchase of electric cars in an effort to hasten the adoption of low-emission vehicles.\n\nThe Clean Vehicle Rebate Project (CVRP) in California, for example, provides tax credits ranging from $1,000 to $7,500 for the purchase of specific new EVs. Furthermore, New York's Drive Clean Rebate program offers incentives of up to $2,000 for eligible new car purchases or leases. Similarly, Colorado offers great incentives. It’s rebate program called Excel gives buyers $5,500 upfront for purchase of new electric vehicles and $3,000 for used ones.\n\nSales of companies like Tesla, Inc. (NASDAQ:TSLA), a major dominating force in the EV sector, are being further boosted by states that offer generous EV benefits.\n\nTesla, Inc. (NASDAQ:TSLA) accounted for more than half of the 3,000 electric vehicles sold in the United States in the second quarter of 2023. As of September 6, the stock has returned 108.22% to investors on a year-to-date basis.\n\nIn its Q2 2023 Earnings Call, Elon Musk, CEO and product architect of Tesla, Inc. (NASDAQ:TSLA) said:\n\n“In Q2 we achieved record vehicle production and deliveries, and record revenue of about $25 billion in a single quarter. And Model Y became the bestselling vehicle of any kind globally in Q1, surpassing the likes of Corolla and Golf. So, it was the number one vehicle of any kind, including vehicles that are sold at a far lower price. This is, I think, an incredible achievement by the Tesla team, and just a huge thank you to our customers for their support. And this came in spite of high interest rates and a lot of macro uncertainty. And nonetheless, we managed to achieve operating margin of about 10%. We continue to target 1.8 million vehicle deliveries this year. Although, we expect that Q3 production will be a little bit down because we’ve got summer shutdowns to — for a lot of factory upgrades.”\n\nMost and Least Environmentally Friendly States in America\n\nThe 2023’s Greenest States study from the personal finance site, WalletHub, which ranked the 50 states utilizing 25 different metrics such as water quality, air quality, and renewable energy consumption, identified Vermont, New York, California, Hawaii, and Maryland as the top 5 most environmentally friendly states in the U.S. At the opposite end of the spectrum, the study ranked West Virginia, Louisiana, Mississippi, Alabama, and Wyoming as the least environmentally friendly states in the country.\n\nVermont, for example, generated almost 100% of its electricity from renewable resources in 2021. It also has low carbon dioxide emissions per capita. Similarly, California is a leader in the solar industry, and more than 1.5 million homes, businesses and other utility customers in the state have rooftop solar panels.\n\nWest Virginia, on the other hand, is more reliant on coal, which continues to supply the vast majority of the state's electricity, delivering 91% of power in 2021.\n\nWith that said, let’s take a look at the most environmentally friendly states in America. 20 Most Environmentally Friendly States in America\n\nOur Methodology\n\nWe initially began our search for the most environmentally friendly states in America by using two reliable metrics. These included 2023’s Greenest States from WalletHub and ConsumerAffairs’s 2023 rankings for the Greenest States in the United States.\n\nWe then proceeded to assign a score to each state based on its ranking in each report. For instance, the #1 state in each report will get a score of 50/50=1, #2 state will get a score of 49/50=0.98 and so on.\n\nAfter that, we added the scores from these two reports for each state. The top 25 states along with their scores were shortlisted, creating a list A.\n\nWe then applied the same scoring methodology to the third metric, our recently published analysis on the 20 States with the Most Electric Vehicles, to generate a list B.\n\nThe overall score for each state was calculated by adding up their individual scores in the aforementioned lists. Finally, we sorted the states by their overall scores and identified the 20 most environmentally friendly states in America.\n\n20. North Carolina\n\nOverall Score: 1.28\n\nNorth Carolina, in the Southeastern region, is one of the most environmentally friendly states in America on our list. It had around EV 45,590 registrations in 2022.\n\n19. Idaho\n\nOverall Score: 1.32\n\nAccording to the EIA, renewable energy sources accounted for 75% of all power generated in Idaho last year.\n\n18. Virginia\n\nOverall Score: 1.39\n\nVirginia is ranked third in the nation for overall air and water quality, according to the 2023 U.S. News & World Report's annual Best States rankings.\n\n17. Delaware\n\nOverall Score: 1.40\n\nDelaware, a Mid-Atlantic U.S. state, encourages homeowners and companies to use renewable energy by providing grants, incentives, and technical assistance. Solar currently accounts for roughly 4.5% of the state's electricity, which is enough to power about 30,000 homes.\n\nIn addition, Delaware intends to triple its solar capacity during the next five years.\n\n16. Hawaii\n\nOverall Score: 1.61\n\nHawaii, located in the middle of the North Pacific Ocean, is one of the most environmentally friendly states in America. It has the finest air quality among the 50 states, according to WalletHub research. Additionally, the state has second lowest gasoline consumption (in gallons) per capita.\n\n15. New Hampshire\n\nOverall Score: 1.62\n\nNew Hampshire has cut air emissions by 76% in the last decade, per the EIA.\n\n14. Minnesota\n\nOverall Score: 1.67\n\nBased on recent research from ConsumerAffairs, Minnesota, located in the Midwest region, is among the top 10 greenest states in America. Moreover, renewables provided 31% of the states’ electricity generation in 2022, per the EIA.\n\n13. South Dakota\n\nOverall Score: 1.68\n\nSouth Dakota is one of the most environmentally conscious states in America. Residents of the state have access to financial incentives to encourage the use of renewable energy.\n\nIn 2021, the state produced the second-highest percentage of energy from renewables.\n\n12. Connecticut\n\nOverall Score: 1.69\n\nConnecticut Green Bank, established in 2011, invests in clean energy projects and helps residents and businesses in financing renewable energy projects, thereby making them more affordable.\n\n11. Maine\n\nOverall Score: 1.76\n\nMaine is on track to generate 100% of its electricity from renewables by 2040. Also, this eco-friendly state has the second-lowest amount of landfill waste among the 50 states.\n\n10. Nevada\n\nOverall Score: 1.97\n\nNevada, a state in the Western region of the United States, had a total of 32,950 EV registrations in 2022.\n\n9. Vermont\n\nOverall Score: 2.00\n\nVermont, one of the greenest states in America, recently passed the Affordable Heat Act, which aims to reduce dependence on high-cost, price-volatile, and polluting fossil heating fuels.\n\n8. New York\n\nOverall Score: 2.01\n\nAccording to WalletHub's report on 2023's Greenest States, the State of New York uses the least amount of gasoline per capita in the country.\n\n7. Massachusetts\n\nOverall Score: 2.04\n\nMassachusetts encourages individuals and business owners to adopt sustainable energy through implementing climate-friendly policies. In 2021, 20% of all electricity produced in the state came from solar.\n\n6. Colorado\n\nOverall Score: 2.07\n\nColorado, with 10.3 electric vehicle registrations per thousand residents in 2022, is one of the most environmentally friendly states in America.\n\nClick to continue reading and see 5 Most Environmentally Friendly States in America.\n\nSuggested articles:\n\n15 Most Bike Friendly Cities in the US 25 Most Environmentally Friendly Companies in the World 25 Best Countries for Green Living\n\nDisclosure: None. 20 Most Environmentally Friendly States in America in 2023 in 2023 is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/20-most-environmentally-friendly-states-105043490.html", "symbols": ["E0P.F", "ENPH.US", "F3A.F", "F3A.XETRA", "FSLR.MX", "FSLR.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.02, "neu": 0.818, "pos": 0.162}}, {"date": "2023-09-11T10:44:20+00:00", "title": "U.S. stocks are rising as investors hope for rate pause; data in view", "content": "Investing.com -- U.S. stocks were rising on hopes the Federal Reserve will leave rates unchanged when it meets this month, as investors anticipate nearing the end of its interest rate increases.\n\nAt 10:38 ET (14:38 GMT), the Dow Jones Industrial Average was up 55 points or 0.2%, while the S&P 500 was up 0.4% and the NASDAQ Composite was up 0.5%.\n\nThe three major Wall Street indices posted a losing week last week, with the blue-chip Dow Jones Industrial Average ending around 0.8 lower. The tech-heavy Nasdaq Composite dropped 1.9% and the broad-based S&P 500 fell 1.3%, their first negative week in three.\n\nInflation data looms large\n\nLast week’s equity losses were largely caused by rising concerns that stronger than expected economic data will prompt the Federal Reserve to keep interest rates at elevated levels for longer than previously expected.\n\nWith this in mind, the focus this week will be on the latest consumer price index and producer price index readings, on Wednesday and Thursday respectively, particularly given the higher energy cost pressures.\n\nThe market is widely expecting the U.S. central bank to pause raising interest rates this month, but policymakers still do not appear to be ready to declare victory over inflation.\n\n\"Another skip could be appropriate when we meet later this month,\" Dallas Fed President Lorie Logan said late on Thursday. \"My base case, though, is that there is work left to do.\"\n\nTech sector in spotlight\n\nThe tech sector suffered last week as rising U.S. bond yields disproportionately impacted a number of the sector’s richly valued stocks.\n\nThis week sees financial updates from Oracle (NYSE:ORCL) on Monday and Adobe (NASDAQ:ADBE) on Thursday, while Apple (NASDAQ:AAPL) is set to hold a product event on Tuesday, at which the world’s most valuable company is widely expected to unveil the iPhone 15.\n\nAdditionally, Alibaba (NYSE:BABA) announced earlier Monday that the e-commerce giant’s former group CEO Daniel Zhang has resigned just two months after concentrating his focus on cloud computing, raising concern over the unit's spin-off plan. Alibaba shares slipped 1.7%.\n\nStory continues\n\nTesla Inc (NASDAQ:TSLA) shares rose 6.4% after an upgrade from Morgan Stanley (NYSE:MS), which said the electric vehicle maker will benefit from its autonomous technology.\n\nCrude market awaits IEA, OPEC reports\n\nOil prices edged lower Monday, easing from 10-month highs after a stellar rally in the wake of top producers Saudi Arabia and Russia extending their voluntary supply cuts to the end of the year.\n\nThe International Energy Agency and the Organization of the Petroleum Exporting Countries are due to release their monthly reports this week.\n\nInvestors will be looking for comments on likely demand growth given a swathe of recent data has shown that the important Chinese economy was cooling despite the lifting of anti-COVID restrictions earlier this year.\n\n(Peter Nurse and Oliver Gray contributed to this item.)\n\nRelated Articles\n\nU.S. stocks are rising as investors hope for rate pause; data in view\n\nDisney and Charter reach agreement ending ESPN, ABC blackout\n\nAstraZeneca seeks to calm CEO speculation after shares drop", "link": "https://finance.yahoo.com/news/u-stocks-rising-investors-hope-104420776.html", "symbols": ["AAPL.US", "ADBE.US", "BABA.US", "DJI.INDX", "IXIC.INDX", "MS.US", "ORCL.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.987, "neg": 0.06, "neu": 0.818, "pos": 0.123}}, {"date": "2023-09-11T10:43:27+00:00", "title": "Trending Tickers: Tesla | BMW | Vistry | The Restaurant Group", "content": "Elon Musk, CEO of SpaceX and Tesla and owner of Twitter. Photo: Gonzalo Fuentes/Reuters\n\nTesla (TSLA)\n\nTesla shares were up around 6% in premarket trading on Monday as it was upgraded from a \"hold\" to a \"buy\" by analysts at Morgan Stanley.\n\nMorgan Stanley thinks the new DoJo supercomputer could increase the electric carmaker's market value by $500bn (£399.4bn), with the possible rise of robocars and network services.\n\nBMW (BMW.DE)\n\nGerman car maker BMW was hitting British headlines on Monday as it set out a plan to increase its investment in its UK operations.\n\nBMW will lay out plans to invest hundreds of millions in a new Mini factory near Oxford as it gears up to produce the next generation of electric vehicles. Production of the Minis would begin at the plant in Cowley in 2026.\n\nRead more: LIVE: FTSE and pound gain as traders weigh 'peak' UK rates\n\nThe move should secure the future of both factories at Cowley and in Swindon, which employ around 4,000 people.\n\nStock rose around 1% on Monday morning.\n\nThe Restaurant Group (RTN.L)\n\nWagamama owner The Restaurant Group (TRG) was on the up on Monday, with stock rising 5.3%.\n\nThe bump came after it revealed it is set to slim down its portfolio with the sale of chains Frankie & Benny's and Chiquito to the owner of Cafe Rouge.\n\nRead more: Stocks that are trending today\n\nTRG will pay Big Table Group £7.5m to take 75 restaurants off its hands.\n\nThe deal is set to close in October, but TRG will continue to provide some services until the end of March next year.\n\nVistry (VTY.L)\n\nVistry stock tore more than 16% higher on Monday morning in London as the housebuilder vowed to concentrate on its division that partners with local government and housing associations.\n\nIt also said it would return $1bn to its investors over the next three years via dividends or buybacks starting with a £55m buyback.\n\nWhile this was good news for shareholders, it was worse news for workers, as the company said it would also cut jobs in its shift away from private projects.\n\nWatch: BMW discontinuing heated seat subscription plan\n\nDownload the Yahoo Finance app, available for Apple and Android.", "link": "https://uk.finance.yahoo.com/news/trending-tickers-ftse-tesla-bmw-vistry-the-restaurant-group-104327256.html", "symbols": ["$KING-USD.CC", "7ADD-USD.CC", "AAC-USD.CC", "ABS-USD.CC", "ABST-USD.CC", "ACS-USD.CC", "ACTN-USD.CC", "ADI-USD.CC", "ADL-USD.CC", "ADX-USD.CC", "AE-USD.CC", "AEON-USD.CC", "AFIN-USD.CC", "AFROX-USD.CC", "AIDUS-USD.CC", "AIM-USD.CC", "AITRA-USD.CC", "AK12-USD.CC", "ALBT-USD.CC", "ALPA-USD.CC"], "tags": [], "sentiment": {"polarity": -0.128, "neg": 0.021, "neu": 0.95, "pos": 0.028}}, {"date": "2023-09-11T10:42:02+00:00", "title": "Dow Jones Futures Rise; Tesla Stock Eyes Buy Signal On Huge Price Target Hike", "content": "Futures rose Monday, with Tesla set to clear an early buy point on a huge price target hike. Apple, Adobe and Oracle in focus this week.\n\nContinue reading", "link": "https://finance.yahoo.com/m/adf86857-6fcf-31e1-aae0-fab15e31db5c/dow-jones-futures-rise%3B-tesla.html", "symbols": ["307.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "DJI.INDX", "DKNG.US", "GSPC.INDX", "IXIC.INDX", "ORC.F", "ORC.XETRA", "ORCL.MX", "ORCL.US", "ORCL34.SA", "RUT.INDX", "SHOP.TO", "SHOP.US", "TL0.F", "TL0.XETRA"], "tags": [], "sentiment": {"polarity": 0.599, "neg": 0, "neu": 0.836, "pos": 0.164}}, {"date": "2023-09-11T10:00:51+00:00", "title": "The biggest ideas and pettiest rages in Walter Isaacson's Elon Musk biography", "content": "Elon Musk at a news conference in Cape Canaveral, Fla., in January. (Associated Press)\n\nWalter Isaacson's newest book, \"Elon Musk,\" about the temperamental corporate executive who runs Tesla, SpaceX and the company formerly known as Twitter, goes on sale this week.\n\nMusk is already one of the most well known and extensively covered leaders in American corporate life (and one of its most unavoidable figures on the service he has renamed X). Isaacson's biography is a Musk agonistes: a portrait of a (largely) self-made, emotionally volatile entrepreneur from South Africa who has a tortured relationship with his father and an addiction to crises of the self-inflicted variety.\n\nRead more:What drove Elon Musk — onetime Democratic 'fanboy' — to troll progressive politics\n\nMusk is tormented, erratic and rude, over and over again\n\nMusk's moods are variously described as cycling through \"light and dark, intense and goofy, detached and emotional, with occasional plunges into what people around him call 'demon mode'\"; he's \"childlike, almost stunted,\" \"a drama magnet,\" \"not bred for domestic tranquility\"; he has \"a craving for storm and drama\" and \"erratic emotional oscillations.\" Multiple people describe him as having undiagnosed Asperger's. At one point, Musk calls himself bipolar. His volatile emotional states are the biggest constant in a book that zigzags from cars to rockets, tunneling to AI, solar energy to neural implants.\n\nIsaacson repeatedly likens Musk to his estranged father Errol Musk, also reportedly prone to volatile moods, abrasive behavior, credit-grubbing, flimflammery and conspiracy theories. Elon's mother Maye said Errol \"hit her\" before the pair divorced, which Errol denied. Musk cut off his father after Errol had a child with a woman Elon considered his half-sister — Jana — whom Errol had raised as his stepdaughter since she was 4. In an email Errol wrote to Elon for Father's Day in 2022, he called Biden a \"freak, criminal, pedophile president\" and that in South Africa, \"with no Whites here, the Blacks will go back to the trees.\"\n\nStory continues\n\nNothing Elon Musk says in the book is as jarring as his own father's sometimes bizarre and racist comments. But elsewhere, Elon's own frequent lack of empathy is bolstered by ample evidence. During the first dance at his wedding with first wife, Justine, he whispered to her, \"I am the alpha in this relationship.\" In 2016, he accused journalists of \"killing people\" (by discrediting self-driving technology) after they asked questions about the first drivers to die in Tesla Autopilot accidents. He was briefly estranged from his brother, Kimbal, after the latter — who once helped rescue Tesla financially — asked for help with his own restaurants. Elon replied that they were doomed, and \"I think they should die.\"\n\nIt's natural for a reader to wonder whether trying to decarbonize the auto industry or avoid humanity's extinction justifies the chaos, the bullying, the poor labor standards — the trouble. Isaacson weighs in on the subject only at the end of his book: \"Do the audaciousness and hubris that drive him to attempt epic feats excuse his bad behavior, his callousness, his recklessness? The times he's an a—? The answer is no, of course not.\"\n\nThen, a few paragraphs later, the needle on Isaacson's moral compass wobbles: \"But would a restrained Musk accomplish as much as a Musk unbound? ... Sometimes great innovators are risk-seeking man-children who resist potty training. They can be reckless, cringeworthy, sometimes even toxic. They can also be crazy. Crazy enough to think they can change the world.\"\n\nRead more:Elon Musk confirms he and Grimes privately welcomed a third child, Techno Mechanicus\n\nThe two Elon Musks, before and after 2018's Tesla \"production hell\" (or Amber Heard, or his daughter's transition)\n\n2018 was an inflection point in the perception of Musk as a public figure, which foreshadowed his post-pandemic evolution in 2020 from moderate Democrat to trolling conservative. When a group of children were trapped in a cave in Thailand, Musk tweeted that one rescue diver who dismissed his offer to build a submersible was a \"pedo guy.\" (Musk later apologized, but not easily.) On Joe Rogan's podcast, he smoked marijuana, which risked his status as a U.S. government contractor. He shot a Tesla Roadster into space.\n\nBehind the scenes, the summer of 2017 through the fall of 2018 encompassed the most \"hellacious\" period of Musk's life, Isaacson writes: \"Musk went through periods when he oscillated between depression, stupor, giddiness, and manic energy.\" Isaacson traces Musk's tailspin to the news of his father's relationship with his stepdaughter — as well as his own stormy relationship with the actor Amber Heard, who had recently gone through a tumultuous divorce with the actor Johnny Depp.\n\nHeard \"drew [Musk] into a dark vortex\" around 2017, Isaacson writes, \"that lasted more than a year and produced a deep-seated pain that lingers to this day. ... His brother and friends hated her with a passion.\" Elon Musk unveiling the Tesla Model Y in Hawthorne in 2019. The struggle to ramp up production of its predecessor, the Model 3, left Musk, as he told Walter Isaacson, \"on the ragged edge of sanity.\" (FREDERIC J. BROWN/AFP via Getty Images)\n\nThere were plenty of other stressors that didn't involve a public figure who's already taken enough public bludgeoning after the Depp-Heard defamation trial. One of the biggest was the \"production hell\" at Tesla in 2018, when the survival of the company (and Musk's reputation) hinged on meeting a seemingly impossible production target for the Tesla Model 3. Musk prowled the factory in a \"frenzy of insanity,\" he recalled later, \"getting four or five hours' sleep, often on the floor. I remember thinking, I'm like on the ragged edge of sanity.\"\n\nWhat gave his turmoil a political bent was his daughter Jenna's gender transition around 2020, followed by her decision to cut ties with him. Musk blamed this on her becoming \"a full communist\" as a result of her progressive education at a Los Angeles private school, Crossroads. This is around the time \"woke mind virus\" worked its way into his vocabulary.\n\nRead more:Column: Elon Musk comes around to blaming the Jews\n\nMusk's team got part of the 405 freeway repainted to improve his Tesla commute\n\nIn 2015, Isaacson reports that Musk would drive from his home in Bel Air to SpaceX headquarters near LAX and wanted his Tesla to be able to complete the trip using the company's not-quite-functional Autopilot system. One lane on the 405 freeway caused Musk's Tesla trouble because the lane markers were too faded. Musk's staff hatched a plan to sneak out onto the freeway at 3 a.m. to repaint the lanes themselves until they found a Musk fan in a governmental \"transportation department\" (it's not specified which one) who helped arrange for the lanes to be repainted in exchange for a tour of SpaceX.\n\nMusk's first principles and Bill Gates' belly\n\nIn the book, Musk is repeatedly depicted as being obsessed with \"first principles,\" namely, the importance of getting to Mars, making humanity a multiplanetary species, avoiding dictatorship by artificial intelligence. Isaacson rarely contexualizes or scrutinizes Musk's positions on these issues himself, leaving the reader to get competing views from Musk's own peers in the tycoon space.\n\nAt a party in 2013, Isaacson reports, Musk argued with Google's Larry Page about the danger of artificial intelligence on the grounds that human consciousness was something special in the universe. Page called Musk's position sentimental nonsense and \"specist.\" Well, yes, I am pro-human,\" Musk told Page. Determined that \"the future of AI should not be controlled by Larry,\" he cofounded OpenAI with Sam Altman (but left the project before ChatGPT was released).\n\nFirst-principles thinking tends to close off alternatives. (Is getting to Mars really the best way to save humanity?) The book strikes a rare note of skepticism when describing a visit from Bill Gates to advocate different priorities (such as eradicating mosquitoes). Musk thinks his wealth is better spent on his human-saving companies. \"He's overboard on Mars,\" Gates tells Isaacson. \"... It's this crazy thing where maybe there's a nuclear war on Earth and so the people on Mars\" will return and restore humanity.\n\nLater, Musk realized Gates still had a short position on Tesla stock. \"It's pure hypocrisy,\" Musk complained to Isaacson. \"Why make money on the failure of a sustainable energy car company?\" He retaliated by tweeting a picture of Gates with a bulging belly.\n\nMusk thought attacking Rep. Nancy Pelosi's husband was one of his worst mistakes\n\nAfter Rep. Nancy Pelosi's husband was seriously injured by a man who invaded their home in 2022, Musk tweeted a link suggesting Paul Pelosi had gotten into a fight with a male prostitute, saying, \"There is a tiny possibility there might be more to this story than meets the eye.\" He deleted the tweet and, Isaacson reported, \"said privately that it was one of his dumbest mistakes.\" His brother agreed.\n\n\"You're an idiot,\" Kimbal, who \"stopped following Elon on Twitter because it was too nerve-wracking,\" told his brother of the Pelosi tweet. \"Stop falling for weird s—.\" Kimbal Musk was down on his brother's Twitter acquisition altogether. \"It's a pimple on the a— of what should be your impact on the world.\"\n\nRead more:The dubious history of the Santa Monica Observer, the outlet behind that false Paul Pelosi story\n\nThe emerald mine affair\n\nOver the years, Musk critics have accused him of getting a leg up in life because of money his father made from emerald mines. Isaacson, who interviewed Errol Musk, reports that Errol struck a black-market deal to receive emeralds from three mines in Zambia to cut in Johannesburg, but that Errol did not have an ownership stake in the mines. He reportedly earned $210,000 from those mines before the business collapsed in the 1980s.\n\nBut Isaacson calls it a \"myth\" that Elon emigrated in 1989 with wealth from his father's emerald business. Isaacson writes that Errol's emerald business had become \"worthless\" years earlier, and that he only gave his son $2,000 in traveler's checks when Elon Musk moved to Canada that year.\n\nIsaacson and the muddied waters of the Musk-Ukraine controversy\n\nIn the days before its release, Isaacson's book has picked up headlines for a chapter, excerpted in the Washington Post, detailing Musk's intervention into the Russian-Ukrainian war. In March 2022, after Russia launched a wide-scale invasion of Ukraine, Musk quickly offered to donate Starlink satellite internet services to the Ukrainian government to aid in the country's military defense.\n\nBut that September, Isaacson wrote, Musk effectively thwarted a Ukrainian submarine drone attack against the Russian fleet based in Russian-occupied Crimea. \"The Russian ambassador had warned him, in a conversation a few weeks earlier, that attacking Crimea would be a red line and could lead to a nuclear response,\" Isaacson wrote.\n\nIt was the ensuing detail from Isaacson that caught headlines: Musk \"secretly told his engineers to turn off coverage within a hundred kilometers of the Crimean coast,\" which neutralized the drones. It sounded as if Musk had acted at the behest of the Russian government.\n\nRead more:Elon Musk’s SpaceX wins Pentagon deal for Starlink in Ukraine\n\nOn Friday, Isaacson posted a correction on Musk's social media service, X (formerly Twitter): \"The Ukrainians THOUGHT coverage was enabled all the way to Crimea, but it was not. They asked Musk to enable it for their drone sub attack on the Russian fleet. Musk did not enable it...\"\n\nThe rest of Isaacson's chapter on the incident gives a little more context. Musk was surprised at the blowback, given that he had directly donated support to the Ukrainian military defense in a way that no other company could. But he also seemed to have bitten, hard, on the Russian government's bluffs of potential nuclear retaliation; Ukraine has since launched many attacks both on Crimea and Russian soil without major escalation.\n\n\"How am I in this war?\" Musk asked Isaacson in a call. \"Starlink was not meant to be involved in wars.\" Following the furor, Starlink contracts with government agencies, which then decide where its tech is used for military purposes. A government rather than a private individual getting to decide matters of war: You might call it a first principle.\n\nSign up for our Book Club newsletter to get the latest Los Angeles book news, events and more.\n\nThis story originally appeared in Los Angeles Times.", "link": "https://finance.yahoo.com/news/biggest-ideas-pettiest-rages-walter-100051460.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.999, "neg": 0.106, "neu": 0.835, "pos": 0.059}}, {"date": "2023-09-11T09:59:00+00:00", "title": "Adam Jonas explains why Tesla will be better at being Nvidia than Nvidia", "content": "It takes something big to cut through all this noise, or at least something bombastic: something like a 66 page research report from Morgan Stanley analyst Adam Jonas and six of his colleagues. Investors have long debated whether Tesla is an auto company or a tech company. The same forces that have driven AWS to reach 70% of AMZN total EBIT can work at Tesla, in our view, opening up new addressable markets that extend well beyond selling vehicles at a fixed price.\n\nContinue reading", "link": "https://finance.yahoo.com/m/380c0235-7b12-3e1a-8be7-4e45e8915462/adam-jonas-explains-why-tesla.html", "symbols": ["NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.511, "neg": 0.024, "neu": 0.89, "pos": 0.086}}, {"date": "2023-09-11T09:58:57+00:00", "title": "Futures advance on Tesla boost, inflation data in focus", "content": "By Ankika Biswas and Shristi Achar A\n\n(Reuters) -Wall Street futures gained on Monday as Tesla shares rose, while investors awaited inflation data due later this week for clues on the U.S. Federal Reserve's interest-rate path.\n\nThe three major indexes logged weekly declines on Friday as strength in oil prices and stronger-than-expected economic data fueled concerns of sticky inflation and interest rates staying higher for longer.\n\nInvestors now await the crucial consumer and producer prices data as well as retail sales numbers due later this week.\n\nThe consumer price data on Wednesday will indicate whether the U.S. economy is on track for a so-called soft landing that could allow the Fed to bring down inflation without sharply impacting growth.\n\n\"This could be a defining period for stocks as we get some clarity on whether the rate hiking cycle is truly at or near its end or if there is more work to do in the battle against inflation,\" said Russ Mould, investment director at AJ Bell in a note.\n\n\"Until the market knows where the terminal interest rate lies and what the new normal is in terms of borrowing costs, we should probably steel ourselves for further volatility.\"\n\nTraders see a 93% chance of the central bank holding its interest rates at current levels in the September meeting, while their odds for a pause in November stand at 55.4%, according to CME FedWatch Tool.\n\nFed officials have entered a blackout period, during which they usually do not make public comments, until the policy decision outcome on Sept. 20.\n\nAt 7:04 a.m. ET, Dow e-minis were up 81 points, or 0.23%, S&P 500 e-minis were up 19.5 points, or 0.44%, and Nasdaq 100 e-minis were up 96.75 points, or 0.63%.\n\nTesla climbed 6.4% in premarket trading as Morgan Stanley upgraded the EV maker to \"overweight\" from \"equal-weight\" due to potential growth in its market value from Dojo, the firm's supercomputer.\n\nApple edged up 0.8% following a near 6% decline last week on China's restrictions of iPhone usage for government officials, ahead of its fall event on Sept. 12.\n\nStory continues\n\nHostess Brands jumped 14.9% as Jif peanut butter maker J.M. Smucker is nearing a deal to buy the Twinkies snack cakes owner for close to $5 billion, according to sources.\n\nShares of Boeing rose 1.4% after the White House said that Vietnam Airlines' deal to buy 50 737 Max jets from the planemaker was worth $7.8 billion.\n\nData over the weekend showed China's consumer prices returned to positive territory in August, while factory-gate price declines slowed, as deflation pressures ease amid signs of stabilization in the economy.\n\nU.S.-listed shares of Chinese firms PDD Holdings, Xpeng, Baidu rose between 1.9% and 4.7%, while the iShares China Large-Cap ETF gained 1.4%.\n\nMeta Platforms added 1.3% after a report on Sunday said the firm was working on a new, more powerful artificial-intelligence system.\n\n(Reporting by Ankika Biswas and Shreyashi Sanyal in Bengaluru; Editing by Arun Koyyur and Vinay Dwivedi)", "link": "https://finance.yahoo.com/news/futures-advance-dull-week-gains-095857170.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.99, "neg": 0.02, "neu": 0.879, "pos": 0.102}}, {"date": "2023-09-11T09:50:00+00:00", "title": "These Stocks Are Moving the Most Today: Tesla, Alibaba, Hostess Brands, Apple, Oracle, and More", "content": "Shares of Tesla are upgraded to Buy from Hold at Morgan Stanley, Alibaba CEO Daniel Zhang is stepping down as head of the company's cloud business, and a report says J.M. Smucker is nearing a deal to buy Hostess Brands for about $4 billion.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a10aa54c-d304-3da8-8a15-b1844cbf0dbd/these-stocks-are-moving-the.html", "symbols": ["9988.HK", "AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AHLA.F", "AHLA.XETRA", "APC.F", "APC.XETRA", "BABA.US", "BABA34.SA", "BABAF.US", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.951, "pos": 0.049}}, {"date": "2023-09-11T09:44:20+00:00", "title": "U.S. stocks rise on hopes for Fed rate pause; inflation data in view", "content": "Investing.com -- U.S. stocks were rising on hopes the Federal Reserve will leave rates unchanged when it meets this month, as investors anticipate nearing the end of its interest rate increases.\n\nAt 9:34 ET (13:34 GMT), the Dow Jones Industrial Average was up 193 points or 0.6%, while the S&P 500 was up 0.7% and the NASDAQ Composite was up 0.9%.\n\nThe three major Wall Street indices posted a losing week last week, with the blue-chip Dow Jones Industrial Average ending around 0.8 lower. The tech-heavy Nasdaq Composite dropped 1.9% and the broad-based S&P 500 fell 1.3%, their first negative week in three.\n\nInflation data looms large\n\nLast week’s equity losses were largely caused by rising concerns that stronger than expected economic data will prompt the Federal Reserve to keep interest rates at elevated levels for longer than previously expected.\n\nWith this in mind, the focus this week will be on the latest consumer price index and producer price index readings, on Wednesday and Thursday respectively, particularly given the higher energy cost pressures.\n\nThe market is widely expecting the U.S. central bank to pause raising interest rates this month, but policymakers still do not appear to be ready to declare victory over inflation.\n\n\"Another skip could be appropriate when we meet later this month,\" Dallas Fed President Lorie Logan said late on Thursday. \"My base case, though, is that there is work left to do.\"\n\nTech sector in spotlight\n\nThe tech sector suffered last week as rising U.S. bond yields disproportionately impacted a number of the sector’s richly valued stocks.\n\nThis week sees financial updates from Oracle (NYSE:ORCL) on Monday and Adobe (NASDAQ:ADBE) on Thursday, while Apple (NASDAQ:AAPL) is set to hold a product event on Tuesday, at which the world’s most valuable company is widely expected to unveil the iPhone 15.\n\nAdditionally, Alibaba (NYSE:BABA) announced earlier Monday that the e-commerce giant’s former group CEO Daniel Zhang has resigned just two months after concentrating his focus on cloud computing, raising concern over the unit's spin-off plan. Alibaba shares slipped 0.5%.\n\nStory continues\n\nTesla Inc (NASDAQ:TSLA) shares rose more than 5% after an upgrade from Morgan Stanley (NYSE:MS), which said the electric vehicle maker will benefit from its autonomous technology.\n\nCrude market awaits IEA, OPEC reports\n\nOil prices edged lower Monday, easing from 10-month highs after a stellar rally in the wake of top producers Saudi Arabia and Russia extending their voluntary supply cuts to the end of the year.\n\nThe International Energy Agency and the Organization of the Petroleum Exporting Countries are due to release their monthly reports this week.\n\nInvestors will be looking for comments on likely demand growth given a swathe of recent data has shown that the important Chinese economy was cooling despite the lifting of anti-COVID restrictions earlier this year.\n\n(Peter Nurse and Oliver Gray contributed to this item.)\n\nRelated Articles\n\nU.S. stocks rise on hopes for Fed rate pause; inflation data in view\n\nJPMorgan sees multi-year 'U-shaped' recovery for Brunswick\n\nUAW ready to negotiate around the clock as strike deadline nears", "link": "https://finance.yahoo.com/news/u-stocks-rise-hopes-fed-094420250.html", "symbols": ["AAPL.US", "ADBE.US", "BABA.US", "DJI.INDX", "IXIC.INDX", "MS.US", "ORCL.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.98, "neg": 0.058, "neu": 0.832, "pos": 0.109}}, {"date": "2023-09-11T09:19:00+00:00", "title": "Tesla surges on Morgan Stanley upgrade that sees $600 billion 'Dojo' AI boost", "content": "Tesla's new DoJo supercomputer could added $600 billion to the carmaker's market value, according to a top Wall Street analyst.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4159711f-e660-3340-9ceb-cb5b51d64677/tesla-surges-on-morgan.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.494, "neg": 0, "neu": 0.819, "pos": 0.181}}, {"date": "2023-09-11T09:06:45+00:00", "title": "The 3 Best Battery Stocks to Buy Now: September 2023", "content": "Lithium is a key component of batteries for electric vehicles (EVs), which are expected to see a surge in demand in the coming years. However, lithium prices have been volatile in the past year, causing the best battery stocks to reach record highs in late 2022 before falling sharply in early 2023 due to oversupply and weak demand from China, the world’s largest EV market.\n\nHowever, some analysts expect lithium prices to rebound in the near and medium term, as supply remains tight, and demand picks up from other regions such as Europe and North America. According to Australian Resources & Investment, lithium hydroxide prices are expected to average $46,746 per ton in 2023, before dropping to $30,357 by 2025. These prices are still historically high compared to the average of $12,163 across the three years to 2021, which underscore the sticky demand undergirding these prices.\n\nFor investors who want to capitalize on the lithium boom, here are three of the best battery stocks that could offer attractive returns.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nTesla (TSLA) Tesla (TSLA) supercharging station during the day.\n\nSource: Arina P Habich / Shutterstock.com\n\nTesla (NASDAQ:TSLA), the world’s leading EV maker, is also a pioneer in battery technology. The automaker has been able to amass a large, loyal customer base and a strong brand image that sets it apart from its competitors. Tesla delivered over 1.3 million EVs in 2022, up 40% year-over-year, and the automaker looks on track to break another record this year.\n\nTesla’s competitive advantage lies in its cutting-edge battery technology, which leverage a cylindrical shape and dry coating to enable the production of high-performance and long-range EVs at affordable prices. The automaker has made investments into its plants in Texas and Nevada to slowly wean itself off of third-party suppliers. The reason here is straightforward. There will be less supply chain risks and more tax credits incentives from the Inflation Reduction Act.\n\nStory continues\n\nIn 2023, quarterly earnings have come in above analysts’ estimates, and the price cut strategy the automaker began to pursue in the beginning year has increased quarterly deliveries while also placing pressure on gross margins. This combination of factors has led to heightened volatility for the famed EV stock, but shares are still up 129% year-to-date (YTD).\n\nPositive secular trends in consumer preferences and strong EV sales across the board this year should keep potential investors interested and current shareholders happy.\n\nBYD (BYDDY) BYD Company Limited logo in front of their website. BYDDY stock.\n\nSource: T. Schneider / Shutterstock\n\nIt is difficult to make a list on battery stocks without mentioning the world’s second largest EV battery supplier. BYD Co. (OTCMKTS:BYDDY) garnered a number of achievements recently. The Chinese automaker has managed to dethrone Tesla as the world’s largest EV maker, but BYD will not stop there. The company also plans to play a direct role in supplying battery technologies to the burgeoning electric vehicle sector.  BYD has even ousted LG as the world’s number 2 EV battery supplier.\n\nHowever, BYD’s stock price has not performed so stunningly YTD. Shares have only risen 21%, which just pales in comparison to its competitor Tesla. That’s why the stock remains very attractive. Much of the reason attributed to BYD’s lackluster share performance has mostly due to the bad press China’s economy has been getting. Sure, the property market may be facing a slump, but new economy sectors such as semiconductors and electric vehicles have continued to outperform in terms of growth.\n\nBYD, in its own right, has been consistently growing its monthly sales and market share in both domestic and international markets. Valuation also remains much cheaper than Tesla, trading at 25x forward earnings versus Tesla’s 63.9x forward earnings.\n\nSigma Lithium (SGML) lithium (LI) on the periodic table\n\nSource: Shutterstock\n\nDifferent from the two automakers who happen to have battery operations, this Canadian company is more of a pure-play lithium producer. Sigma Lithium (NYSE:SGML) owns and operates the Grota do Cirilo lithium mine in Brazil. The lithium producer started this project all the way back in 2012 and after receiving enough investment, was finally able to start construction in 2021. While Sigma Lithium is still pre-revenue, the lithium producer is looking to produce 130,000 tons of lithium concentrate in 2023.\n\nSigma Lithium has been able to sign a multi-year off-take agreement with LG and is in preliminary term-sheet talks with Mitsui & Co. (OTCMKTS:MITSF). Shares in the lithium producer have performed well since the start of the year, despite the slump in lithium prices: shares are up 26%. As demand for electric vehicles continued unabated, lithium demand should continue to be elevated in the short run. With current production levels going as planned and future annualized production capacity expected to improve, investors have a lot to be hopeful for.\n\nOn the date of publication, Tyrik Torres did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nTyrik Torres has been studying and participating in financial markets since he was in college, and he has particular passion for helping people understand complex systems. His areas of expertise are semiconductor and enterprise software equities. He has work experience in both investing (public and private markets) and investment banking.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post The 3 Best Battery Stocks to Buy Now: September 2023 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-best-battery-stocks-buy-090645914.html", "symbols": ["002594.SHE", "1211.HK", "BY6.F", "BY6A.F", "BYDDF.US", "BYDDY.US", "SGML.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.033, "neu": 0.86, "pos": 0.107}}, {"date": "2023-09-11T08:25:00+00:00", "title": "Tesla Catches an Upgrade. It’s an AI Stock.", "content": "Morgan Stanley analyst Adam Jonas upgrades shares of Tesla to Buy from Hold. His price target is boosted to a Wall Street high of $400 a share. He calls Tesla his top pick.\n\nContinue reading", "link": "https://finance.yahoo.com/m/b78a680a-0b0a-3317-ba9c-ac6926128a3e/tesla-catches-an-upgrade..html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.772, "neg": 0, "neu": 0.769, "pos": 0.231}}, {"date": "2023-09-11T08:13:30+00:00", "title": "Tesla, Apple, Hostess Brands, Qualcomm rise premarket; Alibaba falls", "content": "Investing.com -- U.S. futures traded slightly higher Monday, ahead of the release this week of fresh inflation data which could give guidance of future Federal Reserve monetary action.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nTesla (NASDAQ:TSLA) stock rose 6% after Morgan Stanley upgraded its stance on the electric vehicle manufacturer to ‘overweight’ from ‘equal weight’, calling it a top pick as its dedicated supercomputer, Dojo, can add up to $500B to the company's enterprise value.\n\nApple (NASDAQ:AAPL) stock rose 1.1%, rebounding from last week’s near 6% decline on China's restrictions of iPhone usage for government officials, ahead of Tuesday’s new product launch, which is expected to reveal the new iPhone.\n\nAlibaba  (NYSE:BABA) ADRs fell 0.8% after the Chinese e-commerce giant said that outgoing chief executive Daniel Zhang will also step down as the head of its cloud unit. This was an unexpected move as Zhang was set to lead Alibaba’s cloud unit as the company embarks on a six-way split in the coming months.\n\nHostess Brands (NASDAQ:TWNK) stock rose over 15% after Reuters reported that Jif peanut butter maker JM Smucker (NYSE:SJM) is nearing a deal to the owner of Twinkies snack cakes for close to $5 billion.\n\nQualcomm (NASDAQ:QCOM) stock rose 5.2% after the chipmaker announced Monday it had signed a new deal with Apple to supply 5G chips to the iPhone maker until at least 2026.\n\nBoeing (NYSE:BA) stock rose 0.9% after the White House said that Vietnam Airlines' deal to buy 50 737 Max jets from the planemaker was worth $7.8 billion.\n\nMeta Platforms (NASDAQ:META) stock rose 1.2% after the WSJ reported that the Facebook parent is working on a new artificial-intelligence system intended to be as powerful as the most advanced model offered by OpenAI.\n\nBrunswick (NYSE:BC) stock fell 2.1% after JPMorgan downgraded the recreational boat manufacturer to ‘neutral’ from ‘overweight’, highlighting concerns about high interest rates affecting consumer demand and excess inventory.\n\nStory continues\n\nKenvue (NYSE:KVUE) stock rose 2.8% after Deutsche Bank upgraded the Johnson & Johnson (NYSE:JNJ) spinoff to ‘buy’ from ‘hold’, saying it can rebound by more than 25% in the short term.\n\nRelated Articles\n\nTesla, Apple, Hostess Brands, Qualcomm rise premarket; Alibaba falls\n\nWall St gains as Tesla leads megacap rally; inflation data in focus\n\nImpact of possible strikes on Detroit Three automakers", "link": "https://finance.yahoo.com/news/tesla-apple-hostess-brands-qualcomm-081330845.html", "symbols": ["9988.HK", "AAPL.US", "AHLA.F", "AHLA.XETRA", "BA.MX", "BA.US", "BABA.US", "BABA34.SA", "BABAF.US", "BC.US", "BCO.F", "BCO.XETRA", "BOEI34.SA", "BWI.F", "JNJ.US", "KVUE.US", "META.US"], "tags": [], "sentiment": {"polarity": 0.952, "neg": 0.01, "neu": 0.929, "pos": 0.061}}, {"date": "2023-09-11T07:56:17+00:00", "title": "Tesla supercomputer could boost EV maker's market cap by $600 billion -Morgan Stanley", "content": "(Reuters) - Tesla's supercomputer, Dojo, to train AI models for autonomous cars could give the electric vehicle maker an \"asymmetric advantage\" and boost its market capitalization by nearly $600 billion, or 76%, Morgan Stanley estimated.\n\nTesla started production of Dojo in July and plans to spend more than $1 billion through next year.\n\nDojo can open up new addressable markets that \"extend well beyond selling vehicles at a fixed price,\" Morgan Stanley analysts, led by Adam Jonas, said in a note published on Sunday.\n\n\"If Dojo can help make cars 'see' and 'react,' what other markets could open up? Think of any device at the edge with a camera that makes real-time decisions based on its visual field,\" Jonas said.\n\nThe Wall Street brokerage upgraded its recommendation on Tesla's stock to \"overweight\" from \"equal-weight\" and made it their \"top pick,\" replacing Ferrari's U.S.-listed shares.\n\nMorgan Stanley raised its 12-18 month target on Tesla's shares by 60% to $400 - the highest among Wall Street brokerages as per LSEG data - which, it estimated, would give the EV maker a market capitalisation of about $1.39 trillion.\n\nThat compares with its current market value of about $789 billion, after the stock closed at $248.5 on Friday.\n\nJonas expects Dojo to drive the most value in software and services.\n\nThe analyst raised his estimate for revenue from Tesla's network services business to $335 billion in 2040, from $157 billion previously.\n\nJonas expects the unit to account for more than 60% of Tesla's core earnings by 2040, nearly doubling from 2030.\n\n\"This increase is largely driven by the emerging opportunity we see in 3rd party fleet licensing, increased ARPU (average monthly revenue per user),\" Jonas said.\n\n(Reporting by Roshan Abraham and Susan Mathew in Bengaluru; Editing by Savio D'Souza)", "link": "https://finance.yahoo.com/news/tesla-supercomputer-could-boost-ev-075617714.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.979, "neg": 0, "neu": 0.894, "pos": 0.106}}, {"date": "2023-09-11T06:19:06+00:00", "title": "4 big analyst picks: Tesla a Top Pick at Morgan Stanley on AI mojo", "content": "By Davit Kirakosyan\n\nHere is your Pro Recap of the biggest analyst picks you may have missed since Friday: upgrades for Tesla, CSX, DoorDash, and Tenable.\n\nInvestingPro subscribers got this news first. Never miss another market-moving headline.\n\nTesla gets Overweight rating at Morgan Stanley, named Top Pick\n\nTesla (NASDAQ:TSLA) shares were soaring nearly 9% in recent trading after Morgan Stanley upgraded the company to Overweight from Equalweight and raised its price target to $400 from $250, as reported in real-time on InvestingPro.\n\nThe analysts said that they believe Dojo, a dedicated supercomputer, has the potential to increase Tesla's enterprise value by as much as $500B through accelerated adoption in Mobility (robotaxi) and Network Services (SaaS).\n\nTo improve the FSD system's efficacy, says the analysts, Tesla needs to address challenges related to data collection, processing power, speed, efficiency, and scalability. And they say Dojo is designed to meet these challenges by providing the computational power necessary to process extensive real-world data from Tesla's vehicles.\n\nThe firm also named Tesla its Top Pick.\n\nShares were lately changing hands at $270.25.\n\nDoorDash upped to Hold at Jefferies\n\nDoorDash (NYSE:DASH) shares were up some 1.1% recently after Jefferies upgraded the company to Hold from Underperform and raised its price target to $90 from $70.\n\nThe analysts said in a note that the online food ordering and delivery company has a \"DASHing EBITDA outlook.\"\n\nJefferies added:\n\n\"Our profit decomposition suggests consensus underappreciates tailwinds to EBITDA from further advertising penetration and enhancements to underlying unit economics.\"\n\nThe analysts also believe the company has a \"long runway for margin expansion... driven by further advertising penetration and improvements to underlying economics.\"\n\nShares were lately trading at $83.12.\n\nTenable upped to Overweight at JPMorgan\n\nTenable (NASDAQ:TENB) shares popped Monday after JPMorgan upgraded the cybersecurity firm to Overweight from Neutral and raised its price target to $56 from $51, triggering nearly a 4% recent climb in the shares.\n\nStory continues\n\nThe analysts said they \"see an attractive opportunity for better growth, margin expansion, and FCF moving through the back half of the year into FY24 for TENB.\"\n\nThey added:\n\n\"As demand continues to build, execution is improving, the company continues to dominate peers in core VM markets, and management is taking a thoughtful approach toward expansion into adjacent markets.\"\n\nShares were recently up 3.8% to $45.88.\n\nCSX upgraded at BofA on new management\n\nBofA Securities upgraded CSX (NASDAQ:CSX) to Buy from Neutral on Friday, raising its price target to $36 from $34.\n\nThe upgrade came on the naming of Mike Cory as new COO. Cory brings essential Precision Scheduled Railroading (PSR) expertise following the departure of the former COO. The company’s shares had declined 8.1% since the departure last month due to operational concerns.\n\nKevin Boone was also named Chief Commercial Officer, the first in this role, thanks to his customer and supply chain connections.\n\n***\n\nJump on the biggest news for your portfolio amid a barrage of market headlines: Always be the first to know with InvestingPro.\n\nStart your free 7-day trial now.\n\nRelated Articles\n\n4 big analyst picks: Tesla a Top Pick at Morgan Stanley on AI mojo\n\nStellantis to present new offer as UAW contract nears end\n\nJPMorgan sees multi-year 'U-shaped' recovery for Brunswick", "link": "https://finance.yahoo.com/news/4-big-analyst-picks-tesla-061906062.html", "symbols": ["CSX.US", "CSXC34.SA", "CXR.F", "CXR.STU", "DASH.US", "TENB.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.026, "neu": 0.857, "pos": 0.117}}, {"date": "2023-09-11T04:00:52+00:00", "title": "Battery storage takes central role in powering net zero", "content": "State backing for renewable investments fuels growth but western nations remain dependent on Asia for supply\n\nContinue reading", "link": "https://finance.yahoo.com/m/f4f20235-a41f-3f6a-b573-ac0965840cb9/battery-storage-takes-central.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.214, "neg": 0, "neu": 0.849, "pos": 0.151}}, {"date": "2023-09-11T03:26:44+00:00", "title": "Tesla to Surge Thanks to Dojo Supercomputer, Morgan Stanley Says", "content": "(Bloomberg) -- Tesla Inc.’s Dojo supercomputer may add as much as $500 billion to the company’s market value through faster adoption of robotaxis and network services, according to Morgan Stanley.\n\nMost Read from Bloomberg\n\nTrudeau Is Stuck in India With Faulty Aircraft After Hearing Criticism From Modi India’s G-20 Win Shows US Learning How to Counter China Rise Meloni Tells China That Italy Plans to Exit Belt and Road Biden Doubts China Able to Invade Taiwan Amid Economic Woes Even Brief UAW Strike Seen Causing Billions in US Economic Damage\n\nDojo can open up “new addressable markets,” just like AWS did for Amazon.com Inc., analysts including Adam Jonas and Daniela M Haigian wrote in a note, upgrading the stock to overweight from equal-weight and raising its 12-month price target to a Street-high $400 per share from $250. Tesla has already more than doubled this year and closed at $248.50 on Friday.\n\nThe supercomputer, designed to handle massive amounts of data in training driving systems, may put Tesla at “an asymmetric advantage” in a market potentially worth $10 trillion, they wrote, and could make software and services the biggest value driver for Tesla from here onward. The next version of Tesla’s full self-driving system, expected by year-end, and the company’s Artificial Intelligence day in early 2024 are worth watching, they added.\n\nTesla has been mentioning how Dojo gives it an edge in AI and self-driving technology since at least 2021. In July this year, CEO Elon Musk told investors that the carmaker plans to invest more than $1 billion on the project by the end of 2024.\n\nThat base-case target from Morgan Stanley would put the stock near its record close of $409.97 in November 2021. That makes the firm a notable outlier: The average price target among analysts tracked by Bloomberg is $268.42.\n\n“The more we looked at Dojo, the more we realized the potential for underappreciated value in the stock,” the Morgan Stanley analysts said.\n\nStory continues\n\nMost Read from Bloomberg Businessweek\n\nHuawei’s Surprise Phone Gives Ammo to Biden Doubters on China Lyme Disease Has Exploded, and a New Vaccine Is (Almost) Here\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/tesla-surge-thanks-dojo-supercomputer-032644640.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.44, "neg": 0.058, "neu": 0.877, "pos": 0.065}}, {"date": "2023-09-11T02:36:02+00:00", "title": "Dow Jones Futures Rise For Ailing Market Rally; Tesla Stock Gets Huge Price Target Hike", "content": "Here's how to handle the battered market rally. The Apple iPhone 15 looms with earnings from AI giants Adobe and Oracle. Tesla stock got a big price target hike\n\nContinue reading", "link": "https://finance.yahoo.com/m/adf86857-6fcf-31e1-aae0-fab15e31db5c/dow-jones-futures-rise-for.html", "symbols": ["307.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "DJI.INDX", "DKNG.US", "GSPC.INDX", "IXIC.INDX", "ORC.F", "ORC.XETRA", "ORCL.MX", "ORCL.US", "ORCL34.SA", "RUT.INDX", "SHOP.TO", "SHOP.US", "TL0.F", "TL0.XETRA"], "tags": [], "sentiment": {"polarity": -0.153, "neg": 0.052, "neu": 0.948, "pos": 0}}, {"date": "2023-09-11T00:00:00+00:00", "title": "The 3 Best Battery Stocks to Buy Now: September 2023", "content": "The battery sector is full of potential, but these are the best battery stocks which are likely to power up investors with large returns.", "link": "https://investorplace.com/2023/09/the-3-best-battery-stocks-to-buy-now-september-2023/", "symbols": ["BYDDY.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.778, "neg": 0, "neu": 0.799, "pos": 0.201}}, {"date": "2023-09-11T00:00:00+00:00", "title": "This Analyst Thinks TSLA Stock Will Be the Next Nvidia... and Even Better", "content": "TSLA stock is in focus as Morgan Stanley believes Tesla's chips may be superior to Nvidia's when it comes to enabling self-driving.", "link": "https://investorplace.com/2023/09/this-analyst-thinks-tsla-stock-will-be-the-next-nvidia-and-even-better/", "symbols": ["TSLA.US"], "tags": [], "sentiment": {"polarity": 0.542, "neg": 0, "neu": 0.857, "pos": 0.143}}, {"date": "2023-09-11T00:00:00+00:00", "title": "The 3 Most Undervalued EV Charging Stocks to Buy in September 2023", "content": "Therefore, EV charging companies are going to see high demand in the next few years. Charging infrastructure will become the key to enable EV adoption.", "link": "https://investorplace.com/2023/09/the-3-most-undervalued-ev-charging-stocks-to-buy-in-september-2023/", "symbols": ["TSLA.US"], "tags": [], "sentiment": {"polarity": -0.128, "neg": 0.059, "neu": 0.941, "pos": 0}}, {"date": "2023-09-10T22:41:02+00:00", "title": "Dow Jones Futures Rise: Market Rally Pinned With Apple, Two AI Titans In Focus", "content": "Here's how to handle the battered market rally. The Apple iPhone 15 looms along with earnings from AI giants Adobe and Oracle.\n\nContinue reading", "link": "https://finance.yahoo.com/m/adf86857-6fcf-31e1-aae0-fab15e31db5c/dow-jones-futures-rise%3A.html", "symbols": ["307.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "ORC.F", "ORC.XETRA", "ORCL.MX", "ORCL.US", "ORCL34.SA", "RUT.INDX", "SHOP.TO", "SHOP.US", "TL0.F", "TL0.XETRA", "TSLA.MX"], "tags": [], "sentiment": {"polarity": -0.153, "neg": 0.065, "neu": 0.935, "pos": 0}}, {"date": "2023-09-10T19:34:00+00:00", "title": "‘Elon Musk’ Takeaways: Book Paints Complicated Picture of the World’s Richest Man", "content": "Walter Isaacson’s new biography peers behind the scenes at the tycoon’s lifestyle and his leadership of Tesla, SpaceX and Twitter.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e0bf25ee-860f-38d2-86ff-1b37c626fe3d/%E2%80%98elon-musk%E2%80%99-takeaways%3A-book.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-09-10T19:09:56+00:00", "title": "Elon Musk and Tesla poised to benefit from ‘highly likely’ UAW strike against Detroit’s Big 3—and the timing is just right", "content": "Tesla CEO Elon Musk is no fan of unions, but at the moment he might be quietly cheering on Shawn Fain. The United Auto Workers leader shows no signs of backing down from Detroit’s Big 3 automakers as he pushes \"audacious\" contract demands. If no deal is struck, about 146,000 UAW workers will likely go on strike on Friday.\n\nThat would help Tesla at a time when traditional automakers are pushing more aggressively into electric vehicles.\n\n\"If a strike happens then ultimately production and the EV roadmap could be pushed out into 2024 and delays would be on the horizon at this crucial period for GM, Ford, and Stellantis,\" Wedbush analyst Dan Ives wrote in a research note. Tesla is well situated to benefit from any work stoppage at its rivals, he added.\n\n“I think this is going to be the most severe and the most dramatic strike in 50 years,” Erik Gordon, a business professor at the University of Michigan, told WNEM. Barclays analyst Dan Levy, meanwhile, called a strike “highly likely.”\n\nIn addition to slowing down the Detroit automakers, a strike would hurt their bottom lines. One against GM, Ford, and Stellantis lasting 10 days would cost them nearly a billion dollars, according to the Anderson Economic Group.\n\nWhile the Detroit automakers had nearly 2 million vehicles on hand at the end of July, “a work stoppage of three weeks or more would quickly drain the excess supply, raising vehicle prices and pushing more sales to non-union brands,” analyst Sam Fiorani told the Associated Press.\n\nOne of those brands, of course, is Tesla.\n\nMusk has taken a tough stance against organized labor. Tesla workers earn about $45 an hour in wages and benefits, whereas UAW-represented employees at the Detroit Three make about $64 to $67 an hour, according to Reuters. The gap gives Tesla a competitive advantage, as do various manufacturing strategies and not having to share profits with dealers.\n\nIn March, a three-judge panel ruled that Musk had unlawfully threatened workers with the loss of stock options if they chose to be represented by a union. In July, a federal appeals court said it would reconsider the ruling.\n\nStory continues\n\nAt the heart of the matter was a 2018 tweet in which Musk wrote: “Nothing stopping Tesla team at our car plant from voting union. Could do so tmrw if they wanted. But why pay union dues and give up stock options for nothing? Our safety record is 2X better than when plant was UAW & everybody already gets healthcare.”\n\nIn February, workers at a Tesla factory in Buffalo were fired shortly after launching union organizing efforts. Workers United said the terminations were an illegal form of retaliation. Tesla denied this, writing on its blog it had decided to fire the workers beforehand over poor performance.\n\nTesla has pressured other automakers this year with dramatic price cuts, often angering its own customers who bought vehicles at higher prices weeks or days before the cuts—or who were about to sell a used Tesla that suddenly lost value.\n\nAlso worrying Detroit’s big automakers are EV rivals emerging in China and exporting to Europe and elsewhere—though not yet to America. “The Chinese are going to be the powerhouse,” Ford CEO Jim Farley said at a finance event in May.\n\nFord executive chairman Bill Ford Jr. added in June, “They are not here, but they will come here...and we need to be ready.”\n\nTesla might be more ready than its Detroit rivals—and no strike looms on its horizon.\n\nThis story was originally featured on Fortune.com\n\nMore from Fortune: \r\n5 side hustles where you may earn over $20,000 per year—all while working from home\r\nWant more for your money? These 14 savings accounts have rates of 5% APY (and higher)\r\nBuying a house? Here's how much to save\r\nThis is how much money you need to earn annually to comfortably buy a $600,000 home", "link": "https://finance.yahoo.com/news/elon-musk-tesla-poised-benefit-190956138.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.939, "neg": 0.122, "neu": 0.786, "pos": 0.093}}, {"date": "2023-09-10T15:44:02+00:00", "title": "Dow Jones Futures Loom For Battered Rally; Apple iPhone 15, AI Giants Oracle, Adobe In Focus", "content": "Here's how to handle the battered market rally. The Apple iPhone 15 looms along with earnings from AI giants Adobe and Oracle.\n\nContinue reading", "link": "https://finance.yahoo.com/m/adf86857-6fcf-31e1-aae0-fab15e31db5c/dow-jones-futures-loom-for.html", "symbols": ["307.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "ORC.F", "ORC.XETRA", "ORCL.MX", "ORCL.US", "ORCL34.SA", "RUT.INDX", "SHOP.TO", "SHOP.US", "TL0.F", "TL0.XETRA", "TSLA.MX"], "tags": [], "sentiment": {"polarity": -0.153, "neg": 0.065, "neu": 0.935, "pos": 0}}, {"date": "2023-09-10T13:00:39+00:00", "title": "Insiders At Tesla Sold US$7.5b In Stock, Alluding To Potential Weakness", "content": "The fact that multiple Tesla, Inc. (NASDAQ:TSLA) insiders offloaded a considerable amount of shares over the past year could have raised some eyebrows amongst investors. Knowing whether insiders are buying is usually more helpful when evaluating insider transactions, as insider selling can have various explanations. However, shareholders should take a deeper look if several insiders are selling stock over a specific time period.\n\nWhile insider transactions are not the most important thing when it comes to long-term investing, we would consider it foolish to ignore insider transactions altogether.\n\nSee our latest analysis for Tesla\n\nTesla Insider Transactions Over The Last Year\n\nThe Technoking of Tesla, Elon Musk, made the biggest insider sale in the last 12 months. That single transaction was for US$3.9b worth of shares at a price of US$220 each. That means that even when the share price was below the current price of US$249, an insider wanted to cash in some shares. When an insider sells below the current price, it suggests that they considered that lower price to be fair. That makes us wonder what they think of the (higher) recent valuation. Please do note, however, that sellers may have a variety of reasons for selling, so we don't know for sure what they think of the stock price. This single sale was just 4.2% of Elon Musk's stake.\n\nInsiders in Tesla didn't buy any shares in the last year. You can see the insider transactions (by companies and individuals) over the last year depicted in the chart below. If you want to know exactly who sold, for how much, and when, simply click on the graph below! insider-trading-volume\n\nI will like Tesla better if I see some big insider buys. While we wait, check out this freelist of growing companies with considerable, recent, insider buying.\n\nInsiders At Tesla Have Sold Stock Recently\n\nThe last three months saw some Tesla insider selling. CFO, Corporate Controller & Chief Accounting Officer Vaibhav Taneja only netted US$44k selling shares, in that period. It's not great to see insider selling, nor the lack of recent buyers. But the amount sold isn't enough for us to put any weight on it.\n\nStory continues\n\nInsider Ownership\n\nMany investors like to check how much of a company is owned by insiders. I reckon it's a good sign if insiders own a significant number of shares in the company. Tesla insiders own about US$114b worth of shares (which is 14% of the company). This kind of significant ownership by insiders does generally increase the chance that the company is run in the interest of all shareholders.\n\nSo What Does This Data Suggest About Tesla Insiders?\n\nWhile there has not been any insider buying in the last three months, there has been selling. But given the selling was modest, we're not worried. While we feel good about high insider ownership of Tesla, we can't say the same about the selling of shares. While we like knowing what's going on with the insider's ownership and transactions, we make sure to also consider what risks are facing a stock before making any investment decision. In terms of investment risks, we've identified 1 warning sign with Tesla and understanding it should be part of your investment process.\n\nOf course, you might find a fantastic investment by looking elsewhere. So take a peek at this freelist of interesting companies.\n\nFor the purposes of this article, insiders are those individuals who report their transactions to the relevant regulatory body. We currently account for open market transactions and private dispositions of direct interests only, but not derivative transactions or indirect interests.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.", "link": "https://finance.yahoo.com/news/insiders-tesla-sold-us-7-130039761.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.977, "neg": 0.027, "neu": 0.892, "pos": 0.08}}, {"date": "2023-09-10T11:10:00+00:00", "title": "Apple Just Shed More Than $230 Billion In Market Cap. Here's Why It's a Buying Opportunity.", "content": "The iPhone maker may have fallen out of favor with the Chinese government. But things aren't as bad as they appear.\n\nContinue reading", "link": "https://finance.yahoo.com/m/8755f197-b0a1-388e-a77e-584d5df4cda9/apple-just-shed-more-than.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.234, "neg": 0.093, "neu": 0.743, "pos": 0.165}}, {"date": "2023-09-10T06:07:30+00:00", "title": "Tesla's China dominance: This week in EVs", "content": "Investing.com -- Here is your weekly Pro Recap of the past week's biggest headlines in the electric vehicle space: GM allies with Tesla; charging startups in need of a boost; all eyes on Stellantis.\n\nAs always, InvestingPro users got these headlines at lightning speed. Never miss another opportunity to secure an edge for your portfolio.\n\nTesla's Dominance in China\n\nTesla (NASDAQ:TSLA) has made remarkable strides in China's booming electric vehicle market this past month.\n\nThanks to substantial discounts, Tesla's market share significantly expanded in August, nearly doubling its share to 13.2%, up from 7.5% in July. The company booked sales of 64,694 vehicles in China during the month, an impressive feat in a highly competitive market.\n\nOne standout success was the China-made Model Y, which, according to the China Passenger Car Association (CPCA) recorded 65,316 deliveries.\n\nTesla's aggressive pricing strategy, including multiple price reductions throughout the year, seems to have paid off, making its EVs more accessible to Chinese consumers.\n\nHowever, it's worth noting that Tesla introduced a redesigned Model 3 with a starting price that's 12% higher than that of the previous base model with rear-wheel drive, demonstrating a strategic balance between affordability and premium offerings.\n\nShares of TSLA reached a weekly high of $257.90 on Tuesday before closing the week down 3.6% to $248.50.\n\nStellantis Battery Expansion\n\nIn another part of the globe, multinational automaker Stellantis (NYSE:STLA) is preparing for a significant leap in its battery production capacity. The company plans to raise its battery production capacity to a staggering 400 GWh to meet surging demand for EVs, announced Micky Bly, head of global propulsion systems at Stellantis.\n\nStellantis has already committed to delivering six gigafactories worldwide, including the recently inaugurated European gigafactory in France. Additional facilities in Germany and Italy are on the horizon, all part of the ACC joint venture with Mercedes (ETR:MBGn) (OTC:MBGYY) and TotalEnergies (EPA:TTEF) (NYSE:TTE).\n\nStory continues\n\nFurthermore, plans are in motion for three more facilities in the United States and Canada, marking a substantial expansion of Stellantis' global footprint in the EV space.\n\nIn a move to enhance capacity even further, Stellantis is investing 40 million euros ($43 million) in its Battery Technology Center located in Turin's Mirafiori complex. This center will play a pivotal role in conducting in-house testing and development for EV battery packs, ensuring Stellantis stays at the forefront of EV technology.\n\nShares of STLA reached a weekly high of $18.34 on Tuesday, with an overall slide of some 0.9% for the week to $18.23.\n\nMullen Automotive's Battle for Survival\n\nWhile Tesla and Stellantis continue to make waves in the EV market, Mullen Automotive (NASDAQ:MULN) is facing a different kind of challenge.\n\nMullen's share price experienced a brief surge in early trading Friday after the company announced its appeal against Nasdaq's decision to delist the company due to a fall below the $1 mark. This appeal could potentially grant Mullen a lifeline of up to 180 days to rectify its stock price and meet Nasdaq's listing requirements.\n\nMullen's journey to compliance has been tumultuous, including a 10x stock dilution to raise funds for a production ramp, as well as two reverse stock splits in one year to boost share value. The first was a 1-for-25 reverse split back in May, and a 1-for-9 reverse split last month.\n\nGiven the historical price movement over the past five years, predicting a significant recovery in Mullen's share price remains challenging. However, if Nasdaq's committee grants another extension, an artificial increase in the share price could be expected.\n\nCEO David Michery's strategic decisions will be critical in navigating these issues. Another reverse split could offer a temporary boost, but the long-term sustainability of Mullen's stock performance hinges on its ability to deliver on its EV production promises.\n\nShares of MULN reached a weekly high of $0.5377 Tuesday afternoon, and from there dropped 22% to close Friday trading at $0.4193/sh. The stock's weekly loss overall came to 18.9%.\n\nRelated Articles\n\nTesla's China dominance: This week in EVs\n\nUS, Vietnam to boost ties as Biden visits, seek China hedge with chips, rare earths\n\nRakuten CEO touts Viber's ability to counter Russian 'fake news' during Kyiv visit", "link": "https://finance.yahoo.com/news/teslas-china-dominance-week-evs-060730477.html", "symbols": ["8TI.F", "MULN.US", "STLA.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA", "TTE.US"], "tags": [], "sentiment": {"polarity": 0.99, "neg": 0.024, "neu": 0.866, "pos": 0.11}}, {"date": "2023-09-10T00:00:00+00:00", "title": "Spotting the Sweet Spot: When to Dive Into TSLA Stock for Maximum Gains", "content": "What exactly is Tesla CEO Elon Musk's plan? It's hard to know what he's thinking, so investors should be cautious with TSLA stock.", "link": "https://investorplace.com/2023/09/spotting-the-sweet-spot-when-to-dive-into-tsla-stock-for-maximum-gains/", "symbols": ["TSLA.US"], "tags": [], "sentiment": {"polarity": -0.202, "neg": 0.118, "neu": 0.882, "pos": 0}}, {"date": "2023-09-09T16:45:02+00:00", "title": "Dow Jones Futures: Market Rally Battered; Apple iPhone, AI Giants Oracle, Adobe Loom", "content": "Here's how to handle the battered market rally. The Apple iPhone 15 looms along with earnings from AI giants Adobe and Oracle.\n\nContinue reading", "link": "https://finance.yahoo.com/m/adf86857-6fcf-31e1-aae0-fab15e31db5c/dow-jones-futures%3A-market.html", "symbols": ["307.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "DJI.INDX", "DKNG.US", "GSPC.INDX", "IXIC.INDX", "ORC.F", "ORC.XETRA", "ORCL.MX", "ORCL.US", "ORCL34.SA", "RUT.INDX", "SHOP.TO", "SHOP.US", "TL0.F", "TL0.XETRA"], "tags": [], "sentiment": {"polarity": -0.153, "neg": 0.065, "neu": 0.935, "pos": 0}}, {"date": "2023-09-09T15:33:00+00:00", "title": "Tesla rival Chevy has bad news about its popular electric vehicle", "content": "General Motors' Chevy Bolt electric vehicle has been a popular vehicle since it rolled out in 2017, but it has had its share of problems. The Bolt was the second best-selling electric vehicle behind the Tesla Model S after it launched. The 2023 Chevy Bolt has been one of the most affordable electric vehicles on the market with a beginning price at $26,500.\n\nContinue reading", "link": "https://finance.yahoo.com/m/23b5df35-b745-352e-940e-f5445ca35fb9/tesla-rival-chevy-has-bad.html", "symbols": ["8GM.F", "GM.MX", "GM.US", "GMCO34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.226, "neg": 0.052, "neu": 0.853, "pos": 0.095}}, {"date": "2023-09-09T11:13:48+00:00", "title": "30 Wealthiest Countries by Per Capita Net Worth", "content": "In this article, we will discuss the 30 wealthiest countries by per capita net worth. If you want to skip the detailed analysis of the wealthiest countries, click 5 Wealthiest Countries by Per Capita Net Worth.\n\nWorld’s Richest Countries' Wealth Share\n\nGlobal wealth comprises all the assets including monetary assets and other assets in all areas of the world. The wealthiest countries in the world are the powerbrokers in the global economy. The richest countries in the world hold a majority portion of the global wealth. Countries including the United States, China, Japan, Germany, United Kingdom, France, India, and Canada hold the highest share of the global wealth. According to the Credit Suisse Global Wealth Report of 2023, the global wealth share for the United States was 30.8% and China’s global wealth share accounted for 18.6%. Japan, Germany, and the United Kingdom followed next with a global wealth share of 5%, 3.8%, and 3.5%, respectively.\n\nThese rich countries have great investment opportunities. Some of the countries that are best for FDI and FPI include the United States, United Kingdom, Japan, Germany, and Canada - to name a few. These countries offer attractive investment opportunities due to the high-spending consumer market, business-friendly regulations, and profitable real estate market.\n\nImpact of COVID-19 on Global Wealth\n\nThe COVID-19 pandemic had severe implications for the global economy. The wealthiest countries in the world had a hard time tackling the pandemic despite the resources. The wealthiest countries were exposed to their older population and higher health expenses. Furthermore, the economic fallout of lockdowns devastated low-income citizens and workers. Whereas the rich population had more resources and capital to deal with the circumstances. The pandemic had a major impact on the global inequality index. The wealthiest people have always enjoyed the perks of dominating global wealth.\n\nOxfam International, which studies global inequality, shared the statistics of the richest global wealth share. According to Oxfam International, the richest 1% took almost two-thirds of all new wealth created since 2020, which accounted for $42 trillion. That’s nearly twice as much money as the remaining 99% of the world’s population grabbed since 2020.\n\nStory continues\n\nWith the richest population taking away the majority of the global wealth, the increase in wealth inequality during the pandemic was reversed in 2022. According to Credit Suisse’s report, the global wealth share of the top 1% plunged to 44.5% during 2022. Some of the key factors to the decline in wealth in 2022 included inflation and appreciation of the U.S. dollar against other currencies. British economist and Credit Suisse’s report author, Anthony Shorrocks said:\n\n“If exchange rates were held constant at 2021 rates, then total wealth would have increased by 3.4% and wealth per adult by 2.2% during 2022. This is still the slowest increase of wealth at constant exchange rates since 2008. Keeping exchange rates constant but counting the effects of inflation results in a real wealth loss of –2.6% in 2022.”\n\nWorld’s Richest Wealth\n\nThe world’s wealthiest people massively contribute to the global economy. Over the last decade, the richest 1% gathered around half of all new wealth, as per Oxfam International. On January 16, Oxfam International published a report on the survival of the richest, highlighting the global wealth inequality and wealth of the richest. The report highlights that billionaires' wealth soared significantly driven by the increase in food and energy profits in 2022. As per the report, 95 food and energy corporations doubled their profits in 2022, adding nearly $306 billion in windfall profits. These companies paid out almost $257 billion of the total profits to rich shareholders. The retail giant Walmart Inc.’s (NYSE:WMT) owners, the Walton family, received $8.5 billion in 2022.\n\nCompanies Driving Wealth\n\nWalmart Inc. (NYSE:WMT) mainly contributes to the U.S. and Canadian economies, but it has an international presence across 19 countries through its stores, e-commerce websites, and subsidiaries such as Flipkart in India. Walmart Inc. (NYSE:WMT) has been performing exceptionally well. The strong outcomes for the quarter and projections for FY24 are pushing the stock price. Walmart Inc. (NYSE:WMT) stock is trading around its all-time high. On August 31, Walmart Inc. (NYSE:WMT) shares traded at $162.61 per share, its all-time high. As of September 8, Walmart Inc. (NYSE:WMT) is trading at $163.77. In the second quarter of fiscal year 2024, Walmart Inc. (NYSE:WMT) reported earnings per share of $2.92, beating market consensus by $1.20. With the increase in sales, Walmart Inc. (NYSE:WMT) has raised its earnings forecast for 2024. The company expects its full fiscal year consolidated net sales to rise by about 4% to 4.5%. Whereas, Walmart Inc. (NYSE:WMT) projects its earnings per share for the year in the range of $6.36 and $6.46. Here are some of the comments from Walmart Inc.’s (NYSE:WMT) Q2 FY24 earnings call:\n\n“We had another strong quarter. We're gaining share across markets and formats, growing units sold, transaction counts are positive across markets, and growth in operating income is outpacing sales. We're really pleased with our first half performance. For the quarter, comp sales for Walmart U.S. were ahead of where we thought they'd be at 6.4%. Sam's Club U.S. was 5.5% and sales for international were up 11%, led by double-digit growth at Walmex and China. Flipkart's GMV was also strong. The team is driving results in the short-term and building for the future.”\n\nAmazon.com, Inc. (NASDAQ:AMZN) is another mega-company that has created wealth for its owners. Jeff Bezos, the third richest person in the world as of 2023, has made Amazon.com, Inc. (NASDAQ:AMZN) a global success, supporting economies through its e-commerce platform. Amazon.com, Inc. (NASDAQ:AMZN) is operating in more than 50 countries, offering e-commerce services to consumers, and business opportunities for online sellers. Thousands of Amazon.com sellers became millionaires by selling products on the e-commerce platform.\n\nOn February 10, 2022, Jungle Scout posted that 19% of their 5,000 respondents made more than $1 million in sales on Amazon.com, Inc. (NASDAQ:AMZN) from new businesses, and 58% of those respondents sellers reached $1 million in sales in less than five years. Jungle Scout's 2023 report highlights that 89% of Amazon.com, Inc. (NASDAQ:AMZN) sellers are profitable, and despite an increase in costs, more than 37% of sellers generated higher profits in 2022. Amazon.com, Inc. (NASDAQ:AMZN) is also the fifth biggest public company in the world. As per Amazon.com, the company has created more jobs in the U.S. than any other company over the last decade. Since 2021, Amazon.com, Inc. (NASDAQ:AMZN) has invested nearly $530 billion, including investments in infrastructure and employee compensation. On top of that, the company's investments have supported around 1.6 million indirect jobs in the hospitality and construction industries.\n\nBillionaires' companies are key to the global economy. Elon Musk and Bernard Arnault have been swapping the world's richest top spot for many months now. Thanks to the companies they own that have brought these billionaires a lot of fortune. Musk owns quite a few companies, but the most prominent one is his automotive firm Tesla Inc. (NASDAQ:TSLA). While Arnault owns LVMH Moet Hennessy Louis Vuitton SE (EPA:MC), which has made him the world's second-wealthiest person.\n\nOn September 8, Bloomberg reported that Bernard Arnault bought €215 million worth of LVMH Moet Hennessy Louis Vuitton SE (EPA:MC) shares since the company's stock price dropped following disappointing earnings in late July. As per French regulatory filings, Arnault’s Financiere Agache and Christian Dior SE vehicles bought LVMH Moet Hennessy Louis Vuitton SE (EPA:MC) shares three days after the July 25 earnings report. Arnault sees an opportunity to invest further in the company. Arnault and his family own 48% of LVMH Moet Hennessy Louis Vuitton SE (EPA:MC) as the luxury conglomerate has created a lot of wealth in recent years through its operations around the world. In the last 10 years, LVMH Moet Hennessy Louis Vuitton SE (EPA:MC) has had a stock return of 432.37%, as of September 8.  30 Wealthiest Countries by Per Capita Net Worth\n\nMenna/Shutterstock.com\n\nOur Methodology\n\nTo determine the world’s wealthiest countries by per capita net worth, we analyzed data from Credit Suisse’s Global Wealth Databook 2023. Credit Suisse’s database calculates the wealth of countries, considering their financial and non-financial assets while subtracting the value of debt from it. We shortlisted the top countries with the highest total wealth in 2022 and then ranked them based on the highest wealth per adult, which is per capita wealth. The list is ranked in ascending order of this metric. Here is the list of the 30 wealthiest countries by per capita net worth.\n\n30 Wealthiest Countries by Per Capita Net Worth\n\n30. Russia\n\nWealth Per Capita (2022): $39,514\n\nRussia has a strong economy and a total wealth of $4.30 trillion, as of 2022. Since 2012, Russia’s total wealth has increased by 45.51%. Russia ranks 30th on our list of the wealthiest countries by per capita net worth.\n\nWorld-leading companies including Walmart Inc. (NYSE:WMT),  Amazon.com, Inc. (NASDAQ:AMZN), LVMH Moet Hennessy Louis Vuitton SE (EPA:MC), and Tesla Inc. (NASDAQ:TSLA) are massively contributing to their local as well as global economies.\n\n29. Iran\n\nWealth Per Capita (2022): $51,147\n\nDespite global sanctions, Iran has built its economy on its own. The total wealth of Iran in 2022 was $3.03 trillion. Iran ranks among the wealthiest countries by per capita net worth.\n\n28. Poland\n\nWealth Per Capita (2022): $52,741\n\nPoland had a total wealth of $1.59 trillion in 2022. Since 2012, Poland’s total wealth has soared by 60.60%. Ranked 28th on our list, Poland is one of the wealthiest countries by per capita net worth.\n\n27. Mexico\n\nWealth Per Capita (2022): $55,274\n\nMexico had a total wealth of $4.86 trillion, as of 2022. Mexico ranks among the wealthiest countries by per capita net worth.\n\n26. China\n\nWealth Per Capita (2022): $75,731\n\nChina had the second-largest total wealth of $84.48 trillion in 2022. Being one of the largest economies in the world, China makes it to our list of the wealthiest countries by per capita net worth.\n\n25. Saudi Arabia\n\nWealth Per Capita (2022): $90,975\n\nSaudi Arabia had a total wealth of $2.26 trillion in 2022. Since 2012, Saudi Arabia’s total wealth has increased by 80.80%. Ranked 25th on our list, Saudi Arabia is one of the wealthiest countries by per capita net worth.\n\n24. United Arab Emirates\n\nWealth Per Capita (2022): $152,556\n\nThe United Arab Emirates is one the richest Arab countries with a total wealth of $1.24 trillion in 2022. The United Arab Emirates ranks among the wealthiest countries by per capita net worth.\n\n23. Portugal\n\nWealth Per Capita (2022): $158,840\n\nPortugalhad a total wealth of $1.32 trillion, as of 2022. Portugal is ranked 23rd on our list of the wealthiest countries by per capita net worth.\n\n22. Japan\n\nWealth Per Capita (2022): $216,078\n\nJapan is one of the leading economies and one of the wealthiest countries by per capita net worth. In 2022, the total wealth of the country was $22.58 trillion. Japan ranks among the wealthiest countries by per capita net worth.\n\n21. Italy\n\nWealth Per Capita (2022): $221,370\n\nItaly had a total wealth of $11.02 trillion in 2022. Ranked 21st on our list, Italy is one of the wealthiest countries by per capita net worth.\n\n20. Spain\n\nWealth Per Capita (2022): $224,209\n\nSpain is one of the largest economies in Europe with a total wealth of $8.48 trillion in 2022. Spain ranks among the wealthiest countries by per capita net worth.\n\n19. South Korea\n\nWealth Per Capita (2022): $230,760\n\nSouth Korea had a total wealth of $9.89 trillion in 2022. South Korea is placed at 19th place among the wealthiest countries by per capita net worth.\n\n18. Israel\n\nWealth Per Capita (2022): $235,445\n\nIn 2022, Israel had a total wealth of $1.36 trillion. Israel makes it to our list of the wealthiest countries by per capita net worth.\n\n17. Austria\n\nWealth Per Capita (2022): $245,225\n\nAustria had a total wealth of $1.79 trillion in 2022. Since 2012, Austria’s total wealth has grown by 16.99%. Ranked 17th on our list, Austria is one of the wealthiest countries by per capita net worth.\n\n16. Germany\n\nWealth Per Capita (2022): $256,179\n\nOne of the leading economies in the world, Germany had a total wealth of $17.42 trillion. Germany ranks among the wealthiest countries by per capita net worth.\n\n15. Taiwan\n\nWealth Per Capita (2022): $273,788\n\nTaiwan has a strong economy as it makes it to the list of the wealthiest countries by per capita net worth. In 2022, Taiwan had a total wealth of $5.42 trillion.\n\n14. Sweden\n\nWealth Per Capita (2022): $296,800\n\nIn 2022, Sweden had a total wealth of $2.33 trillion. Sweden is ranked 14th on our list of the wealthiest countries by per capita net worth.\n\n13. United Kingdom\n\nWealth Per Capita (2022): $302,783\n\nThe United Kingdom is one of the largest economies in the world with a total wealth of $15.97 trillion. Since 2012, the United Kingdom’s wealth has increased by 31%.\n\n12. France\n\nWealth Per Capita (2022): $312,235\n\nFrance has a strong economy and a total wealth of $15.72 trillion, as of 2022. Since 2012, France’s total wealth has increased by 17.48%. France ranks 12th on our list of the wealthiest countries by per capita net worth.\n\n11. Belgium\n\nWealth Per Capita (2022): $352,814\n\nIn 2022, Belgium had a total wealth of $3.19 trillion. Belgium ranks among the wealthiest countries by per capita net worth.\n\n10. Netherlands\n\nWealth Per Capita (2022): $358,235\n\nThe Netherlands had a total wealth of $4.87 trillion in 2022. The Netherlands is placed at 10th place among the wealthiest countries by per capita net worth.\n\n9. Canada\n\nWealth Per Capita (2022): $369,577\n\nCanada is one of the leading economies in the world and makes it to our list of the wealthiest countries by per capita net worth. In 2022, Canada had a total wealth of $11.26 trillion.\n\n8. Singapore\n\nWealth Per Capita (2022): $382,957\n\nIn 2022, Singapore had a total wealth of $1.90 trillion. Singapore ranks among the wealthiest countries by per capita net worth.\n\n7. Norway\n\nWealth Per Capita (2022): $385,338\n\nNorway had a total wealth of $1.64 trillion in 2022. Norway is ranked seventh on our list of the wealthiest countries by per capita net worth.\n\n6. New Zealand\n\nWealth Per Capita (2022): $388,761\n\nNew Zealand had a total wealth of $1.43 trillion in 2022. Since 2012, New Zealand’s total wealth has grown by 65.81%. New Zealand is one of the wealthiest countries by per capita net worth.\n\nThe world's wealthiest companies that play a vital role in the global economy include Walmart Inc. (NYSE:WMT), Amazon.com, Inc. (NASDAQ:AMZN), LVMH Moet Hennessy Louis Vuitton SE (EPA:MC), and Tesla Inc. (NASDAQ:TSLA).\n\nClick to continue reading and see 5 Wealthiest Countries by Per Capita Net Worth.  Suggested articles:\n\nTop 25 Spice Producing Countries in the World 11 Dirt Cheap Stocks To Buy 20 Countries With Largest High Speed Rail Network\n\nDisclosure: None. 30 Wealthiest Countries by Per Capita Net Worthis originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/30-wealthiest-countries-per-capita-111348314.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA", "WALM34.SA", "WMT.F", "WMT.MX", "WMT.US", "WMT.XETRA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.01, "neu": 0.701, "pos": 0.289}}, {"date": "2023-09-09T09:47:00+00:00", "title": "Up 104% YTD, Has Tesla Stock Run Too Far Too Fast?", "content": "Tesla (NASDAQ: TSLA) stock has more than doubled in 2023, which is a massive move for a company that size. Let's look at where Tesla stock is, how it got here, a fair price for the stock, and where it could be headed to see if the growth stock is worth buying now. At the beginning of the year, Tesla stood out as the best electric vehicle stock to buy.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f2d03d54-8116-3a12-9bd2-9d52e75c0eb6/up-104%25-ytd%2C-has-tesla-stock.html", "symbols": ["TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.875, "neg": 0, "neu": 0.855, "pos": 0.145}}]