[{"date": "2023-09-25T23:28:04+00:00", "title": "What is Anthropic? The buzzy AI startup just got up to $4 billion in funding from Amazon as part of a colossal tech alliance", "content": "Amazon will invest up to $4 billion in Anthropic, one of the buzzy startups building a generative AI chatbot. With the deal, announced Monday, Anthropic secures a major investment from a second Big Tech company, after already receiving $300 million from Google at the end of last year. Google’s investment, which wasn’t reported at the time, gave Google an estimated 10% stake in the company. In its latest fundraising round in May, Anthropic was valued at nearly $5 billion, according to TechCrunch. An updated valuation was not disclosed for Amazon’s most recent investment nor details about the size of its minority stake.\n\nAmazon becomes the latest major player to invest in up-and-comers in the generative AI world, after ChatGPT maker OpenAI received $13 billion from Microsoft.\n\nAmazon’s deal with Anthropic is more comprehensive than just a large infusion of cash—although it is of course that as well. In addition to the $1.25 billion in upfront funding Anthropic will also get access to tools for AI developers and products that Amazon is creating. These include access to computing chips, large language models, and Amazon’s cloud computing capabilities under Amazon Web Services. Anthropic, which already has an AI chatbot called Claude and an established large language model, will be the latest addition to the ever-expanding arsenal of AI-specific tools Amazon is embedding within AWS.\n\n“A big part of our strategy in AI and generative AI specifically is all about customer choice and there’s not going to be any one solution that works for all customers for all use cases,” Amazon Web Services CEO Adam Selipsky told Bloomberg TV in an interview Monday.\n\nHow does Anthropic’s partnership with Amazon work?\n\nAnthropic will, of course, get a big check. Amazon will invest $1.25 billion up front with the possibility for another $2.75 billion later, for a potential total of $4 billion. Amazon declined to provide further details about the deal’s structure.\n\nStory continues\n\nAnthropic will use Amazon’s new AI chips, which the e-commerce giant developed in a bid to rival Nvidia, which has so far cornered the market. Trainium, which as the name suggests, is primarily used to train machine learning models. Meanwhile, Amazon’s Inferentia chips mostly help run the models once they’ve been built. The majority of Anthropic’s work will also be done on the AWS cloud.\n\nAmazon and Anthropic had been working together on AI since this spring. At that time, Anthropic made some of its models available via Amazon’s new Bedrock service, which gives customers access to AI models through a subscription. In the Bloomberg interview, Selipsky said the two companies will continue to work together to help AWS customers develop their own generative AI applications. Selipsky cited Lonely Planet and LexisNexis as customers interested in using Amazon and Anthropic’s combined AI capabilities. A press release announcing the partnership also mentioned hedge fund Bridgewater Associates, the firm founded by legendary investor Ray Dalio, who has been bullish on artificial intelligence’s potential to spur productivity.\n\n“So many of our customers have their data platforms on AWS,” Selipsky said. “And if you’ve got your data here, you really want to have your generative AI and all the powerful capabilities in the same place.”\n\nIt’s worth remembering that for Amazon, customers include both consumers and corporate customers that use its vast digital products to run their own businesses. “Together we can help include many customer experiences,” Amazon CEO Andy Jassy posted on X, the former Twitter.\n\nWhat is Anthropic?\n\nAnthropic was founded in 2021, originally billing itself as a “safer” AI company by touting its emphasis on “reliable” and “steerable” AI.\n\nAnthropic did not immediately respond to a request for comment.\n\nThe company was founded by siblings Daniela and Dario Amodei, president and CEO respectively. Dario was formerly vice president of research at OpenAI, while Daniela was vice president of safety and policy. The duo left OpenAI in December 2020 to found Anthropic.\n\nAmong Anthropic’s better known products is its Claude generative AI assistant that can be programmed to ask clarifying questions if it doesn’t understand a prompt. Like OpenAI, Anthropic operates on a freemium model that gives users a free rudimentary version of its chatbot or a more powerful version for a monthly fee.\n\nDario Amodei has cultivated an image as a cautious AI executive. He once told the New York Times, he’d rather Claude be boring than dangerous—a nod to the fears that AI will potentially destroy humanity. Although like most of Silicon Valley’s AI pioneers his excitement is effusive. When asked about AI’s limits onstage at TechCrunch Disrupt last week, Amodei replied: “I’m not so sure there are any.”\n\nThis story was originally featured on Fortune.com\n\nMore from Fortune: \r\n5 side hustles where you may earn over $20,000 per year—all while working from home\r\nWant more for your money? These 14 savings accounts have rates of 5% APY (and higher)\r\nBuying a house? Here's how much to save\r\nThis is how much money you need to earn annually to comfortably buy a $600,000 home", "link": "https://finance.yahoo.com/news/anthropic-buzzy-ai-startup-just-232804974.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.016, "neu": 0.887, "pos": 0.097}}, {"date": "2023-09-25T22:49:23+00:00", "title": "Jeff Bezos’s space company Blue Origin picks Amazon device chief as CEO", "content": "Amazon’s outgoing head of devices Dave Limp will take over the helm of Jeff Bezos’ Blue Origin at the end of the year, the space company said on Monday. Limp, who for years has led the team developing the Seattle-based tech giant’s Alexa voice assistant and other devices, will replace Blue Origin’s chief executive Bob Smith in December. Blue Origin, which is owned by Amazon founder Bezos, was the first company to successfully launch, land and reuse a rocket.\n\nContinue reading", "link": "https://finance.yahoo.com/m/49f55393-c154-337d-9817-1ee8be958e16/jeff-bezos%E2%80%99s-space-company.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.727, "neg": 0, "neu": 0.916, "pos": 0.084}}, {"date": "2023-09-25T22:34:47+00:00", "title": "12 Best Low Cost ETFs", "content": "In this article, we will take a look at the 12 best low cost ETFs. If you want to skip our discussion on trends amongst low-cost ETFs, you can check out the 5 Best Low Cost ETFs.\n\nWith over 8,000 stocks listed across all US equity markets, identifying the right stocks can be a difficult task for investors. This is where exchange-traded funds (ETFs) come into play, offering diversified market coverage at a low cost. According to the iShares division of BlackRock, ETFs represent 12.6% of equity assets and 2.7% of fixed-income assets in the US. During the second quarter of 2023, the average daily trading volume of US equity ETFs was valued at $141.6 billion, contributing to 28% of the overall total trading volume of the US equity markets.\n\nAccording to one of the leading associations of regulated funds in the US, the Investment Company Institute (ICI) has observed an average decline of 53% in the expense ratio of equity exchange-traded funds and a reduction of 56% in the expense ratio of average index bond ETFs between 2009 and 2022. The industry body has cited higher intensity of competition and economies of scale as the primary reasons for the decline in expense ratios. As per the ICI, the average expense ratio of index equity ETF saw a contraction of one basis point in 2022 to 0.16%. Meanwhile, the average expense ratio of index bond ETFs also fell by one basis point to 0.11% in 2022. The widespread popularity of ETFs can be gauged by the fact that the number of ETFs increased from 204 in 2005 to 2,844 in 2022, while the total net assets rose from $301 billion to $6.48 trillion. The total net assets of ETFs were at an all-time high of $7.19 trillion in 2021. However, global financial markets took back some of their gains in 2022 due to rising inflation and global uncertainty. Overall, Equity ETFs are the most popular type of ETF, as they accounted for 78% of the total net assets at the end of 2022. You can also check out the 12 Best Growth ETFs to Buy here.\n\nStory continues\n\nETFs like SoFi Select 500 ETF (NYSEARCA:SFY), BNY Mellon US Large Cap Core Equity ETF (NYSEARCA:BKLC), JPMorgan BetaBuilders U.S. Equity ETF (CBOE:BBUS), SPDR Portfolio S&P 500 ETF (NYSEARCA:SPLG) and iShares Core S&P 500 ETF (NYSE:IVV) each offer distinct approaches to tracking the S&P 500 index. These ETFs provide coverage to large and mega-cap companies such as Apple Inc. (NASDAQ:AAPL), Microsoft Corporation (NASDAQ:MSFT), and Amazon.com, Inc. (NASDAQ:AMZN), which represent nearly 80% of the US equity market. Meanwhile, SPDR Portfolio S&P 1500 Composite Stock Market ETF (NYSEARCA:SPTM) tracks the S&P Composite 1500 index that covers 90% of the US equity markets. The common theme for all these low-cost ETFs is that they are based on passive, market cap-weighted indexing of the broad US stock market. Investors often favor low-cost index fund ETFs over mutual funds due to their cost-effectiveness and tax efficiency. Additionally, there is an ongoing debate in the investment world regarding the outperformance of passive funds compared to active funds. 12 Best Low Cost ETFs\n\nPhoto by AlphaTradeZone\n\nOur Methodology\n\nIn this article, we have shortlisted the 12 best low-cost ETFs for 2023 based on their expense ratios. Additionally, we considered ETFs with a 5-year price performance exceeding 50% to ensure the selection of high-quality options. SoFi Select 500 ETF (NYSEARCA:SFY) is the only ETF under $50 on our list. Furthermore, Vanguard Total Stock Market Index Fund (NYSEARCA:VTI) and Vanguard 500 Index Fund (NYSEARCA:VOO) are amongst the low-cost Vanguard ETFs included in our selection. Some of these ETFs can be regarded as the best low-cost index funds for 2023, as these ETFs track the same indexes that the index funds track. The ETFs have been ranked in descending order of their expense ratios as of September 25.\n\n12 Best Low Cost ETFs\n\n12. Vanguard 500 Index Fund (NYSEARCA:VOO)\n\n5-Year Price Performance: 50.1%\n\nTotal Net Assets as of September 25, 2023: $908.43 billion\n\nExpense Ratio: 0.04%\n\nNumber of Holdings: 506\n\nVanguard 500 Index Fund (NYSEARCA:VOO) tracks the S&P 500 Index, which covers around 500 of the largest US stocks. As an index fund, the Vanguard 500 Index Fund (NYSEARCA:VOO) uses a passive management strategy and full replication approach, meaning it holds all 500 stocks in the index at their market cap weights. It is the biggest ETF on our list of the best low cost ETFs in terms of net assets and is also considered one of the biggest ETFs globally.\n\n11. Vanguard Growth Index Fund (NYSEARCA:VUG)\n\n5-Year Price Performance: 73.9%\n\nTotal Net Assets as of September 25, 2023: $182.53 billion\n\nExpense Ratio: 0.04%\n\nNumber of Holdings: 234\n\nVanguard Growth Index Fund (NYSEARCA:VUG) follows the CRSP US Large Cap Growth Index, which includes large-cap US stocks that exhibit growth characteristics. The ETF employs a passive management strategy designed to closely match the risk and return characteristics of the growth index. As a growth index fund, Vanguard Growth Index Fund (NYSEARCA:VUG) has a bias towards stocks with higher growth rates and momentum, such as those belonging to the tech, healthcare, and consumer discretionary sectors. Vanguard Growth Index Fund (NYSEARCA:VUG) is considered to be one of the biggest growth index funds in the world.\n\n10. Schwab U.S. Broad Market ETF (NYSEARCA:SCHB)\n\n5-Year Price Performance: 43.7%\n\nTotal Net Assets as of September 25, 2023: $23.46 billion\n\nExpense Ratio: 0.03%\n\nNumber of Holdings: 2465\n\nSchwab U.S. Broad Market ETF (NYSEARCA:SCHB) tracks the Dow Jones U.S. Broad Stock Market Index, which represents the broadest index of the US equity market. The ETF includes stocks across all market capitalizations, offering a high level of diversification. Schwab U.S. Broad Market ETF (NYSEARCA:SCHB) uses a passively managed, full replication strategy to closely track its benchmark index. Apple Inc. (NASDAQ:AAPL), Microsoft Corporation (NASDAQ:MSFT), and Amazon.com, Inc. (NASDAQ:AMZN) are the top three holdings of the ETF with a combined weightage of 14.66% of total assets.\n\nHere’s what Diamond Hill Capital said about Amazon.com, Inc. (NASDAQ:AMZN) in its Q2 2023 investor letter:\n\n“Among our top contributors were insurance company American International Group (AIG), auto retailer CarMax and global online retailer Amazon.com, Inc. (NASDAQ:AMZN).\n\nAmazon’s management team has been working to improve retail profitability, and Q1 results showed progress. In the case of Amazon’s web services (AWS), the market has shifted its focus from where growth will bottom in the near term to how AI can help accelerate the adoption of public cloud services in the future. We believe Amazon’s competitive advantages will continue to grow and that the business has the potential to grow faster than the overall economy in the coming years.”\n\n9. iShares Core S&P Total U.S. Stock Market ETF (NYSEARCA:ITOT)\n\n5-Year Price Performance: 44.1%\n\nTotal Net Assets as of September 25, 2023: $45.63 billion\n\nExpense Ratio: 0.03%\n\nNumber of Holdings: 2829\n\niShares Core S&P Total U.S. Stock Market ETF (NYSEARCA:ITOT) is developed to follow the S&P Total Market Index, which represents the entire US equity market, including micro, small, mid, large, and mega-cap stocks. iShares Core S&P Total U.S. Stock Market ETF (NYSEARCA:ITOT) has the second-highest number of holdings amongst all the ETFs that made it to our list of the best low cost ETFs. Healthcare, technology, and financial services are the top three sector holdings of iShares Core S&P Total U.S. Stock Market ETF (NYSEARCA:ITOT). Together, these sectors represent 53.35% of the total assets.\n\n8. Vanguard Total Stock Market Index Fund (NYSEARCA:VTI)\n\n5-Year Price Performance: 44.6%\n\nTotal Net Assets as of September 25, 2023: $1.37 trillion\n\nExpense Ratio: 0.03%\n\nNumber of Holdings: 3803\n\nVanguard Total Stock Market Index Fund (NYSEARCA:VTI) tracks the performance of the CRSP US Total Market Index, representing the entire US equity market. This ETF has the highest number of holdings amongst all the ETFs on our list. Vanguard Total Stock Market Index Fund (NYSEARCA:VTI) uses a passively managed index sampling approach to replicate the performance of the benchmark index. In terms of net assets, Vanguard Total Stock Market Index Fund (NYSEARCA:VTI) ranks as the biggest low-cost ETF on this list and is also considered one of the largest ETFs globally.\n\n7. Schwab U.S. Large-Cap ETF (NYSEARCA:SCHX)\n\n5-Year Price Performance: 47.8%\n\nTotal Net Assets as of September 25, 2023: $34.02 billion\n\nExpense Ratio: 0.03%\n\nNumber of Holdings: 756\n\nSchwab U.S. Large-Cap ETF (NYSEARCA:SCHX) tracks the performance of the Dow Jones US Large-Cap Total Stock Market Index, which focuses on large-cap US stocks. It includes stocks representing the top 90% of market capitalization in the Dow Jones US Total Stock Market Index. The fund uses a full replication approach, meaning it holds every stock in its benchmark index. Schwab U.S. Large-Cap ETF (NYSEARCA:SCHX) offers a straightforward way to invest in the US large-cap market at a very low cost.\n\n6. SPDR Portfolio S&P 1500 Composite Stock Market ETF (NYSEARCA:SPTM)\n\n5-Year Price Performance: 47.9%\n\nTotal Net Assets as of September 25, 2023: $6.76 billion\n\nExpense Ratio: 0.03%\n\nNumber of Holdings: 1509\n\nSPDR Portfolio S&P 1500 Composite Stock Market ETF (NYSEARCA:SPTM) tracks the S&P 1500 Composite Stock Market Index, which combines the S&P 500 large-cap index with the S&P MidCap 400 and S&P SmallCap 600 to encompass the entire US equity market. SPDR Portfolio S&P 1500 Composite Stock Market ETF (NYSEARCA:SPTM) provides extremely diversified exposure to US stocks across various size and style segments. SPDR Portfolio S&P 1500 Composite Stock Market ETF (NYSEARCA:SPTM) uses a sampling strategy to replicate the index performance.\n\nClick to continue reading and see the 5 Best Low Cost ETFs. Suggested articles:\n\n14 Best Basic Materials Stocks To Buy Now 14 Best Dividend Kings Stocks to Buy Now 12 Best Bank Stocks To Buy For Long-Term\n\nDisclosure: None. 12 Best Low Cost ETFs is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/12-best-low-cost-etfs-223447342.html", "symbols": ["AAPL.US", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GSPC.INDX", "IVV.US", "MSFT.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.019, "neu": 0.872, "pos": 0.109}}, {"date": "2023-09-25T22:16:00+00:00", "title": "Jeff Bezos Picks New CEO for Space Company as SpaceX Dominates Industry", "content": "Dave Limp, who worked on several major products at Amazon.com, will take over for the current Blue Origin CEO, Bob Smith.\n\nContinue reading", "link": "https://finance.yahoo.com/m/7880dfe4-5784-37d8-9e8e-28d44b06a42d/jeff-bezos-picks-new-ceo-for.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-09-25T22:15:09+00:00", "title": "Bezos' Blue Origin replacing CEO with Amazon exec", "content": "Amazon founder Jeff Bezos' aerospace company Blue Origin will soon have a new CEO, the company confirmed to FOX Business on Monday. Bob Smith, CEO of Blue Origin, speaks during a Q&A on the launch of Project Kuiper on April 5, 2022, in Colorado Springs, Colorado.\n\nBlue Origin said chief executive Bob Smith is stepping down at the end of the year and Amazon executive Dave Limp will take his place. Dave Limp, senior vice president of devices and services, speaks at Amazon's HQ2 in Crystal City, Virginia, on Sept. 20, 2023.\n\n\"Dave is a proven innovator with a customer-first mindset. He has extensive experience in the high-tech industry and growing highly complex organizations, including leading Amazon’s Kuiper, Kindle, Alexa, Zoox, Fire TV, and many other businesses,\" Blue Origin said in a statement. Amazon founder Jeff Bezos speaks about his flight on Blue Origin’s New Shepard on July 20, 2021, in Van Horn, Texas. Blue Origin confirmed Monday that it is replacing CEO Bob Smith with an Amazon executive at the end of the year.\n\nRegarding Smith, the company said, \"In his six years, Bob led Blue Origin’s transformation from an R&D-focused company into a multi-faceted space business nearing $10 billion in customer orders and over 10,000 employees.\"\n\nEarlier this year, Blue Origin won a $3.4 billion contract to build a spaceship for NASA's next astronaut mission to the moon after being passed up for the opportunity in 2021. Blue Origin’s human landing system would take two astronauts to the moon’s southern polar region where they will conduct scientific and exploration activities.\n\nFox Business' Daniella Genovese contributed to this report.\n\nREAD ON THE FOX BUSINESS APP\n\nOriginal article source:Bezos' Blue Origin replacing CEO with Amazon exec", "link": "https://finance.yahoo.com/news/bezos-blue-origin-replacing-ceo-221509052.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.926, "neg": 0.008, "neu": 0.92, "pos": 0.072}}, {"date": "2023-09-25T22:11:56+00:00", "title": "Dario Amodei Quit OpenAI to Build a GPT Rival. It’s Now a $5 Billion A.I. Leader", "content": "Dario Amodei speaks onstage during TechCrunch Disrupt 2023 at Moscone Center on September 20, 2023 in San Francisco, California. Kimberly White/Getty Images for TechCrunch\n\nIn 2020, OpenAI’s vice president of research Dario Amodei left the artificial intelligence company and cofounded a rival startup called Anthropic. In less than three years, his new company has grown to be worth more than $5 billion and, like OpenAI, earned the backing of Big Tech.\n\nToday (Sept. 25), Anthropic announced Amazon (AMZN) has agreed to invest up to $4 billion in the company with an initial investment of $1.25 billion for a minority stake. Amazon’s move mirrored that of Microsoft in January when it committed to a $10 billion long-term partnership with OpenAI.\n\nAmodei, Anthropic’s CEO, implied he left OpenAI to start his own company because had different ideas from OpenAI CEO Sam Altman. “One thing I’ve learned is that it can be pretty ineffective to argue with your boss and say, ‘Your company shouldn’t do X, it should do Y.’ A much more effective thing to do is, ‘I’m starting a company. We are going to do X and see how it works,” Amodei said during an onstage interview at TechCrunch Disrupt last week.\n\nAnthropic’s main product is Claude, a ChatGPT-like A.I. text generator. Anthropic uses a unique training method called “constitutional A.I.” that aims to build A.I. systems that are not only powerful and intelligent but aligned with human values. Anthropic has been a client of Amazon’s Web Services (AWS) since 2021. As part of the investment agreement, Anthropic will use AWS as a primary cloud provider and use AWS Trainium and Inferentia A.I. chips to build, train and deploy its future foundation models, Amazon said.\n\nUntil today’s Amazon deal, Anthropic had raised $1.5 billion in funding—from investors including Google, Salesforce and Zoom—and was most recently valued at $5 billion, making it among the highest-valued A.I. startups in the world. Amazon didn’t disclose how much Anthropic was worth before or after it signed the investment deal.\n\nBut Amodei said the funding amount is small relative to how much Anthropic might need for new product development and the potential revenue it could bring in. “It’s all relative,” he said at TechCrunch Disrupt.\n\nStory continues\n\nAnthropic focuses on enterprise customers, Amodei said, who use Claude to speed up “knowledge work in professional services.” For example, legal data analytics firm LexisNexis is a client. Claude is popular among financial service and legal service providers, Amodei said.\n\nEarlier this month, Anthropic launched its first consumer-facing subscription of Claude 2. The company plans to build a “frontier model” that is 10 times more capable than today’s most powerful A.I. and the development will require $1 billion in spending over the next 18 months, according to TechCrunch.\n\nThe “surreal” life as the CEO of a high-flying A.I. startup\n\nAmodei worked at OpenAI for five years, leading the development of GPT-2 and GPT-3, the precursors of the large language model powering ChatGPT today. When he left, he brought along a few coworkers, including his sister, Daniela Amodei, who led OpenAI’s recruiting effort and managed its technical safety and policy teams, according to her LinkedIn page.\n\nAmodei said his day-to-day activities now consist of “a mix of things that are very normal and things that are very unusual.” “Half the day it’s fairly normal things any startup would encounter,” such as monitoring operations, hiring for key positions and talking to potential customers, he said at TechCrunch Disrupt, and “the other half can be very unusual because of where we think the technology is going.” That largely involves communicating with parties outside the tech world about the risks of A.I. and how to mitigate them.\n\nIn July, Amodei testified before the Senate Judiciary Committee on potential regulation of A.I. Amodei said he fears cutting-edge A.I. could be used to create dangerous viruses and other bioweapons and standard tests must be created to test advanced A.I. models before they can be released to the public.\n\n“There’s something surreal about ping-ponging back between those two. I’ve never seen an industry that works that way,” Amodei said.\n\nTrending Observer Stories\n\nBill Gates Says Planting Trees to Solve Climate Crisis Is 'Complete Nonsense' What to Watch on Streaming This Week: September 22-28 10 Books With the Heartwarming Vibes of Heartstopper The Complete List of All the Stuff You Can Anonymously Ship Your Enemies Rex Reed's Top Picks from the 2023 Toronto Film Festival\n\nRead the original story Dario Amodei Quit OpenAI to Build a GPT Rival. It’s Now a $5 Billion A.I. Leader and others by Sissi Cao at Observer.", "link": "https://finance.yahoo.com/news/dario-amodei-quit-openai-build-221156385.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.034, "neu": 0.862, "pos": 0.104}}, {"date": "2023-09-25T22:07:27+00:00", "title": "Why there may be less content coming to your streaming service", "content": "After 146 days, WGA has reached a tentative deal with Hollywood studios, which is one of the steps need to get film and television production going again.\n\nNeedham & Co. Senior Analyst Laura Martin explains how strikes could impact the volume of content that streaming services produce. “Wall Street is demanding they.. move to profitability faster,” Martin says. For streamers, this could mean cutting down seasons by filming fewer episodes—“less content spending”, as Martin notes. Martin expects consolidation in the industry, which will help “get rid of duplicative costs.”\n\nIn regards to smaller streamers, Martin states that due to large competitors such as Amazon (AMZN) and Netflix (NFLX) “there’s no advantage to being small.”\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/why-may-less-content-coming-220727770.html", "symbols": ["0VV.F", "0VVB.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "CMCS34.SA", "CMCSA.MX", "CMCSA.US", "CTP2.F", "DIS.MX", "DIS.US", "DISB34.SA", "NFC.F"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0.057, "neu": 0.872, "pos": 0.07}}, {"date": "2023-09-25T21:30:30+00:00", "title": "Amazon to invest up to $4 billion in San Francisco-based Anthropic", "content": "San Francisco-based Anthropic is adding to its already considerable war chest of funding thanks to Amazon.com (Nasdaq: AMZN) as it seeks to build competing AI model and chatbot to OpenAI's ChatGPT. Amazon said it would invest up to $4 billion in Anthropic as part of a strategic partnership that will give the e-commerce giant a minority stake in the AI startup. As part of the deal, Anthropic will use Amazon Web Services as its primary cloud provider and use Amazon's proprietary chips to power its AI models.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6a1d9728-4866-392d-8ec4-0cdcaf0fb541/amazon-to-invest-up-to-%244.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.103, "neg": 0.042, "neu": 0.891, "pos": 0.068}}, {"date": "2023-09-25T21:12:51+00:00", "title": "What Amazon's up to $4B commitment to Anthropic could mean for AI space", "content": "Amazon (AMZN) has made an investment in the AI firm Anthropic, announcing their willingness to commit up to $4 billion this morning. Anthropic will utilize Amazon's Web Services (AWS) along with their custom chips to facilitate the training and deployment of their AI models.\n\nSmartEye Deputy CEO, Dr. Rana el Kaliouby, sees this as a beneficial move for both Anthropic and Amazon, highlighting how it allows Amazon Web Services to partner with other companies and introduce Anthropic's technology to those already using Amazon's data services.\n\n\"Amazon, like many other companies, was caught flat-footed by the release of ChatGPT back in November\", Chris Callison-Burch, Associate Professor at the University of Pennsylvania’s School of Engineering, tells Yahoo Finance on AI investment trends, adding: \"But, I think this is a really excellent strategic move that will help them catch up.\"\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/amazons-4b-commitment-anthropic-could-211251643.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.939, "neg": 0, "neu": 0.887, "pos": 0.113}}, {"date": "2023-09-25T20:56:16+00:00", "title": "S&amp;P 500 Gains and Losses Today: Index Rallies as Oil Prices Drop, Ahead of Inflation Data", "content": "The S&P 500 snapped a four-day losing streak to finish 0.4% higher on Monday, Sept. 25, 2023 as oil prices fell below $90 a barrel, and ahead of a key inflation report due later in the week.\n\nContinue reading", "link": "https://finance.yahoo.com/m/f9302f4d-219c-39be-a8da-51a34c7afd35/s%26p-500-gains-and-losses.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.382, "neg": 0.069, "neu": 0.931, "pos": 0}}, {"date": "2023-09-25T20:48:01+00:00", "title": "Amazon delivery drivers reportedly consider future after UPS deal with Teamsters", "content": "Some Amazon drivers are reportedly pondering their futures making deliveries for the e-commerce giant.\n\nTheir consideration of making a switch has arisen after UPS and the Teamsters union came to an agreement over the summer that will bring significant pay increases to full-time and part-time union drivers over five years, Business Insider reported Saturday. That deal got ratified in August.\n\nThe Teamsters union has about 340,000 UPS workers, either full-time or part-time, among its members.\n\nAMAZON PRIME VIDEO TO INCLUDE ADS IN 2024 — UNLESS USERS PAY $2.99 A MONTH TO GET RID OF THEM\n\nSocial media users have used the UPS-Teamsters collective bargaining agreement and its pay-related terms as fodder for memes about the difference in UPS and Amazon Delivery Service Partner driver pay, according to the outlet. The drivers Amazon uses are contracted through its Delivery Service Partners program.\n\nBusiness Insider reported that some drivers have made joking comments about moving over to UPS.\n\nREAD ON THE FOX BUSINESS APP\n\n\"I think it puts Amazon in this situation where they’re going to have to decide if they want to keep quality drivers or not,\" a delivery driver told Business insider.\n\nUnder the collective bargaining agreement with UPS, current Teamster-represented UPS workers will see their pay increase $2.75 per hour this year, FOX Business previously reported. Over the five years, the rate is expected to climb $7.50 for full-time and part-time UPS workers.\n\nTEAMSTERS UNION VOTES TO RATIFY UPS CONTRACT\n\nIt has other provisions related to overtime and time off, as well.\n\nFor Amazon, the delivery drivers it uses are contracted through its Delivery Service Partners program. It says on its hiring website that such drivers can expect 40 hours of work each week, full benefits, competitive pay and access to a vehicle, among other things. A United Parcel Service driver makes a delivery along the coast of Cape Cod in Orleans, Massachusetts, on July 24, 2023.\n\nTwo drivers that spoke to Business Insider pegged their own hourly wages at about $18 after having seen increases.\n\n\"This year we're investing more than $840 million into Delivery Service Partner rate increases and new programs for delivery drivers,\" Amazon spokesperson Simone Griffin told FOX Business. \"While individual wages and benefits vary by geography, and are set by the Delivery Service Partners, we anticipate that on average drivers in the U.S. can earn $20.50 per hour or more. We actively audit Delivery Service Partners to ensure compliance with our minimum pay and other contractual requirements.\"\n\nStory continues Amazon says on its hiring website that drivers can expect 40 hours of work each week, full benefits, competitive pay and access to a vehicle, among other things.\n\nAmazon has had delivery service partners since 2018. Earlier this month, the company said those entities collectively had over 279,000 drivers around the world.\n\nThe company said in a press release that $440 million of its recently-announced $840 million investment would go toward DSP rate increases to \"help DSPs provide even greater wages and benefits to drivers,\" in addition to retaining existing ones. It will also cover some tuition for education opportunities and provide help locating child care services, among other things.\n\nTARGET, AMAZON LEAD HOLIDAY HIRING SPREE: HERE'S THE FULL LIST\n\nThe value of the company’s stock has seen a rise of over 50% from the start of the year.\n\nEric Revell contributed to this report.\n\nOriginal article source:Amazon delivery drivers reportedly consider future after UPS deal with Teamsters", "link": "https://finance.yahoo.com/news/amazon-delivery-drivers-reportedly-consider-204801823.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "UPAB.F", "UPS.MX", "UPS.US", "UPSS34.SA"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.017, "neu": 0.852, "pos": 0.131}}, {"date": "2023-09-25T20:41:41+00:00", "title": "25 Most Important Inventions of the 21st Century", "content": "In this article, we will look at the 25 most important inventions of the 21st century. If you want to skip our detailed analysis of innovation in the 21st century, head straight to the 10 Most Important Inventions of the 21st Century.\n\nThe 21st century ushered in an era of rapid change and unprecedented connectivity. It is a period in which the traditional boundaries of time and space have been rendered virtually obsolete, thanks to breakthroughs in technology. At the heart of this transformation lies a relentless drive to create solutions that make our lives more convenient, sustainable, and interconnected. However, it must also be highlighted that the top 3 most important inventions to date are believed to be the printing press, telephone, and electric light, which may not be considered the most technologically competent with the inventions of today.\n\nKey Innovations of the 21st Century\n\nFirstly, the pervasive influence of digital technology cannot be overstated. The digital revolution has touched nearly every aspect of our lives, from the way we consume information and entertainment to how we conduct business. This trend has opened up new avenues for growth and efficiency for almost all industries as it has streamlined most of the technical and nontechnical procedures. This also explains why the digital revolution is also known as the third industrial revolution.\n\nOne of the most important digitalization innovations of the 21st century is arguably the widespread adoption of cloud computing. This technology has transformed how businesses and individuals access, store, and process data and thus, has enabled flexibility and cost-efficiency like never before. Cloud computing has democratized access to powerful computing resources which has given birth to innovation across industries, from AI and IoT to e-commerce and healthcare.\n\nIt is worth noting that Amazon Web Services (AWS), a subsidiary of Amazon.com, Inc (NASDAQ:AMZN), pioneered cloud computing by launching in 2006. It revolutionized technology with its innovative features like scalable storage through Amazon S3, cost-effective cold data storage with Amazon Glacier, and block-level storage with Amazon Elastic Block Store.\n\nStory continues\n\nMoreover, Amazon EC2 provided virtual servers, while services like AWS Identity and Access Management ensured security. Today, AWS continues to lead in cloud innovation with features like Amazon SNS for messaging and different services for AI and IoT. To read more about IoT, check our article on biggest internet of things companies in the world.\n\nSpeaking of Amazon.com, Inc (NASDAQ:AMZN), their competitive management and utilization of artificial intelligence alongside cloud computing has boosted its financial growth as well. Diamond Hill Large Cap Strategy made the following comment about Amazon.com, Inc. (NASDAQ:AMZN) in its Q2 2023 investor letter:\n\n“Among our top contributors were insurance company American International Group (AIG), auto retailer CarMax and global online retailer Amazon.com, Inc. (NASDAQ:AMZN).\n\nAmazon’s management team has been working to improve retail profitability, and Q1 results showed progress. In the case of Amazon’s web services (AWS), the market has shifted its focus from where growth will bottom in the near term to how AI can help accelerate the adoption of public cloud services in the future. We believe Amazon’s competitive advantages will continue to grow and that the business has the potential to grow faster than the overall economy in the coming years.”\n\nOn the other hand, the 21st century has also been marked by an urgent need to address environmental challenges. Innovations in sustainable technology have hence gained prominence as businesses and consumers alike recognize the importance of protecting the planet. Be it any profession, any industry, or any business, there has been an increasing focus on incorporating sustainability practices and promoting sustainability initiatives as an integral part of the collective and global mission to combat climate change.\n\nWe believe that the most significant sustainable technology innovation of the 21st century is the widespread deployment of solar photovoltaic (PV) panels. Solar power has emerged as a game-changer in the transition to clean energy, largely reducing greenhouse gas emissions and our reliance on fossil fuels. It offers a scalable and renewable energy source that can enable homes, businesses, and even entire cities to generate clean electricity.\n\nThis innovation has not only mitigated climate change but has also created jobs, lowered electricity costs, and increased energy independence. Owing to the rising popularity of solar panel technology, solar photovoltaic panel installers are one of the most in demand jobs for the future with a growth rate of 27%. To read more about sustainable and green technology, do check out our article on the biggest green tech companies in the world.\n\nSpeaking of green tech, in Q2 of 2023, Tesla Inc (NASDAQ:TSLA)’s green technology prowess also translated into its exceptional financial performance. Its revenue grew by 47% YoY to nearly $25 billion, with a net income at $3.1 billion. Tesla Inc. (NASDAQ:TSLA) experienced the biggest boom in its solar and battery storage business, which grew 74% YoY in Q2.\n\nInvestors are benefiting from Tesla Inc (NASDAQ:TSLA)’s strong performance. This performance is underpinned by their ongoing cost reduction efforts, impressive production ramp-ups in Berlin and Texas, and solid performance in its Energy and Services & other businesses. Owing to the exceptional financial and professional standing of the company, Tesla Inc (NASDAQ:TSLA) is one of the best companies to work for in 2023. 25 Most Important Inventions of the 21st Century\n\nPhoto by NeONBRAND on Unsplash\n\nOur methodology\n\nGiven the nature of dominant innovations in the 21st century, most of our inventions are essentially technologies. To select the most important inventions of the 21st century, we have identified inventions on the basis of their impact. The ranking of these inventions is done based on the following indicators: social impact, economic impact, and environmental impact.\n\nEach indicator was assigned a score from 0 to 20. The total score, out of 60,  was determined by adding up the scores for all indicators. Hence, higher scores indicate higher rankings. The score for each indicator has been derived from extensive research on the internet and thus, in essence, is calculated based on consensus. The list is presented in ascending order.\n\nHere is a list of the most important inventions of the 21st century.\n\n10. 3D Printing\n\nImpact Score: 34 3D printing has enabled the creation of physical objects from digital designs and has forever changed the landscape of manufacturing. From aerospace to medical implants and fashion, 3D printing is reshaping industries and empowering individuals to innovate and produce with greater efficiency and creativity.\n\n24. Birth Control Patch\n\nImpact Score: 35\n\nThe birth control patch has introduced a revolutionary approach to contraception. Its convenience lies in offering women an effective, discreet alternative to daily pills or invasive procedures that has simplified birth control management and has also improved access. It is one of the most important social inventions of the 21st century.\n\n23. Humanoid Robots\n\nImpact Score: 37\n\nHumanoid robots are making a profound impact across different industries. In healthcare, companies like SoftBank Robotics, a subsidiary of SoftBank Group Corp (OTC:SFTBY) have developed robots like Pepper to assist in patient care and therapy. Pepper is capable of reading human emotions. It is one of the latest inventions of the 21st century.\n\n22. Capsule Endoscopy\n\nImpact Score: 38\n\nCapsule endoscopy is transforming the medical field, particularly in gastroenterology. Small, ingestible capsules equipped with cameras capture images of the digestive tract and help in diagnosing conditions like Crohn's disease and gastrointestinal bleeding. Medtronic Plc (NYSE:MDT) manufactures the PillCam capsule endoscopy system. This technology is minimally invasive, patient-friendly, and reduces the need for traditional endoscopic procedures.\n\n21. Blockchain Technology\n\nImpact Score: 39\n\nBlockchain technology employs a highly decentralized, tamper-resistant ledger that records transactions across a network of computers. This ensures transparency and security and thus, reduces the risk of fraud and manipulation. Beyond cryptocurrency applications, blockchain can transform industries through applications in supply chain management by ensuring the authenticity and traceability of products.\n\n20. SubscriptionVideo on Demand (SVOD) Services\n\nImpact Score: 40\n\nSubscription Video-on-demand (SVOD) services, like Netflix Inc (NASDAQ:NFLX) offer on-demand access to vast content. They have completely revolutionized how people watch movies and series. SVOD has indeed disrupted traditional television and cinema and has also enabled global audiences to enjoy personalized, ad-free entertainment anytime and anywhere.\n\n19. Smart Home Services\n\nImpact Score: 41\n\nBy enhancing convenience, security, and energy efficiency, devices like the Amazon Echo and Google Home enable voice-controlled automation have been completely game changing for the modern lifestyle. It is one the most important modern inventions in the world.\n\n18. Artificial Organs\n\nImpact Score: 42\n\nArtificial organs save lives and improve the quality of life for patients with organ failure. With innovations like artificial hearts and kidneys that provide temporary or permanent solutions, time for transplant waiting lists has been significantly reduced. It is one of the inventions that have changed the world.\n\n17. Smart Grids\n\nImpact Score: 43\n\nSmart grids revolutionize energy management by improving efficiency and reliability. They integrate renewable energy sources, reduce power outages, and enable demand-response systems. Mainly, companies like General Electric Co (NYSE:GE) are involved in the development of smart grid technologies. It is one of the best inventions in the last 20 years.\n\n16. Quantum Computing\n\nImpact Score: 45\n\nQuantum computing is a highly impactful invention owing to its ability to tackle complex problems exponentially faster than classical computers. International Business Machines Corp (NYSE:IBM) is at the forefront of this technology. It is one of the greatest inventions of the 21st century.\n\nQuantum computing, not yet a full-blown invention, faces formidable challenges associated with the environmental effects on quantum superpositions of qubits. Nevertheless, there is a strong consensus among different experts who suggest that the associated problems will have been solved by the end of this century and if so, its impact will be far-reaching.\n\n15. 5G Technologies\n\nImpact Score: 46\n\n5G technology offers faster data speeds that enables innovations in healthcare, manufacturing, and autonomous vehicles, and the Internet of Things (IoT). One example is of its use is in the telecommunications sector, where companies like Verizon Communications Inc (NYSE:VZ) deploy 5G networks. It is one of the most important inventions of the 21st century.\n\n14. Hydrogen Fuel Cells\n\nImpact Score: 47\n\nHydrogen Fuel Cells produce electricity with only water vapor as a byproduct, reducing greenhouse gas emissions and dependence on fossil fuels. It is one of the most important inventions of the 21st century in the world.\n\n13. Drones\n\nImpact Score: 48\n\nFrom being used in agriculture, aerial photography, surveillance and logistics to increasing efficiency, reducing costs, and transforming industries from farming to filmmaking, drones have been proven to be one of the most impactful inventions of all time.\n\n12. Autonomous Vehicles\n\nImpact Score: 49\n\nAutonomous vehicles, or self-driving cars have the potential to improve safety by reducing traffic congestion and improving mobility. Tesla Inc (NASDAQ:TSLA) is at the forefront of developing autonomous driving technology, with applications across the automotive industry.\n\n11. Human Genome Mapping\n\nImpact Score: 50\n\nHuman genome mapping is the detailed study of all the genes in our DNA. It's a highly crucial invention because it helps us understand our genetic makeup, which influences our traits and health. This knowledge is vital for personalization in medicine, where treatments can be tailored to an individual's unique genetic profile. It also aids in finding the causes of inherited diseases and drives progress in fields like biotechnology and pharmaceuticals. It is among the most useful inventions of the 21st century.\n\nClick here to see the 10 Most Important Inventions of the 21st Century.\n\nSuggest Articles:\n\n15 Most Innovative Medical Discoveries in the World 15 Most Advanced Countries in Medicine 12 Most Advanced Countries in Science\n\nDisclosure: None. 25 Most Important Inventions of the 21st Century is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/25-most-important-inventions-21st-204141013.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GE.US", "IBM.US", "MDT.US", "NFLX.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA", "VZ.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.018, "neu": 0.818, "pos": 0.164}}, {"date": "2023-09-25T20:35:25+00:00", "title": "S&amp;P Gains and Losses: Index Rallies as Oil Prices Drop, Ahead of Key Inflation Data", "content": "The S&P 500 snapped a four-day losing streak to finish 0.4% higher on Monday, Sept. 25, 2023 as oil prices fell below $90 a barrel, and ahead of a key inflation report due later in the week.\n\nContinue reading", "link": "https://finance.yahoo.com/m/56349554-ab0c-3a4a-a070-74e6b995cb98/s%26p-gains-and-losses%3A-index.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.382, "neg": 0.069, "neu": 0.931, "pos": 0}}, {"date": "2023-09-25T20:09:15+00:00", "title": "Stock Market Today: Mega-Cap Strength Keeps Stocks Above Water", "content": "The main benchmarks eked out increases Monday as several mega-cap stocks gained ground.\n\nStocks struggled for direction Monday. Market participants are cautious looking ahead to a busy batch of economic data. Most notable in this week's lineup is Friday's release of the Federal Reserve's preferred inflation measure, especially after the central bank last week forecast higher-for-longer interest rates.\n\nThe next inflation reading comes Friday morning with the August personal consumption and expenditures (PCE) index, which measures consumer spending. The latest readings on personal income and spending will also be released.\n\nThis confluence of economic reports, as well as the resumption of student loan repayments and a possible government shutdown could \"create amplified market volatility,\" says Mark Hackett, chief investment officer of Nationwide. \"Investors should brace for a week that could redefine market sentiment and strategy for the quarter ahead.\"\n\nToday, though, the price action was relatively muted with the major indexes bouncing between positive and negative territory throughout Monday's session. At the close, the Nasdaq Composite (+0.5% at 13,271), the S&P 500 (+0.4% at 4,337) and the Dow Jones Industrial Average (+0.1% at 34,007) were all modestly higher.\n\nAmazon's $4 billion AI investment\n\nAmid a relatively bare economic calendar, investors took in single-stock news. Amazon.com (AMZN) sparked several headlines after it announced a collaboration with Anthropic, an artificial intelligence (AI) startup. As part of the deal, Amazon will invest $4 billion in Anthropic, taking a minority stake in the firm. Meanwhile, Anthropic will use Amazon Web Services (AWS) as its primary cloud provider.\n\nAMZN shares climbed 1.7% Monday, while fellow mega-cap stocks Apple (AAPL, +0.7%) and Nvidia (NVDA, +1.5%) also gained ground.\n\nWilliams-Sonoma (WSM) was another big mover with shares rising 11.6% after regulatory filings revealed Green Equity Investors increased its passive stake in the home goods retailer to 5%. Today's gains just add to the consumer discretionary stock's impressive year-to-date return, with WSM up roughly 36% vs a 13% return for the broader market.\n\nStory continues\n\nEnergy stocks keep climbing\n\nEnergy stocks were also a pocket of strength Monday, with the sector outperforming (+1.3%) even as U.S. crude futures fell 0.7% to $89.42 per barrel. Oil and gas companies Coterra Energy (CTRA, +2.0%) and EOG Resources (EOG, +2.5%) were two notable gainers.\n\n\"Energy stocks are now reasserting their market leadership after gasoline prices in August rose 10.5% in the Consumer Price Index (CPI) and a whopping 20% in the Producer Price Index (PPI),\" says Louis Navellier, chairman and founder of Navellier & Associates. In addition to an acute inventory decline, \"there is a diesel shortage again, especially in Europe, so the U.S. is exporting more distillates, which is causing the trade deficit to decline and boost gross domestic product (GDP) growth.\"\n\nRelated content\n\nWhen Is the Next Fed Meeting? Kiplinger's Weekly Earnings Calendar for This Week When Is the Next CPI Report?", "link": "https://finance.yahoo.com/news/stock-market-today-mega-cap-200915708.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "DJI.INDX", "GSPC.INDX", "IXIC.INDX", "WM1.F", "WSM.US"], "tags": [], "sentiment": {"polarity": 0.978, "neg": 0.038, "neu": 0.861, "pos": 0.101}}, {"date": "2023-09-25T19:03:00+00:00", "title": "2 Tech Titans Betting Big on Artificial Intelligence (AI)", "content": "Seemingly every day so far in 2023, there’s a new hot story surrounding Wall Street’s shiny new toy, artificial intelligence (AI). It’s remained at the forefront of market topics all year, and it’s more than reasonable to assume the trend will stay the same for some time as we continue wading through the initial excitement.\n\nAnd just recently, several market heavyweights, including Meta Platforms META and Amazon AMZN, have grabbed attention following recent AI announcements. Both stocks have helped lead the market’s surge in 2023, as we can see illustrated below. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nBut what’s there to like surrounding the recent announcements? Let’s take a closer look.\n\nAmazon\n\nJust earlier, it was revealed that Amazon will invest up to $4 billion in Anthropic, an AI safety and research company based in San Francisco and a rival of OpenAI.\n\nThe deal reflects a partnership to develop reliable and high-performing foundation models, with AWS now becoming Anthropic’s primary cloud provider for critical workloads. According to Anthropic, the investment will provide the resources needed to continue training state-of-the-art models, which require substantial computing power and research programs.\n\nGiven strong AWS customer demand for Claude (Anthropic’s AI chatbot), Anthropic is also now expanding its support of Amazon Bedrock. Amazon Bedrock is a service that simplifies access to advanced AI models created by Amazon and other AI startups, allowing users to pick what fits their needs best.\n\nIt’s another exciting development for Amazon as it continues its AI journey, and the market has had positive reactions so far as well – AMZN shares are up roughly 1% in today’s session so far, adding to their impressive 56% YTD gain.\n\nAnalysts have taken a notably bullish stance on the company’s earnings outlook, helping land Amazon into the highly-coveted Zacks Rank #1 (Strong Buy). Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nKeep an eye out for the company’s upcoming release expected in late October, as the Zacks Consensus EPS Estimate of $0.58 suggests 190% growth from the year-ago period.\n\nStory continues\n\nMeta Platforms\n\nMeta Platforms is hosting its Meta Connect event this week, a two-day event that kicks off this Wednesday. It’s primarily focused on the company’s latest products (including Meta Quest 3), with attendees also receiving a detailed peak behind the scenes at the company’s latest AI innovations.\n\nThose who join will hear the latest on the company’s developer ecosystem, including updated programs and features across AI, VR, MR, AR, Meta Horizon Worlds, and Meta Avatars. Chaya Nayak, product manager of Generative AI Data & Safety, will be speaking.\n\nBack in February, Zuckerberg announced the creation of a new top-level product group focused on generative AI, wanting to develop delightful experiences surrounding the technology. He noted that the company would also be concentrating on creating AI personas to assist people through text chats in WhatsApp and Messenger, which we could see revealed this week.\n\nLike AMZN, Meta Platforms’ earnings outlook has shot higher over the last several months. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nIt’s worth noting that META shares aren’t valuation stretched given the company’s forecasted growth, with earnings forecasted to climb 35% in its current year on 14% higher revenues. Shares presently trade at a 22.6X forward earnings multiple (F1), modestly beneath the 23.1X five-year median.\n\nBottom Line\n\nArtificial intelligence hype isn’t going anywhere anytime soon, with heavyweights Meta Platforms META and Amazon AMZN recently grabbing market headlines again following announcements surrounding the technology.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\n\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/2-tech-titans-betting-big-190300528.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "FB2A.F", "FB2A.XETRA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.006, "neu": 0.836, "pos": 0.158}}, {"date": "2023-09-25T19:00:13+00:00", "title": "3 Signs You Really Don't Need a Car Anymore", "content": "Shedding a vehicle and its costs could work wonders for your finances. Read on to see if you're ready to ditch your car.\n\nContinue reading", "link": "https://finance.yahoo.com/m/c6ce4b61-7885-31b9-b5cf-3ae9bcdd017b/3-signs-you-really-don%27t-need.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.361, "neg": 0, "neu": 0.902, "pos": 0.098}}, {"date": "2023-09-25T18:57:14+00:00", "title": "Jair Lynch's housing development at Shops at Penn Branch lands Amazon grant", "content": "An affordable housing project in Southeast D.C. will be the next beneficiary of Amazon.com Inc.'s housing fund. Amazon (NASDAQ: AMZN) has provided a below-market-rate loan of $22 million to Jair Lynch Real Estate for the next stage of its plans to reimagine the Shops at Penn Branch, which the developer has been working to revitalize for a few years. The next project there calls for a 189-unit apartment community constructed on the parking lot to the rear of the shopping center, along Branch Avenue SE.\n\nContinue reading", "link": "https://finance.yahoo.com/m/88c6313d-a8a5-36ca-b2ac-ddaced9d3702/jair-lynch%27s-housing.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.586, "neg": 0, "neu": 0.945, "pos": 0.055}}, {"date": "2023-09-25T18:05:22+00:00", "title": "7 Stocks to Buy for the Blue-Collar Bull Market", "content": "Labor and industry and flexing their muscles right now in what is being called a worker’s market. Autoworkers are on strike. Unionized pilots just got record pay raises out of all the major airlines. The Teamsters union wrung concessions from United Parcel Service (NYSE:UPS). And union drives continue at American companies as diverse as Starbucks (NASDAQ:SBUX) and Amazon (NASDAQ:AMZN). At the same time, the federal government is spending $1.25 trillion on infrastructure projects across the country to improve roads, bridges, railway corridors, and more. Governments at the state and municipal levels are also investing heavily in construction projects. The Brookings Institution is calling this “America’s Infrastructure Decade.”  It’s all contributing to a blue-collar bull market.\n\nFord Motor (F) Ford dealership sign against a blue sky.\n\nSource: D K Grove / Shutterstock.com\n\nFord Motor (NYSE:F) seems to be doing better than its rivals when it comes to negotiating with the autoworker unions.\n\nFor one, Ford reached a new labor pact with more than 5,000 autoworkers in Canada, narrowly averting a strike that could have impacted its vehicle production. Then, the United Auto Workers (UAW) union in the U.S. announced that it would not expand its strike action against Ford. While a collective agreement between the two has not yet been reached, the union says progress is being made.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nIn addition, the resolution of bargaining in Canada comes as a relief. Without that, Ford would have had to contend with labor issues on both sides of the border. Plus, a strike in Canada would have impacted the production of the Ford Edge and Lincoln Nautilus crossover vehicles.\n\nFedEx (FDX) A FedEx employee loads a FedEx Express truck in Manhattan.\n\nSource: Antonio Gravante / Shutterstock.com\n\nShares of FedEx (NYSE:FDX) are rallying, with UPS finding itself embroiled in labor negotiations.\n\nHelping, FedEx just reported better-than-expected financial results and raised its full-year guidance. For its latest quarter, FedEx reported earnings per share (EPS) of $4.55 on revenue of $21.7 billion. Analysts forecast EPS of $3.71 from sales of $21.7 billion. The company also said earnings were given a big lift by internal cost-cutting, as well as events such as the UPS labor negotiations and the bankruptcy of Yellow Corp. Looking ahead, FedEx said it expects to earn between $17 and $18.50 a share for its full 2024 fiscal year.\n\nStory continues\n\nBoeing (BA) BA stock: a blue and white Boeing 787 flying in the sky above the clouds\n\nSource: vaalaa / Shutterstock\n\nBoeing (NYSE:BA) is a major American manufacturer, employing more than 150,000 blue-collar workers. It’s also one of only two commercial aircraft manufacturers in the world along with France’s Airbus SE. Given its competitive strength and its global duopoly in the manufacture of commercial aircraft, Boeing could be a good long-term holding for investors with time and patience.\n\nGranted, Boeing has had its share of problems. Its stock was knocked lower after the company warned that a new manufacturing flaw in its 737 Max aircraft is likely to delay deliveries to its airline customers worldwide. It also found fastener holes on the aft pressure bulkhead on some 737 Max aircraft were improperly drilled, which needs repair. However, Boeing stressed that the bulkhead problem is not a safety issue. Despite the hiccup, Boeing has raised its monthly production to 38 aircraft from 31 previously.\n\nMcDonald’s (MCD) McDonald's golden arches\n\nSource: Vytautas Kielaitis / Shutterstock\n\nMcDonald’s (NYSE:MCD) just said it would raise the royalty fees it charges new U.S. restaurant franchises. Specifically, McDonald’s said that it is raising the fee that new franchise operators must pay to license the McDonald’s brand to 5% from 4% as of Jan. 1. The company said the increased royalty fee will help it to maintain its “competitive edge.”\n\nThat royalty fee hike also comes after McDonald’s beat Wall Street expectations with second-quarter financial results. Better, a growing number of analysts are turning bullish on McDonald’s, which they feel is a good bet if the economy falls into a recession.\n\nCaterpillar (CAT) Image of the Wall Street Bull.\n\nSource: photo.ua / Shutterstock.com\n\nAfter struggling during the pandemic, Caterpillar (NYSE:CAT) is on a tear once again. At the moment, the company is riding high on renewed infrastructure spending by governments at all levels. That’s in addition to rising demand for its mining machinery.\n\nMoving forward, Caterpillar is well-positioned for continued growth given that most of its business remains in North America. Also, while construction and mining activity in the U.S., Canada, and Mexico remains strong, activity and demand are beginning to wane in other areas, notably China and Europe, where the economies are cooling much faster under the weight of high-interest rates. Caterpillar’s positioning in North America insulates it from international headwinds.\n\nWalmart (WMT) Walmart (WMT) logo on a store front\n\nSource: Ken Wolter / Shutterstock.com\n\nUBS analyst just upgraded Walmart (NYSE:WMT) to a “buy” rating, with a $190 price target. All thanks to growing strength in its online sales channel and increasing dominance in groceries. Helping, Walmart is the largest grocery retailer in America, outpacing both Costco (NASDAQ:COST) and Kroger (NYSE:KR).\n\nIn addition, Walmart’s earnings continue to be impressive. The company recently raised its full-year guidance after beating Wall Street expectations for its second-quarter results. In fact, same-store sales increased 6.4% year over year, with e-commerce sales up 24%. In addition, the company now expects full-year sales to increase between 4% and 4.5% which is ahead of previous guidance of sales gains of 3.50%.\n\nGeneral Electric (GE) Company breakups: The General Electric GE logo on a building\n\nSource: Sundry Photography / Shutterstock.com\n\nGeneral Electric (NYSE:GE) is in the process of splitting into separate entities, which will include GE Aerospace, GE Vernova (the power generation business), and GE HealthCare Technologies. GE executives have said they want all the businesses to have investment-grade credit ratings when they become independent companies with strong franchises in their respective industries. To that end, GE is allocating its free cash flow to the new companies. Wall Street expects GE’s cash flow in Q3 of this year to total about $900 million.\n\nOn the date of publication, Joel Baglole did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 7 Stocks to Buy for the Blue-Collar Bull Market appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-stocks-buy-blue-collar-180522788.html", "symbols": ["AMZN.US", "BA.US", "CAT.US", "COST.US", "F.US", "FDX.F", "FDX.MX", "FDX.US", "FDX.XETRA", "GE.MX", "GE.SW", "GE.US", "GEC.LSE", "GEOO34.SA", "GNE.PA", "KR.US", "MCD.MX", "MCD.US"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.038, "neu": 0.87, "pos": 0.092}}, {"date": "2023-09-25T18:01:50+00:00", "title": "Stock Market Clings To Gains As 10-Year Yield Hits A High; Williams-Sonoma Soars", "content": "The stock market weakened slightly in the past hour, with the indexes mixed in afternoon trading and off the highs of the day amid rising Treasury yields. The Nasdaq reversed from lows to be up 0.2% at 1:30 ET in stock market action. The major indexes remain below their 50-day moving averages.\n\nContinue reading", "link": "https://finance.yahoo.com/m/3e0b1cd9-1671-3f83-9b58-a62bd7e0b93c/stock-market-clings-to-gains.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "DJI.INDX", "GSPC.INDX"], "tags": [], "sentiment": {"polarity": -0.318, "neg": 0.072, "neu": 0.896, "pos": 0.032}}, {"date": "2023-09-25T17:58:00+00:00", "title": "Amazon and 2 Other Cloud Stocks Are Still Seen as the Best AI Plays. Here’s Why.", "content": "The firm reiterated Outperform ratings on Amazon, Microsoft, and Alphabet, citing its latest annual survey results.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9cb0915f-f153-358d-9ad1-96ba37f3d90c/amazon-and-2-other-cloud.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0, "neu": 0.909, "pos": 0.091}}, {"date": "2023-09-25T17:44:35+00:00", "title": "Amazon invests $4bn in ChatGPT rival cofounded by British former journalist", "content": "anthropic\n\nA ChatGPT rival co-founded by a British former journalist has secured $4bn (£3.3bn) from Amazon as the tech giant seeks to catch up in the artificial intelligence race.\n\nThe company is investing in Anthropic, a high-profile Silicon Valley lab formed by a team of researchers who quit OpenAI, the company behind ChatGPT, in protest at its direction.\n\nThey include Jack Clark, a former journalist who studied creative writing and worked as a reporter at technology news website The Register and Bloomberg, where he covered artificial intelligence, before joining OpenAI.\n\nMr Clark also worked with the Government’s AI ethics body, the Centre for Data and Ethics Innovation, as a member of its recently disbanded advisory board.\n\nA team of former OpenAI researchers quit the company in 2021 in protest at what they saw as a lax approach to safety. They include Dario Amodei, OpenAI’s former research head, who is now Anthropic’s chief executive.\n\nThe company was reportedly valued at $5bn by a separate investment earlier this year.\n\nAmazon’s investment marks a response to Microsoft, which has invested billions into OpenAI and has since enjoyed a symbiotic relationship with the company, incorporating ChatGPT’s technology into many of its services such as its search engine, Bing.\n\nAmazon is the world’s biggest provider of cloud computing, which many AI companies rely on to develop their high-powered systems. However, its chief rivals Microsoft and Google have been seen as stealing a march on the company with a string of investments in AI labs.\n\nAmazon also hopes that its AI microchips can become an alternative to those provided by Nvidia, which has become one of the world’s most valuable companies on the back of the AI boom.\n\nAnthropic has sought to be a pioneer of safe development of cutting-edge AI models, emphasising the “responsible” development of the systems.\n\nIts chatbot, Claude, a rival to ChatGPT, is designed to be ethical and less likely to produce responses that could encourage dangerous behaviour.\n\nStory continues\n\nAmazon will invest an initial $1.25bn in the company, with the potential to raise this to $4bn. It said that under the deal, Amazon will become Anthropic’s “primary cloud provider”\n\nGoogle had previously invested $300m in the company.\n\nAI companies have been forced to turn to tech giants for investment because of the huge computing resources at their disposal and as once deep-pocketed investors such as SoftBank and Tiger Global suffer during an investment downturn.\n\nMr Clark recently told the UN that AI creates “potential threats to international peace, security and global stability” because it could be misused or could become unpredictable.", "link": "https://uk.finance.yahoo.com/news/amazon-invests-4bn-chatgpt-rival-174435333.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.043, "neu": 0.832, "pos": 0.125}}, {"date": "2023-09-25T17:41:27+00:00", "title": "Amazon/AI: tech arms race continues with Anthropic investment", "content": "Amazon has lagged behind tech rivals when it comes to the generative artificial intelligence arms race under way in Silicon Valley. It has agreed to invest as much as $4bn in Anthropic, a rival to OpenAI — the group behind ChatGPT. Under the terms of the agreement, Amazon will invest an initial $1.25bn for a minority stake in the company, with the potential to invest up to $4bn.\n\nContinue reading", "link": "https://finance.yahoo.com/m/c410d1ef-4bae-3282-a14d-eccbfa86c405/amazon%2Fai%3A-tech-arms-race.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.823, "neg": 0.029, "neu": 0.816, "pos": 0.155}}, {"date": "2023-09-25T16:58:23+00:00", "title": "Amazon Invests Up To $4B In ChatGPT Competitor, Hollywood Writers Accept Preliminary Deal, ChatGPT Challenges Siri And Alexa With Introduction Of Verbal Responses: Today's Top Stories", "content": "Benzinga\n\nFord Of Canada, Union Reach Collective Agreement With Wage Boosts, Pension Improvements; U.S. Negotiations Continue\n\nAs Detroit-based automaker Ford Motor Co (NYSE: F) continues to reel under the impact of the United Auto Workers (UAW) union's strike in the U.S., Canada's Unifor union has ratified a new agreement with Ford of Canada. Unifor said that most of its Ford members voted in favor of a new three-year collective agreement with Ford of Canada that includes a base hourly wage increase of up to 25%. Under the new contract, general wages would increase 10% in the first year, 2% in the second, and 3% in the third.\n\nHollywood Writers Accept Tentative Deal, Including Pay From Steamers: What About Actors?\n\nThe Writers Guild of America (WGA), representing over 11,000 screenwriters, has taken a monumental step towards ending Hollywood's crippling 146-day strike. In a historic move, WGA members reached a tentative agreement with entertainment companies that could reshape the industry landscape. The deal, if accepted, will bring much-needed relief to a sector reeling from production shutdowns.\n\nPhonePe Challenges Google With Zero-Fee Indus AppStore\n\nPhonePe, the Walmart Inc (NYSE: WMT) backed fintech giant, unveiled the Indus AppStore Developer Platform, underscoring a significant move to attract Android developers in India. This initiative directly challenges Alphabet Inc (NASDAQ: GOOG) (NASDAQ: GOOGL) Google's dominance in the app store market — especially in India — where Android holds a significant market share.\n\nAmazon Invests Up To $4 Billion In ChatGPT Competitor, AI Startup Anthropic\n\nAmazon.Com, Inc (NASDAQ: AMZN) has announced a strategic investment of up to $4 billion in Anthropic, an emerging AI company, as the e-commerce giant seeks to harness the potential of artificial intelligence in diverse applications across its business. As part of this groundbreaking deal, Anthropic will leverage Amazon's custom-designed chips to develop and roll out its AI software. Amazon also intends to integrate Anthropic's cutting-edge technology into various products within its expansive portfolio.\n\nStory continues\n\nRedefining Roadprints: Goodyear Revamps Presence In Asia-Pacific With Strategic Shake-Up\n\nThe Goodyear Tire & Rubber Company (NASDAQ: GT) has unveiled its intentions to redefine its operational presence in the Asia Pacific region, emphasizing Australia and New Zealand. The tire behemoth aims to transition from owning its establishments to embracing a third-party distribution and retail model. This strategic shift will culminate in the shedding of around 700 roles, exit of nine warehouse sites, and the divestment or cessation of nearly 100 retail and fleet outlets. The company intends to share its broader plan with investors during the fourth quarter.\n\nCDC Backs Pfizer's RSV Infection Maternal Vaccine During Pregnancy As Protection For Infants\n\nFriday, The Centers for Disease Control and Prevention recommended the first respiratory syncytial virus (RSV) vaccine for pregnant people to protect their newborns from severe RSV illness. This is the first fall and winter virus season, where vaccines are available for the three major respiratory viruses –COVID-19, RSV, and flu. This new vaccine, Pfizer Inc's (NYSE: PFE) bivalent RSVpreF vaccine (Abrysvo), has been shown to reduce the risk of RSV hospitalization for babies by 57% in the first six months after birth. Pfizer's vaccine, Abrysvo, is already approved and available in the U.S. for adults ages 60 and up.\n\nRevving Up Payments: Mercedes Joins Forces With Mastercard For In-Car Digital Transactions\n\nMercedes Benz Group AG (OTC: MBGAF) has partnered with Mastercard Inc (NYSE: MA) to introduce embedded in-car payments at the point of sale. Through the facility, customers will be able to use a fingerprint sensor in their car to make convenient and secure digital payments at more than 3,600 service stations in Germany.\n\nNovartis Sandoz Prepares For Public Debut With Strong Sales Record And Plans for New Biologic Drugs\n\nNovartis AG (NYSE: NVS) confirmed its plans for a 100% spin-off of the Sandoz business on October 4 after shareholders approved it earlier this month. Novartis also said key regulatory approvals have been obtained, including the approval by SIX Exchange Regulation for listing the Sandoz shares on the SIX Swiss Exchange. The Sandoz shares will have the symbol SDZ, Novartis said.\n\nJapan Approves Biogen/Eisai's Alzheimer Treatment Leqembi\n\nEisai Co Ltd (OTC: ESALY) (OTC: ESALF) and Biogen Inc (NASDAQ: BIIB) announced that humanized anti-soluble aggregated amyloid-beta (Aβ) monoclonal antibody Leqembi Intravenous Infusion (200 mg, 500mg, lecanemab) has been approved in Japan as a treatment for slowing progression of mild cognitive impairment and mild dementia due to Alzheimer's disease (AD). Leqembi's approval is based on Phase 3 data from the global Clarity AD clinical trial, in which Leqembi met its primary endpoint and all key secondary endpoints with statistically significant results and confirmed the clinical benefit.\n\nAluminum Giant Alcoa Ushers In A New Era: William Oplinger Steps Up As CEO\n\nAlcoa Corp (NYSE: AA) disclosed the appointment of William F. Oplinger as President and Chief Executive Officer and as a member of its Board of Directors, effective September 24, 2023. Oplinger succeeds Roy C. Harvey, who will serve as Strategic Advisor to the Chief Executive Officer until December 31, 2023.\n\nWhy Is Brain Cancer Focused TransCode Therapeutics Stock Trading 300% Higher Today?\n\nTransCode Therapeutics Inc (NASDAQ: RNAZ) shares are trading higher after the company announced results with its lead therapeutic candidate, TTX-MC138, in murine models bearing human glioblastoma multiforme (GBM) tumors. The therapeutic candidate showed lasting activity and significantly inhibited miRNA-10b, a driver of tumor progression in glioblastoma.\n\nNewYork Times\n\nTyson, Perdue Farms Under Investigation Over Disturbing Child Labor Allegations\n\nThe U.S. Labor Department has launched an investigation into alleged child labor violations at poultry-processing behemoths Tyson Foods (NYSE: TSN) and Perdue Farms. The federal inquiry is examining whether the companies used migrant children to clean slaughterhouses, a hazardous job banned for minors by federal law. The federal probe was triggered by a New York Times Magazine article detailing the employment of migrant children as young as 13 in overnight shifts at the companies' plants in Virginia.\n\nBloomberg\n\nChatGPT Introduces Verbal Responses, Challenging Siri And Alexa\n\nOpenAI, the pioneering artificial intelligence firm, has unveiled a new feature for its ChatGPT application, enabling the chatbot to respond to user queries verbally. The enhancement will likely transform user interactions with the chatbot, making them more immersive and human-like. The update, scheduled for rollout in the forthcoming weeks, will allow users to select from five distinct voice personas, including \"Juniper,\" \"Breeze,\" and \"Ember.\"\n\nApple's iOS 17 Update Challenges Google's Search Engine Dominance\n\nJohn Giannandrea, previously a high-ranking executive at Alphabet Inc (NASDAQ: GOOG) (NASDAQ: GOOGL) Google and now leading Apple Inc's (NASDAQ: AAPL) artificial intelligence division, highlighted a subtle shift in the recent iPhone software update. This change allows users to opt for a search engine other than Google's while using the internet in private mode. The introduction of iOS 17 on Monday brought forth an option to select from multiple search engines, John Giannandrea mentioned during his testimony in a Washington federal court as part of the ongoing antitrust lawsuit against Google by the Justice Department.\n\nCourt Ruling Questions Lufthansa Offshoot Austrian Airlines' Dubious Environmental Claims\n\nIn a recent court ruling, Austrian Airlines AG, a subsidiary of Deutsche Lufthansa AG (OTC: DLAKY), faced backlash for making inaccurate environmental claims, specifically misleading eco-conscious passengers into believing their flights were wholly sustainable. The controversy was sparked earlier this year when an Austrian consumer-protection body filed a lawsuit against Austrian Airlines. The airline's advertising suggested that its flights to an art exhibition in Venice, Italy, would be operated using 100% sustainable aviation fuel.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Amazon Invests Up To $4B In ChatGPT Competitor, Hollywood Writers Accept Preliminary Deal, ChatGPT Challenges Siri And Alexa With Introduction Of Verbal Responses: Today's Top Stories originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/amazon-invests-4b-chatgpt-competitor-165823564.html", "symbols": ["AA.US", "AAPL.US", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "BIIB.US", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GOGL34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.031, "neu": 0.856, "pos": 0.114}}, {"date": "2023-09-25T16:50:19+00:00", "title": "Markets Mixed at Midday as Bond Yields Rise and Oil Prices Fall", "content": "U.S. equities were mixed at midday on Monday, Sept. 25, 2023, with bond yields rising while oil prices lost ground.\n\nContinue reading", "link": "https://finance.yahoo.com/m/08046d6b-dd23-39ee-ab1a-924a1240abc5/markets-mixed-at-midday-as.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TF7A.F", "TSN.US"], "tags": [], "sentiment": {"polarity": -0.318, "neg": 0.099, "neu": 0.901, "pos": 0}}, {"date": "2023-09-25T16:29:00+00:00", "title": "Amazon (AMZN) Expands Fire TV Portfolio With New Devices", "content": "Amazon.com AMZN has been continuously putting efforts into strengthening its Fire TV ecosystem on the back of innovative products and technologies.\r\n\r\nThis is evident from the latest introduction of two Fire TV Sticks — the all-new Fire TV Stick 4K Max and Fire TV Stick 4K.\r\n\r\nThe Fire TV Stick 4K Max, priced at $59.99, comes with Ambient Experience, which transforms the TV into a beautiful smart display and now it can turn the TV into an in-home art gallery with over 2,000 free, gallery-quality pieces of artwork.\r\n\r\nAmbient Experience allows customers to select from motion graphics, landscape art, personalized and always-evolving dynamic art, personal photos and many more.\r\n\r\nThe Fire TV Stick 4K Max features an upgraded 2.0 GHz quad-core processor and 16 GB of storage. It also supports Wi-Fi 6E.\r\n\r\nThe new Fire TV Stick 4K, on the other hand, comes with an updated 1.7 GHz quad-core processor and supports Wi-Fi 6. It delivers a vibrant 4K Ultra HD picture quality and an immersive Dolby Atmos audio experience for under $50.\n\nAmazon.com, Inc. Price and Consensus Amazon.com, Inc. Price and Consensus\n\nAmazon.com, Inc. price-consensus-chart | Amazon.com, Inc. Quote\n\nMore Into the Headlines\n\nApart from the two new streaming media players, Amazon unveiled the all-new Fire TV Soundbar, priced at $119.99. It is a two-channel companion device offering bold and room-filling sound.  This 24-inch device supports all Fire TV devices and allows connection with phones, tablets or any streaming device via Bluetooth.\r\n\r\nThe company has infused generative AI into Fire TV to offer conversational ways to discover content. With this update, users will be able to find TV shows and movies by asking Alexa open-ended questions regarding the content.\r\n\r\nWe note that this generative AI voice search feature, which will be available later this year, is expected to deliver an enhanced Fire TV experience.\n\nGrowth Prospects\n\nThe latest move is expected to help Amazon rapidly penetrate the booming streaming media player market.\r\n\r\nPer a report from EXTRAPOLATE, the global streaming devices market will reach $62.1 billion by 2032, witnessing a CAGR of 9.1% between 2023 and 2032.\r\n\r\nA Maximize Market Research report shows that the market is likely to hit $134.35 billion by 2029, seeing a CAGR of 15.8% between 2023 and 2029.\r\n\r\nA Statista report indicates that the smart streaming devices market is anticipated to generate revenues worth $8.3 billion in 2023 and is expected to witness a CAGR of 9.8% from 2023 to 2028.\r\n\r\nThis report also shows that the market volume is likely to hit 284.2 million pieces by 2028.\r\n\r\nWe note that Amazon’s growing prospects in this promising market are likely to aid its financial performance, which, in turn, will instill investor optimism in the stock.\r\n\r\nAmazon has gained 53.8% in the year-to-date period.\r\n\r\nThe Zacks Consensus Estimate for 2023 sales is pegged at $570.8 billion, indicating growth of 11.1% from 2022’s level.\n\nStory continues\n\nZacks Rank & Other Stocks to Consider\n\nCurrently, Amazon sports a Zacks Rank #1 (Strong Buy).\r\n\r\nInvestors interested in the broader retail-wholesale sector can consider some other top-ranked stocks like BJ’s Restaurants BJRI, Domino’s Pizza DPZ and Arcos Dorados ARCO. BJRI currently sports a Zacks Rank #1, and DPZ and ARCO each carry a Zacks Rank #2 (Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nBJ’s Restaurants has lost 10.6% in the year-to-date period. The long-term earnings growth rate for BJRI is currently estimated at 15%.\r\n\r\nDomino’s Pizza shares have gained 11.3% in the year-to-date period. DPZ’s long-term earnings growth rate is currently projected at 12.97%.\r\n\r\nArcos Dorados has gained 16% in the year-to-date period. The long-term earnings growth rate for DRI is currently anticipated at 11.4%.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\n\nBJ's Restaurants, Inc. (BJRI) : Free Stock Analysis Report\n\nDomino's Pizza Inc (DPZ) : Free Stock Analysis Report\n\nArcos Dorados Holdings Inc. (ARCO) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/amazon-amzn-expands-fire-tv-162900597.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.039, "neu": 0.819, "pos": 0.143}}, {"date": "2023-09-25T16:29:00+00:00", "title": "Is Artificial Intelligence Just the Latest Buzzword? Ask Amazon", "content": "*Amazon is investing in Anthropic to further its generative artificial intelligence efforts, just as the market begins to question the 'AI trade.' *We view the investment positively for AWS and Amazon's chip efforts. *Ads are coming to Prime Video in 2024, further growing Amazon's advertising business.\n\nContinue reading", "link": "https://finance.yahoo.com/m/47fc30af-a09e-3b08-805f-eaafe63e063f/is-artificial-intelligence.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.802, "neg": 0, "neu": 0.846, "pos": 0.154}}, {"date": "2023-09-25T16:26:00+00:00", "title": "Alphabet's (GOOGL) Google Unveils AI Features for YouTube", "content": "Alphabet’s GOOGL Google has added artificial-intelligence (AI)-powered features to YouTube for video creators.\r\n\r\nOne of the features called Dream Screen, a generative AI-powered tool, adds video backgrounds to short-form videos or Shorts seamlessly. Also, the company introduced the latest production tools for editing short and long-form videos quickly.\r\n\r\nFurther, Google launched YouTube Create, a mobile app designed to streamline video production for creators, offering AI-enabled editing, captioning, voiceover, filters and royalty-free music features.\r\n\r\nApart from this, YouTube plans to offer creators AI-powered insights, automatic video dubbing capability and assistance in finding music and soundtracks beyond creation.\r\n\r\nThe above feature additions is likely to help the company gain strong traction among content creators, which in turn will boost YouTube’s user base. This will likely aid the Google Services segment’s performance, which accounted for 88.8% of total revenues in the second-quarter 2023.\r\n\r\nAdditionally, revenues from the Google Services business in the second quarter increased 5.5% year over year to $66.3 billion.\r\n\r\nOur model estimate for 2023 revenues of the underlined segment is pegged at $2.67 billion, up 5.3% year over year.\n\nAlphabet Inc. Price and Consensus Alphabet Inc. Price and Consensus\n\nAlphabet Inc. price-consensus-chart | Alphabet Inc. Quote\n\nGrowing Efforts in Generative AI\n\nWe mark the latest move as Alphabet’s growing efforts to integrate generative AI into its products and services.\r\n\r\nApart from the latest generative AI features, Google recently announced the general availability of its generative-AI-backed helper, Duet AI, for all Google Workspace apps, helping users to create visual aids, assist in meetings and even attend for them, at a no-cost trial.\r\n\r\nAlphabet is also set to release its conversational multimodal AI software, Gemini, comprising extensive language models that offer chatbots optimization, text summarization, content generation, email drafts, music lyrics and news articles, enabling users to create personalized content.\r\n\r\nFurther, Google enhanced the model of its chatbot, Bard, by integrating it with Google apps, improving Google it feature and introducing new features like Bard Extensions in English, double-checking responses, uploading images with Lens, obtaining Search images and modifying responses to more than 40 languages.\r\n\r\nAdditionally, Google integrated experimental generative AI features into its search engine, known as the search generative experience, which generates detailed summaries based on Internet and digital sources.\r\n\r\nWe believe that the abovementioned endeavors are likely to strengthen Alphabet’s presence in the booming generative AI space.\r\n\r\nPer a Fortune Business Insights report, the global generative AI market size is expected to hit $43.87 billion in 2023 and reach $667.96 billion by 2030, exhibiting a CAGR of 47.5% between 2023 and 2030.\r\n\r\nGrowing prospects in the promising generative AI market are expected aid Alphabet in winning investors’ confidence in the near term.\r\n\r\nAlphabet has gained 47.6% on a year-to-date basis compared with the industry’s growth of 45.8%.\n\nStory continues\n\nIntensifying Competition\n\nWe note that the latest move will allow Alphabet, which currently carries a Zacks Rank #3 (Hold), to compete well with some notable industry players like Microsoft MSFT, Meta Platforms META and Amazon AMZN, which are also making continuous efforts to boost its generative AI efforts.\r\n\r\nYou can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nMicrosoft recently announced OpenAI's DALL-E 3 AI image-synthesis model, which is fully integrated with ChatGPT and challenges previous models by rendering images with complex descriptions and handling in-image text generation.\r\n\r\nFurther, MSFT plans to incorporate the DALL-E 3 text-to-image model into Bing Chat, enabling users to create images directly in a chat.\r\n\r\nMeanwhile, Meta is set to introduce AI chatbots called Gen AI Personas, with unique personalities to appeal to young users.\r\n\r\nAdditionally, Meta introduced the Shepherd large language model (LLM) process to combat generative AI's inaccurate information, analyzing responses from other LLMs to provide suggestions and refinements.\r\n\r\nAmazon, which is riding on its AI-powered solution Amazon Bedrock, recently announced the integration of Redis Enterprise Cloud’s vector database capabilities with Bedrock, allowing customers to streamline application development by utilizing a fully managed and high-performance database and facilitating easy API usage of leading foundation models (FMs).\r\n\r\nFurther, AMZN partnered with Anthropic to accelerate the development of Anthropic's FMs, enabling Amazon Web Services’ customers to access these models through Amazon Bedrock, enhancing existing applications and creating new customer experiences.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nAmazon.com, Inc. (AMZN) : Free Stock Analysis Report\n\nMicrosoft Corporation (MSFT) : Free Stock Analysis Report\n\nAlphabet Inc. (GOOGL) : Free Stock Analysis Report\n\nMeta Platforms, Inc. (META) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/alphabets-googl-google-unveils-ai-162600643.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.003, "neu": 0.861, "pos": 0.136}}, {"date": "2023-09-25T16:25:07+00:00", "title": "20 Easiest Jobs That Pay $100K", "content": "In this article, we will look at the 20 easiest jobs that pay $100K. If you want to skip our in-depth analysis, head straight to the 5 Easiest Jobs that Pay $100K.\n\nWe live in a world where hard work is often associated with long hours and countless sacrifices, and hence, the notion of securing a six-figure income while enjoying a comfortable work-life balance may sound like a dream. However, it's not just a fantasy. There are indeed jobs out there that offer a desirable paycheck without subjecting you to the relentless grind of a 70-hour workweek. However, before exploring such jobs, we will look at some common trends in employment around the world that have made many jobs easier despite being high-paying.\n\nHow Freelancing and Remote Work Are Making High Paying Jobs Easier?\n\nWhile we know that the employment landscape has undergone a profound transformation in recent years especially after Covid-19, ushering in two key trends that have revolutionized how people approach work: the rise of freelancing and the prevalence of remote work. Moreover, platforms like Upwork Inc (NASDAQ:UPWK) and Gitlab Inc (NASDAQ:GTLB) have truly facilitated and made these trends a new normal on a global scale.\n\nAccording to Upwork Inc (NASDAQ:UPWK), world's leading work marketplace, the rise in freelancing activities in 2022 contributed $1.35 trillion to the US economy in annual earnings. Moreover, Upwork Inc (NASDAQ:UPWK) reports that 39% of the US workforce, or approximately 60 million Americans, engaged in freelance work in the past year — a record high. This showcases a fundamental change in the labor landscape, as skilled professionals seek the flexibility and autonomy that freelancing offers, while companies increasingly turn to independent talent to fill critical skills gaps.\n\nIt is worth noting that the demand for freelancers on Upwork Inc (NASDAQ:UPWK) is soaring, with certain skills experiencing unbeatable year-over-year growth.\n\nRemote work has firmly established itself as a transformative trend in the world of employment. According to Forbes, as of 2023, 12.7% of full-time employees have embraced remote work, while an even more substantial 28.2% have opted for a hybrid work model. Moreover, there are projections that by 2025, approximately 22% of the American workforce, equivalent to 32.6 million individuals, will be working remotely. Moreover, 98% express a desire to work remotely at least part of the time. To read more about remote work, check our article about the best work-from-home jobs for 2023.\n\nStory continues\n\nOwing to the popularity of remote work, GitLab Inc (NASDAQ:GTLB)’s remote-only approach has yielded impressive results. The company's fiscal Q2 report for July 2023 revealed a revenue of $139.6 million which surpassed consensus estimates by 7.6%. Total RPO (Revenue Performance Obligation) increased by 37% YoY to reach $496 million.\n\nMoreover, GitLab Inc (NASDAQ:GTLB)'s gross margin stood at 91% and marked a year-over-year improvement of 200 basis points. Moreover, the company generated a robust cash flow from operations, totaling $27.1 million.\n\nIt is worth highlighting that GitLab Inc (NASDAQ:GTLB)’s success extends beyond financial metrics. In terms of customer growth, GitLab Inc (NASDAQ:GTLB) added 409 new base customers with annual recurring revenue (ARR) of at least $5,000 in fiscal Q2. The total number of base customers reached 7,815 with a 33% year-over-year increase.\n\nWhat's worth noting is that remote work and freelancing have together made many high-paying jobs easier. The hours are flexible, there are less chances for burnout, the work-life balance is good for such jobs and the overall job satisfaction is also higher. In our coverage of 30 High-Paying Remote Jobs, there are many jobs that pay exceptionally well in a freelancing setting. For example, Digital Marketers are highly employable as freelancers and earn an average base salary of $62,522, while web designers can an average base salary of $57,233.\n\nFurther, there are many stats that show that remote workers, on average, earn higher than their in-office counterparts. For instance, according to a 2022 report by Hired, remote workers in the tech industry earn more than their in-office counterparts in 15-17% of the global tech markets. Remote workers are also twice as likely to earn higher than in-office workers in the same industry above the local median salary. This was noted by Gusto. Lastly, a study conducted by Ringover in 2023 found that remote-working Americans earn 9.7% more than in-office working Americans. 20 Easiest Jobs That Pay $100K\n\nCopyright: seenad / 123RF Stock Photo\n\nOur Methodology\n\nWe understand that ease of a job often depends on various factors, but we have tried to define easy jobs with some common patterns. We have included jobs with limited physical demands, lower stress levels, and predictable routines and equated them with being easy. Hence, jobs with a combination of these factors have been shortlisted. Most of these jobs either do not require a strict educational background but in case they do, it's not more than a bachelor’s degree. Some jobs may, however, require specialized certifications or years of experience. Thus, to rank the easiest jobs that pay $100K, we have relied on average salaries. We have obtained data for average salaries from our database, in case of non-availability, we have relied on average salary data from Glassdoor.com.\n\nHere is a list of the easiest jobs that pay $100K\n\n20. Equity Research Associate\n\nAverage Salary: $100,946\n\nEquity Research Associates are often highly paid in the US owing to the crucial role they play in providing valuable financial analysis and recommendations to investors. Companies like Goldman Sachs Group Inc (NYSE:GS) hire them. It is one of the easiest jobs that pay $100K.\n\n19. Professional Sleeper\n\nAverage Salary: $101,159\n\nProfessional sleepers are sought by companies, such as mattress manufacturers like Tempur Sealy International Inc (NYSE:TPX), to rigorously test products. Their job involves quality assurance in the competitive mattress industry. It is also one of the dream jobs you didnt know existed.\n\n18. SEO Director\n\nAverage Salary: $102,102\n\nSEO Directors are usually well-compensated because they boost online visibility and revenue for businesses. Big companies like Amazon.com, inc (NASDAQ:AMZN) hire them for strategic SEO management. A bachelor's degree in marketing is an ideal qualification for this role. However, experience in SEO specialization is the key to reaching this position.\n\n17. Private Island Caretaker\n\nAverage Salary: $102,585\n\nBig businesses hire private island caretakers to maintain exclusive retreats and provide elite experiences for high-paying clientele. It is one of the unusual jobs that pay over $100K. To read more about such jobs, check out our article about cool jobs you have never heard of.\n\n16. HR manager\n\nAverage Salary: $103,685\n\nHR Managers oversee crucial functions like hiring and employee well-being. While technology streamlines their tasks which often makes their jobs easy, their strategic role in shaping company culture, maintaining compliance, and attracting talent makes them indispensable to large businesses. Hence, it is one of the easiest jobs in the world that pays well. It is also one of the highest-paying social sciences jobs that are high in demand.\n\n15. Senior Editor\n\nAverage Salary: $104,135\n\nSenior editors are highly important for maintaining content quality, consistency, and brand voice. They ensure accuracy and reader engagement and hence, uphold a company's reputation and credibility in the competitive world of publishing and communication. It is one of theeasiest but highest-paid jobs.\n\n14. Fire Chief\n\nAverage Salary: $104,523\n\nFire Chiefs are highly paid for their critical role in managing emergency services and safeguarding lives and property. While their job may seem routine, the responsibility of public safety justifies their compensation. From becoming an entry-level firefighter to a fire chief, one would require years of experience and certifications along the way to climb the ranks in the business\n\n13. Scrum Master\n\nAverage Salary: $106,213\n\nScrum Masters facilitate efficient teamwork in software development. Their expertise ensures smooth project execution which enhances productivity and delivers quality software, making their role indispensable. It is one of the easiest jobs that pay $100K. To read more about similar jobs and industries, check out our article about the highest-paying countries for project managers.\n\n12. Software Tester\n\nAverage Salary: $110,935\n\nSoftware testers often command competitive salaries because of their pivotal role in ensuring software quality and minimizing defects. Their meticulous testing guarantees reliable products which has the potential to safeguard a company's reputation and customer satisfaction. To become a software tester, a minimum of bachelor’s degree is required.\n\n11. Dispatcher\n\nAverage Salary: $111,529\n\nDispatchers manage communication between emergency services, such as police, fire, and medical responders, and those in need. They receive and prioritize calls, dispatch the appropriate units, and provide critical information to responders. It is also one of the highest paying jobs for 18 year olds.\n\n10. Voice Over Artist\n\nAverage Salary: $111,531\n\nVoice-over artists essentially bring scripts to life. Their distinct voices convey messages effectively in different media which are highly sought after in advertising and entertainment industries. It is one of thehigh paying remote jobs without a degree or experience.\n\n9. Procurement Manager\n\nAverage Salary: $124,900\n\nCompanies like Amazon.com, Inc (NASDAQ:AMZN), Walmart Inc (NYSE:WMT), and Apple Inc (NASDAQ:AAPL) hire them as they help companies reduce costs, improve supplier relationships and maintain product quality which contributes to enhanced profitability and competitiveness.\n\n8. Physician Assistant\n\nAverage Salary: $126,319\n\nPhysician Assistants in the US are addressing the growing demand for healthcare services. While they may have less experience than physicians, their ability to provide quality care and expand access to healthcare in underserved areas explains why they are well-paid. It is one of the easiest jobs that pay $100K without experience.\n\n7. Full Stack Developer\n\nAverage Salary: $128,163\n\nThe versatility of full-stack developers streamlines projects and reduces costs for businesses which makes them invaluable for companies. Full-stack developers are thus highly paid as they have expertise in both front-end and back-end software development. It is one of the jobs that pay $100K without a degree.\n\n6. Sales Manager\n\nAverage Salary: $130,302\n\nCompanies such as Salesforce Inc (NYSE:CRM) and Microsoft Corp (NASDAQ:MSFT) employ sales managers as they work to improve customer relationships and expand market reach which eventually leads to profitability. It is one of the easiest jobs that pay $100K.\n\nClick here to see the 5 Easiest Jobs That Pay $100K.\n\nSuggested Articles:\n\n25 High-Paying Jobs for 18 Year Olds with no Experience 15 Part-Time Jobs for 18 Year Olds with no Experience Required 16 Jobs that will Disappear in the Future Due to AI\n\nDisclosure: None. 20 Easiest Jobs That Pay $100K is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/20-easiest-jobs-pay-100k-162507465.html", "symbols": ["AAPL.US", "AMZN.US", "CRM.US", "GS.US", "GTLB.US", "MSFT.US", "TPX.US", "UPWK.US", "WMT.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.042, "neu": 0.819, "pos": 0.139}}, {"date": "2023-09-25T16:18:40+00:00", "title": "Hollywood Strike Set to Conclude With Tentative Agreement Boosting Media Stocks", "content": "The prolonged strike that had significantly disrupted Hollywood's TV and film production is expected to end following a tentative agreement between writers and studios, announced late Sunday. The deal, set to last for three years, has yet to have its specifics disclosed but is believed to include increased royalties and minimum staffing levels for writers. Safeguards against the application of artificial intelligence in the industry are also part of this agreement.\n\nThe resolution came after five days of continuous negotiations involving top executives from Warner Bros. Discover, Disney, Netflix (NASDAQ:NFLX), and NBCUniversal Studios. Notably, the strike had seen actors standing alongside writers, hinting at a potential similar resolution for them in the future.\n\nStudios had previously noted that the strike led to short-term financial savings in their earnings statements. However, they simultaneously acknowledged that the lack of new content could negatively impact their long-term financial performance.\n\nIn response to the news of the agreement, Monday's premarket trading witnessed a rise in media stocks. Paramount's shares surged by 4%, while Netflix saw a 0.6% increase. Amazon (NASDAQ:AMZN)'s stocks also advanced by 0.4%, Dish Network (NASDAQ:DISH) experienced a 1.4% gain, and both Disney and Comcast (NASDAQ:CMCSA) recorded gains as well.\n\nWriters will only resume work once all aspects of the agreement have been finalized. The specifics of these provisions remain undisclosed at present, keeping the industry in anticipation.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.\n\nRelated Articles\n\nHollywood Strike Set to Conclude With Tentative Agreement Boosting Media Stocks\n\nBritain signs state-level trade accord with Washington\n\nFord pauses work on $3.5 billion battery plant in Michigan", "link": "https://finance.yahoo.com/news/hollywood-strike-set-conclude-tentative-161840950.html", "symbols": ["AMZN.US", "CMCSA.US", "DISH.MX", "DISH.US", "EOT.F", "NFLX.US"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.03, "neu": 0.791, "pos": 0.179}}, {"date": "2023-09-25T16:11:34+00:00", "title": "Amazon.com Inc (AMZN): A Deep Dive into Financial Metrics and Competitive Strengths", "content": "Amazon.com Inc (NASDAQ:AMZN) has recently been in the spotlight, drawing interest from investors and financial analysts due to its robust financial stance. With shares currently priced at $130.65, Amazon.com Inc has witnessed a daily gain of 1.18%, marked against a three-month change of 0.62%. A thorough analysis, underlined by the GF Score, suggests that Amazon.com Inc is well-positioned for substantial growth in the near future.\n\nWarning! GuruFocus has detected 8 Warning Sign with AMZN. Click here to check it out.  AMZN 30-Year Financial Data The intrinsic value of AMZN Amazon.com Inc (AMZN): A Deep Dive into Financial Metrics and Competitive Strengths\n\nUnderstanding the GF Score\n\nThe GF Score is a stock performance ranking system developed by GuruFocus using five aspects of valuation, which has been found to be closely correlated to the long-term performances of stocks by backtesting from 2006 to 2021. The stocks with a higher GF Score generally generate higher returns than those with a lower GF Score. Therefore, when picking stocks, investors should invest in companies with high GF Scores. The GF Score ranges from 0 to 100, with 100 as the highest rank.\n\nFinancial strength rank: 6/10 Profitability rank: 8/10 Growth rank: 10/10 GF Value rank: 9/10 Momentum rank: 9/10\n\nEach one of these components is ranked and the ranks also have positive correlation with the long term performances of stocks. The GF score is calculated using the five key aspects of analysis. Through backtesting, we know that each of these key aspects has a different impact on the stock price performance. Thus, they are weighted differently when calculating the total score. With a high growth rank and a slightly lower financial strength rank, GuruFocus assigned Amazon.com Inc the GF Score of 94 out of 100, which signals the highest outperformance potential.\n\nAmazon.com Inc Business Overview\n\nAmazon.com Inc, with a market cap of $1.35 trillion and sales of $538.05 billion, is a leading online retailer and one of the highest-grossing e-commerce aggregators. In 2021, it reported $386 billion in net sales and approximately $578 billion in estimated physical/digital online gross merchandise volume. Retail-related revenue represents approximately 80% of the total, followed by Amazon Web Services' cloud computing, storage, database, and other offerings (10%-15%), advertising services (5%), and other. International segments constitute 25%-30% of Amazon's non-AWS sales, led by Germany, the United Kingdom, and Japan.\n\nStory continues Amazon.com Inc (AMZN): A Deep Dive into Financial Metrics and Competitive Strengths\n\nFinancial Strength Analysis\n\nAccording to the Financial Strength rating, Amazon.com Inc's robust balance sheet exhibits resilience against financial volatility, reflecting prudent management of capital structure. The Interest Coverage ratio for Amazon.com Inc stands impressively at 5.96, underscoring its strong capability to cover its interest obligations. With a favorable Debt-to-Revenue ratio of 0.26, Amazon.com Inc's strategic handling of debt solidifies its financial health.\n\nProfitability Rank Breakdown\n\nThe Profitability Rank shows Amazon.com Inc's impressive standing among its peers in generating profit. Amazon.com Inc's strong Predictability Rank of 4.5 stars out of five underscores its consistent operational performance, providing investors with increased confidence.\n\nGrowth Rank Breakdown\n\nRanked highly in Growth, Amazon.com Inc demonstrates a strong commitment to expanding its business. The company's 3-Year Revenue Growth Rate is 21.9%, which outperforms better than 83.78% of 1048 companies in the Retail - Cyclical industry. Moreover, Amazon.com Inc has seen a robust increase in its earnings before interest, taxes, depreciation, and amortization (EBITDA) over the past few years. Specifically, the three-year growth rate stands at 0.5, and the rate over the past five years is 23.2. This trend accentuates the company's continued capability to drive growth. Amazon.com Inc (AMZN): A Deep Dive into Financial Metrics and Competitive Strengths\n\nConclusion\n\nGiven Amazon.com Inc's financial strength, profitability, and growth metrics, the GF Score highlights the firm's unparalleled position for potential outperformance. This analysis underscores the importance of considering these key financial metrics when making investment decisions. GuruFocus Premium members can find more companies with strong GF Scores using the following screener link: GF Score Screen\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/amazon-com-inc-amzn-deep-161134312.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.02, "neu": 0.787, "pos": 0.194}}, {"date": "2023-09-25T15:26:31+00:00", "title": "Amazon invests up to $4 billion in AI startup Anthropic, intensifying cloud tech competition", "content": "Amazon (NASDAQ:AMZN) announced on Monday that it will invest up to $4 billion in the artificial intelligence startup Anthropic. The investment is seen as a strategic move by the tech giant to maintain its competitive edge in the rapidly evolving AI sector, particularly against rivals Microsoft (NASDAQ:NASDAQ:MSFT) and Google (NASDAQ:NASDAQ:GOOGL).\n\nAs part of the deal, Amazon's cloud customers will gain early access to Anthropic's technology via Amazon Bedrock, the company's AI platform for businesses. Furthermore, Anthropic committed to primarily relying on Amazon's cloud services, including training its future AI models on large quantities of proprietary chips purchased from Amazon.\n\nThe immediate investment by Amazon will be $1.25 billion, with the option for either party to trigger an additional $2.75 billion in funding from Amazon. Despite the substantial investment, Amazon confirmed it would not gain a board seat and that its stake amounted to a minority position.\n\nAnthropic, founded in 2021 by former OpenAI employees Dario and Daniela Amodei, recently launched its AI assistant named Claude. This product is viewed as a direct competitor to ChatGPT, a creation of OpenAI.\n\nThis move mirrors similar strategies adopted by other tech giants. Since 2019, Microsoft has invested billions of dollars into its partnership with OpenAI, giving its customers special access to the startup's prose-writing, image-generating technology. Google also invested in Anthropic's $450-million fundraise in May and maintains an ongoing relationship with the startup.\n\nAmazon's investment could potentially boost demand for chips powering AI. Anthropic agreed to work on developing technology for Amazon's in-house Trainium and Inferentia chips.\n\nThe deal represents perhaps Amazon's most significant response yet to challenges from smaller cloud rivals that have marketed or developed powerful AI this year. It also indicates ongoing maneuvering by cloud companies to secure ties with AI startups reshaping their industry.\n\nStory continues\n\nAdam Selipsky, Amazon Web Services's CEO, said the partnership with Anthropic will allow Amazon's employees and cloud customers to infuse their businesses with cutting-edge technology.\n\nThe rapid growth of the AI industry is unmistakable, and Amazon's hefty investment in Anthropic underscores its resolve not to be left behind by competitors like Microsoft. This move represents another step in Amazon's continuous expansion into the increasingly competitive AI sector.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.\n\nRelated Articles\n\nAmazon invests up to $4 billion in AI startup Anthropic, intensifying cloud tech competition\n\nNTSB probes JetBlue flight that experienced severe turbulence, injuring eight\n\nCosmetics maker Coty submits application to list on Paris Stock Exchange", "link": "https://finance.yahoo.com/news/amazon-invests-4-billion-ai-152631771.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZN.US", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.016, "neu": 0.846, "pos": 0.138}}, {"date": "2023-09-25T14:35:00+00:00", "title": "Amazon investment aims to close AI gap with Google, Microsoft", "content": "Amazon is looking to close the AI gap with rivals Google and Microsoft with a potential $4 billion investment in the San Francisco startup Anthropic.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9a5c767e-f81e-3f5f-a1d0-5eefc9da9fbb/amazon-investment-aims-to.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0, "neu": 0.936, "pos": 0.064}}, {"date": "2023-09-25T12:45:36+00:00", "title": "Hollywood writers reach tentative deal with studios to end historic strike", "content": "Hollywood writers reached a tentative agreement with studios on Sundayto end a historic strike that started in early May and has lasted nearly 150 days.\n\nThe details of the deal with the Alliance of Motion Picture and Television Producers (AMPTP), which bargains on behalf of the major studios including Warner Bros. (WBD), Disney (DIS), Netflix (NFLX), Amazon (AMZN), Apple (AAPL), and NBCUniversal (CMCSA), Paramount (PARA), and Sony (SONY), have not yet been released as the two sides are still drafting final contract language.\n\nThe Writers Guild of America (WGA) had been fighting for higher compensation, increases to streaming residuals, transparency around viewership data, a guaranteed minimum length of employment, writing room staffing requirements, and further protections surrounding the use of artificial intelligence.\n\nThe two sides had resumed talks on Wednesday after over a month of no communication.\n\n“What we have won in this contract – most particularly, everything we have gained since May 2nd – is due to the willingness of this membership to exercise its power, to demonstrate its solidarity, to walk side-by-side, to endure the pain and uncertainty of the past 146 days,” the WGA wrote in a letter to members on Sunday.\n\n\"We can say, with great pride, that this deal is exceptional – with meaningful gains and protections for writers in every sector of the membership,” the union added.\n\nShares of media companies including Netflix, Disney and Warner Bros. Discovery rose in premarket trading Monday.\n\nThe actors strike, still ongoing, is largely expected to reach a similar conclusion, although the union, SAG-AFTRA, said to members in an e-mail on Sunday, “While we look forward to reviewing the WGA and AMPTP’s tentative agreement, we remain committed to achieving the necessary terms for our members.”\n\nThe actors' union has been on strike for more than 70 days so far.\n\nBoth unions had been fighting for more protections surrounding the role of artificial intelligence in media and entertainment, in addition to higher streaming residuals as more movies and TV shows go direct to streaming.\n\nStory continues\n\nIndustry watchers have said the \"double whammy\" work stoppage will likely have serious economic implications. Meredith Stiehm, president of the Writers Guild of America, pickets outside Paramount Pictures studio, Monday, May 8, 2023, in Los Angeles. (AP Photo/Chris Pizzello)\n\nLast month, Kevin Klowden, chief global strategist at the Milken Institute, estimated the strikes could cost the national economy $5 billion-plus, primarily due to lost wages.\n\nAccording to data released by the Bureau of Labor Statistics, employment in motion picture and sound recording industries decreased by 17,000 in August, \"reflecting strike activity.\" It was the first time the strikes registered a hit to the monthly jobs report.\n\nAlexandra Canal is a Senior Reporter at Yahoo Finance. Follow her on Twitter @allie_canal, LinkedIn, and email her at alexandra.canal@yahoofinance.com.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/hollywood-writers-reach-tentative-deal-with-studios-to-end-historic-strike-124536082.html", "symbols": ["0VV.F", "0VVB.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "CMCS34.SA", "CMCSA.MX", "CMCSA.US", "CTP2.F", "DIS.MX", "DIS.US", "DISB34.SA", "NFC.F"], "tags": [], "sentiment": {"polarity": 0.96, "neg": 0.053, "neu": 0.86, "pos": 0.087}}, {"date": "2023-09-25T11:14:23+00:00", "title": "5 Things to Know Before Markets Open", "content": "A tentative agreement to end the Hollywood writers’ strike sent shares of media companies higher and Amazon is investing $4 billion in OpenAI rival Anthropic. Here’s what investors need to know today.\n\nContinue reading", "link": "https://finance.yahoo.com/m/367a259d-effe-39a7-9c21-19b3bff11732/5-things-to-know-before.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.681, "neg": 0.04, "neu": 0.771, "pos": 0.189}}, {"date": "2023-09-25T11:00:00+00:00", "title": "4 Ways to Grow $100,000 Into $1 Million in Retirement Savings", "content": "Not sure how to make your money grow? Consider all these methods, on their own, or even better -- together!\n\nContinue reading", "link": "https://finance.yahoo.com/m/e031b836-dc40-3603-b241-1c65891e8a0a/4-ways-to-grow-%24100%2C000-into.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GSPC.INDX"], "tags": [], "sentiment": {"polarity": 0.424, "neg": 0.056, "neu": 0.814, "pos": 0.13}}, {"date": "2023-09-25T10:20:23+00:00", "title": "Amazon is investing up to $4 billion in AI startup Anthropic in growing tech battle", "content": "Amazon is investing up to $4 billion in Anthropic and taking a minority stake in the artificial intelligence startup, the two companies said Monday.\n\nThe investment underscores how Big Tech companies are pouring money into AI as they race to capitalize on the opportunities that the latest generation of the technology is set to fuel.\n\nAmazon and Anthropic said the deal is part of a broader collaboration to develop so-called foundation models, which underpin the generative AI systems that have captured global attention.\n\nFoundation models, also known as large language models, are trained on vast pools of online information, like blog posts, digital books, scientific articles and pop songs to generate text, images and video that resemble human work.\n\nUnder the agreement, Anthropic is making Amazon its primary cloud computing service and using the online retail giant's custom chips as part of work to train and deploy its generative AI systems.\n\nSan Francisco-based Anthropic was founded by former staffers from OpenAI, the maker of the ChatGPT AI chatbot that made a global splash with its ability to come up with answers mimicking human responses.\n\nAnthropic has released its own ChatGPT rival, dubbed Claude. The latest version, which is available in the U.S. and U.K., is capable of “sophisticated dialogue and creative content generation to complex reasoning and detailed instruction,” the company said.\n\nAmazon is scrambling to catch up with rivals like Microsoft, which invested $1 billion in OpenAI in 2019, followed by another multibillion-dollar investment at the start of year.\n\nAmazon has been rolling out new services to keep up with the AI arms race, including an update for its popular assistant Alexa so users can have more human-like conversations and AI-generated summaries of product reviews for consumers.", "link": "https://finance.yahoo.com/news/amazon-investing-4-billion-ai-102023659.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.98, "neg": 0, "neu": 0.891, "pos": 0.109}}, {"date": "2023-09-25T10:12:00+00:00", "title": "Amazon kick-starts AI cloud ramp with $4 billion investment in Anthropic", "content": "Amazon is looking to close the AI gap on its big tech rivals Google and Microsoft with a potential $4 billion investment in San Francisco-based startup Anthropic.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9a5c767e-f81e-3f5f-a1d0-5eefc9da9fbb/amazon-kick-starts-ai-cloud.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0, "neu": 0.941, "pos": 0.059}}, {"date": "2023-09-25T09:57:00+00:00", "title": "These Stocks Are Moving the Most Today: Paramount, Warner Bros. Discovery, Amazon, HP Inc., Nike, Instacart, and More", "content": "Media stocks rise as striking writers reached a tentative agreement with Hollywood studios that would end a monthslong strike, while Amazon will be investing up to $4 billion in artificial-intelligence company Anthropic.\n\nContinue reading", "link": "https://finance.yahoo.com/m/8f0ebf8d-f7bf-3573-be8f-3927889bf07d/these-stocks-are-moving-the.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.586, "neg": 0.042, "neu": 0.782, "pos": 0.176}}, {"date": "2023-09-25T09:42:20+00:00", "title": "U.S. stocks are falling on fears of higher rates, looming government shutdown", "content": "Investing.com -- U.S. stocks are falling on Monday heading into the end of the third quarter, with investors still feeling the pressure of the Federal Reserve’s hawkish stance and bracing for the increasing chance that the federal government will shut down.\n\nAt 9:36 ET (13:36 GMT), the Dow Jones Industrial Average was down 74 points or 0.2%, while the S&P 500 was down 0.3%, and the NASDAQ Composite was down 0.4%.\n\nWall Street indices suffer weak month\n\nThe main indices on Wall Street look set to enter the final week of September on a negative note, with the indication from the U.S. central bank that interest rates will remain elevated for longer than expected weighing heavily.\n\nThe tech sector has been hardest hit, with the Nasdaq on track to slump 5.9% this month, potentially its biggest monthly loss since December. The broad-based S&P 500 is set to drop 4.2% this month, while the blue-chip Dow Jones Industrial Average has shed 2.2%.\n\nThe Fed held rates steady last week, but signaled it might raise them one more time this year. It also pointed to only two rate cuts next year, half the number they anticipated in their last round of forecasts in June.\n\nThere are a number of U.S. central bank officials scheduled to speak this week, starting with Minneapolis Fed President Neel Kashkari later Monday. Their comments will be studied carefully for clues of future policy moves, particularly with key inflation data due for release at the end of the week.\n\nBudget stand-off continues\n\nAlso weighing on sentiment is Congress' ongoing budget stand-off, with the federal government set to run out of funding for its operations at the start of October unless lawmakers can hammer out a deal.\n\nOver the weekend, Democrats and Republicans in Congress both warned that there is a chance a deal will not be reached. Even a plan to create a 45-day extension to government funding to give legislators more time coming up against strong resistance by a handful of GOP holdouts in the House.\n\nStory continues\n\nWashington's latest budgetary showdown comes only a few months after a battle over the U.S. debt limit almost brought the world's largest economy to the brink of a damaging default.\n\nAmazon seeks to boost AI position\n\nIn corporate news, Amazon (NASDAQ:AMZN) said on Monday that it is aiming to invest up to $4 billion in artificial intelligence group Anthropic, as the tech giant looks to bolster its position in the corporate arms race over nascent AI technology. Amazon shares were flat.\n\nAdditionally, the entertainment sector could benefit from Sunday’s news that the union representing Hollywood writers reached a preliminary agreement with major studios and streaming companies on a new contract that could end their months-long strike.\n\nCrude rebounds from losing week\n\nOil prices edged higher Monday, rebounding after their first negative week in four as traders returned their focus to the prospect of tighter supplies going forward.\n\nBoth contracts fell last week after a hawkish Federal Reserve stance raised concerns of a hit to economic activity and thus oil demand in the largest consumer in the world.\n\nHowever, prices remain near their highest levels since November last year on forecasts of a wide crude supply deficit in the fourth quarter in the wake of Saudi Arabia and Russia extending additional supply cuts to the end of the year.\n\n(Oliver Gray contributed to this item.)\n\nRelated Articles\n\nU.S. stocks are falling on fears of higher rates, looming government shutdown\n\nSite Centers Corp Announces $0.13 per Share Dividend, Despite Declining Growth Rate\n\nBig media shares shed gains as focus shifts to actors' strike", "link": "https://finance.yahoo.com/news/u-stocks-falling-fears-higher-094220217.html", "symbols": ["AMZN.US", "DJI.INDX", "IXIC.INDX"], "tags": [], "sentiment": {"polarity": -0.833, "neg": 0.104, "neu": 0.805, "pos": 0.091}}, {"date": "2023-09-25T09:30:00+00:00", "title": "A Bull Market Could Be Here: 3 Reasons to Buy Amazon Stock", "content": "The S&P 500 Index has climbed more than 20% from its bear market low, prompting many to call a bull market. One of those players is Amazon (NASDAQ: AMZN). Amazon is a leader in the high-growth markets of e-commerce and cloud computing.\n\nContinue reading", "link": "https://finance.yahoo.com/m/fe3ccd83-9d8f-386f-80b2-93d88bc21061/a-bull-market-could-be-here%3A.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.077, "neg": 0.047, "neu": 0.876, "pos": 0.076}}, {"date": "2023-09-25T09:28:00+00:00", "title": "Amazon to Invest Up to $4 Billion in AI Start-Up Anthropic. It’s a Warning to Big Tech Rivals.", "content": "Amazon’s cloud customers will get early access to Anthropic’s technology through Amazon Bedrock, the company’s generative AI platform for businesses.\n\nContinue reading", "link": "https://finance.yahoo.com/m/308362e0-2d84-3f5e-9dfc-5cf7e9eae723/amazon-to-invest-up-to-%244.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0, "neu": 0.925, "pos": 0.075}}, {"date": "2023-09-25T09:21:00+00:00", "title": "Which High-Profile Stock-Split Stock Is the Cheapest? Get Ready to Be Shocked...", "content": "Among Nvidia, Amazon, DexCom, Shopify, Alphabet, Tesla, Palo Alto Networks, Monster Beverage, and Novo Nordisk, there's one clear-cut stock-split stock that's notably cheaper than the rest.\n\nContinue reading", "link": "https://finance.yahoo.com/m/10f5a2d0-c3cd-36bf-92f7-3074b602e2fd/which-high-profile.html", "symbols": ["307.F", "5AP.F", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "NONOF.US", "NOVA.F", "NOVC.F", "NOVC.XETRA"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0, "neu": 0.941, "pos": 0.059}}, {"date": "2023-09-25T07:48:00+00:00", "title": "Amazon to Invest Up to $4 Billion in Anthropic as AI Arms Race Escalates", "content": "The deal, which includes a broad partnership, follows Microsoft’s multibillion-dollar stake in rival startup OpenAI.\n\nContinue reading", "link": "https://finance.yahoo.com/m/aa665723-8d3c-3571-be67-7f8f7a937b6d/amazon-to-invest-up-to-%244.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-09-25T07:34:17+00:00", "title": "Amazon, Warner Bros, and Dow rise premarket; Nio, Nike, HP fall", "content": "Investing.com -- U.S. futures edged lower Monday, with investors still reeling from last week’s hawkish Federal Reserve meeting, while a U.S. government shutdown draws nearer.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nAmazon (NASDAQ:AMZN) stock rose 0.5% after the tech giant announced plans to invest up to $4 billion in artificial intelligence group Anthropic, in an attempt to bolster its position in nascent AI technology.\n\nWarner Bros Discovery (NASDAQ:WBD) stock rose 2.1%, Netflix (NASDAQ:NFLX) rose 0.8% and Walt Disney  (NYSE:DIS) rose 0.3% as these entertainment giants benefited from the news that Hollywood's writers union reached a preliminary labor agreement with major studios on Sunday, likely ending strikes that have halted most film and television production.\n\nNio (NYSE:NIO) ADRs fell 6.8% after the Chinese EV manufacturer announced it was considering raising $3B from investors.\n\nNike  (NYSE:NKE) stock fell 1.4% after Jefferies downgraded the sportswear giant to ‘hold’ from ‘buy’, citing increased risk due to ongoing pressure on the wholesale channel and macroeconomic challenges in China.\n\nHP (NYSE:HPQ) stock fell 3.7% after Warren Buffett's Berkshire Hathaway (NYSE:BRKa) sold nearly 4.8 million shares of the PC-maker.\n\nDow (NYSE:DOW) stock rose 1.4% after JPMorgan upgraded its stance on the chemicals giant the company to ‘overweight’ from ‘neutral’, citing a robust balance sheet, a hefty dividend yield and ample upside.\n\nRocket Companies (NYSE:RKT) stock rose 3.1% after CFRA upgraded the mortgage loan provider to ‘hold’ from ‘sell’, saying its diversified businesses and available liquidity resources position it well.\n\nAstraZeneca (NASDAQ:AZN) ADRs rose 1.7% after Jefferies upgraded the pharmaceutical company to ‘buy’ from ‘neutral’, noting last week’s positive results from its new lung cancer drug.\n\nHarmony Biosciences (NASDAQ:HRMY) stock fell 3.1% after Goldman Sachs downgraded the biopharmaceutical company to ‘sell’ from ‘neutral’, seeing emerging risks to the durability of its revenue stream.\n\nStory continues\n\nRelated Articles\n\nAmazon, Warner Bros, and Dow rise premarket; Nio, Nike, HP fall\n\nAir Canada Expands Fleet With Boeing 787-10 Dreamliners, Enhancing Sustainability and Passenger Experience\n\nWall St opens lower on lingering concerns over elevated rates", "link": "https://finance.yahoo.com/news/amazon-warner-bros-dow-rise-073417097.html", "symbols": ["2OY.F", "2OY.STU", "7HP.F", "7HP.STU", "7HP.XETRA", "AMZN.US", "AZN.US", "BRKA.US", "DIS.MX", "DIS.US", "DISB34.SA", "DOW.US", "HPQ.MX", "HPQ.US", "HRMY.US", "NFLX.US", "NIKE34.SA"], "tags": [], "sentiment": {"polarity": 0.875, "neg": 0.049, "neu": 0.864, "pos": 0.087}}, {"date": "2023-09-25T07:05:35+00:00", "title": "Amazon steps up AI race with up to $4 billion deal to invest in Anthropic", "content": "By Jeffrey Dastin\n\nSAN FRANCISCO (Reuters) - Amazon.com on Monday said it will invest up to $4 billion in cash in the high-profile startup Anthropic, in its effort to compete with growing cloud rivals on artificial intelligence.\n\nAmazon's employees and cloud customers will gain early access to technology from Anthropic as part of the deal, which they can infuse into their businesses. The San Francisco-based startup also committed to rely primarily on Amazon's cloud services, including training its future AI models on large quantities of proprietary chips it would buy from the online retailing and computing giant.\n\nIn a joint interview, the CEOs of Amazon's cloud division and Anthropic said the immediate investment will be $1.25 billion, with either party having the authority to trigger another $2.75 billion in funding by Amazon.\n\nThey declined to state how much Amazon now would own of Anthropic or the startup's updated valuation, last estimated at more than $4 billion. Amazon said it would not gain a board seat and that its stake amounted to a minority position.\n\nThe news represents perhaps Amazon's biggest answer yet to challenges from Microsoft and Alphabet's Google, smaller cloud rivals that have marketed or developed powerful AI this year. The deal also shows ongoing maneuvering by the cloud companies to secure ties with AI startups reshaping their industry.\n\nSince 2019, Microsoft has put billions of dollars into its partnership with ChatGPT's creator OpenAI, giving its customers special access to the startup's prose-writing, image-generating technology.\n\nGoogle meanwhile helped pioneer this branch of AI and in May invested in Anthropic's $450-million fundraise, in a relationship the startup said is not going away.\n\nFor Amazon, Monday's deal may spell an uptick in demand, including for chips powering AI. Anthropic agreed to work on developing technology for Amazon's in-house Trainium and Inferentia chips, for instance.\n\nStory continues\n\nAdam Selipsky, Amazon Web Services's CEO, said the pact \"will help make Anthropic's models better, will help make our chip technology and our AI infrastructure better.\"\n\nDario Amodei, Anthropic's CEO, said his company \"has obtained the money in a way that allows it to prioritize safety\" and \"allows us to continue to scale up our models.\"\n\nSTILL TIED TO GOOGLE\n\nAnthropic, founded by former OpenAI executives including Amodei, is one of a series of companies building so-called generative AI, systems that can draft content as if a human created it. Anthropic has aimed to distinguish its work by training AI to adhere to moral values.\n\nAmodei declined to state if its latest financing was competitive.\n\nAnthropic is continuing an agreement it announced with Google in February, he said. Anthropic is using Google's custom chips and has planned to make its technology available via Google Cloud and elsewhere.\n\nYet with Monday's deal, Anthropic is giving a boost to Amazon Bedrock, a service that has attracted thousands of users to start building AI applications.\n\nAmazon's customers will gain features from Anthropic early, such as the ability to customize their AI. Selipsky said, \"both companies are committing that, for many years to come, future versions of Claude will be available on Amazon Bedrock, and that's important.\"\n\nAnthropic's Claude 2 is an AI model that is able to respond to particularly large prompts, setting it up to analyze long business or legal documents.\n\nAmodei said the deal \"allows us to work more closely to drive enterprise usage for Claude,\" which he said represented much of the demand on Bedrock so far.\n\nLexisNexis, a data analytics company, is working with Anthropic and Amazon to make its own legal search capabilities more \"intelligent,\" Amodei said. Other customers include Bridgewater Associates and Lonely Planet, he said.\n\nAnthropic has yet to gain the name recognition or usage of OpenAI, the startup behind the GPT-4 model and ChatGPT, which is one of the fastest-growing software applications in history.\n\nAmazon has aimed to give customers a broad range of AI models so they have little reason to look afield for cloud services.\n\nAsked if Amazon would invest in additional AI startups beyond Anthropic, Selipsky said, \"I honestly don't know what the future will hold.\"\n\n(Reporting By Jeffrey Dastin in San Francisco; Editing by Kenneth Li and Chizu Nomiyama)", "link": "https://finance.yahoo.com/news/amazon-steps-ai-race-4-070535684.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.01, "neu": 0.867, "pos": 0.123}}, {"date": "2023-09-25T07:01:00+00:00", "title": "Amazon and Anthropic Announce Strategic Collaboration to Advance Generative AI", "content": "Anthropic selects AWS as its primary cloud provider and will train and deploy its future foundation models on AWS Trainium and Inferentia chips, taking advantage of AWS’s high-performance, low-cost machine learning accelerators\n\nAnthropic deepens commitment to AWS, making its future foundation models accessible to millions of developers and providing AWS customers early access to unique features for model customization, using their proprietary data, and fine-tuning capabilities, all through Amazon Bedrock\n\nSEATTLE, September 25, 2023--(BUSINESS WIRE)--Amazon (NASDAQ: AMZN) and Anthropic today announced a strategic collaboration that will bring together their respective industry-leading technology and expertise in safer generative artificial intelligence (AI) to accelerate the development of Anthropic’s future foundation models and make them widely accessible to AWS customers. As part of the expanded collaboration:\n\nAnthropic will use AWS Trainium and Inferentia chips to build, train, and deploy its future foundation models, benefitting from the price, performance, scale, and security of AWS. The two companies will also collaborate in the development of future Trainium and Inferentia technology. AWS will become Anthropic’s primary cloud provider for mission critical workloads, including safety research and future foundation model development. Anthropic plans to run the majority of its workloads on AWS, further providing Anthropic with the advanced technology of the world’s leading cloud provider. Anthropic makes a long-term commitment to provide AWS customers around the world with access to future generations of its foundation models via Amazon Bedrock, AWS’s fully managed service that provides secure access to the industry’s top foundation models. In addition, Anthropic will provide AWS customers with early access to unique features for model customization and fine-tuning capabilities. Amazon will invest up to $4 billion in Anthropic and have a minority ownership position in the company. Amazon developers and engineers will be able to build with Anthropic models via Amazon Bedrock so they can incorporate generative AI capabilities into their work, enhance existing applications, and create net-new customer experiences across Amazon’s businesses.\n\nStory continues\n\n\"We have tremendous respect for Anthropic’s team and foundation models, and believe we can help improve many customer experiences, short and long-term, through our deeper collaboration,\" said Andy Jassy, Amazon CEO. \"Customers are quite excited about Amazon Bedrock, AWS’s new managed service that enables companies to use various foundation models to build generative AI applications on top of, as well as AWS Trainium, AWS’s AI training chip, and our collaboration with Anthropic should help customers get even more value from these two capabilities.\"\n\n\"We are excited to use AWS’s Trainium chips to develop future foundation models,\" said Dario Amodei, co-founder and CEO of Anthropic. \"Since announcing our support of Amazon Bedrock in April, Claude has seen significant organic adoption from AWS customers. By significantly expanding our partnership, we can unlock new possibilities for organizations of all sizes, as they deploy Anthropic’s safe, state-of-the-art AI systems together with AWS’s leading cloud technology.\"\n\nAn AWS customer since 2021, Anthropic has grown quickly into one of the world’s leading foundation model providers and a leading advocate for the responsible deployment of generative AI. Their foundation model, Claude, excels at a wide range of tasks, from sophisticated dialogue and creative content generation to complex reasoning and detailed instruction, while maintaining a high degree of reliability and predictability. Its industry-leading 100,000 token context window can securely process extensive amounts of information across all industries, from manufacturing and aerospace to agriculture and consumer goods, as well as technical, domain-specific documents for industries such as finance, legal, and healthcare. Customers report that Claude is much less likely to produce harmful outputs, easier to converse with, and more steerable compared to other foundation models, so developers can get their desired output with less effort. Anthropic’s state-of-the-art model, Claude 2, scores above the 90th percentile on the GRE reading and writing exams, and similarly on quantitative reasoning.\n\nToday’s news is the latest AWS generative AI announcement as the company continues to expand its unique offering at all three layers of the generative AI stack. At the bottom layer, AWS continues to offer compute instances from NVIDIA as well as AWS’s own custom silicon chips, AWS Trainium for AI training and AWS Inferentia for AI inference. At the middle layer, AWS is focused on providing customers with the broadest selection of foundation models from multiple leading providers where customers can then customize those models, keep their own data private and secure, and seamlessly integrate with the rest of their AWS workloads—all of this is offered through AWS’s new service, Amazon Bedrock. With today’s announcement, customers will have early access to features for customizing Anthropic models, using their own proprietary data to create their own private models, and will be able to utilize fine-tuning capabilities via a self-service feature within Amazon Bedrock. At the top layer, AWS offers generative AI applications and services for customers like Amazon CodeWhisperer, a powerful AI-powered coding companion, which recommends code snippets directly in the code editor, accelerating developer productivity as they code.\n\nAs part of this deeper collaboration, AWS and Anthropic are committing meaningful resources that are helping customers get started with Claude and Claude 2 on Amazon Bedrock, including through the AWS Generative AI Innovation Center, where teams of AI experts will help customers of all sizes to develop new generative AI-powered applications to transform their organizations.\n\nCustomers accessing Anthropic’s current models via Amazon Bedrock are building generative AI-powered applications that help automate tasks such as producing market forecasts, developing research reports, enabling new drug discovery for healthcare, and personalizing education programs. Enterprises already taking advantage of this advanced technology include Lonely Planet, a premier travel media company celebrated for its decades of travel content; Bridgewater Associates, a premier asset management firm for global institutional investors; and LexisNexis Legal & Professional, a top-tier global provider of information and analytics serving customers in more than 150 countries.\n\n\"We are developing a generative AI solution on AWS to help customers plan epic trips and create life-changing experiences with personalized travel itineraries,\" said Chris Whyde, senior vice president of Engineering and Data Science at Lonely Planet. \"By building with Claude 2 on Amazon Bedrock, we reduced itinerary generation costs by nearly 80 percent when we quickly created a scalable, secure AI platform that organizes our book content in minutes to deliver cohesive, highly accurate travel recommendations. Now we can re-package and personalize our content in various ways on our digital platforms, based on customer preference, all while highlighting trusted local voices–just like Lonely Planet has done for 50 years.\"\n\n\"At Bridgewater, we believe the global economic machine can be understood, so we strive to build a fundamental, cause-and-effect understanding of markets and economies powered by cutting-edge technology,\" said Greg Jensen, co-CIO at Bridgewater Associates. \"Working with the AWS Generative AI Innovation Center, we are using Amazon Bedrock and Anthropic’s Claude model to create a secure large language model-powered Investment Analyst Assistant that will be able to generate elaborate charts, compute financial indicators, and create summaries of the results, based on both minimal and complex instructions. This flexible solution will accelerate the more mundane, yet still involved, steps of our research process, enabling our analysts to spend more time on the difficult and differentiated aspects of understanding markets and economies.\"\n\n\"We are working with AWS and Anthropic to host our custom, fine-tuned Anthropic Claude 2 model on Amazon Bedrock to support our strategy of rapidly delivering generative AI solutions at scale and with cutting-edge encryption, data privacy, and safe AI technology embedded in everything we do,\" said Jeff Reihl, executive vice president and CTO at LexisNexis Legal & Professional. \"Our new Lexis+ AI platform technology features conversational search, insightful summarization, and intelligent legal drafting capabilities, which enable lawyers to increase their efficiency, effectiveness, and productivity.\"\n\nAmazon and Anthropic are each engaged across a number of organizations to promote the responsible development and deployment of AI technologies, including the Organization for Economic Cooperation and Development (OECD) AI working groups, the Global Partnership on AI (GPAI), the Partnership on AI, the International Organization for Standardization (ISO), the National Institute of Standards and Technology (NIST), and the Responsible AI Institute. In July, both Amazon and Anthropic joined President Biden and other industry leaders at the White House to show their support for a set of voluntary commitments to foster the safe, secure, responsible, and effective development of AI technology. These commitments are a continuation of work that both Amazon and Anthropic have been doing to support the safety, security, and responsible development and deployment of AI and will continue through this expanded collaboration.\n\nAbout Amazon Web Services\n\nSince 2006, Amazon Web Services has been the world’s most comprehensive and broadly adopted cloud. AWS has been continually expanding its services to support virtually any workload, and it now has more than 240 fully featured services for compute, storage, databases, networking, analytics, machine learning and artificial intelligence (AI), Internet of Things (IoT), mobile, security, hybrid, virtual and augmented reality (VR and AR), media, and application development, deployment, and management from 102 Availability Zones within 32 geographic regions, with announced plans for 12 more Availability Zones and four more AWS Regions in Canada, Malaysia, New Zealand, and Thailand. Millions of customers—including the fastest-growing startups, largest enterprises, and leading government agencies—trust AWS to power their infrastructure, become more agile, and lower costs. To learn more about AWS, visit aws.amazon.com.\n\nAbout Amazon\n\nAmazon is guided by four principles: customer obsession rather than competitor focus, passion for invention, commitment to operational excellence, and long-term thinking. Amazon strives to be Earth’s Most Customer-Centric Company, Earth’s Best Employer, and Earth’s Safest Place to Work. Customer reviews, 1-Click shopping, personalized recommendations, Prime, Fulfillment by Amazon, AWS, Kindle Direct Publishing, Kindle, Career Choice, Fire tablets, Fire TV, Amazon Echo, Alexa, Just Walk Out technology, Amazon Studios, and The Climate Pledge are some of the things pioneered by Amazon. For more information, visit amazon.com/about and follow @AmazonNews.\n\nAbout Anthropic\n\nAnthropic is an AI safety and research company based in San Francisco. Our interdisciplinary team has deep experience across machine learning, physics, policy, and product. Together, we create reliable, interpretable, and steerable AI systems. Anthropic’s flagship product is Claude, an AI assistant focused on being helpful, harmless, and honest. Learn more about Anthropic at anthropic.com.\n\nForward-Looking Statements\n\nThis press release contains forward-looking statements that are inherently uncertain and difficult to predict, including statements regarding planned investments, anticipated business activities, and expected benefits of the expanded collaboration between Amazon and Anthropic, such as expected developments, performance, scaling, or impacts as a result of the collaboration; the reliability, safety, security, applications, or effectiveness of artificial intelligence technologies; and increased or early accessibility of new features, models, and tools. We use words such as will, believes, expects, future, should, plan, potential, continue, and similar expressions, as well as words referring to future outcomes such as train, make, accelerate, benefit, bring, collaborate, develop, become, create, enhance, expand, incorporate, build, provide, change, receive, help, use, and variations of such words, to identify forward-looking statements. Actual results and outcomes could differ materially for a variety of reasons, including, among others, changes in global economic conditions and customer demand and spending, inflation, interest rates, regional labor market and global supply chain constraints, world events, the rate of growth of cloud services, the amount that Amazon invests in new business opportunities and the timing of those investments, the mix of products and services sold to customers, competition, management of growth, international growth and expansion, the outcomes of claims, litigation, government investigations, and other proceedings, data center optimization, variability in demand, the degree to which we enter into, maintain, and develop commercial agreements, and proposed and completed acquisitions and strategic transactions. Other risks and uncertainties include, among others, risks related to new products, services, and technologies, system interruptions, and government regulation and taxation. In addition, global economic and geopolitical conditions and additional or unforeseen circumstances, developments, or events may give rise to or amplify many of these risks. More information about factors that potentially could affect Amazon’s future business, product development, and financial results is included in Amazon’s filings with the Securities and Exchange Commission, including its most recent Annual Report on Form 10-K and subsequent filings.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20230923046145/en/\n\nContacts\n\nAmazon.com, Inc.\r\nMedia Hotline\r\nAmazon-pr@amazon.com \r\nwww.amazon.com/pr", "link": "https://finance.yahoo.com/news/amazon-anthropic-announce-strategic-collaboration-070100763.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.019, "neu": 0.821, "pos": 0.16}}, {"date": "2023-09-25T07:01:00+00:00", "title": "Amazon to Invest as Much as $4 Billion in AI Startup Anthropic", "content": "(Bloomberg) -- Amazon.com Inc. will invest as much as $4 billion in Anthropic, bagging a crucial partner in its effort to become a major player in generative artificial intelligence and offering a vote of confidence in the hot startup.\n\nMost Read from Bloomberg\n\nChinese Gold Buying Is Driving a Paradigm Shift in Bullion Indians Have Five Days to Deposit $3 Billion in Soon-to-Be-Withdrawn Banknotes India-Canada Clash Should Be a Wakeup Call Hollywood Screenwriters Reach Tentative Deal to End Strike Stocks Fall as German Yield Climbs to 2011 High: Markets Wrap\n\nAs part of the deal, Anthropic will move most of its software to Amazon Web Services data centers, and use the cloud computing company’s homegrown chips to train the models it uses to power chatbots and other applications. Besides getting access to Amazon’s computing power, Anthropic will gain a financial infusion that will help it pay the huge costs required to train and run massive AI models. Amazon will have a minority position in Anthropic, the companies said in a statement on Monday.\n\nThe e-commerce and cloud computing giant has long taken stakes in partners in areas it deems a priority, including cargo airlines, a grocery distributor and an electric truck manufacturer. But if the investment in Anthropic lands anywhere near $4 billion, it would represent the largest known piece of corporate dealmaking directly related to AWS. The unit has tended to build its own products rather than relying on technology or businesses purchased from others, making relatively modest acquisitions in a market of hype-fueled, billion-dollar valuations. Amazon says its engineers, including those who work outside of AWS, will have access to Anthropic’s models.\n\nAWS is the world’s largest seller of on-demand computing power and data storage. But it has been widely seen as a laggard in the emerging field of computer models trained to generate text, images and other content because it has lacked both a hit product and a high-profile exclusive partner in the arena. ChatGPT creator OpenAI runs its software on Microsoft Corp.’s data centers, a partnership based on a $13 billion investment that has sparked a renewal for Amazon’s Seattle-area neighbor.\n\nStory continues\n\nAmazon executives have said that it’s early days for so-called generative AI, and that more than 100,000 customers have used the company’s machine-learning tools to date. Anthropic’s foundational model, called Claude, was already available as part of an Amazon service called Bedrock, still in early release, that makes both Amazon and third-party models available to its customers.\n\n“We have tremendous respect for Anthropic’s team and foundation models, and believe we can help improve many customer experiences, short- and long-term, through our deeper collaboration,” Amazon Chief Executive Officer Andy Jassy said in a statement.\n\nThe deal also represents a milestone moment for Amazon’s in-house chipmaking effort, which includes processors called Trainium and Inferentia that are designed to power machine-learning applications. Most cutting-edge artificial intelligence applications rely on pricey chips built by Nvidia Corp. that can be hard to come by. Anthropic will use AWS chips to build and train future foundational models, the companies said.\n\nFounded by OpenAI veterans, Anthropic has raised more than $1 billion to date with a pitch to make a safer kind of chatbot for such tasks as summarizing, searching, answering questions and coding. The company’s backers include Alphabet Inc.’s Google, which invested almost $400 million in Anthropic, Bloomberg reported in February. Google is also an AWS cloud rival and builder of models used in generative AI.\n\n“By significantly expanding our partnership, we can unlock new possibilities for organizations of all sizes, as they deploy Anthropic’s safe, state-of-the-art AI systems together with AWS’s leading cloud technology,” Anthropic co-founder and CEO Dario Amodei said.\n\nMost Read from Bloomberg Businessweek\n\nPrivate Equity’s Slow Carnage Unleashes a Wave of Zombies Deion Sanders Is Writing College Football’s New Playbook Why Dollar General Might Just Be the Worst Retail Job in America Deion Sanders Got Shade, Then Sold $1.2 Million Worth of Sunglasses How Breville Became the Anti-Instant Pot\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/amazon-invest-much-4-billion-070100383.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.987, "neg": 0.012, "neu": 0.915, "pos": 0.073}}, {"date": "2023-09-25T07:00:47+00:00", "title": "Amazon to invest up to $4bn in AI start-up Anthropic", "content": "Amazon plans to invest up to $4bn in artificial intelligence start-up Anthropic, as the big tech group steps up its rivalry with Microsoft, Google and Nvidia to persuade AI companies to use its technology. The deal, announced on Monday, will see Amazon invest an initial $1.25bn for a minority stake in Anthropic. It is a bid to forge a close relationship with a prominent AI start-up akin to Microsoft’s alliance with OpenAI, the group behind ChatGPT.\n\nContinue reading", "link": "https://finance.yahoo.com/m/38fedfd5-fd39-349e-808e-fc4cc6b370c3/amazon-to-invest-up-to-%244bn.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NVD.F"], "tags": [], "sentiment": {"polarity": 0.778, "neg": 0, "neu": 0.888, "pos": 0.112}}, {"date": "2023-09-25T06:16:18+00:00", "title": "Amazon invests $4 billion in AI startup Anthropic, acquires minority stake", "content": "In an attempt to stay competitive in the rapidly growing artificial intelligence (AI) sector, Amazon (NASDAQ:AMZN) has announced a substantial investment in AI startup Anthropic. The tech giant is set to inject up to $4 billion into the fledgling company, as announced on Monday.\n\nAnthropic, launched by siblings Dario and Daniela Amodei in 2021, is a direct competitor to OpenAI. Both founders are former employees of OpenAI, further intensifying the competition in the AI field. Anthropic has made its mark with its AI assistant Claude, which competes directly with ChatGPT.\n\nThe investment comes on the heels of Microsoft (NASDAQ:MSFT)'s extensive multi-year financial commitment to OpenAI. Google (NASDAQ:GOOGL), another significant player in the AI race, has also invested in Anthropic. These investments underscore the escalating interest and competition in the AI sector among technology giants.\n\nAs part of the deal, Amazon will acquire a minority stake in Anthropic. The startup plans to use Amazon Web Services' (AWS) proprietary chips to develop, train, and deploy its AI software. AWS will become Anthropic's primary cloud provider under this agreement.\n\nIn addition to providing infrastructure support, Amazon will offer its cloud customers early access to Anthropic’s technology via Amazon Bedrock, the firm's AI platform for businesses. This strategic move underlines Amazon's determination not to fall behind its competitors in this rapidly expanding sector.\n\nThe investment signifies a significant commitment from Amazon to advance its position in the AI race against other tech behemoths.\n\nThis article was generated with the support of AI and reviewed by an editor. For more information see our T&C.\n\nRelated Articles\n\nAmazon invests $4 billion in AI startup Anthropic, acquires minority stake\n\nGoldman, HSBC join forces with other banks on client disclosures\n\nSoftBank Corp to raise $800 million from bond-type shares in Japan first", "link": "https://finance.yahoo.com/news/amazon-invests-4-billion-ai-061618185.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GOOGL.US", "MSFT.US"], "tags": [], "sentiment": {"polarity": 0.987, "neg": 0, "neu": 0.854, "pos": 0.146}}, {"date": "2023-09-25T06:15:50+00:00", "title": "Amazon to invest up to $4 billion in Anthropic amid AI arms race", "content": "Investing.com -- Amazon (NASDAQ:AMZN) said on Monday that it is aiming to invest up to $4 billion in artificial intelligence group Anthropic, as the tech giant looks to bolster its position in the corporate arms race over nascent AI technology.\n\nUnder the terms of the agreement, Amazon will place an intial investment of $1.25B in Anthropic for a minority stake in the rival to ChatGPT-maker OpenAI, according to multiple media sources. The figure could then expand to $4B depending on certain conditions. Anthropic will then have access to Amazon's cloud computing platform to help optimize its AI systems, known as large language models.\n\nAnthropic garnered a valuation of almost $5B in its last funding round earlier this year, the Financial Times reported, citing a source familiar with the matter.\n\n“We have tremendous respect for Anthropic’s team and foundation models, and believe we can help improve many customer experiences, short and long-term, through our deeper collaboration,” said Amazon Chief Executive Officer Andy Jassy in a statement.\n\nThe move is the latest sign that Amazon, one of the technology sector's biggest players, is becoming increasingly focused on building out its generative AI offerings. Along with Anthropic's chatbot, Amazon is also trying to brand its Inferentia and Trainium AI chips as possible alternatives to popular processors made by Nvidia (NASDAQ:NVDA).\n\nShares in Amazon were slightly higher in U.S. premarket trading.\n\nRelated Articles\n\nAmazon to invest up to $4 billion in Anthropic amid AI arms race\n\nGoldman, HSBC join forces with other banks on client disclosures\n\nSoftBank Corp to raise $800 million from bond-type shares in Japan first", "link": "https://finance.yahoo.com/news/amazon-invest-4-billion-anthropic-061550715.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0, "neu": 0.825, "pos": 0.175}}, {"date": "2023-09-25T00:00:00+00:00", "title": "A Bull Market Could Be Here: 3 Reasons to Buy Amazon Stock", "content": "Amazon's efforts to cut costs and boost growth are starting to pay off.", "link": "https://www.fool.com/investing/2023/09/25/bull-market-could-be-here-3-reasons-to-buy-amazon/", "symbols": ["AMZN.US"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0.197, "neu": 0.506, "pos": 0.298}}, {"date": "2023-09-25T00:00:00+00:00", "title": "AMZN Stock Alert: What to Know About Amazon&#039;s $4 Billion Bet on AI Firm Anthropic", "content": "Amazon is getting ready for the AI market with a new investment that will hopefully help AMZN stock in the years to come.", "link": "https://investorplace.com/2023/09/amzn-stock-alert-what-to-know-about-amazons-4-billion-bet-on-ai-firm-anthropic/", "symbols": ["AMZN.US"], "tags": [], "sentiment": {"polarity": 0.823, "neg": 0, "neu": 0.652, "pos": 0.348}}, {"date": "2023-09-25T00:00:00+00:00", "title": "Which High-Profile Stock-Split Stock Is the Cheapest? Get Ready to Be Shocked...", "content": "Among Nvidia, Amazon, DexCom, Shopify, Alphabet, Tesla, Palo Alto Networks, Monster Beverage, and Novo Nordisk, there's one clear-cut stock-split stock that's notably cheaper than the rest.", "link": "https://www.fool.com/investing/2023/09/25/which-high-profile-stock-split-stock-is-cheapest/", "symbols": ["AMZN.US"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0, "neu": 0.936, "pos": 0.064}}, {"date": "2023-09-24T23:05:00+00:00", "title": "12 Fastest Growing Sectors and Investment Opportunities in the US", "content": "In this article, we will talk about the 12 fastest growing sectors and investment opportunities in the US. You can skip our detailed analysis and head straight to the 5 Fastest Growing Sectors and Investment Opportunities in the US.\n\nTechnology is indeed the epitome of growth and opportunity. Businesses continue to look for ways to integrate technology into their operations, supply chain, sales, and marketing departments. Most industries today are highly automated. You can take a look at some of the most automated industries in the United States.\n\nWith information technology, data management, and artificial intelligence combined, businesses often end up dominating the market if resources are used effectively. Speaking of which, according to a report by Fortune Business Insights, the global artificial intelligence industry was valued at $428 billion in 2022. The global artificial intelligence industry is expected to grow to $2.03 trillion by 2030 at a compound annual growth rate of 21.6%. The North American market dominates the industry, with a reported market size of $175.96 billion in 2022.\n\nSimilarly, the cloud computing industry is also experiencing rapid growth and development. According to a report by Fortune Business Insights, the global cloud computing industry had a market size of $569.31 billion in 2022. The global cloud computing industry is expected to grow to a valuation of $2.4 trillion by 2030 at a compound annual growth rate of 20%. The North American Market dominates the industry, with a market size of $401.49 billion in 2022.\n\nThe growth of the two industries indicates the potential the information technology sector holds for the future and explains why large companies like Amazon.com, Inc. (NASDAQ:AMZN) invested in offering cloud-based services years ago. On June 26, Amazon.com, Inc. (NASDAQ:AMZN) announced that the company set aside $7.8 billion to invest in the expansion of data centers in Ohio by 2030. Amazon.com, Inc. (NASDAQ:AMZN) has created 3,500 jobs in Ohio since 2015 and added $2.2 billion to the local gross domestic product in Ohio between the years 2015 to 2022.\n\nStory continues\n\nWhy is the Tech Industry Growing in the United States?\n\nTechnology demands funding and investment. Investing in the right human and natural resources is necessary to establish technologically advanced systems that are effective and efficient. The United States is at the forefront of innovation and technology primarily due to the continuous flow and investment funding from the government and large corporations.\n\nOn March 13, the Biden administration announced its annual budget set aside for Research and Development (R&D). According to the report, the Biden administration is set to invest $210 billion in federal R&D. Of this, slightly over $100 billion will be used for applied and basic research. Other than that, the government had also set aside $2.5 billion for innovative health research and $1.4 billion for the National Science Foundation (NSF) to upgrade STEM education and train the workforce in these industries.\n\nWhile government funding is necessary, support from banks and large corporations is the need of the hour. On August 24, Reuters reported that HSBC Holdings Plc (NYSE:HSBC) is set to expand its venture debt offering to early-stage startups. This project is to be done under the supervision of the US innovation banking division of HSBC Holdings Plc (NYSE:HSBC). David Sabow, head of technology and healthcare at the bank's US innovation banking unit, stated:\n\n\"We've been working to mobilize the broader HSBC innovation banking platform around to support companies from Series A, all the way through their journey. We're helping with the operating business, the international expansion, the financing needs, and even leveraging the broader parts of the HSBC ecosystem to connect corporates with their early-stage potential targets.\"\n\nThese figures explain why new startups continue to bloom in the United States. On August 15, Forbes listed some of the next billion-dollar startups that are likely to succeed. These venture-backed startups are making considerable leaps by integrating technology into their systems. One such startup is Hex Technologies. Barry McCardel, the young CEO of Hex Technologies, has raised $96 million in equity ever since its inception. The startup boasted an estimated revenue of $6 million in 2022. The company collects data about consumer behavior and then converts them into charts and graphs for further data analysis. The startup operates on a freemium business model. What differentiates this business from other companies is that the company targets a specific niche. The niche consists of people affluent in analytics but need more exposure to the complete data science skillset.\n\nNotable Names in the Tech Sector\n\nSome of the top companies leading the tech sector include Alphabet Inc. (NASDAQ:GOOG), Microsoft Corporation (NASDAQ:MSFT), and Meta Platforms, Inc. (NASDAQ:META).\n\nAlphabet Inc. (NASDAQ:GOOG) is one of the leading companies specializing in developing new technologies and investing in research and development. On September 14, Reuters reported that the company is set to launch its new artificial intelligence software, Gemini. The conversational AI software is more than just a regular chatbot. The software will enable people to draft emails, music, lyrics, or news stories. The software is also set to be a coder's best buddy. Companies already using the Google Cloud Vertex AI service can access Gemini.\n\nLike Alphabet Inc. (NASDAQ:GOOG), Microsoft Corporation (NASDAQ:MSFT) dominates the tech industry. On September 18, the company reported the launch of the M365 Copilot Early Access Program in Australia. The new program allows Australian companies to test the new generative AI powerhouse. The program allows companies to streamline all their operations. Copilot is installed in all the products Microsoft Corporation (NASDAQ:MSFT) offers, allowing users to easily connect with the AI and use it as their assistant. To discuss the expansion of the program, Lucy Debono, Modern Work Business Group Director, Microsoft Australia and New Zealand, stated:\n\n\"Business leaders within the Early Access Program see this as an opportunity to gain a first-mover advantage in their sectors and enable greater productivity in a market navigating sustained economic pressure. We want these early adopters to work closely with Microsoft to use this technology, test it within their teams, help us to improve it further, and drive great employee experiences. This is such an exciting opportunity to see how Australian companies will use this incredible new tool to fundamentally change how we work.\"\n\nMeta Platforms, Inc. (NASDAQ:META) is another top leader in the tech space. On August 22, the company introduced SeamlessM4T, a multimodal AI model for speech and text translations. The model detects almost 100 languages and offers speech-to-text translation, speech-to-speech translation, text-to-text translation, and text-to-speech translation.\n\nInvestment in technology and artificial intelligence is important for businesses to sustain themselves. After all, companies realize that AI is not here to take over but to assist. It is, without a doubt, true that technology and IT have been experiencing rapid growth in the United States, but many other industries and sectors are experiencing rapid output growth and employment as well. With that, let's look at the fastest-growing sectors and investment opportunities in the United States. 12 Fastest Growing Sectors and Investment Opportunities in the US\n\nOur Methodology\n\nTo come up with the fastest-growing sectors in the United States we consulted the Bureau of Labor Statistics (BLS). We sourced our data from the Industry Output and Growth Projections database by the Bureau of Labor Statistics (BLS). We maintained NAICS conventions for sector classifications. We narrowed down the 12 fastest growing sectors in the US based on their output compound annual growth rate projections for 2022-2032, as calculated by the BLS. The BLS defines this metric as increases and decreases in the output of a sector over time, expressed as a constant rate of change. We have elaborated on the various industries that fall under every sector in order to give our readers an accurate representation of what industries and sectors are expected to grow the fastest over the coming years. The list is ranked in ascending order of the aforementioned metric.\n\n12 Fastest Growing Sectors and Investment Opportunities in the US\n\n12. Ambulatory Health Care Services\n\nCompound Annual Growth Rate in Industry Output (2022-2032): 3.1%\n\nAmbulatory health care services consist of healthcare services provided to a patient without admission to a facility or hospital. Primary industries in this sector include the offices of physicians industry, the offices of dentists industry, the offices of other health practitioners industry, the outpatient care centers industry, and the medical and diagnostic laboratories industry.\n\nAccording to our methodology, the ambulatory health care services sector is among the fastest-growing sectors and will continue to experience a high growth in output for the forecast year 2032. The output of the sector in 2022 was recorded at almost $1.1 trillion followed by a forecast of almost $1.5 trillion in 2032. The sector is also expected to experience a 1.2% increase in employment in the forecast years of 2022-2032.\n\nSome of the fastest growing industries are led by Alphabet Inc. (NASDAQ:GOOG), Microsoft Corporation (NASDAQ:MSFT), and Meta Platforms, Inc. (NASDAQ:META).\n\n11. Offices of Physicians\n\nCompound Annual Growth Rate in Industry Output (2022-2032): 3.2%\n\nThe offices of physicians sectors consist of health practitioners with a degree of M.D (Doctor of Medicine) or D.O (Doctor of Osteopathy). These practitioners either perform general medicine or specialized medicine independently. Some of the primary industries within this sector include the general medicine industry, the specialties medicine industry, the allied and mental health industry, and the biotech industry.\n\nThe offices of physicians sector is among the fastest growing sectors in the United States. The sector had an output of almost $558 billion in 2022 and is expected to grow to $767 billion in 2032.\n\n10. Computer Systems Design\n\nCompound Annual Growth Rate in Industry Output (2022-2032): 3.2%\n\nThe computer systems design sector specializes in the provision of expertise in several fields of IT including, designing, developing, and testing software, planning and designing computer systems, and professional computer-related services. The primary industries within this sector include the computer programming industry, the computer-related services industry, the computer systems design industry, the IT consulting and services industry, and the computer design manufacturing industry.\n\nThe computer systems design sector ranks among the fastest growing sectors in the United States. In 2022, the sector reported an output of almost $612 billion and is expected to grow to $841 billion in 2032. The sector is also expected to experience a 1.8% increase in employment in the forecast years of 2022-2032.\n\n9. Management, Scientific, and Technical Consulting Services\n\nCompound Annual Growth Rate in Industry Output (2022-2032): 3.3%\n\nAccording to our methodology, the management, scientific, and technical consulting services sector is among the fastest-growing sectors and will continue to experience a high growth in output for the forecast year 2032. The sector can be further classified into the agricultural consulting services industry, the motion picture consulting services industry, the biological consulting services industry, the physics consulting services industry, the chemical consulting services industry, and the economic consulting services industry among others.\n\nThe sector recorded an output of almost $435 billion in 2022 followed by a forecast of almost $601 billion in 2032. The sector is also expected to experience a 1.0% increase in employment in the forecast years of 2022-2032. Some examples of companies in the management consulting domain include McKinsey & Company, Bain & Company, and Boston Consulting Group.\n\n8. Information\n\nCompound Annual Growth Rate in Industry Output (2022-2032): 3.3%\n\nThe information sector is one of the largest sectors in the United States. The information sector consists of the computing industry, the technology industry, and the software industry, to name a few. The sector recorded an output of almost $2.4 trillion in 2022 followed by a forecast of $3.4 trillion in 2032. The industry is also expected to experience a 1.0% increase in employment in the forecast years of 2022-2032.\n\n7. Personal Care Services\n\nCompound Annual Growth Rate in Industry Output (2022-2032): 3.5%\n\nThe personal care services sector engages in the provision of services in the beauty and fitness industry. The personal care services sector ranks fifth among the fastest-growing industries in the United States. In 2022, the sector reported an output of almost $513 billion and is expected to report an output of almost $722 billion in 2032.\n\n6. Oil and Gas Extraction\n\nCompound Annual Growth Rate in Industry Output (2022-2032): 3.5%\n\nThe oil and gas extraction sector engages in the exploration and production of petroleum and natural gas. The sector can be classified into three primary domains, exploration and production, transportation and storage, and refining and marketing. Prominent companies operating in this sector include Shell plc (NYSE:SHEL), Exxon Mobil Corporation (NYSE:XOM), and Chevron Corporation (NYSE:CVX). According to our methodology, the oil and gas sector is expected to grow to an output of almost $722 billion by 2032 at a compound annual growth rate in output of 3.5%.\n\nFor investors looking for high-growth opportunities, some of the top growth stocks to consider investing in include Alphabet Inc. (NASDAQ:GOOG), Microsoft Corporation (NASDAQ:MSFT), and Meta Platforms, Inc. (NASDAQ:META).\n\nClick to continue reading and see the 5 Fastest Growing Sectors and Investment Opportunities in the US.\n\nSuggested articles:\n\n15 Most Profitable Cutting Edge Technologies That Will Make You Rich 12 Most Automated Industries in the US 10 Industries Being Revolutionized By AI and Automation Technologies\n\nDisclosure: None. 12 Fastest Growing Sectors and Investment Opportunities in the US is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/12-fastest-growing-sectors-investment-230500439.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZN.US", "CVX.US", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "HSBC.US", "META.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.006, "neu": 0.858, "pos": 0.137}}, {"date": "2023-09-24T20:52:38+00:00", "title": "12 Best Places to Retire in Thailand", "content": "This article looks at the 12 best places to retire in Thailand. If you want to skip our detailed analysis of how Thailand is boosting its growth and quality of life for businesses and expatriates, go to 5 Best Places to Retire in Thailand.\n\nThailand: Boosting Growth and Quality of Life\n\nCommencing January 2023, Thailand has started implementing an ambitious five-year investment promotion strategy designed to attract upstream industries and advanced technologies in the region. Major companies such as Foxconn Technology, BYD Co., and Amazon Web Services of U.S. tech giant Amazon.com, Inc. (NASDAQ:AMZN) have announced investment pledges worth $20 billion in the country. This proactive investment strategy aims to set Thailand well on the path to becoming an attractive destination for both businesses and expatriates, leading to a better quality of life and continued economic growth in the region.\n\nAccording to data from the US Department of State, as many as 30,000 American expats are estimated to live in Thailand, including retirees. While it is true that the growth in number of expats in the region is mainly due to affordable cost of living, there are other reasons attracting business, expatriates, and retirees to this country. A new era of economic development, as quoted by a feature article published by the country's Board of Investment (BOI), is set to initiate with the investment strategy and convert Thailand into a desirable destination for expatriates and business .\n\n\"We will use the BOI and investment to drive Thailand to the new economy.\"\n\nBOI Secretary General Narit Therdsteerasukdi.\n\nIn light of this, Amazon.com Inc. (NASDAQ:AMZN) has pledged a substantial investment of $5 billion. China's largest electric car manufacturer, BYD Co., is committed to a significant expenditure of $660 million. Meanwhile, Taiwan's Foxconn Technology, renowned as the world's largest assembler of iPhones, has ventured into the electric vehicle (EV) sector through a joint collaboration exceeding $1 billion with Thai energy giant PTT.\n\nStory continues\n\nContributing to the favorable investment sentiment, Mr Akio Toyoda, head of Toyota Motor Corporation (NYSE:TM), marked the 60th anniversary of the Thai unit by unveiling the first battery electric (BEV) version of its best-selling Hilux truck in Thailand, further announcing a partnership with Bangkok-based CP Group to turn agricultural biomass into fuel for hydrogen-powered vehicles. Thailand, home to Toyota Motor Corporation (NYSE:TM) Asia headquarters, is described as a “second home” by Mr. Toyoda. Pattaya City has even partnered with Toyota Motor Corporation (NYSE:TM) to establish Thailand’s first hydrogen refueling station for fuel cell electric vehicles.\n\nGlobal Supply Chain Restructuring\n\nThailand has also been benefiting from restructuring supply chains from China to the Southeast Asia region. With Thailand enjoying a nominal GDP of $495.2 billion as of 2022 and boasting a highly developed infrastructure, it is more than capable of enabling production to meet the new demand. This is because COVID-19 policies and geopolitical tensions in China have led many businesses to relocate their supply chains from the country.\n\nCompanies diversifying their supply chains out of China, such as HP Inc. (NYSE:HPQ), Apple Inc. (NASDAQ:AAPL), and Dell Technologies Inc. (NYSE:DELL), are now looking towards countries like Mexico, Vietnam, and Thailand. HP Inc. (NYSE:HPQ), in particular, is shifting its production of millions of consumer and commercial laptops to Thailand in 2023 in a quest to diversify its supply chain from China. While commercial notebook production will go to Mexico, consumer laptop production for HP Inc. (NYSE:HPQ) will go to Thailand.\n\nSimilarly, Amazon.com, Inc. (NASDAQ:AMZN) will invest in Thailand through its subsidiary Amazon Web Services, helping the country become a hub for cloud-based internet services throughout Southeast Asia and improve the country's digital infrastructure. All of these investments and supply chain restructuring are, in turn, helping the country build on its infrastructure, improve financial stability, and work on its economic resilience. Consequently, these steps will help the country become attractive for businesses, expatriates, and even retirees.\n\nRetiring to Thailand\n\nRetiring to Thailand is full of possibilities for those seeking adventure without breaking the bank. Undoubtedly, it is one of the best countries to retire in Asia, and amongst the cheapest and safest countries for Retirement. From the stunning beaches in the country and their lively cities, to their cultural heritage and delectable cuisine, there is so much that the country offers. The process is relatively easy for those wondering how to retire in Thailand. Retirees must obtain a retirement visa, also called a non-immigrant \"O\" visa, to stay in the country. Once approved, the visa will allow you to stay for one year in the country.\n\nWhile retirees will find some of the best places to retire in Thailand, living there also presents its fair share of challenges. Some problems retiring in Thailand include humid weather, lots of traffic, and language differences. Nevertheless, retirees often get around these problems and focus on the country's good things, such as low cost of living, quality healthcare access, and delicious cuisine.\n\nTo navigate the complexities of retiring in the country successfully, one must explore the how-to regarding retirement, consider the cheapest places to live in Thailand, and identify what are the best places to live in Thailand for foreigners. Doing so will enable retirees to make the most of their retirement experience in Thailand. 12 Best Places to Retire in Thailand\n\nMethodology\n\nTo compile the list of best places to retire in Thailand, we have used various sources such as Expatra, International Living, Where to Retire Cheaply, amongst others. We also explored various expat forums to find out what retirees prefer as the best retirement destinations in Thailand.\n\nA consensus approach was used to score the places. Each time a source recommended a place, it was awarded one point. Points were summed up, and the places were ranked by their total scores in ascending order.\n\nFor places where the cost of living is not discussed, we have assumed it to be the Thailand average i.e., $1,500 a month. Cost of living is discussed for a single expat retiree living in Thailand per month, renting a one-bedroom apartment in the city/town center.\n\nHere are the best places to retire in Thailand:\n\n12. Pai\n\nInsider Monkey Score: 2\n\nSitting in a valley on the banks of the Pai River, Pai is a laid-back small town in Northern Thailand. It is renowned for its natural beauty; characterized by rolling hills, waterfalls, and hot springs. Retirees love to live here as it provides an escape from the hustle and bustle of big cities.\n\nThe climate is mild and pleasant in Pai, and the average annual temperature here is around 25°C. Most of the locals have learned English to help expats integrate with the community. Adequate healthcare facilities are available too. It costs a single expat retiree around $807 monthly to live here, with $509 spent on rent.\n\n11. Cha-Am\n\nInsider Monkey Score: 3\n\nCha-Am, a coastal retreat, is one of the most popular retirement destinations in Thailand. The town offers long stretches of sandy beaches along the Gulf, a tranquil atmosphere, and lots of activities at a reasonable cost. There are excellent cafes, bars, and restaurants too. Moreover, the town also has a growing expatriate community for retirees to socialize with. It is also close to Hua Hin, a large city with modern amenities available.\n\n10. Koh Phangan\n\nInsider Monkey Score: 4\n\nFor seniors who are young at heart, Koh Phangan is one of the best retirement islands in Thailand. Famous for the Full-Moon Beach party, the destination lets individuals enjoy the moonlight and celebrate life at its best. There are quieter and more serene areas here, too, and the overall cost of living is reasonable. A single expat retiree can live a modest lifestyle for $1,500. There are four primary hospitals on the island as well, and the staff can speak good English. Thong Nai Pan and the North are common residential areas within Koh Phangan to retire to.\n\n9. Ko Lanta\n\nInsider Monkey Score: 4\n\nKo Lanta, an island in the Strait of Malacca off the west coast of Thailand, is an excellent choice for retirees. It is famous for its spectacular sunsets and natural beauty, and retirees get to experience a relaxed, slow pace of life here. Retirees can also opt for beach-front living as well as engage in all the water-based recreational activities. There is a growing expatriate community, so retirees can build a strong social support network. There are a lot of local markets, too, allowing retirees to buy fresh produce and live a healthier life. A single expat retiree would require $968 to live here, with $582 spent on rent.\n\n8. Koh Chang\n\nInsider Monkey Score: 5\n\nKoh Chang is on our list of best places to retire in Thailand owing to its peaceful atmosphere, rich culture, and reasonable healthcare facilities. The island is brimming with lush rainforests, pristine beaches, and waterfalls. Local markets and festivals give retirees a chance to explore Thai culture and integrate with the community. There are lots of choices when it comes to restaurants, bars, and even beaches. A single expat retiree would require an average of $1,153 to live here, with $588 spent on rent.\n\n7. Krabi\n\nInsider Monkey Score: 6\n\nFamous for its limestone cliffs, lush jungles, and pristine beaches, Krabi is a compelling place to retire. Some popular destinations within Krabi province include Krabi Town, Ao Nang, Railay Beach, and the Phi Phi Islands, renowned for their scenic landscapes and outdoor activities. There are modern healthcare facilities available, too. A single expat retiree would need $1,086 to retire here, with $348 spent on rent.\n\n6. Pattaya\n\nInsider Monkey Score: 8\n\nPattaya, a city on Thailand’s eastern Gulf coast, is known for its vibrant lifestyle, beach-front accommodations, and modern healthcare facilities. Resort hotels, high-rise condos, shopping malls, cabaret bars, and 24-hour clubs are common here, allowing retirees to live a lively and happening retirement. There is a diverse yet growing expatriate community to integrate with as well. Retiring here takes an average of $897 per month, with $476 spent on rental accommodation.\n\nClick to continue reading and see the 5 Best Places to Retire in Thailand.\n\nSuggested Articles:\n\n16 Best Places to Retire in India 25 High Paying Jobs That Don’t Require Math 15 Best Places to Retire in Philippines\n\nDisclosure: none. 12 Best Places to Retire in Thailand is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/12-best-places-retire-thailand-205238215.html", "symbols": ["7HP.F", "7HP.STU", "7HP.XETRA", "AAPL.US", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "DELL.US", "HPQ.MX", "HPQ.US", "TM.US", "TMCO34.SA", "TMN.MX", "TOM.F", "TOMA.F"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.007, "neu": 0.833, "pos": 0.16}}, {"date": "2023-09-24T19:31:37+00:00", "title": "It’s Game Time: 3 NFL Stocks to Buy This Month", "content": "The National Football League (NFL) is back and bigger than ever. The viewership ratings for the first two weeks of the 2023 season have been exceptionally strong. In fact, the first game that kicked off the season scored the biggest ratings yet for Amazon’s (NASDAQ:AMZN) Prime Video broadcasts of Thursday Night Football.\n\nThe league just keeps getting bigger as fans flock to support their teams. In 2022, the 32 teams that comprise the NFL generated combined revenues of $18.6 billion, an increase of more than $1 billion from the previous year according to data from Statista. The popularity and viewership of the NFL draw companies large and small into its orbit as corporations use football as a platform to promote their products and services.\n\nLuckily, the NFL is adaptable, increasingly moving into new areas such as streaming and online betting, and striking ever more lucrative sponsorship deals and celebrity endorsements along the way. As the new season gets into full swing, these are the three NFL stocks to buy.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nAlphabet (GOOG/GOOGL) Alphabet Inc. (GOOG, GOOGL) and Google logos seen displayed on smartphones. The Google stock split is happening today.\n\nSource: IgorGolovniov / Shutterstock.com\n\nAlphabet (NASDAQ:GOOG/NASDAQ:GOOGL) is arguably the big winner this NFL season as YouTube, which the company owns, has acquired the rights to Sunday night game broadcasts.\n\n“NFL Sunday Ticket, the streaming TV package that lets football fans watch all out-of-market Sunday afternoon NFL games during the regular season. YouTube has taken over Sunday Ticket from DirecTV, which previously held the exclusive rights for the programming going all the way back to 1994.”\n\nSunday Ticket for the current NFL season is available through YouTube TV, Alphabet’s streaming service.\n\nYouTube is charging $349 for NFL Sunday Ticket when bundled with a subscription to YouTube TV that itself costs $73 per month. Alphabet is trying to recoup the $2.5 billion it is paying each NFL season for the rights to that year’s Sunday Ticket. The company sees the popular Sunday Ticket service as a way to gain market share in the highly competitive streaming sector and to diversify YouTube. While it’s too early to tell how NFL Sunday Ticket will boost Alphabet’s fortunes, early indications are that the service remains a hit on YouTube.\n\nStory continues\n\nGOOGL stock has risen 47% since the first trading day of January this year.\n\nApple (AAPL) Close-up of Apple (AAPL) retail store Logo in Honolulu at the Ala Moana Center. Advertising the latest generation of the ipad, iphones, and ipods with a Retina display.\n\nSource: Eric Broder Van Dyke / Shutterstock.com\n\nApple (NASDAQ:AAPL) — specifically Apple Music — is officially the sponsor of the Super Bowl halftime show, paying $50 million a year for what is billed as the biggest and most glamorous sponsorship in the world. The company outbid PepsiCo (NASDAQ:PEP) for the halftime show sponsorship, and it can be assumed that Apple will be pulling out all the stops to wring every bit of promotion it can out of the big game, which last year attracted 115 million viewers worldwide.\n\nApple can be expected to promote many of its products at this year’s Super Bowl and through its association with the NFL, namely its new Vision Pro augmented reality headset that it is planning to release in early 2024. The company is also pushing hard to drive sales of its new iPhone 15. And, of course, it will also use the big game to promote Apple Music. While the performer at this season’s Super Bowl, which takes place on Feb. 11, 2024 in Las Vegas, has not yet been announced, rumored frontrunners are Harry Styles, Taylor Swift and Ed Sheeran.\n\nAAPL stock has gained 40% year to date.\n\nPepsiCo (PEP) Cans of PepsiCo's Pepsi soda are in a bucket of ice.\n\nSource: suriyachan / Shutterstock.com\n\nWhile PepsiCo (NASDAQ:PEP) may have lost its sponsorship of the Super Bowl halftime show after a 10-year run, the company is still a big sponsor of the NFL season and its drinks and snacks are popular choices among football fans. The company spends more than $100 million a year advertising during NFL games, including the playoffs. And that figure does not include the Super Bowl or the previous halftime show that it sponsored. Pepsi also has individual advertising deals with 15 NFL teams, the largest of which is with the Dallas Cowboys.\n\nPepsi uses its advertising budget with the NFL to promote its popular game day snacks and beverages, including Doritos and Lay’s potato chips, Pepsi and Mountain Dew soft drinks, and, of course, its Gatorade sports drink. Many of these products can be expected to see sales upticks on NFL gamedays. PepsiCo clearly sees the benefit in tying its products to America’s most popular sports league.\n\nPEP stock is down 2% so far in 20203.\n\nOn the date of publication, Joel Baglole held long positions in GOOGL and AAPL. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post It’s Game Time: 3 NFL Stocks to Buy This Month appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/game-time-3-nfl-stocks-193137923.html", "symbols": ["AAPL.US", "AMZN.US", "PEP.MX", "PEP.US", "PEP.XETRA", "PEPB34.SA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.015, "neu": 0.9, "pos": 0.085}}, {"date": "2023-09-24T17:33:00+00:00", "title": "Need a job? Amazon and Target can help", "content": "Retailers like Walmart, Target, Costco and Amazon.com have openly talked about rising costs and having to charge higher prices to customers. For many people, seasonal opportunities can be a foot in the door.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d22ed0a2-9951-3876-9bd4-2d6ec32b28d6/need-a-job%3F-amazon-and-target.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "DYH.F", "TGT.MX", "TGT.US", "TGTB34.SA", "WALM34.SA", "WMT.F", "WMT.MX", "WMT.US", "WMT.XETRA"], "tags": [], "sentiment": {"polarity": 0.625, "neg": 0, "neu": 0.863, "pos": 0.137}}, {"date": "2023-09-24T13:35:00+00:00", "title": "Amazon Tests Prime Member Loyalty With Streaming Ad Push", "content": "Ads generated nearly $10.7 billion of revenue for Amazon in the second quarter alone, up 22% year over year. Advertising is now a bigger business than subscription services, which includes Prime, and it's twice as big as Amazon's physical store segment, which is primarily Whole Foods. Amazon sells advertising services to third-party sellers and vendors aiming to boost sales on the company's e-commerce platform.\n\nContinue reading", "link": "https://finance.yahoo.com/m/30f507d7-91bd-3f57-a08e-3916d29c6768/amazon-tests-prime-member.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0.029, "neu": 0.883, "pos": 0.088}}, {"date": "2023-09-24T12:35:00+00:00", "title": "Amazon and Target have huge hiring plans", "content": "Retailers like Walmart, Target, Costco and Amazon have openly talked about rising costs and having to charge higher prices to customers. For many people, seasonal opportunities can be a foot in the door.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d22ed0a2-9951-3876-9bd4-2d6ec32b28d6/amazon-and-target-have-huge.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "DYH.F", "TGT.MX", "TGT.US", "TGTB34.SA", "WALM34.SA", "WMT.F", "WMT.MX", "WMT.US", "WMT.XETRA"], "tags": [], "sentiment": {"polarity": 0.7, "neg": 0, "neu": 0.82, "pos": 0.18}}, {"date": "2023-09-24T12:20:00+00:00", "title": "What the Heck Is Happening With Dollar General Stock?", "content": "The discount retailer's fortunes have turned negative this year, but are investors overreacting?\n\nContinue reading", "link": "https://finance.yahoo.com/m/cc82418e-26b6-33c6-b9a0-45700909eb22/what-the-heck-is-happening.html", "symbols": ["7DG.F", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "DG.US", "DGCO34.SA"], "tags": [], "sentiment": {"polarity": -0.329, "neg": 0.144, "neu": 0.856, "pos": 0}}, {"date": "2023-09-24T11:55:00+00:00", "title": "2 Spectacular AI Growth Stocks Down 27.5% and 44% to Buy Now and Hold Forever", "content": "Want to profit from the rise of artificial intelligence? These two industry leaders stand out as great buys right now.\n\nContinue reading", "link": "https://finance.yahoo.com/m/54f52a65-4437-3a8e-8cf0-60974df1f6f0/2-spectacular-ai-growth.html", "symbols": ["45C.F", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "CRWD.US"], "tags": [], "sentiment": {"polarity": 0.886, "neg": 0, "neu": 0.612, "pos": 0.388}}, {"date": "2023-09-24T11:30:00+00:00", "title": "'I get a little bit worried': Warren Buffett compares AI technology to the atom bomb — but he's still betting big on these 3 artificial intelligence stocks", "content": "'I get a little bit worried': Warren Buffett compares AI technology to the atom bomb — but he's still betting big on these 3 artificial intelligence stocks\n\nWarren Buffett has complicated feelings about artificial intelligence (AI).\n\n\"It can do all kinds of things, and when something can do all kinds of things I get a little bit worried,\" he said at the 2023 Berkshire Hathaway annual meeting in May.\n\n\"I know we won't be able to uninvent it, and we did invent, for very, very good reason, the atom bomb.\" he added. \"But is it good for the next 200 years of the world that the ability to do so has been unleashed?\"\n\nIn an April interview with CNBC, Buffet made a similar comparison, saying AI is \"extraordinary, but I don't know if it's beneficial.\"\n\nDon't miss\n\nCommercial real estate has outperformed the S&P 500 over 25 years. Here's how to diversify your portfolio without the headache of being a landlord Rich young Americans have lost confidence in the stock market — and are betting on these 3 assets instead. Get in now for strong long-term tailwinds How can I stop the pain and make money in this nightmarish market? Here's 1 simple way you can protect your nest egg\n\nFollowers of Warren Buffet may recognize the atom-bomb theme from his past public comments. The Berkshire chairman and CEO has repeatedly expressed concerns that nuclear attack is the greatest danger to humanity.\n\nBut despite the recent comparisons between nukes and AI, nearly half of Berkshire's investments include companies linked to the development of AI technology.\n\nGiven Berkshire’s track record, investors may want to follow suit. Here are three AI-related stocks in the company's portfolio.\n\nApple (NASDAQ:AAPL)\n\nIn 2020, Buffett described Apple to CNBC as “probably the best business I know in the world.”\n\nApple shares make up the largest portion of Berkshire’s portfolio, by far, at around 46%, according to CNBC.\n\nOf course, Apple doesn't specialize in generative AI products like ChatGPT, but the company is building its own AI tools, according to Bloomberg. Apple stock saw an immediate bump after news of the new tech was reported in July.\n\nStory continues\n\nRead more: Thanks to Jeff Bezos, you can now use $100 to cash in on prime real estate — without the headache of being a landlord. Here's how\n\nAmazon (NASDAQ:AMZN)\n\nBerkshire owns over 10.5 million shares of Amazon (0.4% of its portfolio), which has funded several major AI projects. In 2018, the company launched AI-focused chips. In June of this year, Amazon announced it would invest $100 million in a new initiative called the Generative AI Innovation Center, which will help businesses build their own generative AI products and services that produce photos, text, code, video and other content. Amazon shares increased substantially after the announcement.\n\nIn July, Amazon announced its HealthScribe project, an AI service designed to save doctors time by using speech recognition and generative language modeling to create clinical records based on doctor-patient conversations.\n\nSnowflake (NYSE:SNOW)\n\nA lesser-known holding on Berkshire's list is Snowflake, a cloud computing company that had its IPO in 2020. The company's value has significantly declined since then, but shares of the company still account for 0.3% of Berkshire's portfolio.\n\nSnowflake has partnered with Microsoft to build large-scale AI models, and in June it announced a partnership with Nvidia, a major supplier of AI processing hardware and software. The partnership aims to allow Snowflake customers to build custom generative AI models.\n\nWhat to read next\n\nWorried about the economy? Here are the best shock-proof assets for your portfolio. (They’re all outside of the stock market.) The US dollar has lost 98% of its purchasing power since 1971 — invest in this stable asset before you lose your retirement fund Jeff Bezos and Oprah Winfrey invest in this asset to keep their wealth safe — you may want to do the same in 2023\n\nThis article provides information only and should not be construed as advice. It is provided without warranty of any kind.", "link": "https://finance.yahoo.com/news/little-bit-worried-warren-buffett-113000654.html", "symbols": ["5Q5.F", "AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "SNOW.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.04, "neu": 0.8, "pos": 0.16}}, {"date": "2023-09-24T11:21:00+00:00", "title": "3 Warren Buffett Stocks to See Skyrocketing AI Growth", "content": "Master investor Warren Buffett may not strike you as an expert in artificial intelligence (AI). Read on to see why our AI panelists suggest e-commerce veteran Amazon.com (NASDAQ: AMZN), comsumer electronics giant Apple (NASDAQ: AAPL), or Buffett's own company, Berkshire Hathaway (NYSE: BRK.A) (NYSE: BRK.B). Nicholas Rossolillo (Berkshire Hathaway): Sure, Berkshire Hathaway is invested in a couple of tech stocks such as Apple and Amazon that could log exceptional growth from AI.\n\nContinue reading", "link": "https://finance.yahoo.com/m/c9b846d5-36f6-3763-a592-58aa37ac7380/3-warren-buffett-stocks-to.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "BRK-A.US", "BRK-B.US"], "tags": [], "sentiment": {"polarity": 0.834, "neg": 0, "neu": 0.862, "pos": 0.138}}, {"date": "2023-09-24T11:18:00+00:00", "title": "Nvidia, Amazon, and Alphabet Announced 3 Key Artificial Intelligence (AI) Developments Last Week You May Have Missed", "content": "Artificial intelligence (AI) has been all the rage this year, with the biggest names in technology all getting in on the action. Helping spark the AI gold rush in 2023 are recent developments in the field of generative AI, which can create original output, handle repetitive tasks, conduct research, and even write code. Business executives are scrambling to implement this technology, which promises vast productivity gains, saving companies time and money.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4f1bb319-d6ff-373d-a587-b2cab2c89a0b/nvidia%2C-amazon%2C-and-alphabet.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "NVD.F", "NVD.XETRA", "NVDA.MX", "NVDA.US", "NVDC34.SA"], "tags": [], "sentiment": {"polarity": 0.84, "neg": 0.065, "neu": 0.742, "pos": 0.193}}, {"date": "2023-09-24T11:10:00+00:00", "title": "1 Super Stock Just 28% Away From Joining Apple, Microsoft, Amazon, Alphabet, and Nvidia in the $1 Trillion Club", "content": "Artificial intelligence is driving a new growth phase for the world's largest social media company.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a8a57694-8bdd-368c-b1d8-5919dddbc7bb/1-super-stock-just-28%25-away.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "FB2A.F", "FB2A.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US"], "tags": [], "sentiment": {"polarity": 0.691, "neg": 0, "neu": 0.711, "pos": 0.289}}, {"date": "2023-09-24T10:55:00+00:00", "title": "3 E-Commerce Stocks You Can Buy and Hold for the Next Decade", "content": "E-commerce is now a permanent fixture on the retail landscape. Market research firm Research and Markets estimates this industry will reach $71 trillion in annual sales by 2028, taking its compound annual growth rate (CAGR) to 27% during that time. Although numerous companies across the retail landscape will benefit from this impressive growth, Amazon (NASDAQ: AMZN), MercadoLibre (NASDAQ: MELI), and Shopify (NYSE: SHOP) are particularly well-positioned to enrich investors.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9cad4e1c-ffc2-3328-9125-5cbeb48ab329/3-e-commerce-stocks-you-can.html", "symbols": ["307.F", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "MELI.US", "MELI34.SA", "MELIN.MX", "MLB1.F", "SHOP.TO", "SHOP.US"], "tags": [], "sentiment": {"polarity": 0.751, "neg": 0, "neu": 0.887, "pos": 0.113}}, {"date": "2023-09-24T10:25:00+00:00", "title": "You Don't Have to Pick a Winner in E-Commerce. Here's Why", "content": "It's hard to find a more noticeable shift among consumers in the past couple of decades than the growth of online shopping. The rise of the internet, coupled with the popularity of the smartphone and proliferation of digital payments, has resulted in a completely new industry that has registered rapid gains. Let's take a closer look at this secular trend.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4806097d-e979-3c03-81d3-8ab53ef84a6c/you-don%27t-have-to-pick-a.html", "symbols": ["307.F", "3E2.F", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "ETSY.US", "SHOP.TO", "SHOP.US"], "tags": [], "sentiment": {"polarity": 0.772, "neg": 0.022, "neu": 0.853, "pos": 0.126}}, {"date": "2023-09-24T09:52:00+00:00", "title": "Here Are the 3 George Soros Stocks Most Likely to Turn $200,000 Into $1 Million Over the Next 20 Years", "content": "Want to know the most important ingredient to success as an investor? Multibillionaire George Soros, for example, owns more than 50 stocks in his Soros Fund Management hedge fund. Here are the three Soros stocks that are most likely to turn $200,000 into $1 million over the next 20 years, in my view.\n\nContinue reading", "link": "https://finance.yahoo.com/m/0e27a57b-2460-3669-a0bf-965f6480d10a/here-are-the-3-george-soros.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA"], "tags": [], "sentiment": {"polarity": 0.724, "neg": 0, "neu": 0.88, "pos": 0.12}}, {"date": "2023-09-24T00:00:00+00:00", "title": "You Don't Have to Pick a Winner in E-Commerce. Here's Why", "content": "A massive industry like online shopping provides numerous investment angles.", "link": "https://www.fool.com/investing/2023/09/24/you-dont-have-to-pick-a-winner-e-commerce-stocks/", "symbols": ["AMZN.US"], "tags": [], "sentiment": {"polarity": 0.361, "neg": 0, "neu": 0.762, "pos": 0.238}}, {"date": "2023-09-24T00:00:00+00:00", "title": "3 E-Commerce Stocks You Can Buy and Hold for the Next Decade", "content": "Analysts predict rapid growth in the e-commerce industry for the foreseeable future.", "link": "https://www.fool.com/investing/2023/09/24/3-e-commerce-stocks-buy-hold-next-decade/", "symbols": ["AMZN.US"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0, "neu": 0.809, "pos": 0.191}}, {"date": "2023-09-24T00:00:00+00:00", "title": "Here Are the 3 George Soros Stocks Most Likely to Turn $200,000 Into $1 Million Over the Next 20 Years", "content": "The multibillionaire's portfolio features some moneymaking ideas.", "link": "https://www.fool.com/investing/2023/09/24/heres-the-1-george-soros-stock-most-likely-to-turn/", "symbols": ["AMZN.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-09-24T00:00:00+00:00", "title": "Amazon Tests Prime Member Loyalty With Streaming Ad Push", "content": "Amazon is betting that Prime members won't mind some ads.", "link": "https://www.fool.com/investing/2023/09/24/amazon-tests-prime-member-loyalty-with-streaming-a/", "symbols": ["AMZN.US"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0, "neu": 0.841, "pos": 0.159}}, {"date": "2023-09-24T00:00:00+00:00", "title": "2 Spectacular AI Growth Stocks Down 27.5% and 44% to Buy Now and Hold Forever", "content": "Want to profit from the rise of artificial intelligence? These two industry leaders stand out as great buys right now.", "link": "https://www.fool.com/investing/2023/09/24/spectacular-ai-growth-stocks-down-buy-and-hold/", "symbols": ["AMZN.US"], "tags": [], "sentiment": {"polarity": 0.886, "neg": 0, "neu": 0.584, "pos": 0.416}}, {"date": "2023-09-24T00:00:00+00:00", "title": "Nvidia, Amazon, and Alphabet Announced 3 Key Artificial Intelligence (AI) Developments Last Week You May Have Missed", "content": "The AI revolution is charging ahead, and three of the biggest names in the space offered updates.", "link": "https://www.fool.com/investing/2023/09/24/nvidia-amazon-alphabet-ai-development-miss/", "symbols": ["AMZN.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-09-23T22:11:13+00:00", "title": "10 Best Mid-Cap Growth ETFs", "content": "In this article, we will take a look at the 10 best mid-cap growth ETFs to buy. If you want to skip our discussion on the mid-cap ETF industry, you can check out the 5 Best Mid-Cap Growth ETFs.\n\nAround 20% of the total market capitalization of the US equity market is represented by mid-cap companies with a market cap between $2 billion and $15 billion. According to VettaFi, there are around 23 exchange-traded funds (ETFs) that can be considered as mid-cap growth ETFs with a combined asset under management (AUM) of $169.8 billion. The size of the ETF industry assets stood at $7.3 trillion at the end of the second quarter of 2023. Investors often consider mid-cap companies as an attractive investment option due to their potential for significant growth, which can surpass what large-cap and mega-cap corporations offer. Moreover, mid-cap companies typically maintain a more stable and secure business model compared to their smaller counterparts. According to the US Bureau of Labor Statistics (BLS), 30% of new businesses cease their operations within a brief period of two years from inception. This figure increases to 45% after five years and 65% after a decade. Historically, mid-cap companies have grown to become large-cap or mega-cap companies with a heavily defendable business model. Interestingly, mid-cap ETFs have not garnered as much attention as their large-cap and mega-cap counterparts and have observed a net outflow of $106 billion in the last five years. Furthermore, the number of mid-cap active funds saw a decline between 2003 and 2018 from 371 to 301. Meanwhile, the number of large-cap funds remained consistent at 816 during the same period.\n\nAccording to S&P Dow Jones Indices, mid-cap stocks have received the lowest asset allocation historically, even lower than that allocated to the small-cap universe. Despite the prevailing beliefs and recent trends, data reveals that mid-cap stocks have actually outperformed both large-cap and small-cap stocks. Since December 1994, the S&P MidCap 400 has outperformed the S&P 500 by 2.03% and the S&P SmallCap 600 by 0.92% on an annualized basis. Some of the best mid-cap stocks, such as Vistra Corp. (NYSE:VST), and Bill.com Holdings, Inc. (NYSE:BILL), Antero Resources Corporation (NYSE:AR), are now attracting hedge fund attention. Here’s what TimesSquare Capital said about Antero Resources Corporation (NYSE:AR) in its Q3 2022 investor letter:\n\nStory continues\n\n“New to the portfolio this quarter is Antero Resources Corporation (NYSE:AR), a natural gas focused exploration and production company with operations in Pennsylvania and Ohio. The continued buildout of U.S. liquefied natural gas stems from utility plants switching from coal to natural gas and European demand.”\n\nTrends in Mid-Cap Funds and US Equity Market\n\nIn the short term, mid-cap funds have experienced a net outflow of funds, while the overall US equity market witnessed a net inflow of $9.7 billion during the week ending on September 13, as reported by LSEG. Experts believe that mid-cap companies are losing against large-cap corporations because mid-cap companies do not have the same level of opportunity to access low-cost labor markets outside the US by outsourcing their operations. Furthermore, they are not able to tap less regulated markets overseas. These factors act as a bottom-line booster for large-cap stocks. There is also a widespread belief that mega-cap and large-cap companies continue to outperform mid-cap companies during extended periods of slow economic growth. This is because large-cap companies can cut costs more effectively through restructuring and other efforts as compared to their mid-cap counterparts.\n\nIt must be noted that mid-cap companies are usually acquisition targets by large-cap companies. There have been numerous examples of mid-cap companies getting acquired by mega-cap or large-cap behemoths in the recent past. Microsoft Corporation (NASDAQ:MSFT), for instance, has been at the forefront of this strategy as it has completed several acquisitions in the last decade. The Redmond, Washington-based company completed the takeover of Skype Technologies for a sum of $8.5 billion in 2011. The acquisition aided Microsoft Corporation (NASDAQ:MSFT) in integrating live audio and video communications platforms into its operating system and gaming console. Similarly, the company completed the acquisition of ZeniMax Media in September 2020 for $8.1 billion to boost its gaming division. Furthermore, Microsoft Corporation (NASDAQ:MSFT) acquired the devices and services division of Nokia Oyj (NYSE:NOK) for $7.2 billion in September 2013 to double down on its bet on mobile devices. The Seattle, Washington-based technology conglomerate Amazon.com, Inc. (NASDAQ:AMZN) also implemented a similar strategy of boosting its digital content platform through the acquisition of Metro-Goldwyn-Mayer (MGM) for $8.50 billion in May 2021. The near-century-old studio had a content library that comprised over 4,000 film titles and 17,000 TV episodes. 10 Best Mid-Cap Growth ETFs\n\nPhoto by Nicholas Cappello on Unsplash\n\nOur Methodology\n\nWe have shortlisted the 10 best mid-cap growth ETFs for the long term on the basis of 5-year performance. All 10 mid-cap growth ETFs on our list were able to beat the performance of the broader S&P Mid-Cap 400 Index, which experienced a rise of 25.62% in the last five years. Among these ETFSs, Vanguard U.S. Momentum Factor ETF (CBOE:VFMO) stands out as the best Vanguard mid-cap growth ETF. The best mid-cap growth ETFs have been ranked in ascending order of their 5-year performance as of September 21.\n\nBest Mid-Cap Growth ETFs\n\n10. Alpha Architect U.S. Quantitative Momentum ETF (CBOE:QMOM)\n\n5-Year Price Performance: 31.9%\n\nTotal Net Assets as of September 21, 2023: $197.58 million\n\nExpense Ratio: 0.39%\n\nNumber of Holdings: 50\n\nAlpha Architect U.S. Quantitative Momentum ETF (CBOE:QMOM) is an actively managed ETF that invests primarily in US mid-cap stocks, defined as companies with market caps between $1 billion and $15 billion. The fund selects stocks based on a rules-based quantitative momentum strategy. Momentum investing tends to favor growth stocks that are exhibiting strong recent price performance. The ETF selects 50 stocks based on 12-month and 6-month momentum, trading volume, and market capitalization. The portfolio is rebalanced and reconstituted quarterly.\n\n9. First Trust Multi Cap Growth AlphaDEX Fund (NASDAQ:FAD)\n\n5-Year Price Performance: 34.4%\n\nTotal Net Assets as of September 21, 2023: $174.34 million\n\nExpense Ratio: 0.63%\n\nNumber of Holdings: 675\n\nFirst Trust Multi Cap Growth AlphaDEX Fund (NASDAQ:FAD) invests in US stocks selected from the NASDAQ US 500 Large Cap, NASDAQ US 600 mid-cap, and NASDAQ US 700 small-cap indexes. Stocks are selected based on growth factors like 3-year EPS growth, price appreciation, and price-to-book value. First Trust Multi Cap Growth AlphaDEX Fund (NASDAQ:FAD) implements a multi-factor stock selection mechanism. The top 10 holdings of the ETF have a cumulative weight of 4.97%, which reflects less concentration at the top, like traditional cap-weighted ETFs. First Trust Multi Cap Growth AlphaDEX Fund (NASDAQ:FAD) has secured the ninth position on our list of the best mid-cap growth ETFs.\n\n8. Etho Climate Leadership U.S. ETF (NYSEARCA:ETHO)\n\n5-Year Price Performance: 35.6%\n\nTotal Net Assets as of September 21, 2023: $178.24 million\n\nExpense Ratio: 0.45%\n\nNumber of Holdings: 261\n\nEtho Climate Leadership U.S. ETF (NYSEARCA:ETHO) invests in US mid-cap stocks selected based on climate leadership criteria. The ETF tracks the Etho Climate Leadership Index. Companies are screened for ESG metrics, fossil fuel involvement, and other environmental factors. The index selects the top 100 climate leaders. Three of the top five holdings of Etho Climate Leadership U.S. ETF (NYSEARCA:ETHO) are mid-cap growth stocks in the form of Telephone and Data Systems, Inc. (NYSE:TDS), Advanced Drainage Systems, Inc. (NYSE:WMS), and Lennox International Inc. (NYSE:LII).\n\nThe London Company shared its stance on Lennox International Inc. (NYSE:LII) in its Q3 2022 investor letter. Here’s what the firm said:\n\n“Lennox International Inc. (NYSE:LII) – LII outperformed during 02. While residential HV AC volume turned negative, current trends are consistent with expectations. Additionally, the new CEO is executing well against stated objectives, specifically, on restoring profitability of the Commercial segment. We are also supportive of management’s decision to sell the international business, which we viewed as a subscale distraction. We see LII as a high quality business in a good industry with opportunities to improve, and we are pleased to see the company effectively attacking opportunities for improvement.”\n\n7. First Trust Mid Cap Growth AlphaDEX Fund (NASDAQ:FNY)\n\n5-Year Price Performance: 35.6%\n\nTotal Net Assets as of September 21, 2023: $269.6 million\n\nExpense Ratio: 0.70%\n\nNumber of Holdings: 225\n\nFirst Trust Mid Cap Growth AlphaDEX Fund (NASDAQ:FNY) aims to achieve investment results that closely track the price and yield performance of the NASDAQ AlphaDEX Mid Cap Growth Index. The ETF utilizes the AlphaDEX stock selection methodology to select mid-cap growth stocks from the NASDAQ US 600 MidCap Index. This methodology evaluates stocks based on three growth factors, namely the three-year earnings growth, sales growth, and return on assets. The stocks are ranked on these growth factors, and the top-ranked quintile is selected for inclusion in the index.\n\n6. Vanguard U.S. Momentum Factor ETF (CBOE:VFMO)\n\n5-Year Price Performance: 35.8%\n\nTotal Net Assets as of September 21, 2023: $351.38 million\n\nExpense Ratio: 0.13%\n\nNumber of Holdings: 554\n\nVanguard U.S. Momentum Factor ETF (CBOE:VFMO) seeks to track the performance of the CRSP US Momentum Factor Index, which measures the investment return of US stocks with high momentum characteristics. The ETF tracks an index of large and mid-cap US stocks exhibiting high momentum based on their risk-adjusted returns over the past 6 and 12 months. Stocks are weighted by their momentum score. The portfolio is reconstituted and rebalanced twice a year. Vanguard U.S. Momentum Factor ETF (CBOE:VFMO) has a high concentration in the technology sector.\n\nIn addition to ETFs, the best mid-cap stocks, such as Vistra Corp. (NYSE:VST), Bill.com Holdings, Inc. (NYSE:BILL), and Antero Resources Corporation (NYSE:AR), are also attracting investor attention.\n\nClick to continue reading and see the 5 Best Mid-Cap Growth ETFs. Suggested articles:\n\n10 Best Canadian ETFs Wall Street Analysts Just Trimmed Price Targets for These 10 Stocks Wall Street Analysts See Upside Potential for 10 Stocks with Rising Price Targets\n\nDisclosure: None. 10 Best Mid-Cap Growth ETFs is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/10-best-mid-cap-growth-221113926.html", "symbols": ["7A6.F", "AMZN.US", "AR.US", "BILL.US", "FAD.US", "FNY.US", "GSPC.INDX", "LII.US", "LXI.F", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA", "NOK.US", "TDS.US", "VST.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.011, "neu": 0.834, "pos": 0.154}}, {"date": "2023-09-23T19:44:00+00:00", "title": "Amazon and Target gives shoppers good news", "content": "Retailers like Walmart, Target, Costco and Amazon have openly talked about rising costs and having to charge higher prices to customers. For many people, seasonal opportunities can be a foot in the door.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d22ed0a2-9951-3876-9bd4-2d6ec32b28d6/amazon-and-target-gives.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "DYH.F", "TGT.MX", "TGT.US", "TGTB34.SA", "WALM34.SA", "WMT.F", "WMT.MX", "WMT.US", "WMT.XETRA"], "tags": [], "sentiment": {"polarity": 0.7, "neg": 0, "neu": 0.82, "pos": 0.18}}, {"date": "2023-09-23T18:00:40+00:00", "title": "Hidden Gems: 3 AI Stocks Flying Under the Radar", "content": "While the hype may have died down, artificial intelligence (AI) is still the leading catalyst in the technology space.\n\nGrand View Research forecasts that the market for AI will reach nearly $2 trillion by 2030, and nearly every major tech company is racing to integrate generative AI into their products. While its still early, clear winners have emerged in the sector. Stocks that are most closely associated with and exposed to AI have seen share prices explode this year, doubling and even tripling.\n\nHowever, other options remain available to investors who may have missed the boat on the obvious AI stocks, such as the following three that are flying under the radar.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nAmazon (AMZN) Closeup of the Amazon logo at Amazon campus in Palo Alto, California. The Palo Alto location hosts A9 Search, Amazon Web Services, and Amazon Game Studios teams. AMZN stock\n\nSource: Tada Images / Shutterstock.com\n\nAmazon (NASDAQ:AMZN) is launching a “smarter and more conversational” version of its popular Alexa voice assistant, powered by AI.\n\nThe company has said that it hopes the newly revamped Alexa assistant will boost the its position within the AI sector. AMZN currently lies low compared to rivals such as Alphabet (NASDAQ:GOOG, NASDAQ:GOOGL).\n\nThe new AI feature being added to Alexa is called “Let’s Chat”. Amazon says it should be available to consumers before the year-end holidays. Similar to ChatGPT and other generative AI chatbots, Alexa will be able to compose and send emails and other text messages.\n\nAmazon engineers and programmers say they hope to use generative AI to optimize, improve and integrate the company’s suite of smart home products. Those include cameras, alarms, and thermostats. AMZN stock is up 50% year to date (YTD).\n\nAdvanced Micro Devices (AMD) Sign of AMD office in Markham, Ontario, Canada. Advanced Micro Devices, Inc. is an American multinational semiconductor company.\n\nSource: JHVEPhoto / Shutterstock.com\n\nMicrochip and semiconductor company Advanced Micro Devices (NASDAQ:AMD) doesn’t get nearly as much attention for its AI space as its rival Nvidia (NASDAQ:NVDA).\n\nYet AMD is making aggressive moves to become a leading supplier of the chips and semiconductors that power advanced AI applications. In June of this year, Advanced Micro Devices introduced a new AI microchip called the “MI300X”. It rivals the most advanced chip from Nvidia. AMD plans to begin shipping to customers by year’s end.\n\nStory continues\n\nThe company’s new MI300X chip has been designed specifically for large language models and other generative AI applications. The chip uses up to 192 gigabits of memory, which means it can accommodate bigger AI models than rival chips.\n\nIn contrast, Nvidia’s H100 chip supports only 120 gigabits of memory. Advanced Micro Devices is also developing its own software for its AI applications called “ROCm”. Impressively, AMD stock is up 50% YTD.\n\nAdobe (ADBE) Website of Adobe (ADBE) Firefly seen in an iPhone. In Mar 2023 Adobe announced the beta launch of its new generative AI model Firefly.\n\nSource: Koshiro K / Shutterstock.com\n\nAdobe’s (NASDAQ:ADBE) recent earnings print was all about the software company’s new suite of generative AI products.\n\nDays prior to its public report, Adobe unveiled several new AI tools and enhancements for its various consumer products. The company shared that its AI products are already helping to bolster its earnings. In fact, the company reports a profit of $4.09 a share for its fiscal third quarter, beating Wall Street expectations of $3.98 a share.\n\nAdobe executives say the company is now looking to raise prices on its AI applications. They plan to increase prices by 8% to 10% for its creative cloud plans starting on November 1.\n\nThis past spring, Adobe launched its Firefly suite of AI tools that includes a popular text-to-image feature. During its recent earnings call with analysts and media, Adobe said so far this year, its customers have produced more than two billion images using Firefly products. ADBE stock is up 52% in 2023.\n\nOn the date of publication, Joel Baglole held long positions in GOOGL and NVDA. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.\n\nMore From InvestorPlace\n\nMusk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. ChatGPT IPO Could Shock the World, Make This Move Before the Announcement The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post Hidden Gems: 3 AI Stocks Flying Under the Radar appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/hidden-gems-3-ai-stocks-180040490.html", "symbols": ["ADB.F", "ADBE.US", "ADBE34.SA", "AMD.US", "AMZN.US", "NVDA.US"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.029, "neu": 0.858, "pos": 0.113}}, {"date": "2023-09-23T17:00:15+00:00", "title": "Don’t Shop at Whole Foods on These Days of the Week", "content": "anouchka / Getty Images\n\nOne of the first natural food grocery store chains in the United States, Whole Foods was originally founded in Austin, Texas in 1980. Since then, it has expanded throughout the country and beyond to Canada and the United Kingdom. Now, there are over 500 locations in these countries overall.\n\nMore: Don’t Shop at Dollar Tree on This Day of the Week\r\nLearn: How To Get Cash Back on Your Everyday Purchases\n\nWhole Foods is still a great place to shop for organic and natural foods, but like other major grocery stores, there are certain days of the week that are better to shop at than others. On certain days, it might be better to avoid going altogether — largely due to longer checkout lines, more crowds, and potentially limited stock on the shelves.\n\nIf you’re thinking about shopping at Whole Foods, these are the best and worst times to go, as well as some ways to save money and time on your shopping trip.\n\nBest Days To Shop at Whole Foods: Wednesdays and Fridays\n\nTwo of the best days to hit up Whole Foods are Wednesday and Friday — just not after work. One reason for this is that there tend to be fewer customers on these days.\n\n“The two best days to shop are Wednesday and Friday,” said Melissa Cid, consumer savings expert at MySavings.com. “New sales start every Wednesday, [so] shop early and you’ll be rewarded with stocked shelves and minimal crowds during your midweek trip. Friday’s are a great time to shop fresh perishable foods like meats, fish, produce, and breads as the store prepares for the impending weekend rush.”\n\nSamantha Landau, consumer expert at TopCashback.com, added, “At Whole Foods, Wednesday is the best day to shop. On Wednesday, the sale cycle is updated with new weekly deals and discounts. Additionally, this is the day that Whole Foods prepares fresh batches of all of their prepackaged foods and pre-cut veggies.”\n\nKeep in mind that certain locations might have their own delivery days and times. “If you’re looking to shop specific products as soon as they hit the shelf, you’ll need to talk to your grocery manager to inquire about delivery days,” said Cid. “This varies by location and local supply chain.”\n\nStory continues\n\nInteresting: 8 Companies That Produce Costco’s Kirkland Brand Products\n\nWorst Days To Shop at Whole Foods: Saturdays and Sundays\n\nIf the middle of the week tends to be the quietest time to go shopping, then it stands to reason that the weekends are the busiest.\n\n“If possible, avoid the weekend rush when you are more likely to come across empty shelves, crowds, and picked-over meats and produce,” said Cid.\n\nThis isn’t unique to Whole Foods either. Many retailers and supermarket chains are simply at their busiest on Saturdays and Sundays. After all, these are the days when most people are off from work and are hitting the stores for their shopping needs.\n\nYou may also want to avoid shopping on weekday evenings as more people head to the grocery store right after work to pick up food for the day or week. If you do go out during these times, you could also get stuck in rush-hour traffic or longer queues.\n\nTips To Save Time and Money at Whole Foods\n\nLooking to save more time or money at Whole Foods? Here are some strategies:\n\nPrice compare. Certain items are more expensive at Whole Foods than they are elsewhere, but you can still score some great deals. “You can absolutely save money at Whole Foods,” said Cid. “My go-to item is brown eggs, which I’ve found to be cheaper than anywhere else, even Walmart.” Shop the 365 brand. “Whole Foods’ 365 brand has great deals that beat [other] store brand products in both value and quality,” said Cid. Plan your meals out ahead of time. Planning out your meals for the week (or longer) and creating a detailed grocery list around that can help ensure you get only what you need. It can also limit impulse buying. Plus, it can lower the chances of you forgetting something and having to come back later — and potentially purchasing more things you don’t actually need. Check out the current deals. Whole Foods sometimes has deals going on that result in lower prices on everyday essentials and ingredients. If you’re an Amazon Prime member, you could get even more savings. “If you have Amazon Prime, you can score an extra 10% off your storewide purchases at Whole Foods just by scanning your Amazon app at checkout,” said Landau. “You should also check your email for exclusive weekly grocery deals for Prime members.” See if your local Whole Foods is busy online. If you want to know how busy your local grocery store is before you go, do a quick Google search to see if there’s a “Popular times” chart. This will give you an idea of how busy the store is right now and when might be better to go. Use rebate. “Check Ibotta and Fetch rebate apps often for special cashback deals on select products at Whole Foods, and sign up for Social Nature for possible free product coupons that you can redeem in-store,” suggested Cid. Use cash back. With a cash-back rewards credit or debit card, you can earn a small amount back on qualifying purchases — such as groceries. Once you’ve accumulated a certain amount, you can redeem those points for cash. “Since prices have increased, you’ll want to maximize your savings with your credit card,” said Landau. “Review the terms of your credit card’s program to determine which spending categories give you the most cash back, rewards points or miles per dollar spent — and make sure to use that card when shopping for those items.”\n\nMore From GOBankingRates\n\nHow To Get Free Money: 13 Proven Ways Successful Retirees Master These 7 Money Moves To Keep Their Retirement Funds Secure 3 Things You Must Do When Your Savings Reach $50,000 How to Save $200,000 Cash By Improving Your Credit Score\n\nThis article originally appeared on GOBankingRates.com: Don’t Shop at Whole Foods on These Days of the Week", "link": "https://finance.yahoo.com/news/don-t-shop-whole-foods-170015345.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.027, "neu": 0.798, "pos": 0.174}}, {"date": "2023-09-23T14:00:00+00:00", "title": "Is Amazon a Buy Now?", "content": "Over the past decade, Amazon (NASDAQ: AMZN) shares have crushed the broader market, soaring 782%. As of this writing, shares of Amazon trade at a price-to-sales multiple of 2.6, which is substantially below the five-year trailing average of 3.2. Let's take a closer look at Amazon's business, where it's headed, and what this could all mean for investors.\n\nContinue reading", "link": "https://finance.yahoo.com/m/33bc6ead-6c46-322d-a7c4-d8e563e87f47/is-amazon-a-buy-now%3F.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA"], "tags": [], "sentiment": {"polarity": 0.202, "neg": 0.045, "neu": 0.865, "pos": 0.09}}, {"date": "2023-09-23T13:24:00+00:00", "title": "Amazon and Target give Americans an early Christmas gift", "content": "Retailers like Walmart, Target, Costco and Amazon have openly talked about rising costs and having to charge higher prices to customers. For many people, seasonal opportunities can be a foot in the door.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d22ed0a2-9951-3876-9bd4-2d6ec32b28d6/amazon-and-target-give.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "DYH.F", "TGT.MX", "TGT.US", "TGTB34.SA", "WALM34.SA", "WMT.F", "WMT.MX", "WMT.US", "WMT.XETRA"], "tags": [], "sentiment": {"polarity": 0.7, "neg": 0, "neu": 0.82, "pos": 0.18}}, {"date": "2023-09-23T12:30:00+00:00", "title": "2 Warren Buffett Stocks to Hold Forever", "content": "These companies have provided Berkshire Hathaway with consistent gains and could do the same for your portfolio.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a0793f4c-01ad-3d2b-bfea-797349dd88df/2-warren-buffett-stocks-to.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA"], "tags": [], "sentiment": {"polarity": 0.34, "neg": 0, "neu": 0.882, "pos": 0.118}}, {"date": "2023-09-23T11:35:00+00:00", "title": "Google's Startling Admission Confirms What Investors Have Long Suspected", "content": "Once upon a time, Alphabet (NASDAQ: GOOGL) (NASDAQ: GOOG) seemed invulnerable. The company maintained an insurmountable position in search and parlayed its supremacy into a pole position in the digital search market -- and no rival even came close. Over the past several years, however, even while its search continued to dominate, it appeared Google's share of the digital advertising market had been slipping -- slowly and gradually -- but falling nonetheless.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a1148040-ebb7-3e24-a711-c8cd102ee632/google%27s-startling-admission.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "FB2A.F", "FB2A.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US"], "tags": [], "sentiment": {"polarity": -0.103, "neg": 0.063, "neu": 0.879, "pos": 0.058}}, {"date": "2023-09-23T10:54:54+00:00", "title": "12 Best Streaming and TV Stocks To Buy Now", "content": "In this article, we will discuss the 12 best streaming and TV stocks to buy now. If you want to skip our detailed analysis of the streaming industry and recent trends shaping the streaming market, go directly to 5 Best Streaming and TV Stocks To Buy Now.\n\nStreaming has become an integral part of our daily lives, from watching movies and TV shows to listening to music and playing games. The rise of streaming services has been incredible, and there are no signs of slowing down. The streaming market size is projected to grow to $1.9 trillion by 2028, as noted by Fortune Business Insights. This remarkable growth is a testament to the profound impact streaming has had on our entertainment habits. In fact, if anything, the pace of change in streaming is only going to quicken, and the future is going to be even more exciting, going by some of the emerging trends and technologies on the horizon.\n\nExponential advances in technology have changed entire industries, especially over the past 10 to 15 years. For example, Netflix, Inc. (NASDAQ:NFLX), Amazon.com, Inc. (NASDAQ:AMZN)’s Prime Video, Hulu, and other digital channels or streaming services have acted as massive disruptive forces within the media and television industries.\n\nNetflix, Inc. (NASDAQ:NFLX) maintains a strong competitive edge compared to legacy media giants, as switching to streaming services for entertainment becomes more dominant. Netflix has demonstrated outstanding financial performance, with a return of 31.00% year-to-date (YTD) and 63.09% in the last 12 months. Over the past 10 years, the company had an annualized return of 24.58%, outperforming the S&P 500 benchmark, which had an annualized return of 9.99% during the same period.\n\nOn the other hand, The Walt Disney Company (NYSE:DIS) has faced challenges in its financial performance, with a return of -4.97% year-to-date (YTD) and -20.99% in the last 12 months. Over the past 10 years, The Walt Disney Company had an annualized return of 3.45%, underperforming the S&P500 index.\n\nStory continues\n\nIn July 2023, The Walt Disney Company (NYSE:DIS)'s CEO Bob Iger extended his contract through 2026, acknowledging the challenges ahead. Iger's concern about Disney's TV networks, which he suggested may not be central to Disney's core, highlights the industry's shifting priorities. The battle for supremacy in streaming and content distribution will undoubtedly persist, with Netflix, Inc. (NASDAQ:NFLX) at the forefront of innovation and adaptation.\n\nEnsemble Capital Management shared a noteworthy observation about Netflix, Inc. (NASDAQ:NFLX) in their Q2, 2023 investor letter:\n\n“Netflix, Inc. (NASDAQ:NFLX) (+27.5%): Netflix posted a great quarter supported by a positive response to its password sharing crackdown and advertising-supported service rollout. In addition, some of its major competitors have been struggling, including Disney+ which lost subscribers in the first quarter for the first time in its history.”\n\nIn the second quarter of 2023, Polen Focus Growth Strategy also turned its attention to stocks like Netflix, Inc. (NASDAQ:NFLX), further emphasizing the streaming giant's prominence in the investment landscape. In their Q2, 2023 investor letter, Polen Focus Growth Strategy provided the following insight regarding Netflix, Inc. (NASDAQ:NFLX):\n\n\"The top absolute contributors to the Portfolio’s performance in the second quarter were Amazon, Netflix, and Microsoft. As mentioned, Amazon and Netflix are seeing their revenue growth accelerate after a difficult 2022 while keeping expense growth in check. We expect robust earnings growth for both companies in 2023 and growth rates in the mid-teens or higher well into the future.”\n\nThe Walt Disney Company (NYSE:DIS)'s CEO Bob Iger has also been actively discussing his strategy to bring Disney+ to profitability in recent earnings calls and interviews. A notable component of this plan is the integration of advertising within the Disney+ platform. Recognizing the need to evolve in the competitive streaming landscape, Iger's emphasis on advertising reflects Walt Disney Company (NYSE:DIS)'s commitment to adapt and thrive in the evolving market.\n\nInvestor attention is now shifting toward legacy media companies like Paramount Global (NASDAQ:PARA) and Comcast Corporation (NASDAQ:CMCSA), all of which possess significant pay-TV network portfolios. Bob Iger's recent statement that traditional TV may not align with Disney's core strategy has put these companies in the spotlight, with investors closely monitoring their responses, including the potential consideration of a sale, in the face of a rapidly changing media landscape.\n\nIn light of the most recent news and industry trends, it's time to uncover the 12 best streaming and TV stocks to buy now. 12 Best Streaming and TV Stocks To Buy Now\n\nCopyright: lculig / 123RF Stock Photo\n\nOur Methodology\n\nTo compile our list of 12 best streaming and TV stocks, we first made a list of all streaming and TV companies in the US. Then, the number of hedge funds that had invested in them during Q2, 2023 was determined through Insider Monkey's database of 943 hedge funds. We then ranked based on the number of hedge funds holding stakes in them in ascending order.\n\n12 Best Streaming and TV Stocks To Buy Now\n\nhere is the list of the 12 best streaming and TV stocks to buy now.\n\n12. FuboTV Inc (NYSE:FUBO)\n\nNumber of Hedge Funds In Q2 2023: 13\n\nFuboTV, a live-streaming television service with a primary focus on channels offering live sports content, caters to customers in the United States, Canada, and Spain, providing access to various sports leagues and tournaments.\n\nIn its most recent earnings report of Q2, 2023, Fubo outperformed expectations in North America, achieving a total revenue of $305 million, marking a significant 41% increase compared to the same quarter in the previous year. Additionally, they garnered a total of 1,167,000 paid subscribers.\n\nOn Sep. 13, 2023, technology analyst Darren Aftahi from Roth MKM held a \"Hold\" rating for FuboTV and set a $3.00 price target.\n\n11. iQIYI, Inc. (NASDAQ:IQ)\n\nNumber of Hedge Funds In Q2 2023: 20\n\niQIYI, Inc. (NASDAQ:IQ) is a streaming service renowned for its diverse content library, which includes a wide array of Asian dramas, movies, variety shows, and anime, all complemented by subtitles and dubbing for a global audience.\n\nOn August 23, 2023, Charlene Liu, an analyst at HSBC, reduced the price target for iQIYI (NASDAQ: IQ) to $5.60, down from the previous target of $5.80, all the while keeping a \"Hold\" rating for the stock. This assessment suggests that iQIYI, Inc. (NASDAQ:IQ) remains an attractive investment option, although it may face some revised expectations.\n\nFurthermore, within the realm of hedge fund investments, it's notable that as of Q2, 2023, 20 out of 910 hedge funds tracked by Insider Monkey held stake in iQIYI, Inc. (NASDAQ:IQ). Among these funds, Farallon Capital stands out as a major player, holding the majority of iQIYI Inc. shares amongst hedge funds with a total value of $182 million.\n\n10. Roku, Inc. (NASDAQ:ROKU)\n\nNumber of Hedge Funds In Q2 2023: 29\n\nRoku, Inc. (NASDAQ:ROKU) is an American company headquartered in San Jose, California, specializing in the manufacturing and sale of digital media players for video streaming and audio equipment.\n\nAs of Q2, 2023, data from Insider Monkey revealed that 29 out of the 910 hedge funds tracked by the platform had stake in Roku, Inc. (NASDAQ:ROKU). In addition to strategic partnerships, Roku, Inc. (NASDAQ:ROKU) made a significant move in November 2019 by acquiring the video advertising platform Dataxu for $150 million in cash.\n\nAs of September 7, JPMorgan analyst Cory Carpenter increased the price target for the stock, upping it from $95 to $100. The analyst anticipates several potential positive catalysts on the horizon, including the resolution of Hollywood strikes, the ramping up of third-party partnerships in 2024, and ongoing media carriage disputes that could further accelerate the shift towards streaming.\n\n9. DISH Network Corporation (NASDAQ:DISH)\n\nNumber of Hedge Funds In Q2 2023: 33\n\nDISH Network Corporation (NASDAQ:DISH), an American television provider, offers a range of services, including satellite television through its subsidiary Dish Network, over-the-top IPTV service through Sling TV, and mobile wireless service via Dish Wireless.\n\nOn Aug. 22, 2023, RBC Capital analyst Jonathan Atkin maintained a \"Hold\" rating for DISH Network Corporation (NASDAQ:DISH) and set a price target of $7.00.\n\nIn terms of DISH Network Corporation (NASDAQ:DISH)'s recent financial performance, for Q2 2023, the company reported a quarterly revenue of $3.91 billion and a net profit of $200.32 million for the quarter ending on June 30. This represents a notable decline from Q2 2022, during that quarter, the company reported a revenue of $4.21 billion and a net profit of $522.83 million.\n\nFurthermore, according to data from the Insider Monkey database, Marshall Wace LLP is the primary holder of DISH Network Corporation (NASDAQ:DISH) shares, owning a total of 11,305,711 shares. As of Q2, 2023, 33 funds out of the 910 tracked by Insider Monkey held stake in DISH Network Corporation (NASDAQ:DISH).\n\n8. Paramount Global (NASDAQ:PARA)\n\nNumber of Hedge Funds In Q2 2023: 39\n\nParamount Global (NASDAQ:PARA), a multinational mass media company, is best known for its subsidiary, Paramount+. In the second quarter of 2023, Paramount+ added 700,000 new subscribers, reaching a total of 61 million subscribers.\n\nBerkshire Hathaway, led by legendary investor Warren Buffett, is the largest stakeholder in Paramount Global (NASDAQ:PARA), holding a stake valued at $1.4 billion as of the second quarter of 2023. It is one of the top tv and streaming stocks.\n\nAriel Appreciation Fund made the following comment about Paramount Global (NASDAQ:PARA) in its Q2 2023 investor letter:\n\n“We also added former holding Paramount Global (NASDAQ:PARA)) in the period. Shares tumbled following a lackluster earnings report and subsequent dividend cut, presenting an attractive entry point in this leading entertainment company. PARA’s Filmed Entertainment business has an exciting upcoming 2023 and 2024 movie slate with many high-profile franchises. Its TV Media segment is undergoing a restructuring to save on costs and PARA’s fresh array of global content is driving subscriber momentum worldwide across its direct-to-consumer platform. Meanwhile, management is magnifying its focus on profitability for the streaming service and moderating investments in content, which should drive free cash flow in 2024 and beyond. In our view, the company’s long-term opportunity in streaming and the value of its proprietary content remain meaningfully underappreciated at current trading levels.”\n\n7. Comcast Corporation (NASDAQ:CMCSA)\n\nNumber of Hedge Funds In Q2 2023: 66\n\nComcast Corporation (NASDAQ:CMCSA), an American multinational telecommunications and media conglomerate, holds the distinction of being the largest pay-TV company, the largest cable TV company, and the largest home Internet service provider in the United States.\n\nOn August 9, 2023, Argus Research, a notable financial analysis firm, issued an updated price target for Comcast Corporation (NASDAQ:CMCSA). Argus Research analyst Joseph Bonner, in light of his evaluation, reiterated a \"Buy\" rating for Comcast Corporation (NASDAQ:CMCSA) and raised the price target from $45 to $50.\n\nThis adjustment in the price target indicates a more optimistic outlook for the company's performance. Investors may interpret this upgrade as a shift towards a less bearish stance on Comcast Corporation (NASDAQ:CMCSA), and they are likely to closely monitor the company's future performance.\n\nIn the second quarter of 2023, 66 hedge funds held stake in Comcast Corporation (NASDAQ:CMCSA). Among these, First Eagle Investment Management was a prominent fund, holding a total of 32,452,337 shares. The hedge fund sentiment reflects that Comcast is one of the best tv and streaming stocks.\n\n6. Warner Bros. Discovery, Inc. (NASDAQ:WBD)\n\nNumber of Hedge Funds In Q2 2023: 67\n\nOn August 8, 2023, Barclays analyst Kannan Venkateshwar made adjustments to their evaluation of Warner Bros. Discovery, Inc. (NASDAQ:WBD). The analyst raised the price target on Warner Bros. Discovery, Inc. (NASDAQ:WBD) from $14 to $15 while maintaining their \"Hold\" rating on the stock.\n\nVenkateshwar's analysis was based on Warner Bros. Discovery's Q2 2023 earnings, which were reported on August 3, 2023. In his evaluation, he placed particular emphasis on the company's top-line performance. The analyst acknowledged that licensing revenues had contributed positively to the quarter's results, but he also highlighted the ongoing challenges faced by core media trends. Looking ahead to streaming growth for FY 2024, Venkateshwar expressed the view that it hinges on the success of implementing sharp price increases as normalized content and marketing investments decrease.\n\nLooking ahead, Warner Bros. Discovery, Inc. (NASDAQ:WBD)'s management provided guidance for the third quarter of 2023, anticipating adjusted EBITDA in the range of the low end of $11 billion to $11.5 billion, accompanied by free cash flow estimated at $1.7 billion. Additionally, for the fiscal year 2023, the company expects adjusted EBITDA to be \"U.S. DTC profitable\" and segment losses to amount to a couple of hundred million dollars. Furthermore, the company anticipates free cash flow ranging from $4.5 billion to $5.0 billion for the full year.\n\nAs of Q2 2023, a total of 67 funds among the 910 tracked by us had invested in Warner Bros. Discovery, Inc. (NASDAQ:WBD). This data reflects a significant level of institutional interest in the company, underscoring its prominence within the investment landscape.\n\nMoreover, the Longleaf Partners Fund provided the following commentary regarding Warner Bros. Discovery, Inc. (NASDAQ: WBD) in its investor letter for the second quarter of 2023:\n\n“Warner Bros. Discovery, Inc. (NASDAQ:WBD) – Media conglomerate Warner Bros Discovery was the top detractor in the quarter but remained a top contributor for the first half. After a strong first quarter, the stock price faltered in the face of near-term uncertainty around the re-launch of streaming service Max. Additionally, the big budget movie The Flash has not been a success. Finally, there was well-publicized drama around CNN management, with CNN CEO Chris Licht leaving the company after only one year, which we believe was a positive resolution. The company remains dramatically undervalued today, and management continues to make positive operational progress to drive free cash flow (FCF) growth. We believe this company has seen the worst so will be less leveraged and more strategically positioned in the quarters and years to come. Its underlying holdings are high quality businesses that will drive FCF per share growth while also being attractive acquisition candidates.”\n\nClick to continue reading and see the 5 Best Streaming and TV Stocks To Buy Now.\n\nSuggested Articles:\n\n10 NASDAQ Stocks with Biggest Upside 14 Best Undervalued Stocks To Buy Now 11 Crypto Stocks with Biggest Upside\n\nDisclosure: None. 12 Best Streaming and TV Stocks To Buy Now is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/12-best-streaming-tv-stocks-105454539.html", "symbols": ["0VV.F", "0VVB.F", "AMZN.US", "CMCS34.SA", "CMCSA.MX", "CMCSA.US", "COMB.BR", "CTP2.F", "DIS.MX", "DIS.US", "DISB34.SA", "DISH.MX", "DISH.US", "EOT.F", "FUBO.US", "IQ.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.014, "neu": 0.889, "pos": 0.097}}, {"date": "2023-09-23T10:14:59+00:00", "title": "25 Most Mentally Stimulating Jobs According to Reddit", "content": "In this article, we will talk about the 25 most mentally stimulating jobs according to Reddit. If you want to skip our detailed analysis, head straight to the 10 Most Mentally Stimulating Jobs According to Reddit.\n\nWhy are Mentally Stimulating Jobs Important?\n\nA recent analysis published in The BMJ suggests that mentally stimulating jobs may have a protective effect against dementia. Researchers combined data from multiple studies that examined the relationship between work factors and chronic diseases, disability, and mortality. They found that individuals with cognitively stimulating jobs with independent decision-making and demanding tasks had a 23% lower risk of developing dementia compared to those with less stimulating jobs. The studies, conducted in the United States and Europe, followed participants who were dementia-free at baseline for several years.\n\nAfter accounting for other dementia risk factors, it was observed that those in less stimulating jobs were more likely to experience cognitive decline. However, the analysis couldn't definitively establish whether job type directly impacted the brain or if other factors were at play. Further research is needed to clarify this relationship. Nonetheless, the findings highlight the potential cognitive benefits of mentally challenging jobs.\n\nAre Workers Mentally or Emotionally Involved with Their Jobs?\n\nAccording to Ardent Partners, today, approximately 40% to 50% of the current workforce consists of external workers, like freelancers, contractors, and gig workers. These workers are often not effectively managed or integrated into talent management strategies which often lead to to missed opportunities and compliance risks.\n\nThe concept of \"total talent management\" is introduced as a holistic approach that treats all workers as valuable contributors to the organization. This approach addresses the need for HR to actively manage the entire workforce due to social, economic, and legislative factors, including diversity and inclusion efforts and compliance requirements related to equal pay and misclassification.\n\nStory continues\n\nHowever, balance is always the key. It must be noted that when individuals are presented with tasks that are either too easy or overly challenging, they tend to redefine their job roles to make them more engaging or manageable. This tendency can have detrimental effects on organizations, as it often results in jobs not fulfilling their intended purposes.\n\nTo address this issue, it is important to conduct chartering conversations between managers and their subordinates. These discussions should aim to customize tasks to match each employee's capabilities and interests, and hence, ensure that the work remains both challenging and achievable.\n\nThe Right Workplaces for Mentally Stimulating Jobs with a Balance\n\nAmazon.com, Inc (NASDAQ:AMZN) and Alphabet Inc (NASDAQ:GOOG) are renowned for their rigorous interview processes which sets the stage for a workforce that thrives on intellectual challenges. Both companies are known to select candidates who exhibit exceptional problem-solving skills and creativity, ensuring that their employees possess the cognitive capabilities necessary for demanding roles.\n\nOnce inside these tech giants, the work culture further fosters mental stimulation. Employees are encouraged to think critically and innovate, but also make independent decisions. The dynamic and fast-paced environment at Amazon.com, Inc (NASDAQ:AMZN) and Alphabet Inc (NASDAQ:GOOG) necessitates adaptability and continuous learning which keeps minds engaged and proactive in addressing complex challenges.\n\nFrom a financial perspective, both Amazon.com, Inc (NASDAQ:AMZN)  and Alphabet Inc (NASDAQ:GOOG)  have reaped the benefits of this approach. Alphabet Inc (NASDAQ:GOOG)’s advertising revenue, driven by its search engine and digital advertising platforms, has contributed largely its financial success. Motivated and intellectually stimulated employees stand behind Alphabet Inc. (NASDAQ:GOOG)'s remarkable success.\n\nThe techniques used at Alphabet Inc. (NASDAQ:GOOG) to keep employees stimulated involves employees' tours and travel, great food and among other things, a peer to peer recognition program powered by an internal software that lets employees nominate each other for a reward for handling a work-related problem.\n\nTo read more about how Alphabet Inc (NASDAQ:AMZN) generates revenue through YouTube, check out our article on the highest paid youtubers in the world.  Alphabet Inc (NASDAQ:GOOG) is also one of the top artificial intelligence companies in USA. 25 Most Mentally Stimulating Jobs According to Reddit\n\nlassedesignen/Shutterstock.com\n\nMethodology\n\nFor our list of most mentally stimulating jobs according to Reddit, we exhausted Reddit’s discussion threads to shortlist the most relevant jobs. We utilized keywords like \"intellectually challenging\" and \"mentally demanding roles\" to target the most mentally stimulating jobs. The list has been ranked on the basis of average salaries, in ascending order. We have acquired our data on average salaries from the Bureau of Labor Statistics.\n\nNote: This list is based on our analysis of Reddit threads on the topic and may not include many jobs that are equally or more mentally stimulating than the jobs on the list.\n\nHere is a list of the most mentally stimulating jobs according to Reddit:\n\n25. Market Research Analyst\n\nAverage Salary: $64,051\n\nMarket research analysts collect and analyze data about market trends, consumer preferences, and competitors to help businesses make informed decisions. Companies like Nielsen Holdings Plc (NYSE:NLSN) and The NPD Group rely on market research analysts to gather insights for product development, marketing strategies, and market positioning.\n\n24. Geologist\n\nAverage Salary: $66,597\n\nGeologists study the Earth's processes, materials, and structures. They can work in different industries, like environmental consulting, oil and gas exploration, and mining. Companies like Exxon Mobil Corp (NYSE:XOM) and Freeport-McMoRan Inc (NYSE:FCX) often hire geologists to assess geological risks and discover valuable resources, crucial for their business operations.\n\n23. Game Developer\n\nAverage Salary: $66,754\n\nGame developers create video games, designing gameplay, coding, and developing interactive experiences. Electronic Arts Inc (NASDAQ:EA) and Activision Blizzard Inc (NASDAQ:ATVI) are two companies that often rely on game developers to create and maintain popular gaming titles, and hence, drive revenue through game sales, microtransactions, and subscriptions. It is one of the most mentally stimulating jobs according to Reddit.\n\n22. Forensic Scientist\n\nAverage Salary: $71,831\n\nForensic scientists investigate and analyze physical evidence from crime scenes to help law enforcement and legal proceedings. There are private forensic science firms like Eurofins Scientific SE that offer services to law enforcement agencies and legal firms.\n\n21. Product Manager\n\nAverage Salary: $78,586\n\nProduct managers oversee the development and launch of products, from ideation to market release, ensuring alignment with business goals. Moreover, Apple Inc (NASDAQ:AAPL) believes that the individual responsible for product magement should also be the one to effectively communicate its significance to consumers and developers.\n\n20. Urban Planner\n\nAverage Salary: $82,420\n\nUrban planners design and develop communities by accounting for factors like zoning, infrastructure, and environmental sustainability. Urban planners are hired by real estate developers like Brookfield Corp (NYSE:BN) to ensure compliance with regulations and for planning of attractive, marketable urban spaces.\n\n19. Detective\n\nAverage Salary: $84,333\n\nDetectives investigate crimes, gather evidence, and analyze information to solve cases. There are private investigative firms such as Control Risks Group that provide detective services to businesses, helping to mitigate risks and conduct background checks.\n\n18. Project Manager\n\nAverage Salary: $87,288\n\nProject managers oversee projects from initiation to completion and ensure their goals are met within budget and on schedule. Large corporations like Amazon.com, Inc (NASDAQ:AMZN) and construction companies like Bechtel rely on project managers to execute complex projects efficiently, controlling costs and delivering value to stakeholders. To read more about project managers, check out our article on highest paying countries for project managers.\n\n17. Neuroscientist\n\nAverage Salary: $95,310\n\nNeuroscientists study the brain and nervous system to understand behavior, cognition, and neurological disorders. Pharmaceutical companies such as Pfizer Inc (NYSE:PFE) employ neuroscientists to research and develop treatments for neurological diseases. It is one of the most mentally stimulating jobs according to Reddit.\n\n16. Professor\n\nAverage Salary: $98,676\n\nProfessors engage in continuous learning, research, and critical thinking. They interact with students to make them adapt to new ideas while staying current in their field. This creates an intellectually stimulating environment that encourages personal growth and academic innovation.\n\n15. Management Consultant\n\nAverage Salary: $99,501\n\nManagement consultants advise organizations on strategy, operations, and efficiency improvements. Consulting firms like McKinsey & Company and Accenture Plc (NYSE:ACN) provide management consultants to businesses, helping them optimize processes, reduce costs, and enhance profitability through strategic guidance and problem-solving.\n\n14. Mathematician\n\nAverage Salary: $100,210\n\nMathematicians study mathematical principles and solve complex problems. Mathematicians are valuable in data science and analytics, helping businesses make data-driven decisions. It is one of the most intellectually stimulating jobs according to Reddit.\n\n13.  Architect\n\nAverage Salary: $101,542\n\nArchitects are crucial for corporations because they design functional and aesthetically appealing spaces that enhance productivity, brand image, and employee satisfaction. Their role involves creative problem-solving, collaboration, and the integration of technology, making it mentally stimulating. To read more about architect, check out our article on the highest paying countries for architects.\n\n12. UX/UI Designer\n\nAverage Salary: $103,691\n\nUX/UI designers create user-friendly and visually appealing digital interfaces. Companies hire UX/UI designers to improve user experiences on websites and applications. It is one of the mentally stimulating jobs without a degree.\n\n11. Software Developer\n\nAverage Salary: $106,170\n\nSoftware developers design and build computer programs and applications. Software developers are essential as they develop software products which can improve business processes, and create customer-facing applications. It is one of the most desirable jobs in the world.\n\nClick here to see the 10 Most Mentally Stimulating Jobs According to Reddit.\n\nSuggested Articles:\n\n30 High-Paying Remote Jobs Without a Degree or Experience. 25 Highest Paying Jobs in the World. 17 Highest Paying Government Jobs Without a Degree.\n\nDisclosure: 25 Most Mentally Stimulating Jobs According to Reddit. is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/25-most-mentally-stimulating-jobs-101459903.html", "symbols": ["AAPL.US", "ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "ACN.US", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "ATVI.US", "BN.US", "EA.US", "FCX.MX", "FCX.US", "FPMB.F", "GOGL34.SA"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.025, "neu": 0.781, "pos": 0.194}}, {"date": "2023-09-23T09:50:00+00:00", "title": "Which Top Artificial Intelligence (AI) Stock Could Make Investors the Most Money This Decade? Here's Why It Just Might Be Google.", "content": "Which top AI stock could make investors the most money this decade? Several top AI stocks are legitimately in the running to make the most money during the new version of the Roaring Twenties. Tesla (NASDAQ: TSLA) especially stands out because of its big head start.\n\nContinue reading", "link": "https://finance.yahoo.com/m/065f053d-795a-3d0f-b2f0-46fea79dd2dd/which-top-artificial.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "FB2A.F", "FB2A.XETRA", "GOGL34.SA", "GOGL35.SA", "GOOG.MX", "GOOG.US", "GOOGL.US", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US"], "tags": [], "sentiment": {"polarity": 0.382, "neg": 0, "neu": 0.927, "pos": 0.073}}, {"date": "2023-09-23T09:25:00+00:00", "title": "2 Artificial Intelligence (AI) Growth Stocks Could Eclipse Apple's Value Twice Over, According to This Wall Street Analyst", "content": "Amazon and Microsoft are on the cutting edge of artificial intelligence (AI) innovation, and both growth stocks are compelling investment ideas right now.\n\nContinue reading", "link": "https://finance.yahoo.com/m/710c0128-63e9-3611-9c38-b944062ca813/2-artificial-intelligence.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "APC.F", "APC.XETRA", "MSF.F", "MSF.XETRA", "MSFT.MX", "MSFT.US", "MSFT34.SA"], "tags": [], "sentiment": {"polarity": 0.856, "neg": 0.046, "neu": 0.586, "pos": 0.367}}, {"date": "2023-09-23T00:00:00+00:00", "title": "Hidden Gems: 3 AI Stocks Flying Under the Radar", "content": "However, other options remain available to investors who may have missed the boat on the obvious AI stocks, such as the following three that are flying under the radar.", "link": "https://investorplace.com/2023/09/hidden-gems-3-ai-stocks-flying-under-the-radar/", "symbols": ["ADBE.US", "AMD.US", "AMZN.US"], "tags": [], "sentiment": {"polarity": -0.296, "neg": 0.073, "neu": 0.927, "pos": 0}}, {"date": "2023-09-23T00:00:00+00:00", "title": "2 Artificial Intelligence (AI) Growth Stocks Could Eclipse Apple's Value Twice Over, According to This Wall Street Analyst", "content": "Amazon and Microsoft are on the cutting edge of artificial intelligence (AI) innovation, and both growth stocks are compelling investment ideas right now.", "link": "https://www.fool.com/investing/2023/09/23/2-ai-growth-stocks-eclipse-apples-value-wall-stree/", "symbols": ["AMZN.US"], "tags": [], "sentiment": {"polarity": 0.856, "neg": 0.049, "neu": 0.559, "pos": 0.391}}, {"date": "2023-09-23T00:00:00+00:00", "title": "Is Amazon a Buy Now?", "content": "Investors don't have to look hard to find compelling reasons to like this company.", "link": "https://www.fool.com/investing/2023/09/23/is-amazon-a-buy-now/", "symbols": ["AMZN.US"], "tags": [], "sentiment": {"polarity": 0.459, "neg": 0.083, "neu": 0.655, "pos": 0.262}}]