[{"date": "2023-12-13T21:45:00+00:00", "title": "Some EVs Could Lose the Federal Purchase Tax Credit. Tesla, Ford Models Are at Risk.", "content": "News that the credit will vanish for some Tesla vehicles hit the stock on a day when it was already under pressure from a recall.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9d91be65-f156-308d-88da-ebcce076ac02/some-evs-could-lose-the.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.103, "neg": 0.079, "neu": 0.827, "pos": 0.094}}, {"date": "2023-12-13T21:42:25+00:00", "title": "The 7 Most Undervalued Growth Stocks to Buy in December", "content": "Stocks of a lot of well-known and historically great companies are on sale right now. Many marquee names haven’t shared in this year’s market rally and are in the red for 2023. This presents a fantastic opportunity for investors to buy great stocks at distressed prices.\n\nFor long-term investors, they can now buy beaten down stocks at a discount and great valuation, and benefit when the share price eventually recovers and climbs higher. Some of the most bruised stocks of 2023 already seem to be staging a comeback and are showing signs of life as we barrel into 2024.\n\nHere are the seven most undervalued growth stocks to buy in December.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nNike (NKE) Nike (NKE) store in a shopping mall in Penang, Malaysia. robinhood stocks\n\nSource: TY Lim / Shutterstock.com\n\nSneaker giant Nike (NYSE:NKE) just got an impressive upgrade ahead of its upcoming earnings report on Dec. 21. Analysts at Citigroup (NYSE:C) have upgraded the stock to a “buy” rating from “neutral” previously, and raised their price target on the shares to $135 from $110. Citigroup analyst Paul Lejuez said he is confident in the future of Nike as its China business recovers and its inventories decline following the Covid-19 pandemic.\n\nOther tailwinds that Citigroup sees for Nike include lower freight costs, growth in its direct to consumer strategy, and improving margins. Nike and its stock have struggled coming out of the pandemic due to issues that have included bloated inventories, slowing sales in China, and production problems at its factories in Southeast Asia. Citigroup said it sees most of those issues being resolved over the coming year. NKE stock is flat in 2023 (up less than 1%). However, the share price is up 64% over five years.\n\nFord Motor Co. (F) Ford dealership sign against a blue sky.\n\nSource: D K Grove / Shutterstock.com\n\nFord Motor Co. (NYSE:F) has just announced that it is cutting the 2024 production of its fully electric F-150 Lightning pick-up truck in half following a costly strike by the United Auto Workers (UAW) union. The new production plan calls for 1,600 F-150 Lightning pick-up trucks to be made a week at Ford’s main plant in Dearborn, Michigan. Previously the automaker planned to produce as many as 3,200 F-150 Lightning trucks per week in 2024.\n\nStory continues\n\nFollowing a costly six-week strike by the UAW, Ford has canceled or postponed $12 billion worth of electric vehicle investments. Electric vehicle demand has been slower than the auto industry expected, as prices and interest rates remain elevated. However, sales of the F-150 Lightning have steadily increased in 2023, recording a monthly record of 4,400 sales in November. The gasoline-powered version of the F-150 pick-up truck has been among the bestselling vehicles in North America every year since 1976.\n\nF stock is down 5% in 2023 but shows signs of improving now that the UAW strike is over.\n\nHasbro (HAS) Hasbro (HAS stock) letters standing next to Magic the Gathering trading cards (a game from Hasbro)\n\nSource: Nico Bekasinski / Shutterstock.com\n\nToymaker Hasbro (NASDAQ:HAS) is struggling, but management is trying to turn things around. The company just announced that it is laying off 1,100 workers as weak toy sales persist into the holiday shopping season. Hasbro began 2023 with 6,300 employees. Earlier in the year, the company let go 800 staff as sales of its toys that include “Transformers,” “Nerf” products, and “My Little Pony” slumped. Now, the company is further reducing its headcount as it tries to right its own ship.\n\nHasbro warned in October that it was seeing a slowdown in sales and that demand for toys was weakening. In its most recent quarterly earnings, Hasbro lowered its full-year guidance, saying it expects a 15% sales decline for the current fiscal year. The company said that typically reliable brands such as “Nerf” are no longer selling as well and that overall sales had fallen 18%. HAS stock fell 2% on news of the latest layoffs, bringing its year-to-date decline to 23%. But a turnaround appears underway.\n\nWalt Disney Co. (DIS) Disney logo on a store front. DIS stock.\n\nSource: chrisdorney / Shutterstock\n\nYou can’t say they’re not trying over at the Magic Kingdom. Walt Disney Co. (NYSE:DIS) just reinstated its dividend payment to shareholders after a three year suspension. The world’s biggest entertainment company announced that it will pay a dividend of 30 cents a share to stockholders of record as of Dec. 11. The payment will be issued in January 2024. Disney had suspended its dividend in early 2020 at the onset of the COVID-19 pandemic.\n\nThe dividend’s return is just the latest step that Disney has taken to try to turn its business around and get DIS stock moving in the right direction again. The company has also let go more than 7,000 workers, raised prices on its Disney+ streaming platform at its theme parks, introduced advertisements to its streaming service, and cutback its content spend. So far, DIS stock hasn’t responded and is down 4% over the last 12 months. However, there is reason to believe the magic will return to Disney in the coming year.\n\nBoeing Co. (BA) image of a Boeing (BA) 737 max aircraft\n\nSource: Marco Menezes / Shutterstock.com\n\nAircraft manufacturer Boeing Co. (NYSE:BA) has just appointed a chief operating officer (COO), the first in the company’s history. Stephanie Pope is taking on the newly created COO role and is seen as a candidate to replace CEO David Calhoun when he retires. Pope currently heads the aftermarket business unit called “Boeing Global Services”, which was the only segment at the company to report a profit through the first nine months of 2023.\n\nCalhoun, who has steered Boeing through one of its most difficult periods after multiple deadly crashes and the Covid-19 pandemic, is expected to remain at the helm of the company for at least another year. Pope assumes the new COO job on Jan. 1. Having joined Boeing in 1994, Pope has worked in all of the company’s business units over the years. Also believed to be in the running to succeed Calhoun are Boeing chief financial officer (CFO) Brian West and head of commercial airplanes Stan Deal.\n\nBA stock is on the mend, having increased 28% in 2023. However, the share price is currently trading 22% lower than where it was five years ago. The company continues to enjoy a duopoly position in the market for commercial aircraft along with Airbus SA of France.\n\nOccidental Petroleum (OXY) Person holding cellphone with logo of American company Occidental Petroleum Corp. (OXY) on screen in front of website. Focus on phone display. Unmodified photo.\n\nSource: T. Schneider / Shutterstock.com\n\nTough times in the oil patch. The price of crude has now fallen to $68 a barrel from more than $90 earlier in 2023. The price decline has pressured oil stocks, including Occidental Petroleum (NYSE:OXY). However, management at Occidental isn’t letting the slumping price of crude oil keep them from building the future of the company. Occidental Petroleum just announced that it is buying privately held energy producerCrownRock in a deal worth $12 billion.\n\nThe deal, which is winning praise on Wall Street, will boost Occidental’s acreage in the oil-rich Permian basin of Texas. Specifically, the CrownRock deal will provide Occidental Petroleum with more than 94,000 net acres of land in the Permian basin, which is the largest and richest oil area in America. The deal is expected to close in the first quarter of 2024 and will be immediately accretive to Occidental Petroleum’s cash flow. Occidental also raised its quarterly dividend to 22 cents a share from 18 cents previously.\n\nOXY stock is down 10% this year due to the slide in crude oil prices. Any rise in the price of crude is sure to lift this stock with it.\n\nAbbVie (ABBV) Closeup of AbbVie (ABBV) building corporate office, an American biopharmaceutical company with its headquarters in Lake Bluff, Illinois, USA\n\nSource: Valeriya Zankovych / Shutterstock.com\n\nSpeaking of acquisitions, drug maker AbbVie (NYSE:ABBV) is buying neuroscience pharmaceutical specialist Cerevel Therapeutics (NASDAQ:CERE) for $8.7 billion. AbbVie has agreed to pay $45 for each share of Cerevel and plans to complete the purchase by the middle of next year. The acquisition represents the latest effort by AbbVie to expand its prescription drug portfolio as its top-selling arthritis medication, Humira, loses its patent protection.\n\nRecently, AbbVie agreed to buy cancer drug makerImmunogen (NASDAQ:IMGN) for $10 billion. Cerevel Therapeutics will enhance AbbVie’s psychiatric and neurological disorder medications. AbbVie will also gain access to experimental treatments for schizophrenia and Alzheimer’s disease. Humira has long been one of the top selling medications in the world, racking up annual sales of $21 billion in 2022 alone. But it now faces competition from generic versions, requiring AbbVie to look elsewhere for future growth.\n\nABBV stock has declined 6% in 2023 though it has rebounded and gained 10% in the last month.\n\nOn the date of publication, Joel Baglole held a long position in DIS. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nJoel Baglole has been a business journalist for 20 years. He spent five years as a staff reporter at The Wall Street Journal, and has also written for The Washington Post and Toronto Star newspapers, as well as financial websites such as The Motley Fool and Investopedia.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post The 7 Most Undervalued Growth Stocks to Buy in December appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-most-undervalued-growth-stocks-214225584.html", "symbols": ["4AB.F", "4AB.XETRA", "ABBV.MX", "ABBV.US", "BA.US", "C.US", "CERE.US", "DIS.US", "F.US", "HAS.US", "IMGN.US", "NKE.US", "OXY.US"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0.059, "neu": 0.86, "pos": 0.082}}, {"date": "2023-12-13T20:17:00+00:00", "title": "Some Tesla Models Could Lose EV Tax Credit. Why It Matters More for the Stock Than Recalls.", "content": "Tesla recalled some 2 million units related to the company’s Autosteering function Wednesday, but there is a much bigger issue that investors should be focusing on: electric-vehicle tax credits. It appears that all of the tax credits for EVs with Chinese parts might be going away faster than expected. Investors were ready for some tax credits to vanish, but not all.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9d91be65-f156-308d-88da-ebcce076ac02/some-tesla-models-could-lose.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.919, "neg": 0, "neu": 0.814, "pos": 0.186}}, {"date": "2023-12-13T19:57:00+00:00", "title": "GM still planning to end gas-powered vehicle sales by 2035 -- CEO", "content": "By David Shepardson\n\nWASHINGTON, Dec 13 (Reuters) - General Motors CEO Mary Barra said Wednesday the Detroit automaker still plans on moving to all electric vehicle sales by 2035 even as it has recently delayed some EV production.\n\n\"Our plan is to only be selling EVs, light-duty EVs at that time but of course we're going to be responsive to where the customer is at but we have a plan to do that,\" Barra told reporters after an appearance at the Washington Economic Club.\n\nGM in October said it was abandoning a goal of building 400,000 EVs from 2022 through mid-2024 as it delays production of electric pickup trucks at its plant in Michigan's Orion Township by a year. GM also in October scrapped a $5 billion plan to jointly develop affordable EVs with Honda Motor .\n\nThe Biden administration is pursuing aggressive vehicle emissions regulations and Barra said they must be achievable.\n\n\"I think we're in a good position with the number of EVs that we have that we're launching,\" Barra said Wednesday. \"I think we just need to make sure that the regulations stay aligned with where the customer is, the charging has to be there.\"\n\nThe American Automotive Policy Council, representing GM, Ford Motor and Stellantis, in October urged regulators to halve its proposed fuel economy increases from 4% to 2% annually for trucks, saying the proposal \"would disproportionately impact the truck fleet.\"\n\nU.S. automakers separately have warned fuel economy fines would cost GM $6.5 billion, Stellantis billion and Ford $1 billion. Reuters reported in June GM paid $128.2 million in fines covering 2016 and 2017, the first time the automaker had paid fuel economy penalties.\n\nAutomakers also have raised alarm at the Energy Department's proposal to significantly revise how it calculates the petroleum-equivalent fuel economy rating for EVs. Barra met with Energy Secretary Jennifer Granholm and raised the issue, sources told Reuters.\n\nGM said in October it could support the administration's fuel economy proposal if the Energy Department rescinded its petroleum-equivalent proposal. (Reporting by David Shepardson)", "link": "https://finance.yahoo.com/news/gm-still-planning-end-gas-195700714.html", "symbols": ["8GM.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA"], "tags": [], "sentiment": {"polarity": 0.925, "neg": 0.035, "neu": 0.892, "pos": 0.073}}, {"date": "2023-12-13T15:58:31+00:00", "title": "Ford to Cut F-150 Lightning Production in Half", "content": "The last few weeks have been packed with news on electric pickups – from the delivery of the first handful of Tesla Cybertrucks to – now – news from Ford that it will be scaling back its electric version of the F-150.\n\nAutomotive News is reporting that Ford plans to reduce production of its Lightning full EV pickup by 50% starting in January. They cite a document allegedly sent to a Ford supplier expressing that the automaker will scale back its run rate from 3,200 trucks to about 1,600 trucks per week.\n\nMost Read on IEN:\n\nAuthorities Seize 11 Tons of Cocaine Hidden in Frozen Tuna Podcast: Old Gun Factory Closing; Tesla Delivers Cybertrucks; World's Heaviest Crane MIT Engineers Design a Robotic Replica of the Heart’s Right Chamber Hasbro Cuts 1,100 Jobs\n\nThe Detroit Free Press adds that Ford claims this move has nothing to do with Tesla’s Cyber Truck – a model that won’t reach production on most models until 2025. They say it’s actually part of a monthlong planning effort where they’ve worked to better match supply with demand.\n\nAnd the demand part has been a challenge of late. The F-150 was released to great fanfare in 2021 and Ford doubled production before closing its reservations system in 2022 due to overwhelming interest. But a year later, after filling many orders and also facing a glut of new competition, including a Chevy Silverado, GMC Sierra and the popular newcomer Rivian, Ford has some challenges to address.\n\nAnalysts have expressed concern that automakers – having plucked the low hanging fruit of EV customers – will need to lower prices and add bells & whistles – including range – in order to lure the next crop of buyers.\n\nThe Free Press quoted John Lawler, Ford’s CFO, as saying last month that Ford is “not NOT moving forward” with EV plans, rather working to match its capacity with the demand. Ford has also expressed its emphasis on building a hybrid portfolio to straddle the line between electric and gas.\n\nAt the same time, the company has recently underscored its commitment to its gas-powered trucks, a profit center that’s been able to defray the costs of the EV transition as Ford, and its competitors, look to scale them to the point of profitability.", "link": "https://finance.yahoo.com/news/ford-cut-f-150-lightning-155831824.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.954, "neg": 0.034, "neu": 0.888, "pos": 0.078}}, {"date": "2023-12-13T15:55:00+00:00", "title": "Buy GM Stock, Pass on Ford, Analyst Says. It’s About Margins.", "content": "As auto-stock analysts update their views and ratings heading into 2024, the consensus call is that General Motors will outperform Ford Motor shares. Wednesday, BNP Paribas analyst James Picariello downgraded Ford stock to Hold from Buy. “The compelling upside case to Ford has always relied on operational execution, narrowing its estimated [2 percentage point] margin gap versus peers,” wrote Picariello.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1ce53938-ff5f-3ef7-be6f-5bac7d8e55b0/buy-gm-stock%2C-pass-on-ford%2C.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0, "neu": 0.936, "pos": 0.064}}, {"date": "2023-12-13T15:30:14+00:00", "title": "Tesla Is Investors’ Standout Bet in a Hazardous EV Landscape", "content": "(Bloomberg) -- The electric-vehicle industry that once spawned multibillion-dollar enterprises is becoming a difficult place for investors as growth rapidly slows.\n\nMost Read from Bloomberg\n\nJPMorgan Is in a Fight Over Its Client’s Lost $50 Million Fortune Tesla Recalls 2 Million Cars to Fix Autopilot Safety Flaws Goldman Trader Paid $100 Million Since 2020 Is Stepping Down Argentina’s Milei Devalues Peso by 54% in First Batch of Shock Measures COP28 Nations Reach First-Ever Deal to Move Away From Fossil Fuels\n\nShares of cash-burning startups Rivian Automotive Inc. and Lucid Group Inc. have tumbled nearly 90% since the heyday of late 2021, wiping out a combined $217 billion of shareholder value. This year, an index of global EV-makers and suppliers is trailing the broader US market by the most since its inception in 2015.\n\n“EV investors may start to wonder if they are in the right theme at the wrong time,” said Nick Colas, co-founder of DataTrek Research.\n\nAs money managers sift through the mess and brace for the sector’s toughest test yet in 2024, Tesla Inc. still stands out as the best option among US EV stocks. While scrutiny of its technology has led to a recall of 2 million vehicles, the Elon Musk-led company has been the best-performing US stock in the Bloomberg Electric Vehicles Price Return Index this year by a long shot and one of the biggest gainers in the S&P 500 Index.\n\n“Tesla remains (and will continue to remain) king of US EVs, as the ‘rise of others’ and the ‘incoming competition’ that’s been discussed for years has still not taken place,” Evercore ISI’s automotive analyst Chris McNally wrote in a note on Dec. 11.\n\nConcern about EV demand intensified in October, when Tesla dialed back its growth expectations, and automakers, EV suppliers and even car-rental companies across the globe followed with their own dire outlooks. The overarching worry is that the pool of enthusiastic first-adopters has been tapped out, and that high prices and a possible recession will deter mainstream buyers.\n\nStory continues\n\nDeutsche Bank AG’s Emmanuel Rosner estimates that EVs will comprise 9% of US auto sales in 2024, down from a prior forecast of 11.8%. It means that after growing at about a 50% rate in 2023, sales growth will slow to slightly below 30% in 2024, before picking up again in 2025.\n\nTesla will hardly be unscathed. Its annual profits will fall by nearly a quarter this year after a series of price cuts on its cars, analysts project. While 2024 earnings are estimated to rebound, they are seen staying below 2022 levels. The pace of revenue expansion, while still far above legacy peers like Ford Motor Co. and General Motors Co., is also poised to slow considerably.\n\nDespite that, Tesla boasts profit margins that exceed its rivals, a still-strong revenue trajectory, a big cash pile and a relatively small debt load.\n\nLooking ahead, Wall Street estimates its revenue will climb at least 20% yearly through 2027, down from more than 50% in 2022, data compiled by Bloomberg show. That number is in the low- to mid-single digits for Ford and GM. And while startups like Rivian and Lucid will see revenue rise much faster than Tesla, their cash burn and much smaller sales volumes make them risky bets in an industry-wide slowdown.\n\n“I just do not see how any other EV maker can sell these vehicles at a lower price and still survive,” Brian Mulberry, client portfolio manager at Zacks Investment Management, said of Tesla. Zacks, which manages about $15 billion, held around 292,000 Tesla shares as of the end of September.\n\nAfter getting slammed in 2022, the stock has jumped 92% this year through Tuesday, compared with a 21% advance in the S&P 500.\n\nMeanwhile, traditional automakers such as GM and Ford are on a colossal spending spree to catch up in EVs.\n\nMorgan Stanley’s Adam Jonas found that the two companies spend the equivalent of their market capitalizations in 1.9 years and 2.6 years, respectively, on capital expenditure and research and development. An average S&P 500 company takes about 50 years to spend its own market valuation on those areas, and for Tesla that number is 69.4 years.\n\n“This cannot continue,” he wrote of GM and Ford in a research note late last month. He sees “2024 as a year that may determine the long-term relevance” of the US legacy auto companies given their rising capital expenses.\n\nStill, Tesla’s lofty valuation — which reflects expectations the company will be a major provider of self-driving technology — muddies the picture.\n\nThat artificial-intelligence potential built into the stock may leave little room for it to climb further, as Wall Street’s essentially flat 12-month price target on the shares suggests. The firm has faced escalating scrutiny of its automated-driving systems from the top US auto-safety regulator, with the latest blow coming on Wednesday when Tesla announced its biggest recall ever, related to its self-driving technology. Shares of the company fell as much as 2% on the news.\n\n“Tesla has a strong balance sheet and is well-positioned to ride out the 2024 EV winter, but I worry that it may not be able to keep up with the rest of the technology space,” said Ivana Delevska, chief investment officer at Spear Invest. “The current valuation assigns significant value to the full self-driving technology, which is not something we expect to materialize in the near future.”\n\nTech Chart of the Day\n\nTop Tech Stories\n\nApple Inc. is adding a feature to iPhones to prevent thieves from gaining access to critical device data in the event that they know a user’s passcode. SpaceX will sell insider shares at $97 apiece in a tender offer, a price increase that boosts the value of Elon Musk’s space and satellite company closer to $180 billion, according to people familiar with the matter. Musk’s X, the social network formerly known as Twitter, is on track to bring in roughly $2.5 billion in advertising revenue in 2023 — a significant slump from prior years, according to people familiar with the matter. Foxconn Technology Group has won approval to invest at least $1 billion more in a plant it’s building in India that will make Apple Inc. products, a major ramp-up in its goal of building a hub beyond China. Microsoft Corp. is betting that Mena Kato — a PlayStation veteran who grew up playing Nintendo classics like Donkey Kong — will help it finally drive a wedge into the world’s No. 3 gaming market.\n\nEarnings Due Wednesday\n\nPremarket\n\nPhotronics Postmarket\n\nAdobe\n\n--With assistance from Subrat Patnaik and David Watkins.\n\n(Adds details, stock move in seventeenth paragraph.)\n\nMost Read from Bloomberg Businessweek\n\nSBF’s Lawyer Says His Client Was the ‘Worst’ Ever Under Cross Examination Vanguard Is Closer Than Ever to Ending BlackRock’s ETF Reign Elon Musk May Have Met His Match in Sweden Rate-Cut Pivot Can’t Come Soon Enough for Debt-Strapped Companies How the Biggest Boutique Fitness Company Turned Suburban Moms Into Bankrupt Franchisees\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/tesla-investors-standout-bet-hazardous-153014878.html", "symbols": ["8GM.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "GSPC.INDX", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.985, "neg": 0.039, "neu": 0.887, "pos": 0.073}}, {"date": "2023-12-13T14:38:00+00:00", "title": "The Self-Driving Car Stock Bubble Has Popped, Too", "content": "Self-driving cars capture imaginations. The technology, however, has been stubbornly difficult to develop.\n\nContinue reading", "link": "https://finance.yahoo.com/m/8f93e567-e1ae-325f-bae6-3ff1cd227c54/the-self-driving-car-stock.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.599, "neg": 0.274, "neu": 0.726, "pos": 0}}, {"date": "2023-12-13T13:05:00+00:00", "title": "Ford (F) Trims F-150 Lightning Production Target for 2024", "content": "Per reports, Ford Motor Company F has reduced its planned production target of F-150 Lightning to half for 2024. In light of slowing demand, the automaker took a step back after significantly increasing its plant capacity for electric vehicles (“EVs”) this year.\r\n\r\nPer a memo to a dealer, first reported by Automotive News, Ford plans to bring down its average weekly production volume at Rouge Electric Vehicle Center in Dearborn, MI, to 1,600 trucks, down from the current production volume of 3,200 per week.\r\n\r\nDuring the third quarter’s earnings call, Ford’s executives shared plans to cancel or delay nearly $12 billion in EV investments due to softening demand for premium vehicles. Year-to-date, the company has lost almost $3.1 billion on EV spending and anticipates losing a total of $4 billion this year.\r\n\r\nAfter receiving 200 thousand reservations for the F-150 Lightning in January 2022, Ford announced it would double its production capacity to 150 thousand units per year by mid-2023. To achieve its production target, the automaker idled its Rouge Electric Vehicle Center in early 2023.\r\n\r\nHowever, the demand for EVs has been slower than anticipated due to higher prices and interest rates. Year-to-date, Ford has sold a total of 20,365 trucks, up from 13,258 sold in the corresponding period of 2022. The growth in demand lags far behind the expectations of automakers, which compelled them to reduce investments in EVs.\n\nZacks Rank & Key Picks\n\nF currently carries a Zacks Rank #3 (Hold).\r\n\r\nSome better-ranked players in the auto space are Volvo VLVLY, Renault SA RNLSY and BYD Company Limited BYDDY, each sporting Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nThe Zacks Consensus Estimate for VLVLY’s 2023 sales and earnings indicates year-over-year growth of 4.2% and 65.6%, respectively. The EPS estimates for 2023 and 2024 have increased 32 cents and 11 cents, respectively, in the past 60 days.\r\n\r\nThe Zacks Consensus Estimate for RNLSY’s 2023 sales and earnings indicates year-over-year growth of 4.5% and 128.1%, respectively. The EPS estimates for 2023 and 2024 have increased 15 cents and 2 cents, respectively, in the past 30 days.\r\n\r\nThe Zacks Consensus Estimate for BYDDY’s 2023 sales indicates year-over-year growth of 160.2%. The EPS estimates for 2023 and 2024 have increased 59 cents and 55 cents, respectively, in the past 60 days.\n\nStory continues\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nAB Volvo (VLVLY) : Free Stock Analysis Report\n\nRENAULT (RNLSY) : Free Stock Analysis Report\n\nByd Co., Ltd. (BYDDY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/ford-f-trims-f-150-130500081.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.987, "neg": 0.04, "neu": 0.85, "pos": 0.11}}, {"date": "2023-12-13T12:56:00+00:00", "title": "Auto Roundup: F Invests in Nickel Plant, STLA Collaborates With Ample &amp; More", "content": "Last week, the China Passenger Car Association released vehicle sales data for November. China's passenger vehicle sales grew 25% year over year to 2.1 million units, representing the fourth consecutive month of increase. November marked the highest monthly sales of new energy vehicles in the country in 2023 with 841,000 units sold, driven by increased year-end promotions and discounts.\n\nOn the news front, recreational vehicle maker Thor Industries, Inc. THO, China’s electric vehicle company NIO Inc. NIO and auto parts retailer AutoZone Inc. AZO posted quarterly results. While AZO delivered a comprehensive beat on both fronts, Thor came up with mixed results. NIO delivered a narrower-than-expected loss but fell short of revenue estimates.\n\nIn light of the rising demand for electric vehicles (EVs), automakers are striving to secure raw materials like lithium, cobalt and nickel for EV batteries. To that end, U.S. legacy automaker Ford F is investing in an under-construction nickel plant in Indonesia to strengthen its supply chain.\n\nMeanwhile, Italian-American auto giant Stellantis STLA joined forces with Ample to integrate Ample's Modular Battery Swapping technology into its EVs. Ample’s Modular Battery Swapping solution offers fast and convenient charging. As part of the Dare Forward 2030 plan, Stellantis aims to achieve a 100% passenger car battery electric vehicle (“BEV”) sales mix in Europe and a 50% passenger car and light-duty truck BEV sales mix in the United States by the end of the decade.\n\nWhile STLA and NIO presently hold a Zacks Rank #1 (Strong Buy) and #2 (Buy), respectively, AZO, THO and F carry a Zacks Rank #3 (Hold) each currently. You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nLast Week’s Top Stories\n\nThor reported earnings of 99 cents per share for first-quarter fiscal 2024 (ended Oct 31, 2023), which surpassed the Zacks Consensus Estimate of 87 cents. The bottom line however tumbled 60.9% from the year-ago quarter’s earnings of $2.53 per share. The company registered revenues of $2,500.8 million for the quarter under review, lagging the Zacks Consensus Estimate of $2,510.4 million. The top line declined 19.5% year over year.\n\nStory continues\n\nAs of Oct 31, 2023, Thor had cash and cash equivalents of $425.8 million and long-term debt of $1,271.9 million. During the first quarter of fiscal 2024, THO repurchased $30 million of common stock at an average price of $91.61. The company has reaffirmed its full-year guidance for fiscal 2024. It projects its full-year consolidated net sales in the range of $10.5-$11 billion. The consolidated gross profit margin is expected to be in the range of 14.5-15%. Earnings per share are expected to be in the range of $6.25-$7.25.\n\nAutoZone reported earnings of $32.55 per share for first-quarter fiscal 2024 (ended Nov 18, 2023), up 18.6% year over year. Earnings surpassed the Zacks Consensus Estimate of $31.01 per share. Net sales grew 5.1% year over year to $4,190.3 million. The top line also surpassed the Zacks Consensus Estimate of $4,171.9 million. In the reported quarter, domestic commercial sales totaled $1,092.9 million, up from $1,034.4 million recorded in the year-ago period. Domestic same-store sales (sales at stores open at least for a year) rose 1.2%.\n\nDuring the quarter, AutoZone opened 17 new stores and closed one store in the United States. It opened five new stores in Mexico and four stores in Brazil. It exited the quarter with 6,316 stores in the United States, 745 in Mexico and 104 in Brazil. The total store count was 7,165 as of Nov 18, 2023.As of Nov 18, 2023, AutoZone had cash and cash equivalents of $282.9 million, up from $269.7 million as of Nov 19, 2022. Its total debt amounted to $8,583.5 million as of Nov 18, 2023, increasing from $6,328.3 million as of Nov 19, 2022.\n\nFord is investing in a battery-nickel plant in Indonesia to strengthen its supply chain. It is collaborating with PT Vale Indonesia and Zhejiang Huayou Cobalt Co. in a project to produce 120,000 tons of nickel chemicals per year for EV batteries. The nickel plant called Pomalaa, which is currently under construction, is likely to commence commercial production in 2026. Although the share of investment of each company in the project is unknown, the total investment is estimated to be around $4.5 billion.\n\nAmid growing refinery investment in Indonesia, the country has become a significant producer of battery-compatible nickel. Per Lisa Drake, vice president of Ford's EV Programs and Energy Supply Chain, the direct investment in plants allows Ford to source nickel in cost-efficient ways. It also allows the automaker to keep the amount of nickel mined in line with the company’s sustainability target. Ford aims to produce more than 2 million EVs by 2026-end. By 2030, it expects EVs to account for 50% of its global sales, which will cement its position in the red-hot EV landscape.\n\nStellantis has signed a binding agreement with Ample to integrate Ample’s Modular Battery Swapping technology in its EVs. With this technology, EV users can swap their depleted EV battery with a fully charged battery in less than five minutes at a battery swapping station. Stellantis is also in talks with Ample to expand the application of Ample’s Modular Battery Swapping technology to meet the automaker’s fleet and consumer demand across other platforms and geographies.\n\nThe program that will use a fleet of 100 Fiat 500e within Stellantis’ Free2move car-sharing service is scheduled to start in 2024 in Madrid, Spain. The Fiat 500e is Stellantis’ highest-selling EV.Per Ricardo Stamatti, senior vice president & global head of Stellantis Energy & Free2move Charge, Ample’s Modular Battery Swapping solution can offer Stellantis’ customers higher energy efficiency, outstanding performance and lower range anxiety.\n\nNIO incurred a loss per American Depositary Share of 37 cents in the third quarter of 2023, narrower than the Zacks Consensus Estimate of a loss of 43 cents. However, the reported loss was wider than the year-ago period's reported loss of 36 cents. Revenues of $2,613.3 million lagged the Zacks Consensus Estimate of $2,631.1 million but increased roughly 43% year over year due to higher delivery volumes. NIO delivered 55,432 vehicles (including 37,585 SUVs and 17,847 sedans) in the third quarter, up 75.4% year over year.\n\nVehicle margin in the reported quarter fell to 11% from 16.4% in third-quarter 2022 due to changes in product mix. Gross margin was 8%, down from 13.3% in the year-ago quarter. As of Sep 30, 2023, cash and cash equivalents totaled $3,301 million and long-term debt amounted to $1,666 million. For fourth-quarter 2023, NIO projects deliveries in the range of 47,000-49,000 vehicles, implying a 17.3-22.3% increase year over year. Revenues are estimated to be between $2,204 million and $2,289 million.\n\nPrice Performance\n\nThe following table shows the price movement of some of the major auto players over the last week and six-month period. Zacks Investment Research\n\nImage Source: Zacks Investment Research\n\nWhat’s Next in the Auto Space?\n\nIndustry watchers will keep a tab on November new car registration data to be released by the European Automobile Manufacturers Association.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nThor Industries, Inc. (THO) : Free Stock Analysis Report\n\nAutoZone, Inc. (AZO) : Free Stock Analysis Report\n\nNIO Inc. (NIO) : Free Stock Analysis Report\n\nStellantis N.V. (STLA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/auto-roundup-f-invests-nickel-125600822.html", "symbols": ["8TI.F", "AZ5.F", "AZO.US", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "N3IA.F", "NIO.US", "STLA.US", "THO.US", "TIV.F"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.036, "neu": 0.865, "pos": 0.099}}, {"date": "2023-12-13T11:33:00+00:00", "title": "The Fed’s Been Near Perfect on Rates. Why Its Next Test Is Key.", "content": "Yellen sees a soft landing ahead as inflation moderates, Biden urges Congress to approve Ukraine aid as Zelensky visits, and other news to start your day.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6b304a65-7daa-360e-875d-b381be1cbbc6/the-fed%E2%80%99s-been-near-perfect.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "CHH.US", "CZH.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-12-13T08:38:19+00:00", "title": "Ford cut to Neutral on dwindling F-150 EV truck demand outlook: 4 big analyst cuts", "content": "Investing.com — Here is your Pro Recap of the biggest analyst cuts you may have missed since yesterday: downgrades at Ford, Johnson & Johnson, Hertz Global, and Ferrari.\n\nInvestingPro subscribers got this news first. Never miss another market-moving headline.\n\nFord slashed to Neutral at Exane BNP Paribas\n\nExane BNP Paribas downgraded Ford Motor (NYSE:F) from Outperform to Neutral with a price target of $12.00, as reported in real-time on InvestingPro.\n\nReports from earlier this week indicated that Ford plans to halve the production of its F-150 Lightning electric pickup truck in 2024, citing \"changing market demand\" as the reason. This move reflects a broader industry trend of reducing electric vehicle investments due to slower-than-expected sales growth.\n\nJohnson & Johnson downgraded at Wells Fargo\n\nWells Fargo downgraded Johnson & Johnson (NYSE:JNJ) to Equal Weight from Overweight with a price target of $163.00 (from $170.00).\n\nThe company is set to report its Q4/23 earnings next month. Street estimates stand at $2.37 for EPS and at $21.01 billion for revenues.\n\nHertz Global cut at Oppenheimer\n\nHertz Global (NASDAQ:HTZ) shares fell more than 1% pre-market today after Oppenheimer downgraded the company to Perform from Outperform.\n\nThe analysts expect 2024 to be a transitional year for Hertz. The company is anticipated to encounter multiple challenges, including significant issues with its EV initiative, higher vehicle interest expenses, and higher DPU. Consequently, the estimated EBITDA for 2024 has been reduced from $1.215B to $823M.\n\nFerrari hit with two downgrades\n\nFerrari (NYSE:RACE) shares fell more than 1% pre-market today after the company received downgrades from two Wall Street firms.\n\nHSBC downgraded the company to Hold from Buy with a price target of €340.00 (from €325.00). The analysts acknowledge the strength of Ferrari's performance, noting that their margin improvement and cash generation are surpassing mid-term goals. The 2024 estimated EBIT is already at the lower end of the 2026 targets. However, these targets are not expected to be revised until 2025. This leads to a reduced likelihood of mid-term earnings upgrades and unexpected positive results.\n\nStory continues\n\nThe analysis also pointed out that historically, Ferrari has shown minimal earnings surprises in the fourth quarter. This is attributed to their strategy of managing deliveries to meet or slightly exceed guidance. Given that the 2023 EBIT is already 2% above guidance, the potential for short-term earnings surprises seems limited.\n\nMeanwhile, Exane BNP Paribas downgraded Ferrari to Neutral from Outperform with a price target of €367.00.\n\nAmid whipsaw markets and a slew of critical headlines, seize on the right timing to protect your profits: Always be the first to know with InvestingPro.\n\nRelated Articles\n\nFord cut to Neutral on dwindling F-150 EV truck demand outlook: 4 big analyst cuts\n\nPro Research: Wall Street eyes Microsoft's AI bets and cloud growth\n\nCitigroup offers partial early bonuses to encourage exits - Bloomberg News", "link": "https://finance.yahoo.com/news/ford-cut-neutral-dwindling-f-083819817.html", "symbols": ["2FE.F", "2FE.XETRA", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "HTZ.US", "JNJ.F", "JNJ.MX", "JNJ.US", "JNJ.XETRA", "JNJB34.SA", "RACE.MI", "RACE.US"], "tags": [], "sentiment": {"polarity": 0.969, "neg": 0.05, "neu": 0.856, "pos": 0.094}}, {"date": "2023-12-13T07:48:50+00:00", "title": "Pfizer, Southwest, Tesla fall premarket; Netflix, Airbnb rise", "content": "Investing.com -- U.S. futures traded higher Wednesday, as investors digested the latest inflation data ahead of the conclusion of the Federal Reserve’s final policy meeting of the year.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nNetflix (NASDAQ:NFLX) stock rose 0.2% after the streaming giant released viewership figures across its catalog, responding to criticism over its perceived lack of transparency over how its titles are consumed.\n\nPfizer  (NYSE:PFE) stock slumped 6.8% after the drugmaker forecast 2024 revenue and profit below expectations, even as it raised cost-cut target by $500 million.\n\nSouthwest Airlines (NYSE:LUV) stock fell 2.5% after the budget airline raised its forecast for fourth-quarter fuel costs, even while expecting unit revenue for the quarter to improve to the higher end of its previous guidance range on the back of strong leisure demand.\n\nAirbnb (NASDAQ:ABNB) stock rose 1.3% after the vacation rental platform agreed to pay over $600 million to the Italian Revenue Agency to settle outstanding host income tax obligations for the 2017-2021 tax years.\n\nTesla (NASDAQ:TSLA) stock fell 1.1% after the electric vehicle manufacturer is set to lose up to $7,500 federal tax credit for some Model 3 vehicles.\n\nTake-Two (NASDAQ:TTWO) stock rose 3.4%, with the video-game maker set to be included in the Nasdaq 100 index, effective Dec 18, likely boosting demand from investors.\n\nFord (NYSE:F) stock fell 0.5% after BNP Paribas (OTC:BNPQY) downgraded its stance on the auto giant to ‘neutral’ from ‘outperform’, seeing relatively little upside from current levels.\n\nPhotronics  (NASDAQ:PLAB) stock rose 4.1% after the semiconductor photomask manufacturer beat quarterly expectations, with revenue up 8.2% year on year. It also expects next quarter's revenue to be around $221 million, in line with estimates.\n\nRelated Articles\n\nPfizer, Southwest, Tesla fall premarket; Netflix, Airbnb rise\n\nIndustrials, materials pull TSX lower at open\n\nWall St opens higher after soft PPI data, Fed's verdict on tap", "link": "https://finance.yahoo.com/news/pfizer-southwest-tesla-fall-premarket-074850745.html", "symbols": ["ABNB.US", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "LUV.MX", "LUV.US", "NFC.F", "NFC.XETRA", "NFLX.MX", "NFLX.US", "NFLX34.SA", "PFE.F", "PFE.MX", "PFE.US"], "tags": [], "sentiment": {"polarity": 0.908, "neg": 0.043, "neu": 0.882, "pos": 0.075}}, {"date": "2023-12-13T07:15:00+00:00", "title": "The EV Stock Bubble Has Popped. This One Is Over, Too.", "content": "Self-driving cars capture imaginations. The technology, however, has been stubbornly difficult to develop.\n\nContinue reading", "link": "https://finance.yahoo.com/m/8f93e567-e1ae-325f-bae6-3ff1cd227c54/the-ev-stock-bubble-has.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.599, "neg": 0.274, "neu": 0.726, "pos": 0}}, {"date": "2023-12-13T00:00:00+00:00", "title": "The 7 Most Undervalued Growth Stocks to Buy in December", "content": "Stocks of a lot of well-known and historically great companies are on sale right now. Many marquee names haven't shared in this year's market rally and are in the red for 2023. This presents a fantastic opportunity for investors to buy great stocks at distressed prices.", "link": "https://investorplace.com/2023/12/the-7-most-undervalued-growth-stocks-to-buy-in-december/", "symbols": ["ABBV.US", "BA.US", "DIS.US", "F.US", "HAS.US", "NKE.US", "OXY.US"], "tags": [], "sentiment": {"polarity": 0.908, "neg": 0.074, "neu": 0.669, "pos": 0.257}}, {"date": "2023-12-12T21:15:00+00:00", "title": "The Toro Company Elects Dianne Craig to Board of Directors", "content": "BLOOMINGTON, Minn., December 12, 2023--(BUSINESS WIRE)--The Toro Company (NYSE: TTC) today announced the election of Dianne Craig to its Board of Directors, effective January 1, 2024.\n\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20231212714273/en/\n\nDianne Craig, president of Lincoln, the luxury vehicle division of Ford Motor Company (NYSE: F) based in Dearborn, Michigan. (Photo: Business Wire)\n\n\"We are very pleased to have Dianne join The Toro Company’s board as a proven leader with a diverse range of executive leadership achievements,\" said Richard Olson, chairman and chief executive officer of The Toro Company. \"Dianne’s experience complements the depth and breadth already represented on our board. Her extensive background in operational execution, channel strategy and delivering best-in-class marketing solutions will be a strong asset as we continue to advance our strategic vision and corporate governance principles for the long-term benefit of our customers, shareholders and business partners.\"\n\nDianne Craig, 59, currently serves as president of Lincoln, the luxury vehicle division of Ford Motor Company (NYSE: F) based in Dearborn, Michigan. Throughout her 30-year career in the automotive industry, she has held several leadership roles of increasing responsibility. She was president of the International Markets Group, Ford Blue, leading business operations for dealer and distributor markets in over 100 countries, and prior to that she served as chief executive officer at Ford Direct and chief executive officer of Ford Motor Company of Canada. Craig received a Bachelor of Science in mathematics from State University of New York at Fredonia.\n\nAbout The Toro Company\n\nThe Toro Company (NYSE: TTC) is a leading worldwide provider of innovative solutions for the outdoor environment including turf and landscape maintenance, snow and ice management, underground utility construction, rental and specialty construction, and irrigation and outdoor lighting solutions. With net sales of $4.5 billion in fiscal 2022, The Toro Company’s global presence extends to more than 125 countries through a family of brands that includes Toro, Ditch Witch, Exmark, Spartan, BOSS, Ventrac, American Augers, Trencor, Pope, Subsite, HammerHead, Radius, Perrot, Hayter, Unique Lighting Systems, Irritrol, and Lawn-Boy. Through constant innovation and caring relationships built on trust and integrity, The Toro Company and its family of brands have built a legacy of excellence by helping customers work on golf courses, sports fields, construction sites, public green spaces, commercial and residential properties and agricultural operations. For more information, visit www.thetorocompany.com.\n\nStory continues\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20231212714273/en/\n\nContacts\n\nInvestor Relations \r\nJeremy Steffan\r\nDirector, Investor Relations\r\n(952) 887-7962, jeremy.steffan@toro.com\n\nMedia Relations \r\nBranden Happel\r\nSenior Manager, Public Relations\r\n(952) 887-8930, branden.happel@toro.com", "link": "https://finance.yahoo.com/news/toro-company-elects-dianne-craig-211500193.html", "symbols": ["F.US", "TO2.F", "TTC.US"], "tags": [], "sentiment": {"polarity": 0.99, "neg": 0.006, "neu": 0.889, "pos": 0.105}}, {"date": "2023-12-12T20:26:00+00:00", "title": "Ford, GM, and Tesla Have All Violated This Key Wall Street Rule", "content": "Car companies’ forecasts about sales and production of electric vehicles have turned out to be far too optimistic.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9ede3091-6957-343c-a6be-b4763c631fdf/ford%2C-gm%2C-and-tesla-have-all.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.318, "neg": 0, "neu": 0.892, "pos": 0.108}}, {"date": "2023-12-12T18:02:30+00:00", "title": "Ford reportedly cutting F-150 Lightning production next year", "content": "Ford Motor Co. will reportedly soon reduce the number of F-150 Lightning electric pickup trucks it builds on average every week.\n\nIn a message to suppliers, the automaker said \"changing market demand\" led to it adjusting its planned Rouge Electric Vehicle Center production of the pickup to an average of 1,600 per week, according to Automotive News. That will reportedly begin in January.\n\nFord \"will continue to match Lightning production to customer demand,\" a company spokesperson told FOX Business on Tuesday.\n\nFORD STOCK PLUNGES 12% ON NEWS OF WIDER EV LOSSES\n\nThe Rouge Electric Vehicle Center, which opened in Dearborn, Michigan, in 2021, received upgrades over the summer meant to lift its targeted annual F-150 Lightning run rate to 150,000, with the facility’s operations picking back up at the beginning of August, according to a press release.\n\nThere had earlier been plans of averaging 3,200 per week in connection to that, Automotive News reported.\n\nREAD ON THE FOX BUSINESS APP The F-150 Lightning is going global for the first time with its entry into Norway, the world’s most advanced electric vehicle market. Following impassioned consumer demand, Norwegian customers can apply to purchase a limited number of special F-150 Lightning Lariat Launch Edition vehicles.\n\nThe reported F-150 Lightning production slowdown comes after Chief Financial Officer John Lawler said during Ford’s third-quarter earnings call that the company was \"being judicious about our production and adjusting future capacity to better match market demand\" for its electric vehicle (EV) business \"given the dynamic EV environment.\"\n\nFORD INTRODUCING IN-VEHICLE CUSTOMER FEEDBACK TOOL\n\n\"For example, we have taken out some Mustang Mach-E production, and we are also slowing down several investments, including making a decision with SK On to delay the second BlueOval SK JV battery plant in Kentucky, and we have also said we are evaluating our BlueOval Battery Park Michigan plant to determine the best path forward,\" he said. \"In fact, all told, we have pushed about $12 billion of EV spend, which includes capex, direct investment and expense.\" The corporate logo of Ford is seen at Brussels Motor Show, Belgium on Jan. 9, 2020.\n\nThe \"ultimate success\" of the company’s EV transition \"will be driven by our Gen 2 and Gen 3 products, which will be cost-optimized and guided by the learnings of our first-generation vehicles that are currently in the market,\" according to Lawler.\n\nStory continues\n\nFord reported earlier this month that people in the U.S. had purchased over 20,300 F-150 Lightning trucks since the start of the year. That figure, which represented a 53.6% year-over-year increase, included sales of nearly 4,400 in November, according to the company. Ford Motor Co. battery powered F-150 Lightning trucks under production at their Rouge Electric Vehicle Center in Dearborn, Michigan, on Sept. 20, 2022.\n\nIt has been producing the electric pickup since April 2022.\n\nFORD SAYS UAW STRIKE COST COMPANY $1.7 BILLION IN LOST PROFITS\n\nThe company, which produces combustion, electric and hybrid vehicles, forecast that it will see an adjusted EBIT in the range of $10 billion to $10.5 billion for the year.\n\nOriginal article source:Ford reportedly cutting F-150 Lightning production next year", "link": "https://finance.yahoo.com/news/ford-reportedly-cutting-f-150-180230407.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.906, "neg": 0.035, "neu": 0.911, "pos": 0.054}}, {"date": "2023-12-12T16:43:45+00:00", "title": "Ford slashes F-150 Lightning EV production to match 'customer demand'", "content": "The next domino to fall in Ford’s evolving electric vehicle game plan? The slowdown in production plans for the F-150 Lightning EV pickup.\n\nAs recently as June of this year, Ford was targeting annual production of the F-150 Lightning at its Rouge EV plant in Dearborn, Michigan of 150,000 by the end of the year - which is the installed capacity of the plant - translating to 3,200 vehicles assembled per week. Ford has now told its F-150 Lightning suppliers that it is planning to slash that output to around 1,600 Lightnings assembled per week, or half the original goal, per a memo obtained by Automotive News. Photo by: NDZ/STAR MAX/IPx 2022 4/13/22 Ford F-150 Lightning during the 2022 New York International Auto Show (NYIAS) at the Javits Center on April 13, 2022 in New York. (NDZ/STAR MAX/IPx)\n\nWhen Yahoo Finance reached out to Ford for comment, the automaker said it was “matching production to customer demand.” Clearly customer demand has fallen, as consumers balk at paying higher prices for EVs compared to gas-powered cars, as well paying higher financing costs compared to only a couple years ago.For instance the F-150 Lightning Pro starts at $49,995 (before tax credits), whereas a base XL SuperCrew F-150 gas-powered truck starts at $40,780.\n\nThat being said, Ford reported a record month for F-150 Lightning sales in November, selling nearly 4,400 trucks in the month - a 100% jump from a year ago. However if Ford averages 5,000 Lightning trucks sold a month next year, that would mean only 60,000 trucks for the year - less than the halved production planned for 2024.\n\nCompetition is also heating up in the EV truck space, with Tesla’s Cybertruck beginning initial deliveries less than two weeks ago, Rivian selling more of its R1 EV adventure vehicles, and GM about to enter the fray next year with its Silverado EV pickups.\n\nFord had big plans for its EV transformation, as outlined in its Ford+ plan at its capital markets day in May. Since then Ford said it will “push out” around $12 billion in EV investments, and was shrinking battery capacity at upcoming plants like one in Michigan that would use CATL technology. Ford is also delaying the start of production at two of its JV battery plants it is building in Kentucky.\n\nStory continues\n\nDespite the effects of the UAW strike and higher labor costs—and the changing reality of the EV demand story—Ford is still targeting an 8% EBIT margin for its EV business by 2026, Ford CFO John Lawler recently said at the Barclays automotive and mobility conference in New York. For comparison, the automaker's Ford Blue traditional gas-powered business is targeting a long-term EBIT of low double-digits, with the Ford Pro commercial unit aiming for the mid-teens.\n\nFord is betting on continuous improvements on its current EVs, like the Lightning and Mustang Mach-E crossover, to less expensive with improved components and streamlined manufacturing processes. But the bigger bet is on its 2nd-gen EVs, which the company is forecasting will help the company be more profitable.\n\n“The main message is we had to design these second generation products completely different than the first-gen products,” Ford CEO Jim Farley said to Yahoo Finance at its capital markets day. Farley said 2nd-gen products like its Project T3 pickup and 3-row EV SUV will be coming in 2025 - with competitive pricing to boot.\n\n“We are going to see pricing pressure, and if you have not put that in your business plan and you haven't designed second-cycle products with discounting included in your run rate to get to an 8% margin in our case, then it's not going to work out,” Farley said.\n\nPras Subramanian is a reporter for Yahoo Finance. You can follow him on Twitter and on Instagram.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/ford-slashes-f-150-lightning-ev-production-to-match-customer-demand-164345409.html", "symbols": ["8GM.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.948, "neg": 0.02, "neu": 0.934, "pos": 0.046}}, {"date": "2023-12-12T16:41:00+00:00", "title": "Ford takes a surprising turn with F-150 Lightning", "content": "The automaker has looked to production of the electric pickup as a historic moment, but things have changed in the last year.\n\nContinue reading", "link": "https://finance.yahoo.com/m/3cf4bc3f-67dd-3a9d-ad29-001f36a6cc0a/ford-takes-a-surprising-turn.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-12-12T15:00:58+00:00", "title": "Ford cutting F-150 Lightning production goal for 2024", "content": "Ford (F) will cut its weekly production goal in half for its popular F-150 Lighting EV. The goal was cut from 3200 EVs a week to 1600, according to Automotive News. The company cites lower customer demand for the truck as broader demand for EVs has slowed down in recent months. Yahoo Finance Senior Reporter Pras Subramanian joins the Live show to break down the latest development for the company and what it means going forward.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/ford-cutting-f-150-lightning-150058453.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.557, "neg": 0.093, "neu": 0.879, "pos": 0.028}}, {"date": "2023-12-12T14:29:10+00:00", "title": "Ford Halves Its F150 Lightning Production Target For 2024", "content": "Ford cut its production target for its F-150 Lightning pickups in half, according to reports. Ford stock was little-changed early Tuesday.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d281d07a-1a18-3843-87d3-44dfff1d714f/ford-halves-its-f150.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.273, "neg": 0.087, "neu": 0.913, "pos": 0}}, {"date": "2023-12-12T14:00:34+00:00", "title": "Ford Motor (NYSE:F) shareholders notch a 10% CAGR over 5 years, yet earnings have been shrinking", "content": "It hasn't been the best quarter for Ford Motor Company (NYSE:F) shareholders, since the share price has fallen 12% in that time. On the bright side the share price is up over the last half decade. However we are not very impressed because the share price is only up 31%, less than the market return of 94%. While the long term returns are impressive, we do have some sympathy for those who bought more recently, given the 18% drop, in the last year.\n\nThe past week has proven to be lucrative for Ford Motor investors, so let's see if fundamentals drove the company's five-year performance.\n\nView our latest analysis for Ford Motor\n\nThere is no denying that markets are sometimes efficient, but prices do not always reflect underlying business performance. By comparing earnings per share (EPS) and share price changes over time, we can get a feel for how investor attitudes to a company have morphed over time.\n\nDuring the last half decade, Ford Motor became profitable. That's generally thought to be a genuine positive, so we would expect to see an increasing share price.\n\nThe image below shows how EPS has tracked over time (if you click on the image you can see greater detail). earnings-per-share-growth\n\nIt's probably worth noting we've seen significant insider buying in the last quarter, which we consider a positive. That said, we think earnings and revenue growth trends are even more important factors to consider. This free interactive report on Ford Motor's earnings, revenue and cash flow is a great place to start, if you want to investigate the stock further.\n\nWhat About Dividends?\n\nWhen looking at investment returns, it is important to consider the difference between total shareholder return (TSR) and share price return. The TSR incorporates the value of any spin-offs or discounted capital raisings, along with any dividends, based on the assumption that the dividends are reinvested. Arguably, the TSR gives a more comprehensive picture of the return generated by a stock. We note that for Ford Motor the TSR over the last 5 years was 63%, which is better than the share price return mentioned above. The dividends paid by the company have thusly boosted the total shareholder return.\n\nStory continues\n\nA Different Perspective\n\nInvestors in Ford Motor had a tough year, with a total loss of 9.9% (including dividends), against a market gain of about 16%. Even the share prices of good stocks drop sometimes, but we want to see improvements in the fundamental metrics of a business, before getting too interested. Longer term investors wouldn't be so upset, since they would have made 10%, each year, over five years. It could be that the recent sell-off is an opportunity, so it may be worth checking the fundamental data for signs of a long term growth trend. While it is well worth considering the different impacts that market conditions can have on the share price, there are other factors that are even more important. Take risks, for example - Ford Motor has  3 warning signs  (and 1 which doesn't sit too well with us)  we think you should know about.\n\nFord Motor is not the only stock insiders are buying. So take a peek at this freelist of growing companies with insider buying.\n\nPlease note, the market returns quoted in this article reflect the market weighted average returns of stocks that currently trade on American exchanges.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.", "link": "https://finance.yahoo.com/news/ford-motor-nyse-f-shareholders-140034645.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.04, "neu": 0.79, "pos": 0.17}}, {"date": "2023-12-12T13:44:00+00:00", "title": "Ford Chief EV Officer Snatches Up $2 Million in Ford Stock", "content": "Ford’s chief electric vehicle, digital, and design officer, Doug Field, just bought a large block of the embattled auto maker’s shares. Field paid an average of about $11.05 for 182,000 Ford Motor shares. Field, who arrived at Ford in 2021 from Apple where he was vice president of special projects, now holds about 720,000 shares of Ford stock.\n\nContinue reading", "link": "https://finance.yahoo.com/m/e831d522-316c-3ba1-bcec-cbb868dab72a/ford-chief-ev-officer.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.66, "neg": 0.044, "neu": 0.816, "pos": 0.14}}, {"date": "2023-12-12T13:32:00+00:00", "title": "Ford to Slow F-150 Lightning Production. The Demand Just Isn’t There.", "content": "Ford will target F-150 Lightning production at about 6,000 a month instead of about 12,000, according to a report.\n\nContinue reading", "link": "https://finance.yahoo.com/m/23109203-881b-3fae-9eff-acd8fbc01ea7/ford-to-slow-f-150-lightning.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-12-12T08:55:00+00:00", "title": "Ford Will Slow F-150 Lightning Production. Here Are All the Numbers You Need to Know.", "content": "Ford will target F-150 Lightning production at about 6,000 a month instead of about 12,000, according to a report.\n\nContinue reading", "link": "https://finance.yahoo.com/m/23109203-881b-3fae-9eff-acd8fbc01ea7/ford-will-slow-f-150.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-12-11T15:35:00+00:00", "title": "Sell Ford, GM, Stellantis Stock. ‘It’s Not You, It’s the Industry.’", "content": "Wells Fargo analyst Colin Langan launched coverage of Stellantis, Chrysler’s parent, with a research report citing multiple challenges.\n\nContinue reading", "link": "https://finance.yahoo.com/m/adc4b405-c856-3c91-a5c7-d67dc543c244/sell-ford%2C-gm%2C-stellantis.html", "symbols": ["8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0, "neu": 0.769, "pos": 0.231}}, {"date": "2023-12-11T14:15:00+00:00", "title": "Is Ford Stock a Buy Right Now?", "content": "Ford Motor Company(NYSE: F) is one of the world's legacy automakers, having been around for over 120 years. It helped usher in an era of mass-produced vehicles, and it's led to the company being one of the world's most influential and recognizable automakers.\n\nFord hasn't been without its struggles, however. Changing consumer trends and supply chain disruptions have weighed the stock down recently. It's down 8% in 2023 and over 57% from its January 2022 highs.\n\nFord's recent woes have caused many investors to wonder if now is the right to invest in the company, and I believe the answer ultimately comes down to your timeline.\n\nIts EV unit needs to remain on target for profitability\n\nIn March 2022, Ford announced a major company restructuring. It divided into two broad, interdependent businesses: Ford Blue and Ford Model e. Ford Blue is dedicated to its traditional gas and hybrid vehicles, and Ford Model e focuses on electric vehicles (EVs) and connectivity.\n\nThe good news is that in the third quarter of 2023, Ford's Model e whole units were up to 36,000 from 25,000 in Q3 2022, and revenue was up $400 million year over year. The bad news is that Ford loses a lot of money on each EV sold, and the Model e division is wildly unprofitable. In Q3 2023, the division lost $1.3 billion in earnings before interest and tax (EBIT).\n\nFord expects its EVs to be profitable by 2026, but it could get worse before it gets better. For long-term investors, these present-day losses are for the greater good as Ford invests in new factories to build EV cars at scale and hopefully lower long-term costs.\n\nThe UAW is weighing on Ford's financials\n\nAt the end of Q3 2023, Ford had more than $29 billion in cash and $51 billion in liquidity. That still didn't distract investors from its relatively disappointing Q3 financial results. Vehicle revenue was $41.8 billion, and earnings per share were $0.39, but both missed Wall Street estimates.\n\nStory continues\n\nIt's no surprise that earnings are coming in low when a single division is losing $1.3 billion, but a critical aspect of Ford's latest financials is just how much impact the United Auto Workers union (UAW) is having. For perspective, the UAW strike had an EBIT impact of around $100 million in Q3 alone, and it could affect Ford's 2023 EBIT by around $1.3 billion.\n\nEarlier in the year, Ford's management set an EBIT guidance of $11 billion to $12 billion. However, the strike has created uncertainty around Ford's ability to meet that, so it withdrew its guidance for the year. That's not quite music to investors' ears. Luckily, there's a tentative agreement in place, but the strike could affect Ford for the coming quarters.\n\nFord's valuation and dividend look appealing\n\nThere are some legitimate concerns for Ford's business right now. There's the cash-burning EV division, supply chain issues, and UAW strikes over worker contracts. The latter is more of a short-term concern, but the first two could cause lasting issues if not addressed properly.\n\nThat said, it's hard to ignore Ford's low valuation at the moment. Its price-to-earnings (P/E) ratio is below 7 (less than its average for the past decade), and it has a dividend yield of 5.6%, well above what an S&P 500 ETF would offer. F Dividend Yield Chart\n\nF Dividend Yield data by YCharts\n\nFord's attractive dividend can provide consistent income and should keep investors patient while the company navigates this transition to make EVs a viable profit-making business segment. Having been around for over 120 years, Ford has shown the ability to adapt, so I don't doubt this time is drastically different.\n\nIf you currently own Ford shares, I don't think you need to panic and sell them. For new investors, I recommend dollar-cost averaging your way into a stake in the company. Consistent investments over time should help reduce risk while letting you capitalize on Ford's potential long-term growth.\n\nMore From The Motley Fool\n\n10 Best Stocks to Buy Today The $16,728 Social Security Bonus You Cannot Afford to Miss 20 of the Top Stocks to Buy (Including the Two Every Investor Should Own) What Is an ETF? 5 Recession-Proof Stocks How to Beat the Market\n\nStefon Walters has no position in any of the stocks mentioned. The Motley Fool has no position in any of the stocks mentioned. The Motley Fool has a disclosure policy.\n\nIs Ford Stock a Buy Right Now? was originally published by The Motley Fool", "link": "https://finance.yahoo.com/news/ford-stock-buy-now-141500126.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.696, "neg": 0.104, "neu": 0.787, "pos": 0.109}}, {"date": "2023-12-11T14:15:00+00:00", "title": "Is Ford Stock a Buy Right Now?", "content": "Ford Motor Company (NYSE: F) is one of the world's legacy automakers, having been around for over 120 years. Ford hasn't been without its struggles, however. Ford's recent woes have caused many investors to wonder if now is the right to invest in the company, and I believe the answer ultimately comes down to your timeline.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1bd55c0c-e6f0-35ed-aa2d-77dd4b54539e/is-ford-stock-a-buy-right-now%3F.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.353, "neg": 0.049, "neu": 0.927, "pos": 0.024}}, {"date": "2023-12-11T10:49:00+00:00", "title": "Could This High-Yield Auto Stock Make You a Millionaire?", "content": "Ford (NYSE: F) has a vaunted history in the American automobile industry, with founder Henry Ford helping shape it from its early days. For years, Ford has made the country's top-selling vehicle, the F-150 pickup trick, and it earned credibility from Wall Street for being the only one of the Big Three automakers to avoid bankruptcy during the financial crisis. As you can see, Ford's share price is actually down over the last decade, and the stock has only generated a slight return with dividends reinvested.\n\nContinue reading", "link": "https://finance.yahoo.com/m/145fe67b-8dfd-3f99-9e04-b57b271e3cbe/could-this-high-yield-auto.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.477, "neg": 0.081, "neu": 0.872, "pos": 0.047}}]