[{"date": "2023-10-27T22:20:25+00:00", "title": "Ford stock plunges 12% on news of wider EV losses", "content": "Ford Motor Co. shares closed down more than 12% Friday after the company withdrew its full-year forecast, citing \"uncertainty\" over its tentative deal with the United Auto Workers and broader losses in its electric vehicle division.\n\nThe automaker reported a higher-than-expected $1.33 billion loss in earnings before interest and taxes (EBIT) in its EV unit in its third-quarter earnings report Thursday, up from the $1.08 billion hit the segment took in the second quarter. The corporate logo of Ford at the Brussels Motor Show in Belgium Jan. 9, 2020.\n\nThat means Ford took an operating loss of nearly $37,000 on every EV it sold last quarter. The company has forecast a full-year loss for the Ford Model e unit of $4.5 billion.\n\nFORD, GM, MERCEDES COME CLEAN ON EV DEMAND WEAKNESS\n\nFord posted revenue of $44 billion for the third quarter, an 11% boost, and reported a $1.2 billion profit. The company lost $827 million the same quarter a year ago.\n\nFord warned of continued pressure on electric vehicles as customers balk at paying a premium for EVs over other models.\n\nREAD ON THE FOX BUSINESS APP\n\nUS TREASURY DEPARTMENT TO ALLOW $7,500 ELECTRIC VEHICLE TAX CREDIT AS POINT-OF-SALE REBATE STARTING IN JANUARY\n\nCEO Jim Farley said in the company earnings call that, for customers, there is an \"affordability issue\" when its comes to EVs.\n\nThe company said it will slash production of its Mustang Mach-E and plans to scale back around $12 billion in investments in its EV division, including a delay in a second battery plant in Kentucky.\n\nReuters contributed to this report.\n\nOriginal article source:Ford stock plunges 12% on news of wider EV losses", "link": "https://finance.yahoo.com/news/ford-stock-plunges-12-news-222025673.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.137, "neg": 0.096, "neu": 0.82, "pos": 0.084}}, {"date": "2023-10-27T21:28:14+00:00", "title": "3 Exciting EV Stocks to Buy for 100% Returns", "content": "The electric vehicle (EV) market has a high-growth potential that seems to be increasingly favorable in comparison to gas-fueled cars. Last quarter alone, more than 300,000 EVs were sold in the United States. This indicates the growing increase in demand for environmentally-friendly vehicles. In 2025, its expected that EV sales will account for half of car sales worldwide. It will also account for 85% of car sales in the U.S. While the competition is fierce in the market, the continuously rising demand for EVs still leaves EV companies with a high-growth potential. Many companies will see drastic growth, while many others will fail. Below are the three EV stocks to buy that I have the most potential.\n\nStellanis (STLA) A flag with the logo for Stellantis waves outside a building with the logos for some of its car brands, including Abarth, Lancia, Fiat, Alfa Romeo and Jeep.\n\nSource: Antonello Marangi / Shutterstock.com\n\nStellanis (NYSE:STLA) is an EV company with the potential that the EV market holds, but that offsets much of the risk. Headquartered in Amsterdam, Stellanis is a European EV powerhouse. The company boasts a market cap of around $60 billion, amongst the highest in the EV space. From both a qualitative and quantitative outlook, Stellanis is a buy.\n\nWith a P/E ratio of about 2.75 in comparison to the industry average of around nine, Stellanis has a lot of unfulfilled potential in terms of price. The company’s financials are strong, with Stellanis having a P/B ratio of 0.70. Compare this to an industry average of around 1.3. Additionally, the company has strong profit margins and large revenue. Each quarter, it rapidly grows its revenue, making a large profit. On the other hand, many other EV companies are constantly turning a loss. \r\nThe company has significant room for growth, dominating the large European EV market. As of now, they control the majority of the European market and are making impressive strides in the North American one. This is signaling that they will absorb much of the industry growth. They are also bought $1.6 billion of Chinese EV company Leapmotor, showing their diversification plans.\n\nStory continues\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nXpeng (XPEV) Xpeng (XPEV) car logo in Shanghai International Automobile Industry Exhibition\n\nSource: THINK A / Shutterstock.com\n\nXPeng (NYSE:XPEV) is a Chinese EV manufacturing company headquartered in Guangzhou with multiple main offices located in major cities overseas. The company announced that the company delivered more than 15,000 Smart EVs last month alone, which was a 12% increase from August and 81% increase year-over-year (YoY)\n\nFurthermore, XPeng recently delivered 750 of its vehicles to Israel. This was the largest single batch of exports for the year. Despite facing regulations abroad, specifically in Europe and the United States, the Chinese EV maker seems adamant on expanding its operations in Israel. Potentially, XPeng will expand to the larger Middle East market. XPeng has partnered with Israel company Frisbee, revealing the company’s ability to customize its products based on consumer preferences. The company is trying to expand its operations worldwide, and thus far has been successful. Expanding internationally allows it to tap into potential outside the highly competitive Chinese market, instead allowing the company to focus on growth and profitability. XPeng definitely earns its spot on our list of EV stocks to buy.\n\nFord (F) Ford logo badge on grill of car\n\nSource: JuliusKielaitis / Shutterstock.com\n\nFord (NYSE:F) is one of the largest automobile companies in the world. It is headquartered in the U.S. The size of the company supplements its EV segment, which has been seeing success. Ford’s Model e EV has experienced a 44% increase in shipments and a 26% revenue growth. Though Ford is losing money from selling EVs, it has been a dominant company for decades. This permits its other operations to subsidize its losses. Meanwhile, smaller EV competitors like Lucid face the risk of bankruptcy if they take on excessive losses.\n\nFord also came to an agreement with the United Auto Workers union, ending a concern about its short-term prospects. They have been investing heavily into their EV segment, stopping production of various gas-fueled cars to hone in on EVs. I think that Ford’s financial stability, strong presence and heavy investments in EV will lead to it absorbing much of the growth that is expected to arise in the EV industry. If you are looking for EV stocks to buy, this is a great place to start!\n\nOn the date of publication, Tomas Levani did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com\n\nTomas is a self-taught investor with a passion for ESG investing. He has managed the portfolio of a small investment fund, interned at a Fortune 500 investment company, and started his own research firm. Through his freelance writing, he now aims to find favorable investments in companies with a mission of bettering the world.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 3 Exciting EV Stocks to Buy for 100% Returns appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-exciting-ev-stocks-buy-212814322.html", "symbols": ["F.US", "STLA.US", "XPEV.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.037, "neu": 0.823, "pos": 0.14}}, {"date": "2023-10-27T20:41:00+00:00", "title": "These Stocks Moved the Most Today: Amazon, Intel, Ford, Chevron, Enphase, Deckers, Capital One, and More", "content": "Amazon posts third-quarter profit well ahead of estimates, Intel issues upbeat guidance, Ford reports weaker-than-expected earnings, and Chevron misses bottom-line forecasts.\n\nContinue reading", "link": "https://finance.yahoo.com/m/0bf663e9-0c7b-37f2-8a97-3672483ee57f/these-stocks-moved-the-most.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "DECK.US", "DO2.F", "E0P.F", "ENPH.US", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA"], "tags": [], "sentiment": {"polarity": 0.586, "neg": 0.069, "neu": 0.688, "pos": 0.243}}, {"date": "2023-10-27T20:34:30+00:00", "title": "Why US EV sales may be at a tipping point", "content": "Ford (F), General Motors (GM), and Tesla (TSLA) are all warning there may be tough times ahead for the U.S. electric vehicle market. It come after more than 313,000 EV's were sold in the U.S. in the third quarter, a new record, according to data from Cox Automotive. Yahoo Finance Senior Autos Reporter Pras Subramanian explains why this may be a tipping point for U.S. EV sales.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/why-us-ev-sales-may-203430215.html", "symbols": ["8GM.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.44, "neg": 0.045, "neu": 0.955, "pos": 0}}, {"date": "2023-10-27T19:49:05+00:00", "title": "Ford, GM, and even Tesla are warning about the EV market", "content": "At least in the US, electric vehicle sales have hit a tipping point. Research firm Kelley Blue Book (KBB) finds that US EV sales in the third quarter crossed 313,000, nearly a 50% increase from a year ago, with EV market share hitting 7.9% — its highest ever level. But this milestone might not be good enough for automakers spending billions on an EV transformation.\n\n“A great product is not enough in the EV business anymore. We have to be totally competitive on cost,” Ford (F) CEO Jim Farley said on Thursday night’s Q3 earnings call. Ford recently paused $12 billion worth of investments in its EV projects until “capacity” is needed. Ford said in its earnings report that US EV buyers were “unwilling to pay premiums for [EVs] over gas or hybrid vehicles, sharply compressing EV prices and profitability.”\n\nThough Ford said it was bullish on its upcoming Gen 2 and Gen 3 EVs, the company’s downbeat assessment of the US electric market echoes what GM (GM) reported earlier this week.\n\n\"We are also moderating the acceleration of EV production in North America to protect our pricing, adjust to slower near-term growth in demand, and implement engineering efficiency and other improvements that will make our vehicles less expensive to produce, and more profitable,\" CEO Mary Barra said in her Q3 shareholder letter. GM, in pushing back its EV truck expansion earlier this month, noted “evolving EV demand” as the main reason why it was slowing its EV truck volumes.\n\nEven Tesla (TSLA) CEO Elon Musk, perhaps the biggest EV evangelist in the industry, poured cold water on the EV market and general economic landscape. Musk noted on Tesla’s conference call last Wednesday that the company was delaying construction of its upcoming Gigafactory in Mexico due to concerns about global economic conditions stemming from rising interest rates that make financing cars more expensive for consumers, thus crimping demand.\n\n“I’m worried about the high interest rate environment we’re in,” Musk said, adding, “I just can’t emphasize enough how important cost is. …. We have to make our products more affordable so people can buy [them].”\n\nStory continues\n\nJessica Caldwell, head of insights at automotive research firm Edmunds agrees with Musk. “The current high-interest environment also doesn't favor convincing consumers to explore less-established auto technology, and cost is already placing EVs beyond the reach of many consumers,” Caldwell said to Yahoo Finance. “Following a decade of bigger spending due to low interest rates, consumers now find themselves needing to economize.”\n\nNew research from J.D. Power out Friday morning puts automaker concerns about pricing and the consumer in stark contrast to once rosy EV sales projections.\n\n“One complicating factor that could be a drag on near-term EV sales, however, is the pricing imbalance that currently exists between EVs and ICE [internal combustion engine] vehicles in the booming compact SUV segment,” J.D. Power noted in its report. “Currently, the bulk of mass market compact EV SUV sales are pricing at around $52,000. That compares with just $34,000 for comparable mass market ICE SUVs. Meanwhile, ICE vehicles in the compact premium SUV segment are trading at around $53,000, vs. EVs in the compact premium SUV segment selling for $60,000 or more.”\n\nDespite concerns about pricing, J.D. Power believes critical mass has already been hit with EVs, and the firm is projecting retail EV sales to hit 3 million by end of this year and 4 million by the end of Q3 2024.\n\nOne area that will help sales starting next year, J.D. Power says, is the $7,500 EV tax credit can be used immediately at point of sale for eligible, instead of waiting for a tax refund. “This is a significant departure from the current implementation of the credit, whereby eligible buyers do not receive the credit until they receive their tax returns,” J.D. Power said in its report.\n\nWhile a tax credit pull forward is nice, it seems buyers will need more incentives to make up for the price differential between EVs and gas-powered cars and cover the increased financing costs as a result of higher rates. This does not even begin to take into consideration range anxiety and lack of charging infrastructure, which a whopping 77% of respondents to Yahoo Finance/Ipsos EV poll found to be the most pressing concern when considering an EV.\n\n“Infrastructure for charging is the elephant in the room. Augmentation of the charging infrastructure must align with the growing acceptance of EVs, if not precede it,” Edmunds’ Caldwell added.\n\nGM, Ford, and even Tesla keeping cash in reserve and deploying it when economic conditions stabilize seems to be the best call, at least from Wall Street’s perspective.\n\n“Ford’s balance sheet remains flush with liquidity to help fund the transition to electrified vehicles and software services as well as provide a buffer for whenever the next recession comes,” Morningstar analyst David Whiston wrote in a note to clients on Friday morning. “This ample funding gives Ford time to reinvent itself, and more time is needed for cost control.”\n\nIt seems the White House goal of 50% EV sales by 2030 is lofty at this point and overly optimistic, whereas only a couple years back policymakers believed Americans wouldn't even need convincing to go electric.\n\nCaldwell said that there are likely to bumps along the road. “While the global shift toward EVs is inevitable, the path to mass adoption may be punctuated by periods of sluggish progress, which is the phase we find ourselves in now,” she said.\n\nPras Subramanian is a reporter for Yahoo Finance. You can follow him on Twitter and on Instagram.\n\nClick here for the latest stock market news and in-depth analysis, including events that move stocks\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/ford-gm-and-even-tesla-are-warning-about-the-ev-market-194905657.html", "symbols": ["8GM.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.03, "neu": 0.895, "pos": 0.075}}, {"date": "2023-10-27T19:44:00+00:00", "title": "Ford forecast, Sanofi, Juniper Networks: Top Stocks", "content": "Shares of the Big Three automakers — Ford (F), General Motors (GM), Stellantis (STLA) — edge lower ahead of Friday's close after Ford reached a tentative labor agreement with striking United Auto Workers (UAW) membership on October 26. While GM and Stellantis are reportedly in talks with the UAW, Ford pulls back on its 2023 forecast fearing higher-than-expected losses in its EV business.\n\nSanofi (SNY) stock dives nearly 20% ahead of Friday's closing bell after disappointing on earnings this quarter and warning of slowing earnings growth in 2024.\n\nCloud developer Juniper Networks (JNPR) stock jumps after reporting strong third-quarter earnings and growth in its enterprise business.\n\nYahoo Finance's Julie Hyman and Josh Lipton take a look at several of the day's top trending stocks.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/ford-forecast-sanofi-juniper-networks-194400777.html", "symbols": ["8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "JNP.F", "JNPR.US", "SAN.PA", "SANF.MI", "SNW.F", "SNW.XETRA", "SNW2.F", "SNY.US", "SNYN.MX", "SNYNF.US"], "tags": [], "sentiment": {"polarity": 0.572, "neg": 0.087, "neu": 0.791, "pos": 0.122}}, {"date": "2023-10-27T19:19:56+00:00", "title": "Smaller manufacturers feeling impact of UAW strike: NAM CEO", "content": "Ford (F) has struck a tentative deal with autoworkers that both sides hope will be ratified. The UAW is still in negotiations with General Motors (GM) and Stellantis (STLA). National Association of Manufacturers (NAM) CEO Jay Timmons says that when you look through the supply chain and the \"downstream effects\" of a strike at a company, \"you find that these smaller manufacturers are having a really hard time making the choice about frankly keeping their doors open or laying people off for a certain amount of time, and if they lay those folks off, are they going to go somewhere else? And then they're not going to be able to bring them back.\" Timmons adds that \"anything that really upsets that delicate balance, it's a threat to manufacturing.\" Watch the video above to find out why Timmons says it's so important for companies and workers to have a strong relationship.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/smaller-manufacturers-feeling-impact-uaw-191956186.html", "symbols": ["8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.017, "neg": 0.064, "neu": 0.871, "pos": 0.065}}, {"date": "2023-10-27T18:44:35+00:00", "title": "Ford Shares Tumble Amid Concerns About EV Slowdown and Higher Costs Following UAW Strike", "content": "Ford shares tumbled Friday after third-quarter earnings fell short of estimates amid concerns about costs tied to the transition to electric vehicles and the automaker's tentative agreement with the United Auto Workers union.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a823cb98-5ddf-3081-b5f7-a393fbc4d62b/ford-shares-tumble-amid.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.802, "neg": 0, "neu": 0.796, "pos": 0.204}}, {"date": "2023-10-27T18:36:00+00:00", "title": "GM, UAW Move Closer to a Tentative Labor Contract", "content": "The United Auto Workers union is close to completing a tentative agreement on a new contract with General Motors, two days after the union clinched a tentative deal with Ford Motor.\n\nContinue reading", "link": "https://finance.yahoo.com/m/0bdf6b0a-fca7-33c6-b297-200f07ec23c8/gm%2C-uaw-move-closer-to-a.html", "symbols": ["8GM.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA"], "tags": [], "sentiment": {"polarity": 0.718, "neg": 0, "neu": 0.824, "pos": 0.176}}, {"date": "2023-10-27T17:35:28+00:00", "title": "Why my lawnmower is electric but my car isn’t", "content": "I bought my first battery-powered lawnmower nearly 10 years ago as an experiment. It was a success, and most of the other machines in my garage — trimmer, weed whacker, chain saw, rototiller, leaf blower, snow thrower — are now powered by batteries I recharge from an electrical outlet.\n\nMy car, however, is not electric, and I still don’t foresee a day when I’ll choose an electric vehicle over a gasoline-powered one. I love EV technology, and I’m glad most automakers are rolling out electrics. But EVs are too far above the practicality curve for me, and it’s not clear if or when they’ll fall inside it.\n\nThe choices on display in my garage are now playing out in the broader market for EVs, where automakers are beginning to pause aggressive efforts to transition rapidly from gas-powered cars to electrics. EV sales are still growing. They’ve jumped from barely nothing a few years ago to 8% of all new car sales. But demand seems to be flagging, forcing automakers to cut prices for EVs, which are not profitable yet for most companies that make them.\n\nFord, General Motors, Honda, and Volkswagen have scaled back EV plans recently or warned about disappointing sales. Even high-flying Tesla, which only makes electrics and lost money for 14 years before turning its first profit in 2020, is slashing prices and delaying the opening of a new factory in Mexico.\n\nNone of this means EVs are a failure. The difficulty most automakers face is predicting adoption rates for the new technology and adjusting their production plans to match what is basically a moving target. Retooling assembly lines to switch from gas-powered cars to electrics is cumbersome and expensive. So is opening new factories to build EVs or components such as the big battery packs they require.\n\nRising interest rates, meanwhile, are forcing buyers to change their plans. And now, the type of fuel that powers your car has become a political issue. Former President Donald Trump has decided EVs = bad, calling them the “ridiculous all-electric car hoax.” He’s wrong. EVs are here to stay. But they’re not for everybody, and in addition to all the other considerations involving a car, potential buyers now have to ask whether an EV fits their political brand.\n\nStory continues\n\nThe biggest unknown about EVs is how much of the market they’ll constitute at any given point in time, and how to get the supply-demand balance right. President Biden, who promised to “end fossil fuel” as a presidential candidate in 2019, wants half of all new cars to be zero-emission vehicles by 2030. For the most part, that means electrics. But Biden can’t force people to buy EVs. He can only set regulations and sign legislation giving them reason to do so, such as the EV tax credits that were in last year’s Inflation Reduction Act.\n\nEvaluating the pros and cons of electrification as you move up the appliance chain from power tools to automobiles helps explain why there may be a demand ceiling for current EV technology. My battery-powered lawnmower is a hit because the technology forces no tradeoffs on me. It cost a little bit more than a gas-powered model, but there’s no gasoline, oil, or other messy fluids, and I charge it at home. There’s basically no maintenance, either. You just pop in a fresh battery and start it up like you would a vacuum cleaner. It’s quieter than gas mowers, and I don’t pollute the air or breathe in carcinogens while mowing.\n\nAs I was writing this story, I decided to scribble some ways of measuring the usefulness of various gizmos, and ended up drawing my personal practicality curve, as you can see below. There are no numerical values associated with the various products I’ve plotted on this chart. All I want to convey is the relative appeal of different types of products, based on what I value as a consumer. Machine rankings, in chicken-scratch\n\nCost is on the vertical access and convenience is on the horizontal axis. I’m willing to pay more money for more convenience, and vice versa, which is why my practicality curve rises from left to right. I define convenience broadly to include what I want from these products, which for me is ease of use, reliability, and a sense that I’m being a thoughtful consumer. Your results may vary.\n\nI could have bought a gas mower instead of my electric for a little less money, but it scores low on convenience because I’d have to buy gas for it, maintain it, and tolerate needless noise and pollution. So it falls outside my practicality curve.\n\n[Drop Rick Newman a note, follow him on Twitter, or sign up for his newsletter.]\n\nThe worst machine on the planet right now is the gas-powered leaf blower, which generates obscene amounts of noise and pollution in the service of vanquishing leaves or dust. It occupies the worst spot on my practicality chart, in the northwest quadrant, where it’s a terrible combination of cost and convenience.\n\nAll my battery-powered electric tools fall inside the practicality curve for the same reasons my lawnmower does: no liquid fuels, no maintenance, always ready, plus they’re quieter and cleaner than gas-powered equivalents. I have a small yard, though, and if I had to manage an acre or more, these tools might not be up to the job. Rick's electric armada\n\nNow for the cars. I have only one car, and I go on long trips sometimes when I have to gas up along the way. I simply need the range and easy refueling that comes with a gas-powered car. EVs are ideal for people who never drive long distances, or who have more than one car, including a gas-powered one they can use for road trips.\n\nYes, you can take long trips in an EV. But charging takes a lot longer than filling with gas, under the best circumstances, and you might have to go out of your way to find a charger. You should also assume you’ll get less than your car’s advertised range. Those tradeoffs and others put EVs outside my practicality curve, since I travel to remote areas sometimes and I don’t want to lengthen my trips substantially by hunting for a charger or killing time while my car powers up.\n\nEVs do come with some of the same advantages that battery-powered lawnmowers do: You can charge them at home most of the time. They require less maintenance and they’re cleaner. So what would it take to get EVs inside my practicality curve?\n\nThe answer is simple: more range and faster refueling. Those cars actually exist. They’re called hybrids, in the vein of the Toyota Prius that debuted all the way back in 1999. Most modern hybrids are plug-ins, which means you can charge a battery that will give you 20 or 30 miles of range, before a gasoline-powered electric motor kicks in, to assist. You can always run the car on gasoline, so you don’t have to worry about a dead battery or an hours-long refueling odyssey.\n\nBut automakers and policymakers have focused less on hybrids than on fully electric cars with no gasoline backup. Many of the hybrids that are available are upscale models or top trim lines beyond the reach of ordinary buyers, which puts them high on the cost axis on my practicality chart. Federal tax credits apply to hybrids as they do to electrics, but complex rules on domestic-content requirements limit the applicability to a handful of models.\n\nSome analysts think the EV transition would be going smoother if there were more deliberate focus on hybrids as a bridging strategy. “Tell me why we abandoned hybrids,” Sarah Emerson, managing principal at Energy Security Analysis, Inc, told me during an interview last year. “We can’t have hybrids because we want to get rid of gasoline. But it might be better to have 10 years of hybrids and then 10 years of EVs.”\n\nIn my yard, by contrast, there’s no need for a bridging strategy. Electrics do the smaller jobs just fine. Working up to the bigger jobs is simply going to take a while.\n\nRick Newman is a senior columnist for Yahoo Finance. Follow him on Twitter at @rickjnewman.\n\nClick here for politics news related to business and money\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/why-my-lawnmower-is-electric-but-my-car-isnt-173528347.html", "symbols": ["8GM.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.144, "neg": 0.066, "neu": 0.865, "pos": 0.069}}, {"date": "2023-10-27T17:25:16+00:00", "title": "REFILE-Auto strikes to reduce US payrolls count in October -government report", "content": "(Refiles to fix dropped word \"including\" in paragraph one)\n\nBy Lucia Mutikani\n\nWASHINGTON, Oct 27 (Reuters) - Strikes by members of the United Auto Workers (UAW) union including against Detroit's Big Three car manufacturers could subtract at least 29,000 jobs from U.S. nonfarm payrolls in October, government data showed on Friday.\n\nThe Labor Department's monthly strike report showed 25,300 workers were idle at assembly plants owned by Ford Motor, General Motors and Chrysler parent Stellantis nationwide during the October payrolls count period.\n\nAnother 4,000 UAW members were on strike at Mack Trucks plants in Florida, Maryland and Pennsylvania during the survey period in mid-October. About 1,100 other UAW members walked off the job at Blue Cross Blue Shield in Michigan during the same period.\n\nIt is not clear whether these workers who are in the direct life, health and medical insurance carrier industry were part of the broader industrial action by the UAW against the automakers.\n\nStriking workers who do not receive a paycheck during the period that the government surveys business establishments for the employment report are treated as unemployed.\n\nThe UAW launched limited strikes on Sept. 15, which expanded in October. The work stoppages have disrupted supply chains, resulting in the three automakers furloughing and laying off thousands of non-striking workers.\n\nThe hit from the strike will likely come through a decline in manufacturing employment, where payrolls have been rising moderately. The government will publish its closely watched employment report for October next Friday.\n\nAccording to a Reuters survey of economists, nonfarm payrolls likely increased by 172,000 jobs last month. That would be a big step-down from the 336,000 jobs added in September, the most in eight months.\n\nStill, job growth would more than exceed the roughly 100,000 positions needed per month to keep up with growth in the working age population, testament of the labor market's resilience despite massive interest rates hikes from the Federal Reserve to cool demand in the economy.\n\nFord and the UAW reached a tentative deal this week. General Motors and the UAW were in intensive discussions on Friday to reach an agreement. Talks with Stellantis were scheduled to resume soon. (Reporting By Lucia Mutikani; Editing by David Gregorio)", "link": "https://finance.yahoo.com/news/auto-strikes-reduce-us-payrolls-172516429.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.685, "neg": 0.042, "neu": 0.906, "pos": 0.052}}, {"date": "2023-10-27T17:08:00+00:00", "title": "Why Ford Stock Tanked Friday", "content": "Ford (NYSE: F) had been touting the investments it has planned to grow its electric vehicle (EV) segment. The report was a mix of good and bad news, but investors are focusing on the negatives today. Ford launched its Ford+ strategy this year, breaking its operations into three reporting segments.\n\nContinue reading", "link": "https://finance.yahoo.com/m/b24d1c05-d496-3da5-922f-fdd91d034d76/why-ford-stock-tanked-friday.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.026, "neg": 0.066, "neu": 0.866, "pos": 0.068}}, {"date": "2023-10-27T16:53:00+00:00", "title": "Tesla Stock Is Rising on Higher EV Prices. Ford Is Helping, Too.", "content": "Electric-vehicle maker Tesla raised prices on one of its Model Y vehicles. Also, Ford is delaying capital spending on EVs.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a76fb4d8-6f7c-3dbf-8aa4-6989493548d0/tesla-stock-is-rising-on.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-27T16:53:00+00:00", "title": "Former Ford CEO has a blunt warning for the electric vehicle industry", "content": "The strike against Ford may be over, but the company's electric vehicle woes are far from solved. The entire auto industry, grappling with steadily softening EV demand over cost and existential infrastructure challenges, is beginning to pull back its efforts to grow the sector.\n\nContinue reading", "link": "https://finance.yahoo.com/m/b091d930-d69c-34f0-973c-aac300756c8a/former-ford-ceo-has-a-blunt.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.412, "neg": 0.132, "neu": 0.789, "pos": 0.079}}, {"date": "2023-10-27T16:44:44+00:00", "title": "UPDATE 1-GM, Stellantis in intensive union talks to reach new contract", "content": "(Recasts with resumption of GM talks, adds details and stock prices, paragraphs 1, 3 and 5.)\n\nBy David Shepardson\n\nOct 27 (Reuters) - Talks between General Motors and the United Auto Workers resumed on Friday as they engage in intensive bargaining to try to reach a labor contract deal to end a six-week-old strike. Discussions with Chrysler parent Stellantis were scheduled to resume soon.\n\nFord Motor on Wednesday was the first of Detroit's Big Three car manufacturers to negotiate an agreement to settle strikes joined by 45,000 Detroit Three auto workers since mid-September. The deal will likely set a pattern for new contracts with GM and Stellantis.\n\nTalks with GM and Stellantis which began on Thursday stretched in to the early hours on Friday before they adjourned. GM resumed talks at 11 a.m. EDT on Friday and Stellantis was expected to resume at 1 p.m. Both automakers hope to reach agreements soon, sources said.\n\nGM CEO Mary Barra and UAW President Shawn Fain took part in Thursday's talks. Both GM and Stellantis and the UAW were very close on economic provisions but some final issues including the use of temporary workers remained under discussion, the sources said.\n\nGM shares were down 2.6% at $27.82 at midday, after hitting a low of $27.32, the weakest intraday price since August 2020. Stellantis shares were down 1.3% at $18.24 in New York.\n\nThe Ford agreement, which still must be ratified by union members, includes a 25% wage hike over the life of the 4-1/2-year contract, a boost in retirement contributions, and the elimination of lower-pay tiers for workers in certain parts operations at Ford.\n\nIt also reduces the time to get to top pay to three years from eight, and the UAW won the right to strike over plant closures.\n\nThe deal amounts to total pay hikes of more than 33% when compounding and cost-of-living mechanisms are factored in, the UAW said.\n\nFord Chief Financial Officer John Lawler said on Thursday that the strike had cost the automaker $1.3 billion in earnings and 80,000 vehicles.\n\n(Reporting by David Shepardson in Washington Editing by Chizu Nomiyama and Matthew Lewis)", "link": "https://finance.yahoo.com/news/1-gm-stellantis-intensive-union-164444095.html", "symbols": ["8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.957, "neg": 0.045, "neu": 0.858, "pos": 0.097}}, {"date": "2023-10-27T16:20:59+00:00", "title": "Stock Market Today: Dow ends losing week on sour note as energy stocks lead rout", "content": "Investing.com -- The Dow slumped Friday, as investors digested contrasting corporate earnings as Amazon and Intel impressed, but underwhelming results from oil majors including Chevron left energy stocks nursing heavy losses.\n\nThe Dow Jones Industrial Average fell 1% or 337 points and the Nasdaq rose 0.4%. The S&P 500 fell 0.4% to close in correction territory at 4,118.93.\n\nS&P 500 closes in correction territory as tech bid fades despite Amazon, Intel surge\n\nThe S&P 500 has racked up a more than 10% loss from its July peak of 4,588.96 to close in correction territory as tech gave up some gains despite a rally in Amazon and Intel.\n\nAmazon (NASDAQ:AMZN) rose more than 6% after the tech giant reported third-quarter results that topped Wall Street estimates.\n\n“Amazon remains one of the best earnings growth stories in the market heading into 2024,” Deutsche Bank said, pointing to signs that Amazon’s cloud business is set for a reacceleration.\n\nIntel Corporation (NASDAQ:INTC), meanwhile, jumped more than 9% as the chipmaker’s blowout Q3 earnings and lift on earnings guidance drew praise from Wall Street.\n\nIntel's gross margin outlook “came in much closer to our above-Street estimates, reinforcing our confidence in a stronger GM recovery in 2024 than currently contemplated by consensus,” Deutsche Bank said.\n\nOil majors Chevron, Exxon Mobil slip on mixed quarterly results\n\nExxon Mobil and Chevron fell 2% and nearly 7% respectively, dragging the broader energy sector lower after reporting disappointing quarterly results.\n\nExxon Mobil Corp (NYSE:XOM) Q3 results missed Wall Street estimates on both the top and bottom lines, wedged down by weaker performance in its upstream segment, which includes the exploration and production stages.\n\nChevron Corp (NYSE:CVX), meanwhile, reported a miss on earnings as lower margins on refining business.\n\nInflation continues to ease, but consumer spending comes in hot\n\nThe core price consumer expenditure index, a measure of inflation closely watched by the Fed, slowed to 3.7% in the 12 months through September, as expected, from a 3.9% pace the prior month.\n\nStory continues\n\nWhile ongoing signs of the slowing inflation will provide the Fed with further evidence that its restrictive monetary policy measures are having the desired impact, the stronger-than-expected pace of consumer spending seen last month could muddy the Fed’s thinking on policy.\n\nAt a speech at Economic Club of New York luncheon on Oct. 19, Powell warned that above-trend economic growth could \"put the progress of inflation at risk and justify further tightening of monetary policy,\" the Fed chief said.\n\nFord falls after withdrawing guidance as UAW strikes dent Q3 earnings\n\nFord Motor Company (NYSE:F) fell more than 12% after the automaker withdrew its full-year guidance following third-quarter results that fell short of Wall Street estimates as UAW strikes made a big dent to growth.\n\n\"The UAW impact was $100M in Q3 .. but $1.3B to date,\" RBC said in a note.\n\nJPMorgan slips as CEO Jamie Dimon set to offload 1 million shares\n\nJPMorgan Chase & Co (NYSE:JPM) fell more than 3% as chief executive Jamie Dimon is set to sell 1 million shares starting next year, the bank said in a regulatory filing this week.\n\nDimon and his family’s stake in the bank, which is currently about 8.6 million shares, “will remain very significant,” the bank added.\n\nRelated Articles\n\nStock Market Today: Dow ends losing week on sour note as energy stocks lead rout\n\nSolarWinds anticipates revenue growth, considers sale after 2020 cyberattack\n\nBattery maker AESC eyes US IPO, seeks further expansion funding", "link": "https://finance.yahoo.com/news/stock-market-today-dow-ends-162059070.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "CHV.F", "CHV.XETRA", "CMC.F", "CMC.XETRA", "CVX.MX", "CVX.US", "DJI.INDX", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.98, "neg": 0.073, "neu": 0.811, "pos": 0.115}}, {"date": "2023-10-27T16:19:11+00:00", "title": "Stock Market Correction Intensifies; Google, Meta, Microsoft, Amazon Are Big Earnings Movers: Weekly Review", "content": "The stock market correction intensified, with the major indexes all hitting fresh lows. Microsoft, Google, Amazon and Meta led key earnings.\n\nContinue reading", "link": "https://finance.yahoo.com/m/76b1de8c-6274-3c68-b406-132430fa0de8/stock-market-correction.html", "symbols": ["ABEA.F", "ABEA.XETRA", "ABEC.F", "ABEC.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "F.MX", "F.US", "FB2A.F", "FB2A.XETRA", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GE.MX", "GE.SW", "GE.US", "GEC.LSE"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0.07, "neu": 0.775, "pos": 0.155}}, {"date": "2023-10-27T16:10:00+00:00", "title": "Electric vehicle market facing challenges in its efforts to grow", "content": "While the electric vehicle sector has been taking some serious hits lately, one analyst believes EVs are in for the long haul.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d766ec54-69cf-39e8-a7fd-6eb71a5c94ff/electric-vehicle-market.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.077, "neg": 0.053, "neu": 0.947, "pos": 0}}, {"date": "2023-10-27T15:49:00+00:00", "title": "When Will GM and Stellantis Agree to UAW Deals? These Are the Key Dates to Watch.", "content": "The United Auto Workers negotiation this year has been unlike any other in recent memory. The UAW went on strike against the Detroit Three auto makers on Sept. 15. Now about 45,000 workers are on the picket lines with the UAW striking at some of the auto makers’ most profitable factories.\n\nContinue reading", "link": "https://finance.yahoo.com/m/fb17af93-2a5a-3b63-95ed-d501953e5346/when-will-gm-and-stellantis.html", "symbols": ["8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.667, "neg": 0.026, "neu": 0.87, "pos": 0.104}}, {"date": "2023-10-27T14:51:25+00:00", "title": "Ford outlook suffers amid UAW deal uncertainty", "content": "Ford Motor Company (F) missed earnings expectations Thursday after reaching a tentative agreement with the United Auto Workers union. The deal, which still needs to be ratified by union members, led Ford to withdraw its previous guidance due to uncertainty around the financial impact of the recent strikes. The strikes have cost Ford an estimated $100 million in Q3 and $1.2 billion in Q4 as workers halted production for over a month while negotiating the new contract.\n\nYahoo Finance's Senior Autos Reporter Pras Subramanian breaks down the automaker's strike impact, providing insights from the earnings calls and discussing recent EV investments and the inclusion of battery plants in the UAW deal.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nVideo Transcript\n\nDIANE KING HALL: Another company we're watching, Ford. It released its third-quarter results on Thursday after the bell, missing expectations. Now this comes just after the UAW and the automaker reached a tentative agreement that will be voted on by Union members this coming Sunday. We want to bring in Yahoo Finance's Pras Subramanian, who has been following all of this closely. Pras, take us through the latest.\n\nPRAS SUBRAMANIAN: Hey, Diane. Yeah, so, a highly anticipated report last night following the big news of that UAW tentative deal and then they reported mixed results shortly after that. But a few things stood out to me with the report and also the ensuing conference call.\n\nSo the first thing was Ford said that it was on pace to hit its improved outlook before the strike. But as we know, it pulled the guidance last night similar to GM due to uncertainty here. Ford said it lost $100 million in Q3 and 1.2 billion in Q4 due to the strike. But it said, that its costs are still unknown as it restarts production.\n\nSo I was a little surprised to hear-- when you get an updated figure yet-- they said they will issue one shortly. Number two, Ford is pushing back its EV investments saying last night it's going to push out around $12 billion in those EV investments until capacity is needed.\n\nStory continues\n\nIt means they're going to pause some plants that were scheduled to be built in the next couple of years. Ford said in a statement that many North American customers interested in buying EVs are unwilling to pay premiums for them over gas or hybrid cars, thus sort of compressing profitability and prices. So it's a challenging environment over price with EVs.\n\nAnd now they're saying that they still want to keep investing in EVs but they want to focus on their next Gen cars because their current cars aren't necessarily competitive on cost and features. Basically saying that Ford is not competitive right now compared to Tesla. And finally, it's unclear in what they said-- with the tentative deal that if battery plants are part of the UAW agreement, Ford CFO John Lawler on a media call declined to say if unionization at battery plants was part of the deal.\n\nNow Ford, of course, isn't at liberty to talk about these things because of the fact that they still need to be discussed. The UAW is still discussing these things with their membership before they can vote on it like you mentioned. But this is a big reason why the UAW didn't strike additional GM plants a few weeks ago because it said that GM agreed to include battery plants as part of the Master Agreement as they call it.\n\nSo it's unclear if Ford has this sort of provision in the UAW contract that it agreed to, but I can't imagine it doesn't after the UAW made such a big deal about those battery plants included into the Master Agreement.", "link": "https://finance.yahoo.com/video/ford-outlook-suffers-amid-uaw-145125895.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.958, "neg": 0.042, "neu": 0.888, "pos": 0.07}}, {"date": "2023-10-27T14:37:25+00:00", "title": "Ford Stock Tumbles After Auto Maker Withdraws Guidance, Citing Strike", "content": "[**Ford Motor (F)**](https://www.wsj.com/market-data/quotes/F) shares swooned after the auto maker withdrew its guidance for the year, citing the impact of the United Auto Workers strike. Ford swung to a profit of $1.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9db18f98-627b-3cee-9169-df1e1e79f61a/ford-stock-tumbles-after-auto.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.751, "neg": 0.04, "neu": 0.749, "pos": 0.211}}, {"date": "2023-10-27T14:33:04+00:00", "title": "Down 25%, Is Ford Stock a Buy Now?", "content": "Ford Motor Company (NYSE: F) just updated investors with its third-quarter results, and it has investors on the fence regarding what's to come from the automaker. If you do buy, don't expect to be rewarded from growth in Ford's Model e, the electric vehicle (EV) segment. Ford missed analyst estimates in the third quarter for both operating profit and earnings per share.\n\nContinue reading", "link": "https://finance.yahoo.com/m/0f179981-34a3-3b3c-85b6-33a78796a6bc/down-25%25%2C-is-ford-stock-a-buy.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.827, "neg": 0.031, "neu": 0.818, "pos": 0.151}}, {"date": "2023-10-27T14:23:29+00:00", "title": "US STOCKS-Nasdaq, S&amp;P 500 edge higher as Amazon, Intel lift megacaps", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nAmazon.com says growth in cloud business stabilizing\n\n*\n\nIntel forecast Q4 revenue, margins above estimates\n\n*\n\nFord withdraws full-year results forecast\n\n*\n\nChevron posts slump in third-quarter profit\n\n*\n\nDow off 0.23%, S&P up 0.08%, Nasdaq climbs 0.69%\n\n(Updated at 9:50 a.m. ET/ 1350 GMT)\n\nBy Ankika Biswas and Shashwat Chauhan\n\nOct 27 (Reuters) - The Nasdaq and S&P 500 rose on Friday as robust updates from Amazon.com and Intel lifted beaten-down megacaps, while investors also drew comfort from data that showed inflation rose largely in line with expectations.\n\nAmazon.com jumped 7.0% after the e-commerce giant reported a pick up in growth at its most profitable cloud business.\n\nIntel rallied 11.0% after the chipmaker forecast fourth-quarter revenue and margins above estimates. Chip stocks Advanced Micro Devices and Nvidia added 1.4% and 1.0%, respectively.\n\nMegacaps Microsoft, Meta Platforms, Tesla and Apple rose between 0.5% and 3.5% at the end of a rough week for Big Tech.\n\nMeanwhile, data showed U.S. consumer spending increased more than expected in September, keeping it on a higher growth path heading into the fourth quarter.\n\nThe personal consumption expenditures price index, considered to be the Federal Reserve's preferred inflation gauge, climbed 0.4% in September compared with an estimated 0.3% rise.\n\nCore inflation which excludes volatile food and energy components rose 0.3%, meeting estimates.\n\n\"There's a lot of evidence of disinflation really kicking in throughout the economy,\" said David Russell, global head of market strategy at TradeStation.\n\n\"The Fed seems to have accomplished a lot of what they were trying to do in terms of inflation but then we have a very strong job market, very strong GDP and the Fed really has no incentive to change their policy anytime soon.\"\n\nFutures contracts tracking Federal Reserve's policy rate rose, reflecting increased confidence among traders that the central bank will not raise borrowing costs any further.\n\nStory continues\n\nAt 9:50 a.m. ET, the Dow Jones Industrial Average was down 75.24 points, or 0.23%, at 32,709.06, the S&P 500 was up 3.30 points, or 0.08%, at 4,140.53, and the Nasdaq Composite was up 87.37 points, or 0.69%, at 12,682.98.\n\nWeighing on the Dow, Chevron fell 5.0% after the oil major reported a drop in third-quarter profit.\n\nShares of Exxon Mobil advanced 0.5% after it posted a higher profit compared with the prior quarter, though year-on-year earnings plunged nearly 54%.\n\nFord Motor sank 8.0% after withdrawing its full-year results forecast due to \"uncertainty\" over the pending ratification of its deal with the United Auto Workers union, and warning of continued pressure on electric vehicles.\n\nOf the 245 companies in the S&P 500 that have reported earnings so far, 77.6% beat earnings expectations, LSEG data showed. Third-quarter earnings are expected to grow 4.3% from a year earlier.\n\nToothpaste-maker Colgate-Palmolive rose 1.6% after raising its annual organic sales and profit forecasts for a third time this year.\n\nEnphase Energy dipped 13.5% after the solar inverter maker forecast fourth-quarter revenue below estimates.\n\nThe tensions in the Middle East were also on investors' radar, with a Hamas official tying the release of hostages to Israel stopping the bombardment of Gaza which it launched after a deadly rampage by Hamas militants into the southern part of the country nearly three weeks ago.\n\nDeclining issues outnumbered advancers by a 1.62-to-1 ratio on the NYSE and by a 1.51-to-1 ratio on the Nasdaq.\n\nThe S&P index recorded no new 52-week high and 40 new lows, while the Nasdaq recorded eight new highs and 186 new lows. (Reporting by Ankika Biswas, Shashwat Chauhan and Sruthi Shankar in Bengaluru; Editing by Arun Koyyur and Vinay Dwivedi)", "link": "https://finance.yahoo.com/news/us-stocks-nasdaq-p-500-142329217.html", "symbols": ["CHV.F", "CHV.XETRA", "CVX.MX", "CVX.US", "DJI.INDX", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GSPC.INDX", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "IXIC.INDX"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0.037, "neu": 0.861, "pos": 0.102}}, {"date": "2023-10-27T14:15:00+00:00", "title": "Ford (F) Misses on Q3 Earnings, Withdraws 2023 Guidance", "content": "Ford F reported adjusted earnings of 39 cents per share for third-quarter 2023, which missed the Zacks Consensus Estimate of 40 cents but increased from 30 cents recorded in the year-ago quarter. The company’s consolidated third-quarter revenues came in at $43,801 million, rising 11.2% year over year.\n\nFord currently carries a Zacks Rank #3 (Hold). You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\n\nFord Motor Company Price, Consensus and EPS Surprise Ford Motor Company Price, Consensus and EPS Surprise\n\nFord Motor Company price-consensus-eps-surprise-chart | Ford Motor Company Quote\n\nSegmental Performance\n\nThe U.S. legacy automaker reports its automotive results under three business segments — Ford Model e, Ford Blue and Ford Pro. While Ford Blue focuses on the firm’s legacy gas-powered business, Ford Model e focuses on EVs, advanced technologies and several related aspects to support electrification plans. Ford Pro deals with commercial vehicles and services.\n\nIn the third quarter, total wholesale volume in the Ford Blue segment decreased 1% year over year to 736,000 units and also fell short of our forecast of 750,000 units. However, revenues from the segment increased 7% year over year to $25.6 billion and topped our estimate of $23.8 billion on better-than-expected pricing. Earnings before interest and taxes came in at $1,718 million with an EBIT margin of 6.7%. EBIT exceeded our projection of $1,557 million thanks to the company’s cost-containment efforts and higher-than-expected revenues.\n\nTotal wholesale volume in the Ford Model e segment increased 44% year over year to 36,000 units. Revenues from the segment rose 26% year over year to $1.8 billion. Loss before interest and taxes widened to $1,380 million with an EBIT margin of negative 75.6% amid high costs in the development of technologically advanced products.\n\nTotal wholesale volume in the Ford Pro segment decreased 2% year over year to 314,000 and missed our expectation of 382,000 units. However, revenues from the segment grew 16% year over year to $13.8 billion and beat our expectations of $11.8 billion. Earnings before interest and taxes came in at $1,654 million with an EBIT margin of 12%.\n\nStory continues\n\nOverall, Ford’s total automotive revenues came in at around $41,176 million, surpassing our estimate of $36,588 million on stronger-than-expected results from Ford Blue and Ford Pro units.\n\nSecond-quarter revenues from the Ford Credit unit came in at $2,625 million, up 20% year over year. Pretax earnings totaled $358 million, falling from $589 million in the year-ago quarter. Reduced financing margin, the absence of gains in derivative market valuations and a decrease in the residual values of leased vehicles adversely impacted the results.\n\nFinancial Position\n\nFord reported adjusted free cash flow of $1,225 million for the quarter. It had cash and cash equivalents of $26,427 million as of Sep 30, 2023. Long-term debt, excluding Ford Credit, totaled $19.33 billion at the end of the third quarter of 2023.\n\nDespite a tentative agreement with the United Auto Workers, the strike brought uncertainty to Ford’s fiscal year results. Given the extent of its influence and the pending ratification of the agreement, Ford withdrew its full-year 2023 guidance.\n\nZacks Rank & Key Picks\n\nFord currently carries a Zacks Rank #3 (Hold).\n\nA few top-ranked players in the auto space include Toyota TM, Honda HMC and Nissan NSANY, each sporting a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nThe Zacks Consensus Estimate for TM’s fiscal 2024 sales and EPS implies year-over-year growth of 10.5% and 27.5%, respectively. The earnings estimate for fiscal 2024 and 2025 has been revised upward by 18 cents and 37 cents, respectively, in the past seven days.\n\nThe Zacks Consensus Estimate for HMC’s fiscal 2024 sales and EPS implies year-over-year growth of 7.7% and 27.7%, respectively. The earnings estimate for fiscal 2025 has been revised upward by 5 cents in the past seven days.\n\nThe Zacks Consensus Estimate for NSANY’s fiscal 2024 EPS implies year-over-year growth of 12.6%. The earnings estimate for fiscal 2024 and 2025 has been revised upward by 10 cents and 3 cents, respectively, in the past seven days.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nToyota Motor Corporation (TM) : Free Stock Analysis Report\n\nHonda Motor Co., Ltd. (HMC) : Free Stock Analysis Report\n\nNissan Motor Co. (NSANY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/ford-f-misses-q3-earnings-141500846.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.032, "neu": 0.832, "pos": 0.136}}, {"date": "2023-10-27T14:09:29+00:00", "title": "UPDATE 1-Dana sees 'significant impact' from UAW strikes to North American operations", "content": "(Adds details from earnings call, shares and details throughout)\n\nBy Nathan Gomes\n\nOct 27 (Reuters) - Auto parts supplier Dana said on Friday its operations in North America were \"significantly impacted\" by the ongoing United Auto Workers (UAW) union strikes against automakers, while outlining the expected financial hit from them.\n\nShares of the company, which supplies axles, driveshafts and transmissions to the Detroit Three automakers, namely General Motors, Ford Motor and Stellantis NV, were up more than 3% in morning trade.\n\nDana said the UAW strikes affected some of its largest light truck programs, including Ford Super Duty, Ranger and Bronco as well as Stellantis' Jeep Wrangler and Gladiator.\n\n\"The longer the UAW strike continues, the greater financial stress there will be across the Tier 2 through Tier 4 supply base,\" Dana's chief executive James Kamsickas said in a post-earnings call with analysts.\n\nThe company earlier in the day said its heavy-vehicle business and operations in the rest of the world were largely unaffected.\n\nDana expects its full-year sales to be $10.7 billion if UAW strikes through Oct. 31, or $10.2 billion with strikes through Dec. 31.\n\nIt expects full-year adjusted earnings per share to be 80 cents assuming the strike continues through Oct. 31, or 30 cents with strike through Dec. 31.\n\nThe company had forecast annual sales of $10.45 billion to $10.95 billion, and annual adjusted EPS to be between $0.65 and $1.05, in July.\n\nGM and Ford have pulled their full-year forecasts this week to account for impacts from the UAW strikes.\n\nEarlier this week, consultancy firm Anderson Economic Group estimated the economic losses related to supplier wages and earnings of about $2.78 billion through the fifth week of the strike.\n\nOn an adjusted basis, Dana earned 30 cents per share in the third quarter ended Sept. 30, compared with LSEG estimates of 13 cents per share.\n\n(Reporting by Nathan Gomes in Bengaluru; Editing by Shilpi Majumdar)", "link": "https://finance.yahoo.com/news/1-dana-sees-significant-impact-140929147.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.077, "neg": 0.075, "neu": 0.86, "pos": 0.065}}, {"date": "2023-10-27T13:45:00+00:00", "title": "UAW Settlement Aside, Ford Crashes After Q3 Results", "content": "Ford Motor Co is lower in early market trading after withdrawing their 2023 guidance and reporting an operating loss in their EV segment. In this daily bar chart of F, below, I can see that prices have been under selling pressure from early July. The On-Balance-Volume (OBV) line has been weak since the beginning of July and tells me that sellers of F have been more aggressive than buyers.\n\nContinue reading", "link": "https://finance.yahoo.com/m/bbde6138-ee4a-3772-855d-a7e095fe9ebc/uaw-settlement-aside%2C-ford.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.858, "neg": 0.152, "neu": 0.848, "pos": 0}}, {"date": "2023-10-27T13:22:17+00:00", "title": "GM, UAW in intensive talks to reach new contract", "content": "By David Shepardson\n\n(Reuters) - Talks between General Motors and the United Auto Workers went on until about 5 a.m. (0900 GMT) Friday as they engage in intensive bargaining to try to reach a labor contract deal to end a six-week-old strike.\n\nFord Motor on Wednesday was the first of Detroit's Big Three car manufacturers to negotiate an agreement to settle strikes joined by 45,000 Detroit Three auto workers since mid-September. The deal will likely set a pattern for new contracts with GM and Chrysler parent Stellantis.\n\nGM and UAW negotiators were reconvening later on Friday after the all-night session with the hope of soon reaching a deal. The UAW also held lengthy talks Thursday with Stellantis.\n\nGM CEO Mary Barra and UAW President Shawn Fain took part in talks on Thursday. GM and the UAW were very close on economic topics but some final issues including the use of temporary workers remained under discussion, sources said.\n\nThe Ford agreement, which still must be ratified by union members, includes a 25% wage hike over the life of the 4-1/2-year contract, a boost in retirement contributions, and the elimination of lower-pay tiers for workers in certain parts operations at Ford.\n\nIt also reduces the time to get to top pay to three years from eight, and the UAW won the right to strike over plant closures.\n\nThe deal amounts to total pay hikes of more than 33% when compounding and cost-of-living mechanisms are factored in, the UAW said.\n\nFord Chief Financial Officer John Lawler said Thursday the strike had cost the automaker $1.3 billion in earnings and 80,000 vehicles.\n\n(Reporting by David Shepardson; Editing by Chizu Nomiyama)", "link": "https://finance.yahoo.com/news/gm-uaw-intensive-talks-reach-132217824.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.964, "neg": 0.034, "neu": 0.864, "pos": 0.103}}, {"date": "2023-10-27T13:20:02+00:00", "title": "GM, UAW in intensive talks to reach new contract", "content": "By David Shepardson\n\nOct 27 (Reuters) - Talks between General Motors and the United Auto Workers went on until about 5 a.m. (0900 GMT) Friday as they engage in intensive bargaining to try to reach a labor contract deal to end a six-week-old strike.\n\nFord Motor on Wednesday was the first of Detroit's Big Three car manufacturers to negotiate an agreement to settle strikes joined by 45,000 Detroit Three auto workers since mid-September. The deal will likely set a pattern for new contracts with GM and Chrysler parent Stellantis.\n\nGM and UAW negotiators were reconvening later on Friday after the all-night session with the hope of soon reaching a deal. The UAW also held lengthy talks Thursday with Stellantis.\n\nGM CEO Mary Barra and UAW President Shawn Fain took part in talks on Thursday. GM and the UAW were very close on economic topics but some final issues including the use of temporary workers remained under discussion, sources said.\n\nThe Ford agreement, which still must be ratified by union members, includes a 25% wage hike over the life of the 4-1/2-year contract, a boost in retirement contributions, and the elimination of lower-pay tiers for workers in certain parts operations at Ford.\n\nIt also reduces the time to get to top pay to three years from eight, and the UAW won the right to strike over plant closures.\n\nThe deal amounts to total pay hikes of more than 33% when compounding and cost-of-living mechanisms are factored in, the UAW said.\n\nFord Chief Financial Officer John Lawler said Thursday the strike had cost the automaker $1.3 billion in earnings and 80,000 vehicles. (Reporting by David Shepardson; Editing by Chizu Nomiyama)", "link": "https://finance.yahoo.com/news/gm-uaw-intensive-talks-reach-132002249.html", "symbols": ["8GM.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA"], "tags": [], "sentiment": {"polarity": 0.964, "neg": 0.033, "neu": 0.865, "pos": 0.102}}, {"date": "2023-10-27T13:12:00+00:00", "title": "Ford CEO Sounds a Lot Like Tesla’s Elon Musk. It’s Not Helping the Stock.", "content": "Ford Motor CEO Jim Farley sounded a lot like Elon Musk on the company’s third-quarter conference call—which is good news considering that Tesla CEO Elon Musk didn’t sound like his usual, confident self. Ford (ticker: F), on Thursday evening, reported weaker-than-expected third-quarter results. Ford stock was down 4.2% in premarket trading Friday while futures were up 0.4% and futures were little changed.\n\nContinue reading", "link": "https://finance.yahoo.com/m/7cc5a5db-243c-3c96-872b-cb82670d6152/ford-ceo-sounds-a-lot-like.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.878, "neg": 0, "neu": 0.842, "pos": 0.158}}, {"date": "2023-10-27T12:23:00+00:00", "title": "Ford stock wobbles as company puts a dollar figure on UAW auto strikes", "content": "The legacy automaker, reporting earnings Thursday, Oct. 26, said the strikes came at a huge cost for the company.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1a471353-3fb0-36a6-abf0-f805c89be276/ford-stock-wobbles-as-company.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.052, "neg": 0.11, "neu": 0.789, "pos": 0.101}}, {"date": "2023-10-27T12:00:19+00:00", "title": "Ford shares fall after pulling full-year forecast, wider EV losses", "content": "By Shivansh Tiwary\n\n(Reuters) -Shares of Ford Motor Co fell 6% in morning trade on Friday, after the automaker reported wider losses from its electric-vehicle (EV) business due to pressure from a price war sparked by industry leader Tesla.\n\nThe Detroit automaker also pulled its 2023 forecast, citing \"uncertainty\" over the pending ratification of its new labor deal with the United Auto Workers (UAW) union, which is expected to significantly increase labor-related expenses.\n\nFord cautioned about ongoing challenges in its EV business and said it was cutting production of its Mustang Mach-E while scaling back about $12 billion in investments in the segment, including delaying its second battery plant in Kentucky.\n\n\"We believe that the rise in battery raw material costs has negatively impacted the outlook for BEV (battery electric vehicles) profitability, and consequently, Ford's profitability,\" Wells Fargo analysts wrote in a note.\n\nThe company's quarterly report added to the gloom around the EV market, which has seen consumers pull back on some purchases due to high inflation.\n\nFord on Thursday said its EV unit posted a quarterly loss in earnings before interest and taxes (EBIT) of $1.33 billion, compared with an EBIT loss of $1.08 billion in the second quarter.\n\nOn Wednesday, the UAW and Ford reached a tentative agreement that entails a 25% wage increase for 57,000 workers over a span of nearly five years, effectively putting an end to the strike at some of the automaker's largest factories.\n\nFord expects the new contract to add $850 to $900 in labor cost per-vehicle, Chief Financial Officer John Lawler said in a briefing on Thursday.\n\nThe automaker has lost about $4.32 billion in market cap throughout the duration of the strike, according to LSEG data.\n\nGeneral Motors, a rival that has not yet reached an agreement with UAW, withdrew its 2023 results forecast earlier this week and revised its frequently stated goal of producing 400,000 EVs by mid-2024.\n\n(Reporting by Shivansh Tiwary and Nathan Gomes in Bengaluru; Editing by Krishna Chandra Eluri)", "link": "https://ca.finance.yahoo.com/news/ford-shares-fall-pulling-full-120019282.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.584, "neg": 0.07, "neu": 0.849, "pos": 0.081}}, {"date": "2023-10-27T11:59:00+00:00", "title": "Ford’s Cost Problem Isn’t Just About EVs", "content": "Ford’s gas-engine business is also costing more than it should—a difference from crosstown rival General Motors that investors are ignoring at their peril.\n\nContinue reading", "link": "https://finance.yahoo.com/m/1b31b9bd-0a25-3749-9e49-51372c215fdd/ford%E2%80%99s-cost-problem-isn%E2%80%99t.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.66, "neg": 0.19, "neu": 0.81, "pos": 0}}, {"date": "2023-10-27T11:33:47+00:00", "title": "5 Things to Know Before Markets Open", "content": "Chevron shares fell after the oil giant reported earnings that came in below estimates on lower commodity prices and Amazon shares surged as its web services division drove revenue higher. Here’s what investors need to know today.\n\nContinue reading", "link": "https://finance.yahoo.com/m/92066d27-d8e4-3f8c-bbbd-d3c2aef13cdc/5-things-to-know-before.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "CHV.F", "CHV.XETRA", "CVX.MX", "CVX.US", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA"], "tags": [], "sentiment": {"polarity": 0.44, "neg": 0.051, "neu": 0.808, "pos": 0.141}}, {"date": "2023-10-27T10:47:46+00:00", "title": "Stocks to Watch Friday: Exxon, Amazon, Chevron, Intel", "content": "↗️ [**Amazon (AMZN)**](https://www.wsj.com/market-data/quotes/AMZN?mod=searchresults_companyquotes): The tech giant said quarterly profit [tripled to nearly $10 billion](https://www.wsj.com/tech/amazon-amzn-q3-earnings-report-2023-9919947b) on the back of strong sales in its cloud-computing, advertising and retail units.\n\nContinue reading", "link": "https://finance.yahoo.com/m/7dd90904-50ec-32b8-a007-4bbbd4804ecb/stocks-to-watch-friday%3A.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "CHV.F", "CHV.XETRA", "CMC.F", "CMC.XETRA", "CVX.MX", "CVX.US", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US"], "tags": [], "sentiment": {"polarity": 0.735, "neg": 0, "neu": 0.819, "pos": 0.181}}, {"date": "2023-10-27T10:42:00+00:00", "title": "The U.S. Economy Is a Juggernaut. Why It May Not Remain That Way.", "content": "Amazon boosts sales and profit, Ford withdraws guidance after UAW tentative deal, Yellen sees signs of soft landing, and other news to start your day.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4912c2e9-fda4-39a0-aed4-5a3bf2f3f5be/the-u.s.-economy-is-a.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.71, "neg": 0, "neu": 0.777, "pos": 0.223}}, {"date": "2023-10-27T10:00:00+00:00", "title": "7 Battery Stocks That Can Make You Very Rich in 10 Years", "content": "As green initiatives electrify global markets, the battery sector continues to spark significant investor interest. Indeed, battery stocks are no longer just speculative plays, becoming an integral part of investor portfolios. With an insatiable upsurge in demand, batteries are no longer confined to powering electric vehicles; they’re critical to a variety of daily essentials, kindling a financial flurry around battery stocks.\n\nThe race to replace combustion engines with sustainable alternatives has become more heated than ever. These EV battery stocks are recognizing their potent potential in effectively redefining wealth portfolios. This pivotal transition is what positions battery stocks not just as fleeting trends but as key investments for those looking to energize their financial trajectories.\n\nLithium Americas (LAC) smartphone with logo of Canadian company Lithium Americas Corp on screen\n\nSource: Wirestock Creators / Shutterstock.com\n\nLithium Americas (NYSE:LAC), following its recent split, is zeroing in on its North American assets, making it one of the most intriguing prospects for the coming half-decade. Despite an initial dip post-split, astute investors should see its current price as an enticing entry point.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nAt the heart of LAC’s potential lies the Thacker Pass project. Boasting a formidable 40-year mine life, this project, estimated to have a net present value of $5.7 billion, could become a massive revenue generator, especially if lithium prices rise. LAC’s collaboration with General Motors adds another layer of assurance.\n\nWith GM’s investment commitment of $650 million and an off-take agreement, there’s a predictable cash flow trajectory awaiting post-production. There also are whispers about the Department of Energy contemplating a whopping $1 billion loan for Thacker Pass. Therefore, such a financial boost, complemented by GM’s backing, promises smooth sailing ahead for the company’s financing.\n\nBYD (BYDDF) BYD Company Limited logo in front of their website. BYDDY stock.\n\nSource: T. Schneider / Shutterstock\n\nStory continues\n\nBYD (OTCMKTS:BYDDF), a towering automotive giant from China, is not only flexing its muscles as Tesla’s (NASDAQ:TSLA) top competitor, but holds the esteemed title of the world’s second-largest battery maker.\n\nIts proprietary Blade Battery surges ahead in traditional lithium-ion versions in efficiency and cost-effectiveness, acknowledged by even EV pioneer Tesla, integrating it into its own vehicles. Diversifying its portfolio, BYD’s freshly minted sub-brand is ready to debut SUVs, off-road vehicles, and sports cars, reflecting its sharp market acumen in its rising delivery numbers.\n\nThe financial prowess of BYD is nothing short of impressive, though, boasting a 204% surge in profits in a mere six-month span.\n\nAs it spreads its tentacles in global territories, including France, Japan, and Australia, BYD ensures it’s not just tethered to its Chinese roots, offering a buffer against potential domestic regulatory challenges. With the momentum it’s building, 2024 could very well be the year the EV player dominates its niche globally.\n\nSolid Power (SLDP) Smartphone with logo of American battery company Solid Power Inc. on screen in front of business website. Focus on center-left of phone display.\n\nSource: T. Schneider / Shutterstock.com\n\nSolid Power (NASDAQ:SLDP) is at the forefront of the solid-state battery revolution, bolstered by its formidable allies, including BMW (OTCMKTS:BMWYY) and Ford (NYSE:F).\n\nBoth automotive giants aren’t just financial support; BMW, for instance, is deeply involved in concurrent research efforts to speed up the battery’s commercialization process. By the close of 2023, Solid Power aims to present its EV cells to these partners for validation tests, a move likely to reshape its trajectory.\n\nThe financial footing of the firm is rock-solid, boasting a cash reserve of $443 million at the end of the second quarter. Their projected cash expenditure for this year falls in the $120 to $140 million range, signaling a robust financial runway extending into 2025.\n\nWhile full commercialization may hover around 2025 or 2026, several catalysts could propel SLDP stock upwards, especially with the production of its EV cells having already begun.\n\nPanasonic (PCRFY) A Panasonic (PCRFY) sign hanging in Beijing, China. generation z\n\nSource: testing/Shutterstock.com\n\nPanasonic (OTCMKTS:PCRFY) isn’t just any name on Tesla’s supplier list; it stands out as a trusted ally in the EV pioneer’s electric journey.\n\nWhile skeptics point out that Tesla is Panasonic’s primary revenue source, it’s tough to ignore the company’s strategic maneuvers. The company is capitalizing on its pioneering advantage, amplifying its production capabilities and positioning itself to reap benefits from the Inflation Reduction Act.\n\nIt continues to innovate aggressively and refine its lithium-ion battery design while holding promising patents for solid-state battery technologies that could challenge lithium-ion’s EV dominance.\n\nExpansion is in full throttle, with plans to inaugurate four additional EV battery plants, aiming for a whopping 200-gigawatt-hour production by 2031, a potential fourfold surge from the previous year’s capacity. Hence, Panasonic’s vision makes it an intriguing long-term prospect in the EV battery sphere.\n\nAlbemarle (ALB) Albemarle (ALB) logo on a mobile phone screen\n\nSource: IgorGolovniov/Shutterstock.com\n\nAlbemarle (NYSE:ALB) has effectively weathered the downturn in the lithium market, emerging as a potential value pick with an enticing forward P/E of 5.2.\n\nComplementing its valuation is a commendable dividend yield of 1.2%, complemented by 28 consecutive years of growth. However, the crux of ALB’s allure lies in its forward-thinking expansion strategy. In 2022, the company declared a lithium conversion capacity of 200ktpa and has set its sights on nearly tripling this by 2027.\n\nIts second quarter financials further bolstered its optimistic narrative, with its net income soaring to $650 million from the preceding year’s $406.8 million, with net sales rising by a notable 60%. This commendable growth, primarily attributed to the Energy Storage and Ketjen ventures, prompted the company to revise its full-year forecasts optimistically. Given the global pivot to EVs, and the expected rebound in lithium prices, Albemarle’s prospects are undoubtedly gleaming.\n\nAmplify Lithium & Battery Technology ETF (BATT) Electric car lithium battery pack and power connections. MMAT stock\n\nSource: asharkyu / Shutterstock.com\n\nWhen venturing into the rapidly evolving EV battery niche, investors usually grapple with the volatility of individual stocks.\n\nA savvy strategy, in this case, is pivoting to exchange-traded funds, offering diversified exposure with marginalized risks. One such noteworthy ETF in the sector is the Amplify Lithium & Battery Technology ETF (NYSE:BATT).\n\nOut of its vast umbrella of 50 distinct holdings, industry giants, including Tesla and BYD, unmistakably shine through. It deftly extends its reach to companies, including Albemarle and an array of other potential-laden lithium miners.\n\nWith over $120 million in assets under management, BATT’s credentials remain robust, though some investors might find its 0.59% expense ratio a tad on the higher side.\n\nWhile BATT is unlikely to transform your portfolio overnight singularly, its strategic composition positions it as a conduit to a sector offering tremendous potential multi-baggers in the foreseeable future.\n\nToyota Motors (TM) Toyota (TM) logo on the building of a dealership during daylight\n\nSource: josefkubes / Shutterstock.com\n\nToyota Motors (NYSE:TM), traditionally famed for its mid-range cars and hybrid innovations, is revving up to carve its niche in the EV battery segment.\n\nWhile including an automaker might seem rather unconventional, Toyota’s ambitions of becoming a vertically integrated player in the battery space cannot be overlooked. The company invests in internal solid-state battery development, targeting a game-changing 1,000 km range, with mass production likely to roll out by 2027.\n\nTo back this ambitious vision, Toyota earmarked a colossal $13.6 billion for battery investments over the next decade. This financial strategy includes pumping $9 billion into production, intending to electrify its extensive vehicle lineup.\n\nBy 2025, the auto giant envisions 10 active battery production lines, expanding to a staggering 70 in the foreseeable future. Moreover, Toyota’s partnership with South Korea’s LG Energy Solution is another feather in its cap as it looks towards growing its market share further.\n\nOn the date of publication, Muslim Farooque did not have (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines\n\nMuslim Farooque is a keen investor and an optimist at heart. A life-long gamer and tech enthusiast, he has a particular affinity for analyzing technology stocks. Muslim holds a bachelor’s of science degree in applied accounting from Oxford Brookes University.\n\nMore From InvestorPlace\n\nThe #1 AI Investment Might Be This Company You’ve Never Heard Of Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 7 Battery Stocks That Can Make You Very Rich in 10 Years appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-battery-stocks-very-rich-100000197.html", "symbols": ["002594.SHE", "1211.HK", "ALB.US", "AMC.F", "BATT.US", "BY6.F", "BY6A.F", "BYDDF.US", "BYDDY.US", "F.US", "LAC.TO", "LAC.US", "MAT1.F", "MATA.F", "PCRFF.US", "PCRFY.US", "SLDP.US", "TM.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.02, "neu": 0.852, "pos": 0.128}}, {"date": "2023-10-27T09:36:58+00:00", "title": "US STOCKS-Futures gain on Amazon, Intel boost; key inflation data awaited", "content": "(For a Reuters live blog on U.S., UK and European stock markets, click or type LIVE/ in a news window.)\n\n*\n\nFutures up: Dow 0.35%, S&P 0.63%, Nasdaq 1%\n\nOct 27 (Reuters) - U.S. stock index futures climbed on Friday as robust forecasts from Amazon.com and Intel along with a pullback in Treasury yields lifted megacaps, while investors awaited a key inflation data during the day.\n\nAmazon.com gained 5.4% in premarket trading after saying growth in its cloud business is stabilizing on signing new deals. However, it warned that customers remained wary about spending heading into the holiday quarter.\n\nIntel gained 7.9% after forecasting fourth-quarter revenue and margins above estimates as the chipmaker was optimistic about a rebound in personal computer sales, improved data center business and demand for manufacturing services.\n\nAmong other chip stocks, Advanced Micro Devices rose 2.1% and Nvidia added 1.6%.\n\nMegacap tech and tech-adjacent stocks including Microsoft , Meta Platforms, Tesla and Alphabet gained between 0.7% and 2.1% as U.S. Treasury yields dropped after Thursday's weaker-than-expected U.S. inflation and disposable income data.\n\nInvestor focus will be on personal consumption expenditure for September, the Federal Reserve's preferred inflation metric, at 8:30 a.m. ET for more clarity on the monetary policy outlook.\n\nThe U.S. Commerce Department's report is expected to show a 0.3% monthly rise in the headline and core figures, excluding volatile energy and food items, according to a Reuters poll. Annually, they are seen rising 3.4% and 3.7%, respectively.\n\nTraders have fully priced in an interest rate hold in the Fed's policy decision on Nov. 1 and a 80% chance of the same in December, as per CME's FedWatch tool.\n\nMeanwhile, bets of a 25-basis-point rate cut stood at over 32% each in May and June.\n\nAll the three benchmark indexes are set for weekly and monthly losses with investors gauging the earnings and data deluge for clues on the economy's strength.\n\nStory continues\n\nAt 5:03 a.m. ET, Dow e-minis were up 114 points, or 0.35%, S&P 500 e-minis were up 26.25 points, or 0.63%, and Nasdaq 100 e-minis were up 141.5 points, or 1%.\n\nInvestors will also monitor quarterly earnings from Chevron , Exxon Mobil and Colgate-Palmolive during the day.\n\nFord Motor lost 2.7% after withdrawing its full-year results forecast due to \"uncertainty\" over the pending ratification of its deal with the United Auto Workers union, and warning of continued pressure on electric vehicles.\n\nThe tensions in the Middle East were also on investors' radar.\n\nTwo U.S. fighter jets struck weapons and ammunition facilities in Syria in retaliation for attacks on U.S. forces by Iranian-backed militia as concerns grew that the Israel-Hamas conflict may spread in the Middle East. (Reporting by Ankika Biswas in Bengaluru; Editing by Arun Koyyur)", "link": "https://finance.yahoo.com/news/us-stocks-futures-gain-amazon-093658052.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GSPC.INDX"], "tags": [], "sentiment": {"polarity": 0.947, "neg": 0.06, "neu": 0.843, "pos": 0.096}}, {"date": "2023-10-27T09:04:00+00:00", "title": "These Stocks Are Moving the Most Today: Amazon, Intel, Ford, Enphase, DexCom, Masimo, Deckers, Exxon, and More", "content": "Amazon posts third-quarter profit well ahead of estimates, Intel issues upbeat guidance, Ford reports weaker-than-expected earnings, and Enphase projects a slowdown in solar-product sales will continue.\n\nContinue reading", "link": "https://finance.yahoo.com/m/0bf663e9-0c7b-37f2-8a97-3672483ee57f/these-stocks-are-moving-the.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "E0P.F", "ENPH.US", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA"], "tags": [], "sentiment": {"polarity": 0.691, "neg": 0, "neu": 0.782, "pos": 0.218}}, {"date": "2023-10-27T07:54:54+00:00", "title": "Amazon, Intel, Exxon Mobil rise premarket; Ford, Chevron fall", "content": "Investing.com -- U.S. futures rose Friday, boosted by strong numbers from a couple of tech giants ahead of the release of key inflation data.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nAmazon (NASDAQ:AMZN) stock rose 6.1% after the e-commerce giant reported third-quarter results that topped expectations as growth in its cloud business continued to stabilize and advertising growth jumped.\n\nIntel (NASDAQ:INTC) stock rose 7% after the chip manufacturer delivered better-than-expected guidance for the current quarter after third-quarter earnings markedly beat analyst estimates amid signs PC demand has bottomed out.\n\nFord (NYSE:F) stock fell 3.4% after the auto giant withdrew its full-year results forecast due to \"uncertainty\" over the pending ratification of its deal with the United Auto Workers union.\n\nExxon Mobil  (NYSE:XOM) stock rose 0.3% after the oil major posted a $9.1 billion third-quarter profit, an about 54% drop from record earnings a year ago but up from the prior quarter as oil prices recovered.\n\nJPMorgan (NYSE:JPM) stock fell 0.9% after the lender said CEO Jamie Dimon would sell a portion of his stock holdings in the bank in 2024 for financial diversification and tax planning.\n\nChevron  (NYSE:CVX) stock fell 2% after the oil giant reported a fall in third-quarter profit despite higher oil prices, days after agreeing to buy smaller U.S. rival Hess (NYSE:HES) for $53 billion.\n\nNatwest (NYSE:NWG) stock fell 10% after the Financial Conduct Authority said it had identified potential \"regulatory breaches\" in the U.K.-based lender’s handling of a decision to close former Brexit party leader Nigel Farage's accounts.\n\nSanofi  (NASDAQ:SNY) ADRs fell 18% after the French drugmaker dropped its 2025 profit target under a plan to list its consumer healthcare business, while lifting its development spending plans.\n\nEnphase Energy (NASDAQ:ENPH) stock slumped 19% after the solar inverter maker missed quarterly revenue forecasts and offered full-year guidance well below expectations.\n\nStory continues\n\nAbbVie (NYSE:ABBV) stock rose 1.6% after the pharmaceutical company raised its annual profit forecast after beating quarterly earnings estimates, helped by a lower-than-feared drop in sales of its blockbuster arthritis drug, Humira, and strong demand for newer drugs. Colgate-Palmolive (NYSE:CL) stock rose 1.1% after the consumer goods company raised its annual organic sales and profit forecasts for a third time this year, betting on price hikes and steady demand for its self-care and pet nutrition products.\n\nRelated Articles\n\nAmazon, Intel, Exxon Mobil rise premarket; Ford, Chevron fall\n\nAmazon rallies on cloud recovery as it chases Microsoft for AI business\n\nSam Bankman-Fried takes the stand in his own defense in fraud trial", "link": "https://finance.yahoo.com/news/amazon-intel-exxon-mobil-rise-075454121.html", "symbols": ["4AB.F", "4AB.XETRA", "ABBV.MX", "ABBV.US", "AMZN.US", "CL.US", "CMC.F", "CMC.XETRA", "CVX.US", "E0P.F", "ENPH.US", "EXXO34.SA", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.046, "neu": 0.83, "pos": 0.124}}, {"date": "2023-10-27T04:00:42+00:00", "title": "Union workers score big pay gains as labour action sweeps US", "content": "The United Auto Workers’ 57,000 members at Ford wrested a hefty pay rise from the US carmaker this week following a strike that squeezed its production and profitability. Management agreed to a 25 pay rise over four years, including an immediate bump of 11 per cent, an offer far more generous than its initial bargaining position. “We told Ford to pony up and they did,” said UAW president Shawn Fain.\n\nContinue reading", "link": "https://finance.yahoo.com/m/076f4711-0106-3aa5-a62f-b5332f9d8e2a/union-workers-score-big-pay.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.806, "neg": 0.056, "neu": 0.807, "pos": 0.137}}, {"date": "2023-10-27T03:00:25+00:00", "title": "Ford Motor Company (F) Q3 2023 Earnings Call Transcript", "content": "At this time, I would like to welcome you to the Ford Motor Company third quarter 2023 earnings conference call. At this time, I would like to turn the call over to Lynn Antipas Tyson, executive director of investor relations. With me today are Jim Farley, president and CEO; John Lawler, chief financial officer; and Peter Stern, president, Ford Integrated Services.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6bdff351-248c-35d4-b071-15291dd8f4f2/ford-motor-company-%28f%29-q3.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.791, "neg": 0, "neu": 0.879, "pos": 0.121}}, {"date": "2023-10-27T00:00:00+00:00", "title": "3 Exciting EV Stocks to Buy for 100% Returns", "content": "The EV industry is one of the most competitive, but at the same time one of the most potent. Here are three of the best EV stocks to buy.", "link": "https://investorplace.com/2023/10/3-exciting-ev-stocks-to-buy-for-100-returns/", "symbols": ["F.US", "STLA.US", "XPEV.US"], "tags": [], "sentiment": {"polarity": 0.806, "neg": 0, "neu": 0.788, "pos": 0.212}}, {"date": "2023-10-26T23:30:24+00:00", "title": "Here's What Key Metrics Tell Us About Ford Motor Company (F) Q3 Earnings", "content": "For the quarter ended September 2023, Ford Motor Company (F) reported revenue of $41.18 billion, up 10.7% over the same period last year. EPS came in at $0.39, compared to $0.30 in the year-ago quarter.\n\nThe reported revenue compares to the Zacks Consensus Estimate of $38.57 billion, representing a surprise of +6.74%. The company delivered an EPS surprise of -2.50%, with the consensus EPS estimate being $0.40.\n\nWhile investors closely watch year-over-year changes in headline numbers -- revenue and earnings -- and how they compare to Wall Street expectations to determine their next course of action, some key metrics always provide a better insight into a company's underlying performance.\n\nSince these metrics play a crucial role in driving the top- and bottom-line numbers, comparing them with the year-ago numbers and what analysts estimated about them helps investors better project a stock's price performance.\n\nHere is how Ford Motor Company performed in the just reported quarter in terms of the metrics most widely monitored and projected by Wall Street analysts:\n\nWholesale Units - Ford Blue: 736 thousand versus the three-analyst average estimate of 688.11 thousand. Wholesale Units - Ford Pro: 314 thousand versus 345.62 thousand estimated by three analysts on average. Wholesale Units - Ford Model e: 36 thousand versus the three-analyst average estimate of 39 thousand. Revenues- Company excluding Ford Credit: $41.18 billion versus the three-analyst average estimate of $36.24 billion. Revenues- Ford Credit: $2.63 billion versus the two-analyst average estimate of $2.21 billion. The reported number represents a year-over-year change of +20%. Revenues- Ford Pro: $13.80 billion compared to the $12.15 billion average estimate based on two analysts. Adjusted EBIT- Corporate Other: -$200 million versus -$203.10 million estimated by three analysts on average. Adjusted EBIT- Ford Blue: $1.70 billion versus $1.54 billion estimated by three analysts on average. Adjusted EBIT- Ford Credit: $400 million compared to the $365.27 million average estimate based on three analysts. Adjusted EBIT- Ford Pro: $1.70 billion versus the three-analyst average estimate of $1.71 billion. Adjusted EBIT- Ford Model e: -$1.30 billion compared to the -$1.24 billion average estimate based on three analysts.\n\nStory continues\n\nView all Key Company Metrics for Ford Motor Company here>>>\r\n\r\nShares of Ford Motor Company have returned -6.9% over the past month versus the Zacks S&P 500 composite's -3.4% change. The stock currently has a Zacks Rank #3 (Hold), indicating that it could perform in line with the broader market in the near term.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/heres-key-metrics-tell-us-233024455.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.985, "neg": 0, "neu": 0.92, "pos": 0.08}}, {"date": "2023-10-26T23:15:00+00:00", "title": "Ford Retrenches Further on EVs, Citing Waning Demand", "content": "The automaker withdrew its profit guidance for the year, citing the UAW strike which is expected to cost it about $1.3 billion this year in operating profit.\n\nContinue reading", "link": "https://finance.yahoo.com/m/c2fd66c3-5c17-34be-a50c-551370658d2e/ford-retrenches-further-on.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.649, "neg": 0.045, "neu": 0.781, "pos": 0.174}}, {"date": "2023-10-26T22:46:06+00:00", "title": "Ford Misses on Profit, Pulls 2023 Outlook After Strike Deal", "content": "(Bloomberg) -- Ford Motor Co. said it fell short of third-quarter earnings expectations, citing higher costs and lower quality, a day after it won labor peace through a tentative contract with the United Auto Workers.\n\nMost Read from Bloomberg\n\nTech Giants Signal Rebound as Amazon, Intel Rally: Markets Wrap Controversial Chip in Huawei Phone Produced on ASML Machine US Economy Grew at a 4.9% Pace Last Quarter, Fastest Since 2021 Israel Latest: Israel Says Key Planner of Oct. 7 Attacks Killed What Happened Inside Morgan Stanley After Ted Pick Was Named CEO\n\nWith the six-week strike resolved pending a ratification vote by the union membership, Ford on Thursday pulled its forecast of adjusted earnings before interest and taxes in a range of $11 billion to $12 billion, which it had boosted in July. Crosstown rival General Motors Co., which still hasn’t settled with the UAW, likewise suspended its 2023 guidance.\n\n“We were negatively impacted by the strike, and our cost and quality remain a drag on our business,” Chief Executive Officer Jim Farley said on a conference call with analysts.\n\nThe union’s work stoppage, which began on Sept. 15, cost the company $100 million in the third quarter and a total of $1.3 billion so far, John Lawler, Ford’s chief financial officer, said in a media briefing. Ford’s deal with the UAW will add an additional $850-$950 per vehicle, he said, shaving margins by 60-to-70 basis points.\n\n“We going to have to find efficiencies and productivity throughout the system and throughout the company to help mitigate the impacts,” Lawler said.\n\nRead more: Ford Agrees to 25% Wage Hike in Tentative Deal to End Strike\n\nShares of the company fell 3.4% in postmarket trading to $10.96 as of 6:44 p.m. in New York. The stock closed Thursday up about 3% this year.\n\nProfit Miss\n\nThe Dearborn, Michigan-based carmaker posted adjusted earnings per share Thursday of 39 cents, 9 cents higher than a year ago but below the 47 cents consensus analyst estimate compiled by Bloomberg. Ford’s revenue in the third quarter of $43.8 billion, was better than the $41 billion analysts expected.\n\nStory continues\n\n“It’s been a challenging situation for us, but our business is never short of challenges,” Farley said of the strike, calling Ford’s performance in the quarter “mixed.”\n\nOne reason for that muted assessment: Ford has some 50,000 vehicles on hold due to quality-related issues in the third quarter, CFO Lawler told reporters.\n\nThe company is tapping the brakes harder on a shift to electric vehicles, something it signaled in July. Lawler said on the conference call with analysts that Ford will “push out” $12 billion in EV-related investments, part of the $50 billion it has earmarked for spending on EVs.\n\nA second planned battery plant in Kentucky with South Korean partner SK ON is being delayed, he said. Ford also is reducing production of the electric Mustang Mach-E at a plant in Mexico that was expanded earlier this year.\n\nThe carmaker’s struggles in its nascent electric vehicle business, known as Model e, resulted in a loss before interest and taxes of $1.33 billion in the quarter ended Sept. 30, more than the $1.27 billion loss analysts expected.\n\nLighting Sales Plunge\n\nSales of Ford’s signature EV, the F-150 Lightning, plunged 46% in the quarter as the company shut its factory for expansion, delayed delivery of trucks for “quality checks” and temporarily laid off workers at the plant for what the company called “multiple constraints.”\n\n“Great product is not enough in the EV business anymore,” Farley said. “We have to be totally competitive on cost.”\n\nThe CEO noted EV market leader Tesla Inc. has set a high benchmark for rivals by trimming cost and scaling output.\n\nThe traditional internal combustion engine unit, known as Ford Blue, saw third quarter earnings before interest and taxes of $1.72 billion, below analysts’ average forecast of $1.94 billion. That came despite a 7.7% increase in US vehicle sales in the quarter, led by models like the Bronco SUV and F-150 pickup truck.\n\nFord’s commercial business, known as Ford Pro, posted earnings before interest and taxes of $1.65 billion, undershooting the $2.16 billion analysts expected. That unit has seen growth in selling software services to help fleet owners better manage their vehicles, a business Ford sees growing up to 1,000% over the next few years.\n\n--With assistance from Gabrielle Coppola.\n\n(Updates from 10th paragraph with additional comments from CEO, CFO.)\n\nMost Read from Bloomberg Businessweek\n\nSam Bankman-Fried Takes Stand in Reminder of Crypto’s Epic Fall X, One Year Later: How Elon Musk Made a Mess of Twitter’s Business Venezuela’s Primary Sweep Puts Maduro and Biden in the Hot Seat No One Understands Corporate Boycotts Like This Former Trump Researcher The War That Broke Social Media\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/ford-misses-profit-pulls-2023-212426169.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.882, "neg": 0.061, "neu": 0.866, "pos": 0.073}}, {"date": "2023-10-26T22:43:13+00:00", "title": "Ford says UAW strike cut $1.3bn from operating earnings", "content": "Ford lost $1.3bn in operating earnings due to the United Auto Workers’ strike of nearly six weeks, the company said on Thursday, a day after striking a deal with the union. The company made 80,000 fewer cars and trucks than it otherwise would have churned out during the days workers were on strike, said Ford chief financial officer John Lawler. The lost earnings at the vehicle maker eclipse the damage at Detroit rival General Motors, which said on Tuesday the strike had cost it $800mn in earnings before interest and taxes.\n\nContinue reading", "link": "https://finance.yahoo.com/m/8371a9ca-7361-30ec-b62e-944267ae04e3/ford-says-uaw-strike-cut.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.542, "neg": 0.122, "neu": 0.821, "pos": 0.057}}, {"date": "2023-10-26T22:11:58+00:00", "title": "Ford Motor Co (F) Q3 2023 Earnings: Revenue Rises 11% to $44 Billion", "content": "Third-quarter revenue increases 11% year-over-year to $44 billion Net income of $1.2 billion, reversing a year-ago net loss of $827 million Adjusted EBIT increases to $2.2 billion Company withdraws 2023 guidance with ratification of tentative U.S. labor agreement pending\n\nOn October 26, 2023, Ford Motor Co (NYSE:F) released its third-quarter earnings report, showcasing a significant improvement in its financial performance. The company's revenue rose by 11% year-over-year to reach $44 billion, and it reported a net income of $1.2 billion, a stark contrast to the net loss of $827 million it experienced in the same period last year. The adjusted EBIT also increased to $2.2 billion.\n\nFinancial Performance\n\nWarning! GuruFocus has detected 5 Warning Signs with F.\n\nFord's third-quarter U.S. sales gains were seen across its gas, hybrid, and electric vehicle lines. The company's revenue in the quarter was $44 billion, up 11% from third-quarter 2022 on flat vehicle wholesales. The net income of $1.2 billion reversed a year-ago net loss of $827 million. The cash flow from operations was $4.6 billion in the quarter and $12.4 billion through the first nine months of the year. Adjusted free cash flow for the same periods was $1.2 billion and $4.8 billion, respectively.\n\nCompany's Balance Sheet\n\nFord's balance sheet remains strong, with more than $29 billion in cash and $51 billion in liquidity at the end of Q3, providing important financial flexibility. This included a $4 billion contingent liquidity facility that the company secured in August in anticipation of business uncertainties.\n\nBusiness Segment Highlights\n\nFord Pro, the business segment dedicated to commercial customers, generated $1.7 billion in EBIT a 12% margin on $13.8 billion in revenue, which was up 16%. Ford Blue, which markets a lineup of gas and hybrid vehicles, delivered $1.7 billion in third-quarter EBIT up 17% from last year. The business was again profitable in every region where it operates, driven by a strong and fresh product portfolio.\n\nStory continues\n\nOutlook\n\nDespite the positive results, Ford has withdrawn its guidance for full-year 2023 operating results due to the pending ratification of a tentative U.S. labor agreement. The company plans to report fourth-quarter and full-year 2023 financial results on Thursday, Feb. 1.\n\nExplore the complete 8-K earnings release (here) from Ford Motor Co for further details.\n\nThis article first appeared on GuruFocus.", "link": "https://finance.yahoo.com/news/ford-motor-co-f-q3-221158213.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.98, "neg": 0.039, "neu": 0.849, "pos": 0.113}}, {"date": "2023-10-26T21:30:15+00:00", "title": "Ford Motor Company (F) Q3 Earnings Miss Estimates", "content": "Ford Motor Company (F) came out with quarterly earnings of $0.39 per share, missing the Zacks Consensus Estimate of $0.40 per share. This compares to earnings of $0.30 per share a year ago. These figures are adjusted for non-recurring items.\n\nThis quarterly report represents an earnings surprise of -2.50%. A quarter ago, it was expected that this company would post earnings of $0.51 per share when it actually produced earnings of $0.72, delivering a surprise of 41.18%.\n\nOver the last four quarters, the company has surpassed consensus EPS estimates two times.\n\nFord Motor Company , which belongs to the Zacks Automotive - Domestic industry, posted revenues of $41.18 billion for the quarter ended September 2023, surpassing the Zacks Consensus Estimate by 6.74%. This compares to year-ago revenues of $37.19 billion. The company has topped consensus revenue estimates four times over the last four quarters.\n\nThe sustainability of the stock's immediate price movement based on the recently-released numbers and future earnings expectations will mostly depend on management's commentary on the earnings call.\n\nFord Motor Company shares have lost about 0.8% since the beginning of the year versus the S&P 500's gain of 9%.\n\nWhat's Next for Ford Motor Company?\n\nWhile Ford Motor Company has underperformed the market so far this year, the question that comes to investors' minds is: what's next for the stock?\n\nThere are no easy answers to this key question, but one reliable measure that can help investors address this is the company's earnings outlook. Not only does this include current consensus earnings expectations for the coming quarter(s), but also how these expectations have changed lately.\n\nEmpirical research shows a strong correlation between near-term stock movements and trends in earnings estimate revisions. Investors can track such revisions by themselves or rely on a tried-and-tested rating tool like the Zacks Rank, which has an impressive track record of harnessing the power of earnings estimate revisions.\n\nStory continues\n\nAhead of this earnings release, the estimate revisions trend for Ford Motor Company: mixed. While the magnitude and direction of estimate revisions could change following the company's just-released earnings report, the current status translates into a Zacks Rank #3 (Hold) for the stock. So, the shares are expected to perform in line with the market in the near future. You can see the complete list of today's Zacks #1 Rank (Strong Buy) stocks here.\n\nIt will be interesting to see how estimates for the coming quarters and current fiscal year change in the days ahead. The current consensus EPS estimate is $0.31 on $37.64 billion in revenues for the coming quarter and $2.02 on $159.66 billion in revenues for the current fiscal year.\n\nInvestors should be mindful of the fact that the outlook for the industry can have a material impact on the performance of the stock as well. In terms of the Zacks Industry Rank, Automotive - Domestic is currently in the bottom 44% of the 250 plus Zacks industries. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nOne other stock from the same industry, Xos, Inc. (XOS), is yet to report results for the quarter ended September 2023. The results are expected to be released on November 9.\n\nThis company is expected to post quarterly loss of $0.10 per share in its upcoming report, which represents a year-over-year change of +28.6%. The consensus EPS estimate for the quarter has remained unchanged over the last 30 days.\n\nXos, Inc.'s revenues are expected to be $13.58 million, up 23.3% from the year-ago quarter.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nXos, Inc. (XOS) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/ford-motor-company-f-q3-213015477.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.011, "neu": 0.897, "pos": 0.091}}, {"date": "2023-10-26T21:25:15+00:00", "title": "Ford reports mixed Q3 earnings, withdraws full-year guidance", "content": "Ford Motor (F) reported mixed third quarter results. The automaker reported adjusted earnings of $0.39 per share compared to estimates of $0.47. Revenue was $43.8 billion versus estimates of $40.98 billion. Ford also withdrew its full-year guidance citing the UAW strike, though the company and union have reached a tentative deal. Yahoo Finance Live breaks down the report.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/ford-reports-mixed-q3-earnings-212515649.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.273, "neg": 0.019, "neu": 0.936, "pos": 0.046}}, {"date": "2023-10-26T21:25:01+00:00", "title": "GM, Stellantis 'scrambling to assess' UAW-Ford deal", "content": "The United Auto Workers (UAW) reportedly reached a tentative labor deal with automaker Ford (F) on Thursday after 40 days of striking. MSR Strategy LLC Principal Consultant Marc Robinson explains what this could mean for EV battery plant workers and General Motors (GM) and Stellantis' (STLA) standings in reaching a similar agreement with union workers.\n\n\"I would be stunned if they did not end up agreeing to pattern economics, it will be almost impossible to get an agreement that's different than pattern ratified... by the members,\" Robinson, who is also a former GM employee, tells Yahoo Finance.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/gm-stellantis-scrambling-assess-uaw-212501119.html", "symbols": ["8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.862, "neg": 0.023, "neu": 0.876, "pos": 0.101}}, {"date": "2023-10-26T21:15:13+00:00", "title": "UAW Strike Could Threaten Ford, GM, and Stellantis' Already-Tough Transition to EVs", "content": "The United Auto Workers strike against Ford (F), General Motors (GM), and Stellantis (STLA), threatens to complicate the Big Three automakers' already-difficult transition to electric vehicles (EVs).\n\nContinue reading", "link": "https://finance.yahoo.com/m/da086e7e-b2a2-341f-9097-9e930c304dfc/uaw-strike-could-threaten.html", "symbols": ["8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "STLA.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.077, "neg": 0.125, "neu": 0.79, "pos": 0.085}}, {"date": "2023-10-26T20:48:03+00:00", "title": "Ford earnings fall short of estimates after it strikes a tentative deal with striking autoworkers", "content": "SAN FRANCISCO (AP) — Ford on Thursday reported significant growth in the third quarter, although its financial results fell short of Wall Street estimates.\n\nThe automaker's net income swung to a $1.2 billion profit from a year-earlier loss of $827 million. Revenue increased by 11% compared to a year earlier, coming in at $43.8 billion.\n\nFord's latest quarterly profit, adjusted for one-time items, amounted to 39 cents a share. That was below the 46 cents a share expected by industry analysts, according to FactSet.\n\nThe results came out just a day after Ford reached a tentative contract agreement with the United Auto Workers union. The four-year labor deal, which still has to be approved by 57,000 union members at the company, could bring a close to the union’s series of strikes at targeted factories run by Ford, General Motors and Jeep maker Stellantis.\n\nThe Ford deal could set the pattern for agreements with the other two automakers, where workers will remain on strike. The UAW called on all workers at Ford to return to their jobs and said that will put pressure on GM and Stellantis to bargain.\n\n“We told Ford to pony up, and they did,” President Shawn Fain said in a video address to members Wednesday night. He added that Ford put 50% more money on the table than it did before the strike started on Sept. 15.\n\nShares in Ford Motor Co., which is based in Dearborn, Michigan, were down almost 4% in after-hours trading following earnings report.", "link": "https://finance.yahoo.com/news/ford-earnings-fall-short-estimates-204803436.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.964, "neg": 0.038, "neu": 0.838, "pos": 0.124}}, {"date": "2023-10-26T20:47:00+00:00", "title": "Ford Swings to Profit, Withdraws Guidance Citing Impact of UAW Strike", "content": "Ford Motor posted $1.2 billion in net income in the third quarter, swinging from a loss in the prior-year period, but withdrew its guidance for the year, citing the impact of the United Auto Workers strike.\n\nContinue reading", "link": "https://finance.yahoo.com/m/c2fd66c3-5c17-34be-a50c-551370658d2e/ford-swings-to-profit%2C.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.318, "neg": 0.083, "neu": 0.827, "pos": 0.09}}, {"date": "2023-10-26T20:42:43+00:00", "title": "Ford Earnings Jump Less Than Expected. Management Yanks Guidance.", "content": "Ford earnings soared 30%, below forecast. And management pulled full-year guidance after reaching a labor agreement with the UAW.\n\nContinue reading", "link": "https://finance.yahoo.com/m/a59eba3d-b7e3-3c9f-a634-f1f6bdbeb08d/ford-earnings-jump-less-than.html", "symbols": ["8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.612, "neg": 0, "neu": 0.783, "pos": 0.217}}, {"date": "2023-10-26T20:41:00+00:00", "title": "Ford Earnings Miss Estimates. The Stock Is Slumping as Strike Costs Start to Bite.", "content": "Ford Motor stock is falling after third-quarter results came in light. Thursday evening, Ford (ticker: F) reported operating profit of $2.2 billion and earnings per share of 30 cents from sales of $39.4 billion. Wall Street was looking for operating profit of $2.6 billion and earnings per share of 46 cents from sales of $43.9 billion.\n\nContinue reading", "link": "https://finance.yahoo.com/m/cb88ee8d-1567-3c25-bf0b-9c73caaba145/ford-earnings-miss-estimates..html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.823, "neg": 0.025, "neu": 0.818, "pos": 0.157}}, {"date": "2023-10-26T20:25:00+00:00", "title": "These Stocks Moved the Most Today: Meta, UPS, Comcast, IBM, ServiceNow, Align, Hasbro, Whirlpool, Sunnova, and More", "content": "Shares of Meta Platforms fall following a warning about weaker advertising demand, UPS misses revenue estimates, and Comcast's broadband internet division loses customers. Amazon reports earnings after the closing bell Thursday.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9ae3a84d-3376-30bc-95de-f6107fa66bf7/these-stocks-moved-the-most.html", "symbols": ["AFW.F", "ALGN.US", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "F.MX", "F.US", "FB2A.F", "FB2A.XETRA", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "IBM.F", "IBM.LSE", "IBM.MX", "IBM.US", "IBM.XETRA", "MAT.US"], "tags": [], "sentiment": {"polarity": -0.727, "neg": 0.276, "neu": 0.627, "pos": 0.098}}, {"date": "2023-10-26T20:14:09+00:00", "title": "Ford withdraws 2023 forecast, warns on EV results", "content": "By Paul Lienert and Nathan Gomes\n\nDETROIT (Reuters) -Ford Motor Co on Thursday withdrew its full-year results forecast due to the pending ratification of its deal with the United Auto Workers (UAW) union, and warned of higher losses on electric vehicles, sending shares of the company down nearly 5% after-hours.\n\nThe union and Ford on Wednesday reached a tentative agreement that included a 25% wage hike for 57,000 workers over 4-1/2 years, ending a strike at some of the automaker's biggest factories.\n\nFord Chief Financial Officer John Lawler in a media briefing on Thursday said the company will delay some of its planned multibillion-dollar investment in new EV production capacity, citing \"tremendous downward pressure\" on prices.\n\nLike many of its competitors, Ford is \"trying to find the balance between price, margin and EV demand,\" Lawler said.\n\nRival General Motors earlier this week also withdrew its 2023 results forecast and said it would delay by a year the opening of an electric truck plant in Michigan.\n\nFord's adjusted third-quarter earnings per share of 39 cents missed the Wall Street average target of 45 cents, according to LSEG data.\n\nFord said its EV unit posted a higher-than-expected loss in earnings before interest and taxes of $1.3 billion. The company has forecast a full-year loss of $4.5 billion for the Ford Model e unit.\n\nThe automaker said its EV business was experiencing \"sharply compressed\" prices and profitability, and said customers were not willing to pay a premium for EVs over comparable combustion and hybrid models.\n\nFord's third-quarter revenue rose 11% to $44 billion, with profit of $1.2 billion compared with a year-earlier loss of $827 million.\n\nThe automaker said its Ford Pro commercial vehicle business and Ford Blue combustion and hybrid vehicle business both posted higher year-on-year revenue, EBIT and EBIT margins.\n\nThe total economic loss from the strikes at the Detroit Three automakers has reached $9.3 billion, consultancy Anderson Economic Group said earlier this week.\n\n(Reporting by Paul Lienert in Detroit and Nathan Gomes and Abhijith Ganapavaram in Bengaluru Editing by Devika Syamnath, Peter Henderson and Matthew Lewis)", "link": "https://ca.finance.yahoo.com/news/ford-withdraws-2023-forecast-201409526.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.353, "neg": 0.075, "neu": 0.857, "pos": 0.068}}, {"date": "2023-10-26T20:05:00+00:00", "title": "Ford+ Again Attracts New Customers, Drives Growth in Q3; Company Changing How It Works to Improve Quality, Costs", "content": "DEARBORN, Mich., October 26, 2023--(BUSINESS WIRE)--Ford Motor Company (NYSE:F) today reported its 2023 third quarter financial results. Click here or visit media.ford.com to view the news release. Visit shareholder.ford.com for the slide presentation and access the webcast to the Ford earnings call, which begins at 5:00 p.m. ET. The call will feature Jim Farley, president and CEO; John Lawler, chief financial officer; and other members of the Ford senior management team.\n\nThis press release features multimedia. View the full release here: https://www.businesswire.com/news/home/20231026735673/en/\n\nAbout Ford Motor Company\n\nFord Motor Company (NYSE: F) is a global company based in Dearborn, Michigan, committed to helping build a better world, where every person is free to move and pursue their dreams. The company’s Ford+ plan for growth and value creation combines existing strengths, new capabilities and always-on relationships with customers to enrich experiences for customers and deepen their loyalty. Ford develops and delivers innovative, must-have Ford trucks, sport utility vehicles, commercial vans and cars and Lincoln luxury vehicles, along with connected services. The company does that through three customer-centered business segments: Ford Blue, engineering iconic gas-powered and hybrid vehicles; Ford Model e, inventing breakthrough EVs along with embedded software that defines exceptional digital experiences for all customers; and Ford Pro, helping commercial customers transform and expand their businesses with vehicles and services tailored to their needs. Additionally, Ford is pursuing mobility solutions through Ford Next, and provides financial services through Ford Motor Credit Company. Ford employs about 177,000 people worldwide. More information about the company and its products and services is available at corporate.ford.com.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20231026735673/en/\n\nStory continues\n\nContacts\n\nMedia \r\nT.R. Reid\r\n1.313.319.6683\r\ntreid22@ford.com\n\nEquity Investment Community \r\nLynn Antipas Tyson\r\n1.914.485.1150\r\nltyson4@ford.com\n\nFixed-Income Investment Community \r\nChristopher Conti\r\n1.313.418.1673\r\ncconti5@ford.com\n\nShareholder Inquiries \r\n1.800.555.5259 or\r\n1.313.845.8540\r\nstockinf@ford.com", "link": "https://finance.yahoo.com/news/ford-again-attracts-customers-drives-200500207.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0, "neu": 0.879, "pos": 0.121}}, {"date": "2023-10-26T20:03:43+00:00", "title": "NEWSMAKER-UAW's Shawn Fain snatches victory from Ford with unorthodox playbook", "content": "(Recasts throughout)\n\nBy Joseph White and Abhijith Ganapavaram\n\nOct 26 (Reuters) - Bible-quoting, tough-talking Shawn Fain on Wednesday scored his first big victory against the Detroit Three through a tentative labor deal with Ford. But the jury is out on whether his aggressive bargaining tactics have soured worker relations with the automakers for a long time.\n\nSix weeks into escalating strikes and heated rhetoric, the United Auto Workers (UAW) president extracted a record 25% wage hike for some 57,000 Ford Motor workers in a tentative deal.\n\nFain, representing nearly 150,000 auto workers in one of the biggest labor strikes in decades, upended tradition by taking simultaneous action against all three automakers - a bolder, riskier path than his predecessors.\n\nThe strike started as the clock hit midnight on Sept. 15, and followed Fain's decision to open negotiations with Ford, General Motors and Stellantis at once, eschewing public niceties involving choreographed handshakes that famously kicked off previous negotiating efforts.\n\nIn the past weeks, he ran what amounted to a public auction among the companies, while prior UAW presidents picked just one automaker to set a pattern for the other two.\n\nWearing T-shirts with slogans like \"EAT THE RICH\", Fain, 54, announced walkouts at the companies' most profitable factories making SUVs and trucks, pitting them against each other to come up with offers quickly.\n\n\"Fain used a series of new tactics for these strikes and negotiations, and the tentative deal at Ford demonstrates how effective those tactics were,\" said Lynne Vincent, assistant professor in Syracuse University's Whitman School of Management.\n\n\"He took the risk of changing the playbook, and it paid off at Ford and may continue to pay off at the other automakers.\"\n\nFain was especially tough on Ford, which in the past cultivated a collaborative relationship with the UAW. He said last week: \"The days of the UAW and Ford being a team to fight other companies are over. We will always and forever be on the side of working people everywhere.\"\n\nStory continues\n\nFain won office by a narrow margin in a first-ever direct election earlier this year and has sought alliances with high-profile progressive politicians such as U.S. Senator Bernie Sanders to reframe the UAW's contract bargaining as a battle to reset the balance of power between workers and global corporations.\n\nIn lengthy social media talks to UAW members, Fain alternates quoting Bible verses with the use of charts and graphs to dissect wage and benefit offers from the automakers - details his predecessors kept behind closed doors during bargaining crunch time.\n\nThe strategy is not without risk.\n\n\"He won the battle, but whether he wins the war or not, which is to have more union workers getting paid more, is unclear,\" said Jeffrey Scharf, Chairman of Act Two Investors and a former holder of GM stock.\n\n\"That's what I would be more worried about if I was a young auto worker. I would worry about whether this is going to cost me my job in the long-term.\"\n\nCOMPETITIVENESS AND POLITICS\n\nThe automakers, along with some analysts and investors, have said the higher costs from any potential deal will hobble their ability to close the gap with electric-vehicle (EV) market leader Tesla and harm workers in the long run.\n\nFain, however, has rebutted automakers' concerns about labor costs by pointing out that they have poured billions into share buybacks to benefit investors.\n\n\"If they've got money for Wall Street they sure as hell have money for the workers making the product,\" he said.\n\nDuring negotiations, Fain clashed with Ford CEO Jim Farley and GM chief Mary Barra, citing their million-dollar paychecks as one of the reasons they should be rewarding workers.\n\nThe strike has also became a political issue in the 2024 U.S. presidential campaign.\n\nPresident Joe Biden, facing re-election next year, joined Fain on a picket line outside Detroit on Sept. 26. His chief rival, former President Donald Trump, visited Michigan the next day to woo auto workers' votes with an anti-EV message.\n\n\"This tentative agreement provides a record raise to auto workers who have sacrificed so much to ensure our iconic Big Three companies can still lead the world in quality and innovation,\" Biden said in a statement late on Wednesday.\n\nThe UAW has not endorsed Biden's re-election. His administration is pouring billions in federal subsidies into expanding sales of EVs, and a shift to electric threatens UAW jobs at powertrain plants.\n\nThe union has criticized the Biden administration for subsidizing battery plants owned by joint ventures of the unionized automakers as they are not bound by contracts and pay lower wages.\n\nAbsent from the yet-to-be-ratified contract terms announced on Wednesday was any mention of future pay and unionization at new EV battery factories that Ford is building with an Asian partner.\n\n\"I think it's a success with an asterisk. In other words, successful, but with a lot of pain, heartache and damage done to get to this point,\" Wedbush analyst Dan Ives said.\n\n(Reporting by Joe White and Ben Klayman in Detroit; additional reporting by Eric Cox in Detroit, Bianca Flowers in Chicago, David Shepardson in Washington, Abhirup Roy in San Francisco, Abhijith Ganapavaram in Bengaluru; Editing by Sayantani Ghosh and Devika Syamnath)", "link": "https://finance.yahoo.com/news/newsmaker-uaws-shawn-fain-snatches-200343094.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.15, "neg": 0.077, "neu": 0.858, "pos": 0.065}}, {"date": "2023-10-26T19:24:14+00:00", "title": "Ford, Worksport, Hyundai, Stellantis And Tesla Bring Some Much-Needed Good News From The Automotive Universe", "content": "On Thursday before the bell, Ford Motor (NYSE: F) shares rose 3% before the bell as it reached a tentative deal with the UAW. Shares of General Motors (NYSE: GM) also followed with a 1% rise as analysts expected the automaker to follow Ford’s footsteps and end an unprecedented strike that the consultancy Anderson Economic Group estimated to have had an economic cost of $9.3 billon. Also today, Stellantis (NYSE: STLA) revealed that it will be buying a 21% stake in Leapmotor, a Chinese EV maker, for $1.6 billion in attempt to revive its appeal in China.\n\nAs Ford saved its most lucrative segment from further losses, another pickup player from the automotive parts zone, Worksport Ltd (NASDAQ: WKSP) announced today its hard-folding tonneau covers received interest from a leading Canada-based automotive aftermarket reseller.\n\nFord Ends The Strike\n\nFord and the UAW agreed upon a 25% wage hike over the 4-1/2-year contract, beginning with an initial increase of 11%. General Motors as well as Stellantis previously offered a 23% increase in wages. The ratification of 57,000 UAW workers employed at Ford will take up to 2 weeks, kicking off on October 29th, upon approval of the deal by the UAW's leadership. Ford’s deal will undoubtedly serve as a template for GM and Stellantis. According to Reuters, the UAW stated that when compounding and cost-of-living mechanisms are factored in, GM and Stellantis are in for total pay hikes of more than 33%. The agreement that Ford made reverses concsessions the union agreed to when GM, Chrysler and Ford were desperately trying to stay afloat. By ending the strike, Ford avoided the UAW going against its facility in Dearborn but only time will show if these concessions put it at a disadvantage against non-unionized EV makers such as Tesla Inc (NASDAQ: TSLA).\n\nHyundai Says Its EV Plans Remain On Track\n\nWhile the world eagerly awaits for Tesla to bring its Cybertruck to life, this year will end with plenty of developments on the electric pickup front. For example, Hyundai Motor Company (OTC: HYMTF) was among the first to express its interest in Worksport’s game changing solutions. Hyundai will be getting a customized version of Worksport’s proprietary solar-powered pickup for its Santa Cruz pickup. Moreover, Hyundai Motor is a rare automaker who is not toning down its EV ambitions. Today, Hyundai confirmed it will not be delaying its EV plans and showed optimism for continued growth this year, which is a sharp contrast to its rivals. Considering that Hyundai Motor is not a member of the UAW and that it has been making significant effort in reducing logistics costs, its assembly plant in Alabama and EV-factory in the making in Georgia are protected from the effects of the strike.\n\nStory continues\n\nWorksport Continues Its Growth Trajectory\n\nAfter securing $16 million USD annual sales agreement for its hard-folding and soft-folding covers with a leading U.S. aftermarket reseller earlier this year, Worksport announced today a Canada-based automotive market reseller has expressed interest in its hard-folding covers that were already sent as samples. Worksport is unable to disclose the name of private-label customers but revealed that the annual sales volume of this potential client surpass $10 billion CAD.\n\nWorksport has further fortified its position in the aftermarket and cleantech space as it continues to get closer to the debut of its solar-powered SOLIS Solar Cover and portable COR Battery System. This game-changing power on the go duo promise to bring additional driving range for electric pickup trucks of partnering OEM brands and providing off-grid power in remote locations.\n\nTesla Also Delivered Good News\n\nTesla also reported today it received an order from BP EV unit that ordered $100 million worth Tesla chargers. As it gained a new revenue stream, Tesla announced that this is first deployment of its chargers on an independent network. After Tesla took a beating after a dissapointing quarterly report and the UAW embarked on an unprecedented strike against all three Detroit automakers, these developments are all good news that the automotive world needs right now.\n\nDISCLAIMER: This content is for informational purposes only. It is not intended as investing advice.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article Ford, Worksport, Hyundai, Stellantis And Tesla Bring Some Much-Needed Good News From The Automotive Universe originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/ford-worksport-hyundai-stellantis-tesla-192414936.html", "symbols": ["005380.KO", "005385.KO", "005387.KO", "005389.KO", "8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "HYMTF.US", "HYU.F", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.028, "neu": 0.851, "pos": 0.121}}, {"date": "2023-10-26T19:04:59+00:00", "title": "General Motors and Stellantis in talks with United Auto Workers to reach deals that mirror Ford's", "content": "DETROIT (AP) — General Motors and Jeep maker Stellantis are meeting with United Auto Workers bargainers Thursday to see if they can reach a contract agreement that mirrors a deal signed with crosstown rival Ford.\n\nNearly 17,000 striking workers at Ford left the picket lines when the agreement was announced Wednesday night and will return to work shortly. About 57,000 Ford workers still have to vote on the tentative pact.\n\nGM and Stellantis will have to follow the pattern set by Ford or it's likely that UAW President Shawn Fain will add factories to its partial strikes that began on Sept. 15, said Art Wheaton, director of labor studies at Cornell University.\n\n“Fain does not strike me as someone who is going to be willing to concede anything to the other two automakers to break the pattern,” Wheaton said.\n\nAdditional strikes would be painful to the companies, especially at GM, which has profitable pickup truck plants in Fort Wayne, Indiana, and Flint, Michigan, that the union could shut down, Wheaton said.\n\nGM and Stellantis are losing money due to the strikes and they may be eager to bring them to a close, even though it's not certain whether Ford workers will ratify the contract, Wheaton said. GM said Tuesday that it's losing about $200 million per week due to the strike, which this week hit the highly profitable factory in Arlington, Texas, that makes large truck-based SUVs such as the Chevrolet Tahoe.\n\nThe Ford deal, if approved by local union leaders and ratified by members, would give top-scale assembly plant workers a 25% raise over the life of the contract. Including cost of living raises, workers would get over 30% in pay increases to over $40 per hour by the time the contract expires on April 30 of 2028. They also won pay raises and a quicker path to full-time for temporary workers, the end of some wage tiers, pension increases, and increased 401(k) contributions for those without them. Members could begin voting next week on the pact.\n\nStory continues\n\nGM is likely to be the next company to settle because it has agreed to pull new electric vehicle battery factories into the UAW's national contract, which essentially unionizes them. The UAW sees the plants as the jobs of the future in the auto industry as the nation and world transition from internal combustion engines to battery power. Workers making gasoline engines and transmissions will need a place to work when their plants are phased out.\n\nIt wasn't clear what Ford agreed to in terms of battery factories. The company has said it would be hard to unionize employees who haven’t been hired yet at plants that haven't been built. Ford had announced plans to build two battery factories in Kentucky, one in Tennessee and another in Michigan, but the Michigan plant is now on hold.\n\nAll three companies have said they don’t want to absorb labor costs that are so high that they would force price increases and make their vehicles more expensive than those made by nonunion companies such as Tesla and Toyota.\n\nA study this month by Moody’s Investor Service found that annual labor costs could rise by $1.1 billion for Stellantis, $1.2 billion for GM and $1.4 billion for Ford in the final year of the contract. The study assumed a 20% increase in hourly labor costs.\n\nWheaton said the companies are making billions and now can afford the higher labor costs, which he estimated are 6% to 8% of the cost of a vehicle.", "link": "https://finance.yahoo.com/news/general-motors-stellantis-talks-united-190459940.html", "symbols": ["8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.861, "neg": 0.03, "neu": 0.922, "pos": 0.048}}, {"date": "2023-10-26T18:38:03+00:00", "title": "Dow futures tick higher, Intel up 8%, Amazon lifts 4.4% after earnings", "content": "Investing.com - US stock futures were trading slightly higher during Thursday's evening deals, as investors parsed fresh earnings results from tech heavyweights Amazon.com Inc (NASDAQ:AMZN) and Intel Corporation (NASDAQ:INTC).\n\nBy 6:30pm ET (10:30pm GMT) Dow Jones Futures added 0.2%, S&P 500 Futures gained 0.4% and Nasdaq 100 Futures were up 0.8%.\n\nIn extended deals, Amazon (NASDAQ:AMZN) gained 4.4% after reporting Q3 EPS of $0.94 versus $0.58 expected while revenues came in at $143.1 billion versus $141.53 billion expected. The company also forecasted Q4 2023 revenue in the range of $160-167 billion versus $157.2 billion expected.\n\nIntel (NASDAQ:INTC) lifted 8%, reporting Q3 EPS of $0.41 versus $0.22 expected, while revenues were at $14.2 billion versus $13.53 billion.\n\nFord Motor (NYSE:F) fell 4.1% after the company reported Q3 EPS of $0.39 versus $0.47 expected, while revenue came in at $44 billion versus $44.05 billion.\n\nCapital One Financial (NYSE:COF) added 5%, after reporting Q3 EPS of $4.45 versus $3.24 expected, while revenue came in at $9.37 billion versus $9.21 billion.\n\nAhead in Friday's trade, market participants will be closely monitoring PCE price index data, personal income and spending, Michigan consumer sentiment and expectations as well as a speech from Fed Vice Chair Barr.\n\nAmong earnings, companies including Chevron Corp (NYSE:CVX) and Exxon Mobil Corp (NYSE:XOM) are expected to report quarterly results.\n\nDuring Thursday’s regular trading, the Dow Jones Industrial Average lost 251.6 points or 0.8% to 32,784.3, the S&P 500 dipped 49.6 points or 1.2% to 4,137.2 and the NASDAQ Composite lost 225.6 points or 1.8% to 12,595.6.\n\nOn the bond markets, United States 10-Year rates were at 4.851%.\n\nRelated Articles\n\nDow futures tick higher, Intel up 8%, Amazon lifts 4.4% after earnings\n\nWestern Digital, Japan's Kioxia call off merger talks -source\n\nWall Street strategist and '10 Surprises' author Byron Wien dies at 90", "link": "https://finance.yahoo.com/news/dow-futures-tick-higher-intel-183803589.html", "symbols": ["AMZN.US", "COF.US", "CVX.US", "DJI.INDX", "F.US", "INL.F", "INL.XETRA", "INTC.MX", "INTC.US", "ITLC34.SA", "XOM.US"], "tags": [], "sentiment": {"polarity": 0.878, "neg": 0.015, "neu": 0.928, "pos": 0.057}}, {"date": "2023-10-26T18:09:28+00:00", "title": "3 Cheap EV Stocks to Buy Under $10", "content": "It’s been a mixed year for electric vehicle stocks. Macroeconomic headwinds have impacted growth, and several EV companies have found it challenging to grow as competition intensifies. Amid mixed sentiments, several cheap EV stocks are still worth considering.\n\nAn important point is that there are intermediate corrections even in industries with positive tailwinds. The EV industry is still in early growth due to its penetration into different markets. For 2023, EV sales are expected to be 18% of global car sales. Further, by 2030, EV sales will likely increase to 60% of total sales. In the next five to ten years, there will be massive value creators like Tesla (NASDAQ:TSLA).\n\nThese three EV stocks under $10 are attractive. Two of these stocks represent companies in early growth stages. If business developments remain positive, these stocks can deliver multibagger returns.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nPanasonic Holdings (PCRFY) A Panasonic (PCRFY) sign hanging in Beijing, China. generation z\n\nSource: testing/Shutterstock.com\n\nPanasonic Holdings (OTCMKTS:PCRFY) is the top name among EV stocks under $10 to buy and hold. PCRFY stock has trended higher by 17% year-to-date. However, valuations remain attractive, considering a forward price-earnings ratio of 8. Further, the stock provides a dividend yield of 1.1%.\n\nIt’s worth noting that Panasonic is pursuing aggressive business expansion. This is a key reason to be bullish. To put things into perspective, the company is targeting EV battery capacity of 200GWh by 2031. This would imply a quadrupling of capacity compared to past financial years. Capacity expansion will translate into robust revenue and cash flow growth.\n\nBesides aggressive expansion, Panasonic is also investing in innovation. The company claims to have developed a way to slow battery degradation. Additionally, Panasonic is targeting a 20% jump in battery density by 2030. This would imply smaller and lighter EV batteries.\n\nPolestar Automotive (PSNY) A Polestar (PSNY) sign at the area at Polestar powerstop in Mjölby.\n\nSource: Jeppe Gustafsson / Shutterstock.com\n\nStory continues\n\nPolestar Automotive (NASDAQ:PSNY) is among the most undervalued EV stocks under $10. After a correction of 54% in the last 12 months, PSNY stock seems poised for a comeback in 2024.\n\nThe first reason to be bullish on Polestar is the potential acceleration in car deliveries next year. In December, the company will commence commercial sales of Polestar 4 in China. Further, Polestar 5 is due for commercial launch next year. These two models will ensure robust delivery growth in the next 12 to 24 months.\n\nThe second reason to be positive on PSNY stock is cost cutting. Cash burn has been challenging and Polestar has initiated cost-cutting measures to reduce losses in EBITDA. This, coupled with operating leverage, is likely to translate into a healthier EBITDA margin next year. With a cash buffer of $1 billion, the company is well positioned to navigate cash burn in the next few quarters.\n\nSolid Power (SLDP) Smartphone with logo of American battery company Solid Power Inc. on screen in front of business website. Focus on center-left of phone display.\n\nSource: T. Schneider / Shutterstock.com\n\nSolid Power (NASDAQ:SLDP) is another name among cheap EV stocks to buy and hold. After a 75% correction in the last 12 months, SLDP stock trades at $1.4. Assuming a scenario where the company commercializes solid-state batteries, the stock is poised for 20x to 30x returns from current levels.\n\nOne reason to like Solid Power is that the stock is not speculative. Automotive giants that include Ford (NYSE:F) and BMW (OTCMKTS:BMWYY) back the company. BMW is conducting parallel research and development after Solid Power licensed its technology to the former.\n\nIn terms of business development, Solid Power expects to deliver A-sample EV cells to automotive partners in 2023. This is an important development, as positive news from validation testing can be a key stock upside catalyst.\n\nSolid Power is also well positioned from a financial perspective. As of Q2 2023, the company reported cash and equivalents of $443 million. There is ample financial flexibility to invest in R&D in the next 24 months.\n\nOn the date of publication, Faisal Humayun did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nFaisal Humayun is a senior research analyst with 12 years of industry experience in the field of credit research, equity research and financial modeling. Faisal has authored over 1,500 stock specific articles with focus on the technology, energy and commodities sector.\n\nMore From InvestorPlace\n\nChatGPT IPO Could Shock the World, Make This Move Before the Announcement Musk’s “Project Omega” May Be Set to Mint New Millionaires. Here’s How to Get In. The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 3 Cheap EV Stocks to Buy Under $10 appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-cheap-ev-stocks-buy-180928336.html", "symbols": ["BAMXF.US", "BMW.F", "BMW.XETRA", "BMW3.F", "BMW3.XETRA", "BMWB.F", "BMWYY.US", "BYMOF.US", "F.US", "MAT1.F", "MATA.F", "PCRFF.US", "PCRFY.US", "PSNY.US", "SLDP.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.017, "neu": 0.868, "pos": 0.115}}, {"date": "2023-10-26T17:09:18+00:00", "title": "What's next for Ford, UAW after reaching labor deal?", "content": "The United Auto Workers (UAW) union has reached a tentative deal with Ford — a four-year contract that includes most of the union’s demands, including wage hikes. Now the next question for the automaker is looking to be: How soon will Ford resume production?\n\nAutoblog Editor-in-Chief Greg Migliore says the automaker is already on it. “They [Big Three automakers] know what they’re doing\", Migliore tells Yahoo Finance, noting Ford's production was ongoing during the strike. Migilore expects “clear, structured labor costs” over the next four years to meet the demands of the union.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nVideo Transcript\n\n- In terms of if the vote goes forward and it's successful and the deal is finalized, what are the next steps in terms of the impact on the industry? How long does it take after a strike this long and so targeted to get a lot of these production lines back up and running?\n\nGREG MIGLIORE: So from what I've heard, some of the Ford factories are already-- people are going back to them like today. So Ford, General Motors, Stellantis have been making cars and trucks and SUVs for close to 100 years, more than that in Ford's case. They know what they're doing. And it's actually somewhat of a reasonable task to just restart production. So that's going to, I think, happen in pretty short order. I think going forward, both sides will have clear-structured labor costs for the next 4 and 1/2 years.\n\nI think they'll have some clarity. We don't know all of the details of the agreement, but we'll get some more clarity on what battery plants might be included into it. And frankly, this is about to be over with, I think. It's one of those things where you look back at the 2019 General Motors strike, which was almost all-- which was all General Motors factories, this what it seems like accomplished a bit more for the union.\n\n- Certainly for that, at least laying out the blueprint for the other two to follow. Appreciate that update, Autoblog editor-in-chief, Greg Migliore, thank you so much.", "link": "https://finance.yahoo.com/video/whats-next-ford-uaw-reaching-170918435.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.983, "neg": 0.011, "neu": 0.897, "pos": 0.092}}, {"date": "2023-10-26T16:34:00+00:00", "title": "Ford’s Deal With UAW Points to $80,000-Plus in Annual Pay", "content": "Union Vice President Chuck Browning said the pact is the most lucrative since the time of Walter Reuther, who led the UAW from 1946 to 1970.\n\nContinue reading", "link": "https://finance.yahoo.com/m/487e8ee8-a230-3fc0-80d6-4db897ac0f70/ford%E2%80%99s-deal-with-uaw-points.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-26T16:32:50+00:00", "title": "Ford earnings preview: Profit forecast and EV unit outlook in focus after UAW deal reached", "content": "Ford (F) is set to report third quarter earnings after the bell, with investors keen to hear about the tentative deal reached with the United Auto Workers (UAW) on a labor contract. The results also come as cross-town rival GM reported strong earnings, but pulled its guidance due to the labor stoppages.\n\nFor the quarter, Ford is expected to report top-line revenue of $41.21 billion, which would be a nearly 11% improvement from a year ago, but a dip from the $45.0 billion reported in Q2. Ford is also expected to post adjusted EPS of $0.47, and adjusted net income of $1.874 billion.\n\nLast quarter, Ford raised its full-year 2023 guidance for adjusted EBIT to between $11 billion and $12 billion, and also lifted its adjusted free cash flow forecast to between $6.5 billion and $7 billion. Whether it keeps this forecast or adjusts in light of a labor deal being reached will be key to the results.\n\nGM (GM) said this week labor uncertainty necessitated its forecast be withdrawn, due to uncertainty brought on by the UAW and president Shawn Fain’s stand-up strike strategy.\n\nJPMorgan analyst Ryan Brinkman estimates the costs of the labor strike in Q3 to be approximately $145 million for Ford. GM reported the strikes cost the company $200 million in Q3, and $800 million in pre-tax earnings since the strikes began on Nov. 15.\n\nThe UAW said its tentative agreement with Ford includes a 25% base wage increase through April 2028 and will cumulatively raise the top wage by over 30% to more than $40 an hour and raise the starting wage by 68%, to over $28 an hour. The lowest-paid workers at Ford will see a raise of more than 150% over the life of the agreement, with some workers receiving an 85% increase immediately upon ratification.\n\nThe UAW also revealed COLA (cost-of-living allowance) provisions were reinstated, along with a new three-year wage progression scale (previously it was eight years), as well as the end of wage tiers. The union said it secured gains for workers with pensions and 401(k) plans but did not reveal specifics.\n\nStory continues\n\nLabor deal aside, Q3 will also mark the third time Ford reports performance across its three main business lines — Ford Blue for gas-powered cars, Ford Model e for its EV business, and Ford Pro for its commercial and Super Duty trucks business. Bloomberg estimates the following for those units:\n\nFord Blue\n\nRevenue: $23.93 billion EBIT: $1.94 billion Ford Model e\n\nRevenue: $2.34 billion EBIT loss: $1.27 billion Ford Pro\n\nRevenue: $14.65 billion EBIT: $2.16 billion\n\nNote for its Model e EV business, Ford projected a $4.5 billion loss for the unit in 2023. Ford may update this figure given additional price cuts it has initiated for both the F-150 Lighting EV pickup and Mustang Mach-E electric SUV.\n\nEarlier this month Ford reported US Q3 sales of 500,504 units, up 7.7% from a year ago, powered by F-Series truck sales, which rose 13.4% compared to Q3 last year. Ford noted that hybrid sales jumped 41.4%, and EV sales also climbed 14.8%.\n\nPras Subramanian is a reporter for Yahoo Finance. You can follow him on Twitter and on Instagram.\n\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/ford-earnings-163250658.html", "symbols": ["8GM.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA"], "tags": [], "sentiment": {"polarity": 0.974, "neg": 0.042, "neu": 0.876, "pos": 0.082}}, {"date": "2023-10-26T16:29:00+00:00", "title": "The UAW-Ford Deal: What’s in the Contract, Who Won and What It Means for GM and Stellantis", "content": "The agreement gives workers a 25% raise over the course of the contract and puts pressure on its Detroit rivals.\n\nContinue reading", "link": "https://finance.yahoo.com/m/d4c03564-31c2-3fb4-ab0a-dacb13197ab5/the-uaw-ford-deal%3A-what%E2%80%99s-in.html", "symbols": ["8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.25, "neg": 0.09, "neu": 0.779, "pos": 0.131}}, {"date": "2023-10-26T16:02:33+00:00", "title": "Ford's tentative UAW agreement could give $70.5M boost to KC’s economy from base pay alone", "content": "Ford Motor Co. reached a tentative labor agreement with the UAW on Wednesday night that includes a 25% bump in base wages over the next four years and the right to strike over plant closures.\n\nContinue reading", "link": "https://finance.yahoo.com/m/8564d0d1-b6aa-34f2-b515-580e30b68154/ford%27s-tentative-uaw.html", "symbols": ["8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.477, "neg": 0.039, "neu": 0.84, "pos": 0.121}}, {"date": "2023-10-26T15:51:02+00:00", "title": "UAW reaches tentative deal with Ford — a Chicago worker responds", "content": "Ford President and CEO Jim Farley said he expects striking employees including those in Chicago to return to work soon.\n\nContinue reading", "link": "https://finance.yahoo.com/m/66ca351c-b2c6-3cf8-89e2-18009cbdeed5/uaw-reaches-tentative-deal.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-26T15:32:04+00:00", "title": "UPDATE 1-Ford workers to return to work as UAW turns to GM, Stellantis", "content": "(Updates share prices in second to last paragraph)\n\nBy David Shepardson and Joseph White\n\nOct 26 (Reuters) -\n\nFord autoworkers were set to head back to work after the United Auto Workers (UAW) union reached a tentative labor deal with the company late Wednesday.\n\nFord was the first of Detroit's Big Three car manufacturers to negotiate a settlement to strikes joined by 45,000 workers since mid-September. The UAW will now turn its attention to talks with General Motors and Chrysler parent Stellantis.\n\nThe agreement, which still must be ratified by union members, includes a 25% wage hike over the life of the 4-1/2-year contract and the elimination of lower-pay tiers for workers in certain parts operations at Ford.\n\nThe Ford contract stands as a significant victory for labor, one of many reached this year as workers have walked out or threatened strikes in various industries such as rail, entertainment, shipping and casinos.\n\n\"We still have to see some of the details but it is a major achievement for the union,\" said Harley Shaiken, labor professor at University of California Berkeley.\n\nThe agreement reverses concessions the union agreed to in a series of contracts since 2007, when GM and the former Chrysler were skidding toward bankruptcy, and Ford was mortgaging assets to stay afloat.\n\nThe companies are collectively in a better position now, though they have all stated that excessive pay increases would hamstring their ability to compete in coming years against lower-cost manufacturers, including Tesla, the leading seller of electric vehicles.\n\nThe deal, which could help create a template for settlements with GM and Stellantis, amounts to total pay hikes of more than 33% when compounding and cost-of-living mechanisms are factored in, the UAW said.\n\n\"We know it breaks records,\" UAW President Shawn Fain said in a video address Wednesday night. \"We know it will change lives. But what happens next is up to you all.\"\n\nStory continues\n\nThe UAW told Ford workers now on strike to return to their jobs during the ratification process. That means production of Ford Super Duty pickups, Ford Bronco and Explorer SUVs and Ranger trucks could restart this week.\n\n\"We are pleased to have reached a tentative agreement on a new labor contract with the UAW covering our U.S. operations,\" Ford CEO and President Jim Farley said in a statement.\n\nFord shares were down 0.5% in trading on Thursday.\n\nGM and Stellantis in statements on Wednesday said they were working to secure agreements as soon as possible. (Reporting By David Shepardson in Washington and Joseph White in Detroit; Additional reporting from Abhirup Roy; Writing by David Gaffen; Editing by Mark Porter)", "link": "https://finance.yahoo.com/news/1-ford-workers-return-uaw-153204983.html", "symbols": ["8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.022, "neu": 0.849, "pos": 0.129}}, {"date": "2023-10-26T15:11:00+00:00", "title": "Tesla Started a Price War, Every EV Stock Is Paying the Price", "content": "Ford Motor General Motors and Mercedes-Benz are all lamenting how tough the electric vehicle market has become., and Volkswagen is complaining about profitability, too. Tesla, remember, elected to start a price war to maintain its EV sales. The German auto maker reported third-quarter numbers that included some disappointing guidance.\n\nContinue reading", "link": "https://finance.yahoo.com/m/4579fafc-7e9d-34ff-a359-86c7578998c2/tesla-started-a-price-war%2C.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA", "VLKAF.US", "VLKPF.US", "VOW.F", "VOW.XETRA", "VOW3.F", "VOW3.XETRA", "VWAGY.US", "VWAPY.US"], "tags": [], "sentiment": {"polarity": -0.883, "neg": 0.225, "neu": 0.739, "pos": 0.035}}, {"date": "2023-10-26T14:46:04+00:00", "title": "Only Four Days Left To Cash In On Ford Motor's (NYSE:F) Dividend", "content": "Readers hoping to buy Ford Motor Company (NYSE:F) for its dividend will need to make their move shortly, as the stock is about to trade ex-dividend. Typically, the ex-dividend date is one business day before the record date which is the date on which a company determines the shareholders eligible to receive a dividend. The ex-dividend date is of consequence because whenever a stock is bought or sold, the trade takes at least two business day to settle. Therefore, if you purchase Ford Motor's shares on or after the 31st of October, you won't be eligible to receive the dividend, when it is paid on the 1st of December.\n\nThe company's next dividend payment will be US$0.15 per share. Last year, in total, the company distributed US$0.60 to shareholders. Looking at the last 12 months of distributions, Ford Motor has a trailing yield of approximately 5.2% on its current stock price of $11.54. Dividends are an important source of income to many shareholders, but the health of the business is crucial to maintaining those dividends. So we need to investigate whether Ford Motor can afford its dividend, and if the dividend could grow.\n\nCheck out our latest analysis for Ford Motor\n\nDividends are usually paid out of company profits, so if a company pays out more than it earned then its dividend is usually at greater risk of being cut. Ford Motor paid out more than half (58%) of its earnings last year, which is a regular payout ratio for most companies. A useful secondary check can be to evaluate whether Ford Motor generated enough free cash flow to afford its dividend. It paid out 94% of its free cash flow in the form of dividends last year, which is outside the comfort zone for most businesses. Cash flows are usually much more volatile than earnings, so this could be a temporary effect - but we'd generally want to look more closely here.\n\nFord Motor paid out less in dividends than it reported in profits, but unfortunately it didn't generate enough cash to cover the dividend. Were this to happen repeatedly, this would be a risk to Ford Motor's ability to maintain its dividend.\n\nStory continues\n\nClick here to see the company's payout ratio, plus analyst estimates of its future dividends. historic-dividend\n\nHave Earnings And Dividends Been Growing?\n\nWhen earnings decline, dividend companies become much harder to analyse and own safely. If earnings decline and the company is forced to cut its dividend, investors could watch the value of their investment go up in smoke. Ford Motor's earnings per share have fallen at approximately 12% a year over the previous five years. Such a sharp decline casts doubt on the future sustainability of the dividend.\n\nThe main way most investors will assess a company's dividend prospects is by checking the historical rate of dividend growth. Since the start of our data, 10 years ago, Ford Motor has lifted its dividend by approximately 4.1% a year on average. Growing the dividend payout ratio while earnings are declining can deliver nice returns for a while, but it's always worth checking for when the company can't increase the payout ratio any more - because then the music stops.\n\nThe Bottom Line\n\nShould investors buy Ford Motor for the upcoming dividend? It's definitely not great to see earnings per share shrinking. The company paid out an acceptable percentage of its income, but an uncomfortably high percentage of its cash flow over the past year. It's not an attractive combination from a dividend perspective, and we're inclined to pass on this one for the time being.\n\nWith that in mind though, if the poor dividend characteristics of Ford Motor don't faze you, it's worth being mindful of the risks involved with this business. We've identified 3 warning signs with Ford Motor (at least 1 which is potentially serious), and understanding them should be part of your investment process.\n\nGenerally, we wouldn't recommend just buying the first dividend stock you see. Here's a curated list of interesting stocks that are strong dividend payers.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.", "link": "https://finance.yahoo.com/news/only-four-days-left-cash-144604616.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.059, "neu": 0.838, "pos": 0.103}}, {"date": "2023-10-26T13:19:56+00:00", "title": "Ford-UAW tentative labor deal 'historic' agreement for union", "content": "Ford (F) has reached a tentative labor deal with striking United Auto Workers (UAW), agreeing to a 25% wage hike and cost-of-living adjustments among other stipulations. UAW President Shawn Fain characterized the deal as an “historic agreement” on day 40 of the union’s stand-up strike.\n\nYahoo Finance Autos Reporter Pras Subramanian details what this could mean for the automaker ahead of Ford's reporting third-quarter earnings on Thursday.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.\n\nVideo Transcript\n\nSEANA SMITH: The UAW and Ford have tentatively reached an agreement after nearly six weeks of strikes. Now, the union saying that the deal includes 25% wage increases over the course of four years, adjustments for cost of living, and the right to strike over plant closures. Negotiations still continue between the United Auto Workers Union and General Motors and Stellantis. UAW President Shawn Fain called the deal a, quote, \"historic agreement.\"\n\nSHAWN FAIN: Ford knew what was coming for them on Wednesday if we didn't get a deal. That was checkmate. On day 40 of the stand-up strike, we reached a historic agreement.\n\nSEANA SMITH: Yahoo Finance's Pras Subramanian joining us now with the latest. Pras, we just heard Shawn Fain saying checkmate, a historic agreement. What's in the-- what do we know more about just what's in this deal and then the next steps here over the coming days?\n\nPRAS SUBRAMANIAN: Hey, Seana. So, yeah, interesting with that quote you just played. What he was alluding to was before checkmate was that they were potentially going to strike the F-150 Lightning plant. That was supposedly the next step. And I guess that was enough to sort of prompt Ford to reach this deal.\n\nSo anyway, some of the big sort of parts of this deal are, you mentioned that, 25% base wage increase through 2028 through the end of the deal, 30% increases in the top wage, a 68% raise in starting pay, also shortening the wage progression to three years to get to that top wage, and also the reinstatement of COLA, or Cost Of Living Adjustments, among other things.\n\nStory continues\n\nFord said it was pleased to reach a deal and to focus on restarting their plants. And Shawn Fain also saying that we-- quote, \"We won things nobody thought possible. This agreement sets us on a new path to make things right at Ford, the Big 3, and across the auto industry.\"\n\nNow, the deal still needs to be voted on by the UAW Ford National Council. Then it goes to members for a vote, perhaps a week from now. And then some Wall Street reaction, initial reaction is good. Our good friend Dan Ives saying that was a balanced deal and that he expects to see other deals struck with Stellantis and GM in the next week or so.\n\nBRAD SMITH: Yeah, this is really interesting process, especially given the timing, UAW clearly recognizing, all right, Ford has its back up against the wall. It's about to report earnings. It could come out and have to issue some of the same statements that GM did, or it could strike a deal right before that. Do you feel like Ford felt like they were painted into a corner here and ultimately wanted to give investors some clarity about where they were willing to and ready to move forward?\n\nPRAS SUBRAMANIAN: You know, Brad, it's probably a little bit of both there, right? So they're pushed against the wall, potential strike at that F-150 plant, earnings today. But from a timing point of view-- I was thinking about this earlier-- this is such a good thing for Ford.\n\nRight ahead of earnings, they're able to say this deal is struck, talk about it tonight in the call, see-- say what the implications are, maybe keep their guidance, which GM had to pull. And that was sort of a black eye for them, among other things, this week. So it's almost like a big win for Ford over its crosstown rival GM, as it hit the deal.\n\nIt's probably going to keep its guidance, or at least tweak it slightly, and say that, hey, we're done. We're going to get this vote out and hopefully-- hopefully the members ratify it and workers go back to the plants. It can't be said yet for GM and Stellantis. But I think that they have at least have a model template to work with, and we'll probably see these other two deals happen very shortly.\n\nBRAD SMITH: All right, we're going to be watching that very closely, as we know you will as well, Pras. Tracking ticker symbol F here on the day here, premarket and as of right now, we're just taking a look at shares that are up by about 2.7%. We'll continue to keep a close eye on that moving forward here as we get closer to the start of today's trading activity.", "link": "https://finance.yahoo.com/video/ford-uaw-tentative-labor-deal-131956189.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.019, "neu": 0.876, "pos": 0.105}}, {"date": "2023-10-26T13:18:42+00:00", "title": "Ford shares rise a day after tentative deal with UAW", "content": "(Reuters) - Ford shares rose slightly on Thursday as the company's unionized workers were set to return to work following a tentative agreement between the automaker and the United Auto Workers (UAW) union guaranteeing a record wage hike.\n\nRival General Motors' shares also rose as analysts expected the automaker to follow Ford in reaching a deal that would end a strike at some of its most profitable plants.\n\nThe total economic loss from the autoworkers' strike has reached $9.3 billon, consultancy Anderson Economic Group said earlier this week.\n\nThe proposed deal between Ford and the UAW provides a 25% wage hike over the 4-1/2-year contract, starting with an initial increase of 11%.\n\nGM and Stellantis have previously offered a 23% wage increase.\n\nStellantis' U.S.-listed shares were down 1.5% in premarket trading on Thursday as the automaker announced a $1.6 billion deal to buy a 21% stake in electric-vehicle maker Leapmotor.\n\nFord and GM shares trade 6.2 times and 4.3 times forward profit estimates, respectively.\n\nThe focus will now be on ratification by Ford's 57,000 UAW workers.\n\n\"We estimate the ratification will take 1-2 weeks. The process starts on Oct. 29 when the UAW Council votes to send the tentative agreement to members,\" said Wells Fargo analyst Colin Langan, adding that the deal will be a template for GM and Stellantis.\n\n(Reporting by Abhijith Ganapavaram in Bengaluru; Editing by Shounak Dasgupta)", "link": "https://finance.yahoo.com/news/ford-shares-rise-day-tentative-131842321.html", "symbols": ["8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.98, "neg": 0.022, "neu": 0.829, "pos": 0.149}}, {"date": "2023-10-26T12:53:06+00:00", "title": "Ford workers to return to work as UAW turns to GM, Stellantis", "content": "By David Shepardson and Joseph White\n\n(Reuters) - Ford autoworkers were set to head back to work after the United Auto Workers (UAW) union reached a tentative labor deal with the company late Wednesday.\n\nFord was the first of Detroit's Big Three car manufacturers to negotiate a settlement to strikes joined by 45,000 workers since mid-September. The UAW will now turn its attention to talks with General Motors and Chrysler parent Stellantis.\n\nThe agreement, which still must be ratified by union members, includes a 25% wage hike over the life of the 4-1/2-year contract and the elimination of lower-pay tiers for workers in certain parts operations at Ford.\n\nThe Ford contract stands as a significant victory for labor, one of many reached this year as workers have walked out or threatened strikes in various industries such as rail, entertainment, shipping and casinos.\n\n\"We still have to see some of the details but it is a major achievement for the union,\" said Harley Shaiken, labor professor at University of California Berkeley.\n\nThe agreement reverses concessions the union agreed to in a series of contracts since 2007, when GM and the former Chrysler were skidding toward bankruptcy, and Ford was mortgaging assets to stay afloat.\n\nThe companies are collectively in a better position now, though they have all stated that excessive pay increases would hamstring their ability to compete in coming years against lower-cost manufacturers, including Tesla, the leading seller of electric vehicles.\n\nThe deal, which could help create a template for settlements with GM and Stellantis, amounts to total pay hikes of more than 33% when compounding and cost-of-living mechanisms are factored in, the UAW said.\n\n\"We know it breaks records,\" UAW President Shawn Fain said in a video address Wednesday night. \"We know it will change lives. But what happens next is up to you all.\"\n\nThe UAW told Ford workers now on strike to return to their jobs during the ratification process. That means production of Ford Super Duty pickups, Ford Bronco and Explorer SUVs and Ranger trucks could restart this week.\n\nStory continues\n\n\"We are pleased to have reached a tentative agreement on a new labor contract with the UAW covering our U.S. operations,\" Ford CEO and President Jim Farley said in a statement.\n\nFord shares were up 2.7% in premarket trading on Thursday.\n\nGM and Stellantis in statements on Wednesday said they were working to secure agreements as soon as possible.\n\n(Reporting By David Shepardson in Washington and Joseph White in Detroit; Additional reporting from Abhirup Roy; Writing by David Gaffen; Editing by Mark Porter)", "link": "https://ca.finance.yahoo.com/news/ford-workers-return-uaw-turns-125306126.html", "symbols": ["8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.023, "neu": 0.849, "pos": 0.128}}, {"date": "2023-10-26T12:53:06+00:00", "title": "Ford workers to return to work as UAW turns to GM, Stellantis", "content": "By David Shepardson and Joseph White\n\n(Reuters) - Ford autoworkers were set to head back to work after the United Auto Workers (UAW) union reached a tentative labor deal with the company late Wednesday.\n\nFord was the first of Detroit's Big Three car manufacturers to negotiate a settlement to strikes joined by 45,000 workers since mid-September. The UAW will now turn its attention to talks with General Motors and Chrysler parent Stellantis.\n\nThe agreement, which still must be ratified by union members, includes a 25% wage hike over the life of the 4-1/2-year contract and the elimination of lower-pay tiers for workers in certain parts operations at Ford.\n\nThe Ford contract stands as a significant victory for labor, one of many reached this year as workers have walked out or threatened strikes in various industries such as rail, entertainment, shipping and casinos.\n\n\"We still have to see some of the details but it is a major achievement for the union,\" said Harley Shaiken, labor professor at University of California Berkeley.\n\nThe agreement reverses concessions the union agreed to in a series of contracts since 2007, when GM and the former Chrysler were skidding toward bankruptcy, and Ford was mortgaging assets to stay afloat.\n\nThe companies are collectively in a better position now, though they have all stated that excessive pay increases would hamstring their ability to compete in coming years against lower-cost manufacturers, including Tesla, the leading seller of electric vehicles.\n\nThe deal, which could help create a template for settlements with GM and Stellantis, amounts to total pay hikes of more than 33% when compounding and cost-of-living mechanisms are factored in, the UAW said.\n\n\"We know it breaks records,\" UAW President Shawn Fain said in a video address Wednesday night. \"We know it will change lives. But what happens next is up to you all.\"\n\nThe UAW told Ford workers now on strike to return to their jobs during the ratification process. That means production of Ford Super Duty pickups, Ford Bronco and Explorer SUVs and Ranger trucks could restart this week.\n\nStory continues\n\n\"We are pleased to have reached a tentative agreement on a new labor contract with the UAW covering our U.S. operations,\" Ford CEO and President Jim Farley said in a statement.\n\nFord shares were down 0.5% in trading on Thursday.\n\nGM and Stellantis in statements on Wednesday said they were working to secure agreements as soon as possible.\n\n(Reporting By David Shepardson in Washington and Joseph White in Detroit; Additional reporting from Abhirup Roy; Writing by David Gaffen; Editing by Mark Porter)", "link": "https://finance.yahoo.com/news/ford-workers-return-uaw-turns-125306909.html", "symbols": ["8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0.023, "neu": 0.849, "pos": 0.128}}, {"date": "2023-10-26T12:40:20+00:00", "title": "Ford, UAW reach a ‘balanced’ tentative deal after 6-week strike", "content": "Ford (F) and the United Auto Workers (UAW) announced a tentative labor deal is in place, potentially ending a bruising 6-week long contract negotiation.\n\nThe UAW said the tentative agreement includes a 25% base wage increases through April 2028 and will cumulatively raise the top wage by over 30% to more than $40 an hour, and raise the starting wage by 68%, to over $28 an hour. The lowest-paid workers at Ford will see a raise of more than 150% over the life of the agreement, with some workers receiving an 85% increase immediately upon ratification.\n\nThe UAW also revealed COLA (cost-of-living allowance) provisions were reinstated, along with a new three-year wage progression scale (previously it was 8 years), as well as the end of wage tiers. The union said it secured gains for workers with pensions and 401K plans, but did not reveal exact specifics.\n\nThe deal is still subject to approval by UAW’s Ford national council, and ratification by simple majority vote of the UAW’s 57,000 Ford workers. UAW President Shawn Fain and Vice President Chuck Browning discuss reaching a deal with Ford in a Facebook Live video\n\n“We are pleased to have reached a tentative agreement on a new labor contract with the UAW covering our US operations,” Ford CEO Jim Farley said in a statement. “We are focused on restarting Kentucky Truck Plant, Michigan Assembly Plant and Chicago Assembly Plant, calling 20,000 Ford employees back to work and shipping our full lineup to our customers again.”\n\n“We won things nobody thought possible,” UAW president Shawn Fain said in a statement. “Since the strike began, Ford put 50% more on the table than when we walked out. This agreement sets us on a new path to make things right at Ford, at the Big Three, and across the auto industry.”\n\nWall Street reaction to the deal was positive, with shares rising in early trade.\n\n\"The UAW's big win against Ford suggests a serious improvement in workers' bargaining power, with the deal, if approved, securing an 11% pay bump in the first year of the contract and other gains on pensions and job security,\" said Gavekal Research analyst Tan Kai Xian in a note to clients. \"Typically, a deal with one automaker will lead to others following suit.\"\n\nStory continues\n\nWedbush analyst Dan Ives echoed those sentiments. “The initial deal based on reports [is] a more balanced deal for Ford vs original one on the table,” Ives said in a tweet following reports a deal was struck. Ives believes a deal between the union, GM, and Stellantis will likely get done over the next week.\n\nIn terms of next steps, Fain said the UAW’s national council for Ford would vote on Sunday to determine whether to send the deal to UAW membership. After informational meetings with local UAW members, the deal would then be sent for a full vote.\n\nLast but not least, Ford will report Q3 earnings Thursday night after the bell. Ford leadership is expected to discuss more details regarding the financial impact of the agreement and any changes to its profit guidance after reaching a tentative deal with the union.\n\nPras Subramanian is a reporter for Yahoo Finance. You can follow him on Twitter and on Instagram.\n\nFor the latest earnings reports and analysis, earnings whispers and expectations, and company earnings news, click here\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/ford-uaw-reach-a-balanced-tentative-deal-after-6-week-strike-123919628.html", "symbols": ["8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.012, "neu": 0.851, "pos": 0.137}}, {"date": "2023-10-26T12:40:00+00:00", "title": "Auto ETF in Focus as Ford &amp; UAW Reach Tentative Labor Deal", "content": "In a significant development following a six-week strike, Ford Motor F and United Auto Workers (UAW) union negotiators have reached a tentative labor deal that promises substantial pay increases for workers. This four-and-a-half-year contract, pending approval by union leaders and members, marks a historic achievement in the ongoing labor disputes involving 45,000 workers at Ford, General Motors GM, and Stellantis (Chrysler-parent) since September 15.\n\nUnder the proposed agreement, Ford workers can anticipate a 25% wage hike over the duration of the contract. Immediate gains include an 11% wage hike. When considering compounding and the cost of living adjustments, the overall worker pay is expected to soar by approximately 33%, reaching beyond $40 an hour over the contract's lifespan.\n\nFord's Agreement Paves the Way for GM and Stellantis\n\nThe UAW's success in reaching a tentative agreement with Ford carries broader implications for the entire automotive industry. UAW President Shawn Fain has urged Ford workers to return to work promptly to exert pressure on General Motors and Stellantis to reach their own settlements.\n\nIf ratified by Ford workers, this contract is expected to set the standard for future negotiations at General Motors and Stellantis, effectively shaping the labor landscape until April 30, 2028.\n\nEconomic Impact and Stock Market Response\n\nThe strike, which has persisted for six weeks, has had a substantial economic impact. Estimates suggest total losses stemming from the auto workers' strike have reached a staggering $9.3 billion. This includes disrupted production and supply chain disruptions, affecting various sectors of the economy.\n\nFurthermore, the stock market has reacted to this development, as General Motors shares slumped about 10% past month. General Motors withdrew its 2023 profit outlook. The company attributed this decision to the rising costs associated with the UAW strikes. Notably, the strike is estimated to have cost General Motors approximately $200 million during the September quarter.\n\nStory continues\n\nETF in Focus\n\nFirst Trust NASDAQ Transportation ETF (FTXR)\n\nThe Nasdaq US Smart Transportation Index is a modified factor weighted index, designed to provide exposure to US companies within the transportation industry. Ford Motors has 8.53% exposure to the fund and also contains the first spot. General Motors Company too has about 7.8% in the fund. The fund charges 60 bps in fees. The fund is off about 7% past month.\n\nBottom Line\n\nIn conclusion, the tentative labor agreement between Ford and the UAW represents a significant breakthrough in the ongoing labor disputes within the automotive industry. It sets the stage for potential resolutions with General Motors and Stellantis as well. However, the strike's economic impact and its effect on the stock market has far-reaching consequences. For the near term, we expect a turnaround in the auto ETF.\n\n(Disclaimer: This article has been written with the assistance of Generative AI. However, the author has reviewed, revised, supplemented, and rewritten parts of this content to ensure its originality and the precision of the incorporated information.)\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nGeneral Motors Company (GM) : Free Stock Analysis Report\n\nFirst Trust NASDAQ Transportation ETF (FTXR): ETF Research Reports\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/auto-etf-focus-ford-uaw-124000475.html", "symbols": ["8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.042, "neu": 0.826, "pos": 0.132}}, {"date": "2023-10-26T12:03:00+00:00", "title": "Ford Earnings Are Coming. What the UAW Deal Means for Its Stock.", "content": "Profits and losses are important, but so is what the company says about employment costs going forward.\n\nContinue reading", "link": "https://finance.yahoo.com/m/cb88ee8d-1567-3c25-bf0b-9c73caaba145/ford-earnings-are-coming..html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.128, "neg": 0.087, "neu": 0.755, "pos": 0.158}}, {"date": "2023-10-26T11:29:06+00:00", "title": "5 Things to Know Before Markets Open", "content": "Shares of Instagram parent Meta Platforms fell after warning of softer ad sales amid economic uncertainty and the United Auto Workers union said it reached a tentative agreement with Ford. Here’s what investors need to know today.\n\nContinue reading", "link": "https://finance.yahoo.com/m/6df4b176-d099-3bc4-b2c8-391b36dd0c1a/5-things-to-know-before.html", "symbols": ["DWD.F", "DWD.XETRA", "F.MX", "F.US", "FB2A.F", "FB2A.XETRA", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "IBM.F", "IBM.LSE", "IBM.MX", "IBM.US", "IBM.XETRA", "MS-PA.US", "MS-PF.US", "MS-PK.US", "MS.MX", "MS.US", "MSBR34.SA"], "tags": [], "sentiment": {"polarity": 0.586, "neg": 0.103, "neu": 0.69, "pos": 0.207}}, {"date": "2023-10-26T11:10:32+00:00", "title": "Trending tickers: Meta | Ford | Unilever | Intel", "content": "Ad impressions across all of Meta’s apps grew 31% in the September quarter while the company also reported a 6% decrease in average price per ad. Photo: Rafael Henrique/SOPA/LightRocket/Getty\n\nMeta (META)\n\nMeta shares fell 4.2% on Wednesday, and are down 3% in pre-market trading on Thursday, after the social media platform warned that near-term ad spending could be affected by global macro conditions.\n\nThis was despite posting 23% year-on-year quarterly revenue gains to $34.15bn (£28.28), exceeding the $33.5bn analysts expected. Monthly and daily active users on it's 'Family of Apps', including WhatsApp, Facebook and Instagram, rose 7% from last year.\n\nAd impressions across all of Meta’s apps grew 31% in the September quarter while the company also reported a 6% decrease in average price per ad.\n\nHowever, it was still a slower rate of decline than in the same period the year before, when average price per ad fell 18%.\n\nMeta also revealed that it had doubled profits compared to the year prior, reporting net income of nearly $11.6bn – during the same quarter in 2022, Meta’s profits had dropped by half.\n\n\"While encouraging, we believe investors are viewing the wide range for 4Q revenue guidance as a near-term sign of caution,\" Justin Patterson, analyst at KeyBanc Capital Markets, said.\n\n\"CEO Mark Zuckerberg stated that Meta is continuing to focus on operating efficiency, and will be deprioritizing non-AI projects to shift resources toward AI,\" he added. \"While commentary on a hiring backlog may have made some nervous about potential opex acceleration, we view the core message as clear: Meta plans to grow headcount at a much slower rate going forward.\"\n\nFord (F)\n\nFord has made a tentative agreement with union chiefs to end a workers’ strike at its US plants which has been ongoing since mid-September.\n\nThe move, which still needs to be approved by union members, is expected to provide staff with a 25% wage increase over the four-year deal, with an initial increase of 11%.\n\nThe lowest-paid temporary workers would see pay rises of more than 150% over the period. The union also won the right to strike over future Ford plant closures.\n\nStory continues\n\n\"We told Ford to pony up and they did,\" United Auto Workers (UAW) president Shawn Fain said.\n\nRead more: LIVE: FTSE and European stocks fall ahead of ECB interest rate decision\n\nHowever, Ford’s 16,000 workers who have been on strike have been asked to return to work ahead of the vote.\n\nThe strike, which started on 15 September, is the first in the UAW's 88-year history to target all three carmakers at once.\n\nShares climbed 2.3% in pre-market trading on Thursday on the back of the news, and comes ahead of Ford's quarterly financial results later today.\n\nUnilever (ULVR.L)\n\nUnilever, the maker of Ben & Jerry’s ice cream and Marmite, has seen its shares fall 3% on the day, trading near a one-year low, after it announced its third quarter results.\n\nIt revealed underlying sales growth of 5.2%, with prices increasing by 5.8% and volumes declining by 0.6%.\n\nThe group left its 2023 guidance unchanged, targeting underlying sales growth of above 5%, with a modest improvement in underlying operating margin.\n\n“This is another drab quarter from Unilever with underlying sales growth being entirely led by higher prices and volume declines accelerating in the quarter,\" Charlie Huggins, manager of the Quality Shares Portfolio at Wealth Club, said.\n\n\"Europe was particularly weak with volumes falling by over 10%, and the percentage of Unilever's business winning market share on a rolling 12 month-basis fell to a disappointing 38%.\"\n\nRead more: Bitcoin rally lifts memecoins as doge and shiba inu tokens soar\n\nHe added: \"Unilever's new CEO, Hein Schumacher, recognises that the group could and should be doing better. His 'Action Plan', announced today, is designed to reinvigorate performance through more impactful innovation, productivity savings and an improved culture.\n\n\"From here it's all about the execution. Anyone can talk a good game with pretty PowerPoint slides, but actually doing it is quite another matter. Unilever's previous strategy updates promising greater agility, productivity and innovation ultimately didn't really deliver. This Action Plan feels like it has more substance, but the proof will be in the pudding.\"\n\nUnilever also named a new chief financial officer and replaced division heads as Schumacher seeks to revive the company, focusing investment on its top 30 brands.\n\nIntel (INTC)\n\nIntel stock has continued its decline this week after a report that Nvidia (NVDA) was developing an Arm-based CPU for the PC market.\n\nIt is set to report its third quarter earnings after the closing bell on Thursday, with an expectation of $13.5bn revenue in the quarter, according to data compiled by Bloomberg.\n\nThis is an 11.7% decline compared to the $15.3bn the company reported in the same period last year. Wall Street is anticipating adjusted earnings per share of $0.21, down 64.2% year-on-year.\n\nIntel’s Client Computing revenue is expected to hit $7.4bn in Q3, a decline of 9.2% year over year. But estimates point to a return to growth in Q4, with analysts anticipating year-over-year growth of 15.7%.\n\nIntel’s data center and AI business, meanwhile, is expected to show more signs of progress toward a return to growth. Wall Street estimates indicate the segment’s revenue will come in at $3.9 billion. That is still down 7.4% year over year but an improvement versus the last two quarters when growth slowed by double digits.\n\nIt comes as Intel is in the midst of a massive corporate turnaround. After losing ground to long-time rival AMD (AMD) in the PC chip space, the firm has taken a beating for not being able to match Nvidia's AI capabilities.\n\nWhat are SPACs?\n\nDownload the Yahoo Finance app, available for Apple and Android.", "link": "https://uk.finance.yahoo.com/news/trending-tickers-stock-markets-meta-ford-unilever-intel-111032178.html", "symbols": ["A1MD34.SA", "AMD.F", "AMD.MX", "AMD.US", "AMD.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "F.MX", "F.US", "FB2A.F", "FB2A.XETRA", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "INL.F", "INL.XETRA", "INTC.MX"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.027, "neu": 0.867, "pos": 0.106}}, {"date": "2023-10-26T09:09:00+00:00", "title": "These Stocks Are Moving the Most Today: Meta, IBM, ServiceNow, Ford, Align, Mattel, Amazon, and More", "content": "Shares of Meta Platforms fall following a warning about weaker advertising demand, while IBM says a push into artificial intelligence is starting to pay off. Amazon.com reports earnings after the closing bell Thursday.\n\nContinue reading", "link": "https://finance.yahoo.com/m/9ae3a84d-3376-30bc-95de-f6107fa66bf7/these-stocks-are-moving-the.html", "symbols": ["AFW.F", "ALGN.US", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "F.MX", "F.US", "FB2A.F", "FB2A.XETRA", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "IBM.F", "IBM.LSE", "IBM.MX", "IBM.US", "IBM.XETRA"], "tags": [], "sentiment": {"polarity": -0.226, "neg": 0.202, "neu": 0.667, "pos": 0.131}}, {"date": "2023-10-26T07:09:27+00:00", "title": "Meta, UPS, Hasbro and Align fall premarket; IBM, Ford rise", "content": "Investing.com -- U.S. futures slipped lower Thursday, as investors digested earnings from some of the influential tech giants.\n\nHere are some of the biggest premarket U.S. stock movers today:\n\nMeta Platforms (NASDAQ:META) stock fell 3.8% after the Facebook-parent exceeded third-quarter expectations, but the management said on the earnings call that brand advertising demand softened at the beginning of the fourth quarter.\n\nIBM (NYSE:IBM)  (IBM) stock rose 1.3% after the tech company beat expectations on profit for the third quarter and reaffirmed its outlook.\n\nUnited Parcel (NYSE:UPS) Service (UPS) stock fell 3.4% after the delivery service cut its 2023 revenue forecast due to lower e-commerce delivery demand as it fights to win back customers lost during its difficult labor talks.\n\nFord (NYSE:F) stock rose 2.4% after the auto giant reached a tentative labor deal with the United Auto Workers union to end a strike.\n\nAlign (NASDAQ:ALGN) stock slumped 24% after the dental company lowered its full-year revenue forecast.\n\nHasbro (NASDAQ:HAS) stock fell 10% after the toymaker cut its annual revenue forecast for the second time, warning of choppy toy sales into the crucial holiday quarter.\n\nMerck (MRK) stock rose 0.6% after the drugmaker reported higher-than-expected third-quarter sales and profit on surprisingly strong demand for its COVID-19 treatment, primarily in Japan.\n\nSouthwest Airlines (NYSE:LUV) stock fell 3% after the carrier reported a third-quarter profit that fell about 30% on soaring labor and fuel costs.\n\nNorthrop Grumman (NYSE:NOC)  (NOC) stock rose 1% after the defense company raised its annual revenue target for the second time this year after reporting a jump in third-quarter revenue and profit helped by strong weapons demand.\n\nKenvue (NYSE:KVUE) stock fell 1.2% after the Johnson & Johnson (JNJ) spinoff cut its annual profit forecast, as it expects lower demand for its cough, cold and flu medicines.\n\nRelated Articles\n\nMeta, UPS, Hasbro and Align fall premarket; IBM, Ford rise\n\nMercedes says 'brutal' EV market will pressure car sales margins\n\nTesla gets $100 million US ultra-fast charger order from BP EV charging unit", "link": "https://finance.yahoo.com/news/meta-ups-hasbro-align-fall-070927040.html", "symbols": ["ALGN.US", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "HAS.US", "IBM.F", "IBM.LSE", "IBM.MX", "IBM.US", "IBM.XETRA", "KVUE.US", "LUV.MX", "LUV.US", "META.US"], "tags": [], "sentiment": {"polarity": 0.878, "neg": 0.127, "neu": 0.74, "pos": 0.133}}, {"date": "2023-10-26T04:47:00+00:00", "title": "Ford inks surprising deal with striking UAW workers", "content": "Ford Motor has come to terms with United Auto Workers, agreeing to a landmark compensation deal to end workers' stand-up strike against it. UAW workers have been striking against all of Detroit's big three automakers. The agreement comes after the UAW upped the ante this past week against General Motors and Stellantis , calling on more workers to strike at key plants.\n\nContinue reading", "link": "https://finance.yahoo.com/m/8316cfa7-359e-32ad-b3df-d716b0f54195/ford-inks-surprising-deal.html", "symbols": ["8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.751, "neg": 0.048, "neu": 0.812, "pos": 0.141}}, {"date": "2023-10-26T04:34:47+00:00", "title": "Amazon, U.S. GDP, ECB rate decision - what's moving markets", "content": "Investing.com --Amazon takes the lead as the quarterly earnings season continues, with the tech sector remaining in focus. The European Central Bank is expected to halt its rate-hiking cycle, while investors will also focus on the latest quarterly U.S. growth numbers ahead of next week's Federal Reserve meeting.\n\n1. Meta Platforms falls on revenue guidance; Amazon next up\n\nIt was the turn of Meta Platforms (NASDAQ:META) to take the spotlight after the close of trading on Wednesday, as the Facebook and Instagram owner beat expectations for third-quarter profit and revenue, helped by an austerity drive and a recovery in digital advertising ahead of the holiday season.\n\nMeta's operating margin in the third quarter doubled to 40%, while revenue grew at its quickest pace in two years.\n\nAdditionally, CEO Mark Zuckerberg stated that Meta is now moving into artificial technology, following the lead of rivals Alphabet (NASDAQ:GOOGL) and Microsoft (NASDAQ:MSFT), adding AI would constitute Meta's biggest investment area in 2024.\n\nHowever, Meta’s stock fell over 3% premarket as investors fretted over the company’s guidance for the fourth quarter revenue, with the $38.3 billion estimate coming in 1.6% below expectations.\n\nEarnings from the important tech sector continue Thursday, with e-commerce and cloud computing giant Amazon (NASDAQ:AMZN) expected to report earnings per share of 58 cents on revenue of $141.5 billion, after the close.\n\nInvestors will look for signs that Amazon's aggressive expansion of same-day delivery services helped increase its third-quarter profit margin by spurring shoppers to place more frequent and bigger orders.\n\n2. Futures fall as the earnings season continues\n\nU.S. stock futures dropped Thursday, continuing the previous session’s selloff with earnings from a series of tech giants driving sentiment.\n\nAt 04:40 ET (08:40 GMT), the Dow futures contract dropped 115 points or 0.3%, S&P 500 futures fell by 26 points or 0.6%, and Nasdaq 100 futures slipped by 140 points or 1%.\n\nStory continues\n\nThe major indices closed sharply lower Wednesday, as Alphabet's (NASDAQ:GOOG) miss on revenue expectations from its cloud operations hit the tech sector, in particular, very hard.\n\nThe tech-heavy Nasdaq Composite fell 2.4%, recording its worst day since February, while the broad-based S&P 500 dropped 1.4% and the blue chip Dow Jones Industrial Average fell 0.3%.\n\nThe earnings deluge continues Thursday, with results due from e-commerce giant Amazon the highlight [see above].\n\nNumbers are also due from the likes of pharmaceutical giant Merck (NYSE:MRK), carrier Southwest Airlines (NYSE:LUV), auto giant Ford (NYSE:F) and Mexican fast food chain Chipotle (NYSE:CMG).\n\nThere are a number of economic indicators due Thursday, headlined by the first reading of third quarter gross domestic product [see below].\n\nSeptember durable goods orders, goods trade deficit, wholesale and retail inventory numbers and weekly initial jobless claims will be published at the same time as the GDP report.\n\n3. ECB to pause lengthy hiking streak\n\nThe European Central Bank meets later Thursday, and is widely expected to pause its rate-hiking cycle after raising interest rates at its past 10 meetings.\n\nThe central bank hiked its key interest rates by 25 basis points, taking the deposit rate to 4.00% and the refinancing rate to 4.50%, but signaled its 14-month-long hiking streak was likely to be its last.\n\nA weakening eurozone economy suggests the need for further tightening is limited, with Germany, Europe's largest economy, likely entering a recession this quarter.\n\nHowever, inflation, while slowing, remains above the ECB’s medium-term target. Additionally, the conflict in the Middle East is pushing energy prices higher, creating another headwind.\n\n\"The biggest challenge will be to keep a balancing act -- not sound aggressively hawkish but keep the door open to rate hikes,\" said ING's global head of macro Carsten Brzeski.\n\n4. U.S. GDP seen rising strongly\n\nThe Federal Reserve policymakers get together next week, and they will have fresh data to consider, including the first reading of third quarter gross domestic product, due out later in the session.\n\nGDP is expected to have increased at a 4.3% annualized rate in the last quarter, which would be the fastest since the fourth quarter of 2021, and far sharper than the 2.1% pace seen in the April-June quarter.\n\nThis expected lift in growth will likely come from a boost in consumer spending, which accounts for more than two-thirds of U.S. economic activity, which has been supported by a strong labor market.\n\nHowever, the Fed is likely to keep interest rates unchanged at its Oct. 31-Nov. 1 policy meeting, even with a strong GDP number, as financial conditions have already tightened with U.S. Treasury yields surging.\n\n5. Crude slips lower as U.S. inventories rise\n\nCrude prices edged lower Thursday, giving up some of the previous session’s gains as U.S. oil stocks rose while traders continued to focus on developments in the Israel-Hamas war.\n\nBy 04:40 ET, the U.S. crude futures traded 0.7% lower at $84.72 a barrel, while the Brent contract dropped 0.6% to $89.56 a barrel.\n\nThe benchmark contracts settled nearly 2% higher on Wednesday, but have since fallen back after the Wall Street Journal reported that Israel has agreed to delay an expected invasion of Gaza for now.\n\nU.S. crude inventories climbed by 1.4 million barrels last week, according to data from the Energy Information Administration, released Wednesday, pointing to weakening demand at the world’s largest consumer.\n\nHowever, trading remains volatile, as traders struggle to gauge whether the war would escalate and disrupt crude supplies in the oil-rich Middle East region.\n\nRelated Articles\n\nAmazon, U.S. GDP, ECB rate decision - what's moving markets\n\nWith House speaker installed, US Congress returns to spending battles\n\nExclusive-TikTok, YouTube, Meta eye Indonesia e-commerce licenses- sources", "link": "https://finance.yahoo.com/news/amazon-u-gdp-ecb-rate-043447614.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "CMG.US", "DJI.INDX", "F.US", "FB2A.F", "FB2A.XETRA", "GOOG.US", "GOOGL.US", "IXIC.INDX", "LUV.US", "META.US", "MRK.US", "MSFT.US"], "tags": [], "sentiment": {"polarity": -0.968, "neg": 0.088, "neu": 0.832, "pos": 0.08}}, {"date": "2023-10-26T02:46:06+00:00", "title": "UAW, Ford Reach a Tentative Agreement", "content": "United Auto Workers (UAW) announced that it has reached a \"tentative agreement\" with automaker Ford Motor Co. (F), potentially bringing an end to a six-week strike action if it is ratified.\n\nContinue reading", "link": "https://finance.yahoo.com/m/74e3ac38-6adb-3384-92f3-dca7da9c66fb/uaw%2C-ford-reach-a-tentative.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.758, "neg": 0.041, "neu": 0.712, "pos": 0.247}}, {"date": "2023-10-26T02:09:10+00:00", "title": "Ford reaches deal with UAW to end strike and raise members’ wages", "content": "The United Auto Workers and Ford reached a tentative deal on Wednesday night that would raise union members’ wages 25 per cent over the four-year agreement, following a sweeping 40-day strike against the traditional Big Three carmakers in the US. “For months, we’ve been saying record profits mean record contracts,” said UAW president Shawn Fain. “And UAW family, our Stand-Up strike has delivered.”\n\nContinue reading", "link": "https://finance.yahoo.com/m/364cedb2-f86f-34e3-8904-2a67c0e33c3b/ford-reaches-deal-with-uaw-to.html", "symbols": ["8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.807, "neg": 0.043, "neu": 0.811, "pos": 0.147}}, {"date": "2023-10-26T02:09:10+00:00", "title": "Ford reaches deal with union to end US strike and raise wages", "content": "The United Auto Workers and Ford reached a tentative deal on Wednesday night that would raise union members’ wages 25 per cent over the four-year agreement, following a sweeping 40-day strike against the traditional Big Three carmakers in the US. “For months, we’ve been saying record profits mean record contracts,” said UAW president Shawn Fain. “And UAW family, our Stand-Up strike has delivered.”\n\nContinue reading", "link": "https://finance.yahoo.com/m/364cedb2-f86f-34e3-8904-2a67c0e33c3b/ford-reaches-deal-with-union.html", "symbols": ["8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.807, "neg": 0.043, "neu": 0.811, "pos": 0.147}}, {"date": "2023-10-26T01:53:44+00:00", "title": "Ford Agrees to 25% Wage Hike in Tentative Deal to End UAW Strike", "content": "(Bloomberg) -- The United Auto Workers reached a tentative labor agreement with Ford Motor Co., putting pressure on the carmaker’s two chief rivals to end a protracted strike that has cost the industry billions of dollars.\n\nMost Read from Bloomberg\n\nControversial Chip in Huawei Phone Produced on ASML Machine Trump Ally Mike Johnson Elected House Speaker, Shifting GOP Further Right Post-Earnings Meta Rally Fails to Prop Up QQQ: Markets Wrap Apple Plans AirPods Overhaul With New Low- and High-End Models, USB-C Headphones Israel Is Losing Support as Fury Grows Over Its Strikes on Gaza\n\nFord agreed to a record 25% hourly wage hike over the life of the contract, which exceeds four years. With cost-of-living allowances, the top wage rate is expected to increase by 33%. The top pay will be over $40 an hour, the union said.\n\nUAW leadership will vote on the deal Oct. 29. It then must be ratified by Ford’s 57,000 US hourly workers, a process that could take weeks.\n\n“We won things nobody thought was possible,” said UAW President Shawn Fain Wednesday night in a video posted on X. “Since the strike began, Ford put 50% more on the table.”\n\nIn a statement on Wednesday, President Joe Biden highlighted “worker power” when congratulating Ford and the union on reaching a deal.\n\nPay was one of the last issues to be ironed out during the talks. The union had originally sought a 40% raise and 32-hour work week before reining in its demands. Ford earlier agreed to cost-of-living allowances, converting temp hires to full-time and expediting how long it takes workers to get to the top wage rate.\n\nLeft out of Wednesday’s announcement were details on key issues including wages and benefits at battery plants and Fain’s initial demand for a 32-hour workweek.\n\nFain did not address whether the tentative agreement covers Ford’s four battery plants that are under construction or helps the UAW organize the new electric truck assembly plant the automaker is building in Tennessee.\n\nStory continues\n\nRival Deals\n\nGeneral Motors Co. and Stellantis NV are set to meet with the UAW on Thursday and the union hopes they will agree to the same terms, according to people familiar with the talks who weren’t authorized to speak publicly.\n\nThe UAW told Ford workers to go back to work during the ratification process to “keep the pressure on Stellantis and GM,” said Chuck Browning, the union’s top Ford negotiator.\n\n“The last thing they want is for Ford to get back to full capacity while they mess around and lag behind,” Browning said in the video.\n\nGM and Stellantis said in separate emailed statements that they’re working with the UAW to reach agreements “as soon as possible.”\n\nFord said it was “pleased” to reach a deal with the UAW and restart its plants, “calling 20,000 Ford employees back to work and shipping our full lineup to our customers again,” the company said in a statement.\n\nLost Earnings\n\nThe strike that began Sept. 15 initially affected one vehicle-assembly plant at each of Detroit’s legacy automakers. It was the first time all three companies were targeted at once — a bet by Fain to keep them guessing about his next move. Within six weeks, the strike grew to include more than 45,000 workers at eight assembly plants and 38 parts-distribution facilities.\n\nAfter the UAW launched a surprise walkout at Ford’s highly profitable Kentucky Truck Plant on Oct. 11, it announced that it was switching up its strategy to call strikes with little notice, which it said was a response to companies slow-walking talks before making any substantial offers.\n\nTwo more surprise strikes followed: at Stellantis’ Sterling Heights, Michigan, plant that makes its best-selling Ram 1500 pickup truck on Oct. 23; and GM’s Arlington, Texas, facility assembling the Chevy Tahoe, GMC Yukon and Cadillac Escalade on Oct. 24.\n\nFain suggested that a bigger strike was in store for Ford if it hadn’t reached an agreement.\n\n“Ford knew what was coming on Wednesday if we didn’t get a deal. That was checkmate,” Fain said in the video on X.\n\nThe strike was estimated to cost GM, Ford and Stellantis about $2.1 billion in lost earnings before interest and taxes as of Oct. 23, according to Deutsche Bank analyst Emmanuel Rosner. GM this week pulled its earnings guidance after the strike muddied its outlook.\n\nShares of GM and Ford have seen steep declines since July and are underperforming the S&P 500 this year. Stellantis is an outlier with its US shares up 33% so far in 2023.\n\nWhat Bloomberg Intelligence Says:\n\n“Ford’s tentative labor agreement with the UAW may increase its costs by more than $900 million in its first year, based on an 11% raise in year one, putting additional pressure on the company’s efforts to enhance its mediocre profitability.”\n\n— Joel Levington, BI Director of Credit Research\n\nFord’s UAW Deal May Cost $900 Million; S&P to Act? Credit React\n\nHigh-Stakes Bet\n\nFain made a high-stakes bet that he could win back benefits forfeited during the financial crisis more than a decade ago. The union has about 147,000 members at the three automakers, and they’ve been eager to share in soaring corporate profits as car prices have surged in the four years since the last contract was signed.\n\nIf approved, the contract could be of historic proportions. A Bloomberg Law review of the last 10 contracts between the Big Three automakers and the UAW show that raises in that period never topped 3% in a single year. In fact, for 21 of the 36 years covered under these earlier contracts, workers received no annual wage increase at all.\n\nThe UAW strategy reflects a resurgence of labor activism in the US. Emboldened by tight labor markets and agitated by inflation and risks shouldered during the pandemic, unionized workers have notched a series of victories in the last year at prominent US companies, including Kaiser Permanente and United Parcel Service Inc.\n\n“This agreement sets us on a new path to set things right at Ford, at the Big Three and across the auto industry,” Fain said.\n\n--With assistance from Jennifer Jacobs, Robert Combs \"Bob\" and Anne Cronin.\n\n(Updates with context throughout.)\n\nMost Read from Bloomberg Businessweek\n\nX, One Year Later: How Elon Musk Made a Mess of Twitter’s Business Venezuela’s Primary Sweep Puts Maduro and Biden in the Hot Seat No One Understands Corporate Boycotts Like This Former Trump Researcher Lululemon’s Founder Is Racing to Cure the Rare Disease Destroying His Muscles Inflation Raging at 130% Is Pushing Argentina Down a Radical Path\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/ford-uaw-reach-tentative-deal-235436345.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.986, "neg": 0.069, "neu": 0.833, "pos": 0.099}}, {"date": "2023-10-26T01:31:19+00:00", "title": "Instant view: Ford reaches tentative deal with striking UAW workers", "content": "(Reuters) - Ford Motor and United Auto Workers (UAW) union negotiators reached a tentative labor deal after a six-week strike, UAW President Shawn Fain said on Wednesday, agreeing on a 4-1/2-year contract that would provide a record pay boost.\n\nThe union is still in striking GM and Stellantis.\n\nFollowing are reactions to the tentative deal:\n\nSAM FIORANI, VP OF GLOBAL VEHICLE FORECASTING, AUTOFORECAST SOLUTIONS\n\n\"This lays the groundwork for the next two contracts and they should fall in line fairly quickly because all three were within a narrow gap of each other.\"\n\n\"The strike so far has been painful for everybody and knowing what it takes to get a signed contract should bring them to the table much quicker.\"\n\nJOE BIDEN, U.S. PRESIDENT\n\n\"I applaud the UAW and Ford for coming together after a hard fought, good faith negotiation and reaching a historic tentative agreement tonight. This tentative agreement provides a record raise to auto workers who have sacrificed so much to ensure our iconic Big Three companies can still lead the world in quality and innovation...\n\n\"Critical to building an economy from the middle out and bottom up, instead of from the top down, is worker power. It's showing how collective bargaining works by providing workers a seat at the table and the opportunity to improve their lives while contributing fully to their employer's success. This tentative agreement is a testament to the power of employers and employees coming together to work out their differences at the bargaining table in a manner that helps businesses succeed while helping workers secure pay and benefits they can raise a family on and retire with dignity and respect.\"\n\nJEFFREY SCHARF, CHAIRMAN, ACT TWO INVESTORS, FORMER GM HOLDER, ON UAW AND CHIEF SHAWN FAIN\n\n\"If they can use this as a lever to organize Tesla and companies like that, he's brilliant. If they fail to organize the other companies and the differential causes jobs to go out of Detroit and to the other companies, then he's a failure. He won the battle, but whether he wins the war or not, which is to have more union workers getting paid more, is unclear. That's what I would be more worried about if I was a young auto worker. I would worry about whether this is going to cost me my job in the long-term.\"\n\nStory continues\n\nGENERAL MOTORS STATEMENT\n\n\"We are working constructively with the UAW to reach a tentative agreement as soon as possible.\"\n\nSTELLANTIS STATEMENT\n\n\"We remain committed to working toward a tentative agreement that gets everyone back to work as soon as possible.\"\n\n(Reporting by Abhirup Roy, David Shepardson and Joe White; Editing by Peter Henderson)", "link": "https://finance.yahoo.com/news/instant-view-ford-reaches-tentative-013119936.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.976, "neg": 0.069, "neu": 0.792, "pos": 0.139}}, {"date": "2023-10-26T01:31:19+00:00", "title": "Instant view: Ford reaches tentative deal with striking UAW workers", "content": "(Reuters) - The United Auto Workers (UAW) union reached a tentative labor deal on Wednesday with Ford Motor, the first of Detroit's Big Three car manufacturers to negotiate a settlement to strikes joined by 45,000 workers since mid-September.\n\nFollowing are reactions to the tentative deal:\n\nHARLEY SHAIKEN, LABOR PROFESSOR, UNIVERSITY OF CALIFORNIA, BERKELEY\n\n\"We still have to see some of the details but it is a major achievement for the union.\"\n\n\"I think it is a victory that will ultimately affect and improve the lives of all working Americans. This is a set of negotiations, historically, where gains made in Detroit would be viewed and adapted by many other industries across the economy. It increases purchasing power, it is a major step toward wages matching the losses of inflation, and that puts purchasing power into the economy, which fuels economic growth.\"\n\nTIM PIECHOWSKI, PORTFOLIO MANAGER, ACR ALPINE CAPITAL RESEARCH\n\n\"I think this will be a positive for the stocks from go forward basis. I do think for the industry, while the expenses of these labor agreements will be significant, the reality is with where the stocks are trading for these companies, they are implying something that's worse than the agreements that have been reached at this point.\"\n\nDANIEL IVES, ANALYST AT WEDBUSH SECURITIES\n\n\"It's a relief for investors that this UAW nightmare is now over for Ford. I think it's been an albatross for Farley as well as Detroit and now that Ford got a deal done we would expect GM and Stellantis to be the next dominoes to fall over the next week. Now there is pressure on GM and Stellantis to get a deal done in the next 72 hours.\"\n\n\"I think investors are going to view this as less onerous than the worst case scenario that they were staring at six to seven weeks ago.\"\n\nSAM FIORANI, VP OF GLOBAL VEHICLE FORECASTING, AUTOFORECAST SOLUTIONS\n\n\"This lays the groundwork for the next two contracts and they should fall in line fairly quickly because all three were within a narrow gap of each other.\"\n\nStory continues\n\n\"The strike so far has been painful for everybody and knowing what it takes to get a signed contract should bring them to the table much quicker.\"\n\nJOE BIDEN, U.S. PRESIDENT\n\n\"I applaud the UAW and Ford for coming together after a hard fought, good faith negotiation and reaching a historic tentative agreement tonight. This tentative agreement provides a record raise to auto workers who have sacrificed so much to ensure our iconic Big Three companies can still lead the world in quality and innovation...\n\n\"Critical to building an economy from the middle out and bottom up, instead of from the top down, is worker power. It's showing how collective bargaining works by providing workers a seat at the table and the opportunity to improve their lives while contributing fully to their employer's success. This tentative agreement is a testament to the power of employers and employees coming together to work out their differences at the bargaining table in a manner that helps businesses succeed while helping workers secure pay and benefits they can raise a family on and retire with dignity and respect.\"\n\nJEFFREY SCHARF, CHAIRMAN, ACT TWO INVESTORS, FORMER GM HOLDER, ON UAW AND CHIEF SHAWN FAIN\n\n\"If they can use this as a lever to organize Tesla and companies like that, he's brilliant. If they fail to organize the other companies and the differential causes jobs to go out of Detroit and to the other companies, then he's a failure. He won the battle, but whether he wins the war or not, which is to have more union workers getting paid more, is unclear. That's what I would be more worried about if I was a young auto worker. I would worry about whether this is going to cost me my job in the long-term.\"\n\nGENERAL MOTORS STATEMENT\n\n\"We are working constructively with the UAW to reach a tentative agreement as soon as possible.\"\n\nSTELLANTIS STATEMENT\n\n\"We remain committed to working toward a tentative agreement that gets everyone back to work as soon as possible.\"\n\n(Reporting by Abhirup Roy, David Shepardson and Joe White; Editing by Peter Henderson and Christopher Cushing)", "link": "https://ca.finance.yahoo.com/news/instant-view-ford-reaches-tentative-013119630.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0.075, "neu": 0.759, "pos": 0.166}}, {"date": "2023-10-26T01:25:37+00:00", "title": "Ford, United Auto Workers reach tentative deal after weeks-long strike", "content": "United Auto Wokers and Ford Motor Co. have reached a tentative deal following a strike that began 41 days ago. UAW President Shawn Fain and Vice President Chuck Browning outlined the deal in a video posted earlier Wednesday evening. The gains in the deal, as outlined by Fain and Browning, are valued at more than four times the gains from the 2019 contract, and provide more in base wage increases than Ford workers have received in the past 22 years, according to the union.\n\nContinue reading", "link": "https://finance.yahoo.com/m/326203e1-0dc0-3a49-9eef-2f6e0c5761bf/ford%2C-united-auto-workers.html", "symbols": ["8GM.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA"], "tags": [], "sentiment": {"polarity": 0.856, "neg": 0.017, "neu": 0.852, "pos": 0.132}}, {"date": "2023-10-26T01:17:00+00:00", "title": "The UAW Strike Is 41 Days Old. It’s Close to Ending for Ford.", "content": "The 2023 United Auto Workers strike against the Detroit Three auto makers just turned 41 days old, beating the most recent big walkout, in 2019. It isn’t over yet, but the UAW and Ford Motor (ticker: F) announced a tentative agreement on Wednesday night. Ford and the UAW didn’t immediately respond to a request for comment.\n\nContinue reading", "link": "https://finance.yahoo.com/m/144fc4ab-232a-322e-b96c-761c80defec3/the-uaw-strike-is-41-days.html", "symbols": ["8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "STLA.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.486, "neg": 0.081, "neu": 0.819, "pos": 0.1}}, {"date": "2023-10-26T00:48:32+00:00", "title": "UAW and Ford reach tentative deal on new labor contract", "content": "The United Auto Workers (UAW) union and Ford announced a tentative new labor deal with Ford aimed at bringing to an end the union’s strike which is currently in its sixth week.\n\nThe UAW initially sought pay raises for union autoworkers amounting to 40% over the course of a four-year contract, as well as a 32-hour work week and enhancements to benefits – while the automakers initially offered raises closer to 20% over a new contract with about 10% provided upon ratification of the new contract.\n\nFord and the UAW agreed to raise wages by 25% over the four-and-a-half-year contract with cost-of-living adjustments and an immediate 11% raise upon ratification. The agreement between Ford and the UAW would be tentative until it's ratified by the union's membership through a majority vote.\n\nUNITED AUTO WORKERS STRIKE: COST TO US ECONOMY TOPS $9 BILLION The United Auto Workers union and Ford have reportedly reached an agreement on a tentative labor contract amid an ongoing strike.\n\nAbout 57,000 Ford workers are represented by the union, and about 16,600 of whom are currently on strike while 3,167 were temporarily laid off due to the strike.\n\n\"We are pleased to have reached a tentative agreement on a new labor contract with the UAW covering our U.S. operations,\" Ford CEO and President Jim Farley said in a statement. \"Ford is proud to assemble the most vehicles in America and employ the most hourly autoworkers. We are focused on restarting Kentucky Truck Plant, Michigan Assembly Plant and Chicago Assembly Plant, calling 20,000 Ford employees back to work and shipping our full lineup to customers again.\"\n\nREAD ON THE FOX BUSINESS APP\n\n\"Today, we reached a tentative agreement with Ford – for months we said that record profits mean record contracts,\" UAW President Shawn Fain said. \"And UAW family, our stand up strike has delivered.\"\n\nUAW Vice President Chuck Browning added that, \"We are calling on all Ford strikers to go back to work while we vote on our tentative agreement. Like everything we've done in this stand up strike, this is a strategic move to get the best deal possible. We're going back to work at Ford to keep the pressure on Stellantis and GM. The last thing they want is for Ford to get back to full capacity while they mess around and lag behind.\"\n\nStory continues\n\nThe UAW strike began on Sept. 15 with a simultaneous strike against Detroit’s Big Three automakers – Ford, General Motors and Stellantis, which is the parent company of Chrysler, Dodge, Jeep and Ram.\n\nIt launched what it called a \"stand up strike\" in which specific locals are asked to go on strike at their facilities. Over 45,000 union autoworkers are currently on strike – about one-third of the roughly 150,000 total workers across the three companies. About 45,000 union autoworkers are on strike across the Big Three of Ford, General Motors and Stellantis.\n\nThe union will need to reach separate agreements with each automaker on new labor contracts covering their respective employees.\n\nFOX Business' Philip Bodinet contributed to this report.\n\nOriginal article source:UAW and Ford reach tentative deal on new labor contract", "link": "https://finance.yahoo.com/news/uaw-ford-reach-tentative-deal-004832169.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.054, "neu": 0.822, "pos": 0.124}}, {"date": "2023-10-26T00:35:55+00:00", "title": "TIMELINE-UAW, Ford reach tentative labor agreement for 4-1/2 year deal", "content": "Oct 25 (Reuters) - Ford Motor and the negotiators of the United Auto Workers (UAW) union have reached a tentative labor deal, the union said Wednesday, for a 4-1/2-year contract that would provide a record pay boost. The deal is the first reached between the union and one of the Detroit Three automakers. Since first striking on Sept. 15, more than 45,000 union members working at Ford, General Motors and Chrysler parent Stellantis have joined the picket lines. Here is a timeline of events beginning with the election of Fain in March: Date Development March 25 Shawn Fain wins the race for UAW president; vows to take a tough stance against the Big Three automakers. July 10 The union says it will open contract talks with Detroit's Big Three automakers starting July 13. July 11 Fain says the union is not afraid to hold a strike at any of the automakers without a fair contract. July 19 Fain meets President Joe Biden at the White House as the union briefs the staff on contract talks with the automakers. Aug. 1 The UAW presents demands to Stellantis, says the union is seeking ambitious benefit increases from the Detroit Three, including double-digit pay rises and defined-benefit pensions for all workers. Aug. 2 The union presents contract demands to General Motors. Aug. 3 The union presents contract demands to Ford Aug. 8 Fain angrily tosses contract proposals from Stellantis in a trash can, citing numerous concessions that the Chrysler parent is seeking in labor talks. Aug. 25 The UAW says 97% of voting members were in favor of authorizing a strike at the Detroit Three if an agreement is not reached before Sept. 14. Aug. 31 The union says it has filed unfair labor practice charges with the National Labor Relations Board (NLRB) against GM and Stellantis, saying they have refused to bargain in good faith. Aug. 31 Ford makes a contract offer to the UAW, providing hourly employees with 15% guaranteed combined wage increases, lump-sum payments and improved benefits over the life of the contract. Sept. 1 The NLRB says it will investigate the charges filed by the UAW. Sept 6 The UAW makes a labor contract counterproposal on economic issues to Ford. Sept. 7 GM makes a counteroffer to the UAW that includes a 10% wage hike and two additional 3% annual lump-sum payments over four years. Fain calls the offer \"insulting.\" Sept. 8 Stellantis says it offered U.S. hourly workers a 14.5% wage hike over four years but no lump-sum payments. Sept. 8 Fain says UAW expects to go on strike against all three automakers the following week if they do not improve their contract offers. Sept. 11 Stellantis says it plans to make a new counteroffer to the UAW after the union made its own revised offer on Sunday ahead of the expiration of the current four-year labor deal Thursday night. Sept. 13 The UAW rejects counteroffers from the automakers and outlined plans for strikes targeting individual U.S. auto plants in what would be its first-ever simultaneous strike against the Detroit Three. Sept. 15 The UAW launches simultaneous strikes that will halt production of some popular models at three factories owned by GM, Ford and Stellantis. Sept. 16 Negotiators for the UAW and Ford have \"reasonably productive discussions\" toward a new contract, while officials at Stellantis say a proposal to resume work at an idled Illinois factory has fallen through. Sept. 18 UAW says it will announce strikes at more plants on Sept. 22 if no serious progress is made in talks. Sept. 20 UAW says 90 workers go on strike at Mercedes-supplier ZF's plant in Alabama. Sept. 22 UAW will expand its strikes against GM and Stellantis, but has made real progress in talks with Ford Motor, the union says. Sept 24. Ford says despite progress in some areas, it still has \"significant gaps to close\" on key economic issues before it can reach a new labor agreement with UAW. Sept. 28 The UAW makes a new counter-proposal to Stellantis, just one day before it was set to strike at additional Detroit Three facilities. Sept. 29 The UAW will walk off the job at an additional plant at General Motors and at Ford, says Fain. The new strike will not extend to Stellantis, which called before the scheduled 10 a.m. ET announcement to make significant changes in its contract proposal. Oct.2 GM and Ford say they are laying off another 500 workers at four Midwestern plants. Separately, the UAW confirms it presented a new contract offer to GM. GM says it has received the counterproposal \"but significant gaps remain.\" Oct. 3 Ford says it had made a new contract offer but says a dispute over battery plants remained unresolved. Ford says the new offer boosts wages for temporary workers, increases company 401(k) contributions and further shrinks time needed to get to the top wage rate. Oct. 6 The UAW holds off on additional strikes against Detroit Three auto plants, citing GM's unexpected willingness to allow workers at joint-venture battery plants to be covered by union contracts. Oct. 11 GM, Ford and Stellantis all agree to raise base wages by between 20% and 23% over a four-year deal. Ford and Stellantis agree to reinstate cost-of-living adjustments, or COLA. Oct. 12 The UAW shuts down Ford's biggest plant globally, saying the automaker refused to move further in bargaining. UAW negotiators are expected to turn their attention to talks with Stellantis. Oct. 13 Fain says the union will not expand its strike at the moment, but warns that members would now walk out of additional facilities without warning rather than wait until Fridays to announce new plans. Oct. 13 A senior Ford executive says the automaker is \"at the limit\" of what it can spend on higher wages and benefits for the UAW. Stellantis and Ford say they will temporarily lay off 1,250 employees due to the impact of the UAW strike. Oct. 16 Ford executive chairman Bill Ford urges the UAW union to end a 32-day strike and reach a new labor agreement, and warns of the growing impact to the automaker and the U.S. economy. Oct. 20 General Motors and Stellantis raise their offer to striking auto workers, matching Ford's proposed 23% wage hike. Fain says \"there is more to be won.\" Oct. 23 An additional 6,800 UAW members go on strike at Stellantis's largest assembly plant. Oct. 24 General Motors withdraws its 2023 profit outlook just ahead of a new UAW walkout at its Arlington, Texas, factory. The UAW and Ford announce a Oct. 25 tentative agreement on a labor deal that will last 4-1/2 years and provide a record pay increase. (Reporting By Reuters Staff; Editing by Cynthia Osterman)", "link": "https://finance.yahoo.com/news/timeline-uaw-ford-reach-tentative-003555985.html", "symbols": ["8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.956, "neg": 0.07, "neu": 0.851, "pos": 0.079}}, {"date": "2023-10-26T00:01:34+00:00", "title": "UAW Strike: Ford, Union Reach Tentative Labor Deal", "content": "Ford reached a tentative labor deal with the United Auto Workers Wednesday night. Ford stock rose, along with GM and Stellantis.\n\nContinue reading", "link": "https://finance.yahoo.com/m/14ffee15-38b2-38e2-969d-808799b2b027/uaw-strike%3A-ford%2C-union-reach.html", "symbols": ["8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "STLA.US"], "tags": [], "sentiment": {"polarity": 0.494, "neg": 0, "neu": 0.826, "pos": 0.174}}, {"date": "2023-10-26T00:00:00+00:00", "title": "F Stock Pops as Ford Strikes Deal With UAW", "content": "Ford stock is heading higher on Thursday as F investors react to it signing an agreement with the UAW union to end strikes.", "link": "https://investorplace.com/2023/10/f-stock-pops-as-ford-strikes-deal-with-uaw/", "symbols": ["F.US"], "tags": [], "sentiment": {"polarity": 0.178, "neg": 0.097, "neu": 0.778, "pos": 0.125}}, {"date": "2023-10-26T00:00:00+00:00", "title": "3 Best Stocks for Covered Calls in October 2023", "content": "Here are three different stocks for investors looking to receive a premium from selling call options. Have you considered covered calls?", "link": "https://investorplace.com/2023/10/3-best-stocks-for-covered-calls-in-october-2023/", "symbols": ["AMD.US", "F.US", "KO.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-25T23:26:29+00:00", "title": "Ford, UAW negotiators reach tentative labor deal: Sources", "content": "(Adds background of strike para 6-8)\n\nBy Joseph White and David Shepardson\n\nOct 25 (Reuters) - Ford Motor and the negotiators of the United Auto Workers (UAW) union have reached a tentative labor deal, pending union leadership approval, three sources familiar with the matter said on Wednesday.\n\nA deal would be the first settlement of strikes against Ford, General Motors and Chrysler-parent Stellantis .\n\nThe deal is expected to provide a 25% wage hike through the life of the contract, including 11% to start, one of the sources said. Including compounding and cost of living, workers will get more than 30% under the tentative deal.\n\nUAW President Shawn Fain has not issued a statement confirming an agreement.\n\nMore than 45,000 union members working at the Detroit Three automakers have joined walkouts that began on Sept. 15.\n\nThe UAW's most recent move was to strike against each company's most profitable plants - GM's Arlington, Texas assembly plant, Ford's Kentucky Truck heavy-duty pickup factory and Stellantis' Ram pickup plant in Sterling Heights, Michigan.\n\nTotal economic losses from the UAW strike have reached $9.3 billon, the Anderson Economic Group said earlier this week.\n\nIf the contract is ratified by Ford-UAW workers, it would set the standard for bargaining at General Motors and Stellantis and expire on April 30, 2028. The three automakers were close on most terms of the contract headed into Wednesday.\n\nThe three companies had no immediate comment.\n\nThe union has waged an unusual campaign of simultaneous strikes against the Detroit Three automakers, demanding a 40% wage hike, including a 20% immediate increase, improvements in benefits, as well as covering EV battery plant workers under union agreements.\n\nCNBC earlier reported the tentative deal. (Reporting by Mrinmay Dey in Bengaluru; Editing by Shailesh Kuber)", "link": "https://finance.yahoo.com/news/1-ford-uaw-negotiators-reach-232629093.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.88, "neg": 0.058, "neu": 0.847, "pos": 0.095}}, {"date": "2023-10-25T23:16:22+00:00", "title": "Ford, UAW reach tentative deal to end strike including record pay raise", "content": "By Joseph White and David Shepardson\n\n(Reuters) -Ford Motor and United Auto Workers (UAW) union negotiators reached a tentative labor deal after a six-week strike, UAW President Shawn Fain and the automaker said on Wednesday, agreeing a 4-1/2-year contract with a record pay boost.\n\nThe deal, which needs approval by union leaders and members, would be the first settlement of strikes by 45,000 workers against Ford, General Motors and Chrysler-parent Stellantis that began Sept. 15.\n\n\"We told Ford to pony up and they did,\" Fain said in a video post on Facebook, adding that the strike at Ford \"has delivered\".\n\nFain said the UAW reached a historic agreement with Ford, including a 25% wage increase over the life of the contract. Ford workers will receive an immediate 11% wage hike. Including compounding and cost of living, worker pay will rise about 33% to over $40 an hour over the life of the contract.\n\nIn addition to the general wage hike, Fain said the lowest-paid temporary workers would see raises of more than 150% over the contract term and employees would reach top pay after three years. The union also won the right to strike over future plant closures, he said.\n\nThe UAW also succeeded in eliminating lower-pay tiers for workers in certain parts operations at Ford - an issue Fain highlighted from the start of the bargaining process, wearing T-shirts with the slogan \"End Tiers.\"\n\nThe Ford contract would reverse concessions the union agreed to in a series of contracts since 2007, when GM and the former Chrysler were skidding toward bankruptcy, and Ford was mortgaging assets to stay afloat.\n\n\"We know it breaks records,\" Fain said in a video address Wednesday night. \"We know it will change lives. But what happens next is up to you all.\"\n\nThe UAW was preparing to strike at a key Ford facility in Dearborn this week if it had not reached agreement after striking at additional GM and Stellantis facilities this week.\n\nStory continues\n\nBut in an unexpected gesture to Ford, UAW-Ford Vice President Chuck Browning said in a video Wednesday that Ford workers now on strike should return to their jobs during the coming ratification process. That means production of Ford Super Duty pickups, Ford Bronco and Explorer SUVs and Ranger trucks could restart this week.\n\nFord confirmed the news. \"We are pleased to have reached a tentative agreement on a new labor contract with the UAW covering our U.S. operations,\" Ford CEO and President Jim Farley said in a statement.\n\nIf the Ford contract is ratified, it would set the standard for bargaining at GM and Stellantis and expire on April 30, 2028.\n\nIn statements, GM and Stellantis said Wednesday they are working to secure agreements as soon as possible.\n\n\"This lays the groundwork for the next two contracts and they should fall in line fairly quickly because all three were within a narrow gap of each other,\" Sam Fiorani, vice president of global vehicle forecasting at AutoForecast Solutions.\n\n\"The strike so far has been painful for everybody and knowing what it takes to get a signed contract should bring them to the table much quicker,\" he said.\n\nThe UAW ratcheted up pressure on the automakers by striking at each company's most profitable plant - GM's Arlington, Texas assembly plant, Ford's Kentucky heavy-duty pickup factory and Stellantis' Ram pickup plant in Sterling Heights, Michigan.\n\nTotal economic losses from the auto workers' strike have reached $9.3 billon, the Anderson Economic Group said earlier this week.\n\nThe UAW's campaign for a record contract converged with union efforts in Hollywood and at delivery giant UPS to win big pay increases. It also became the focus of attention by U.S. President Joe Biden and Republican rivals who see Michigan and other auto states as pivotal to their 2024 campaign strategies.\n\nBiden joined Fain on a picket line last month, and praised the tentative agreement in a statement Wednesday night as a \"testament to the power of employers and employees coming together to work out their differences at the bargaining table.\"\n\nAbsent from Fain and Browning's summary of the contract terms Wednesday was mention of future pay and unionization at new joint-venture electric vehicle battery factories the Detroit Three are building with Asian partners.\n\nBecause they are owned by separate corporate entities, the automakers did not have to include those factories in this round of bargaining. Fain had pushed for assurances that battery plant wages would be comparable to wages at assembly plants, and expressed concern that UAW jobs at Detroit Three combustion powertrain plants would be lost over time to non-union battery operations.\n\n(Reporting by Mrinmay Dey in Bengaluru; Writing by Peter Henderson; Additional reporting by Abhirup Roy; Editing by Cynthia Osterman and Christopher Cushing)", "link": "https://ca.finance.yahoo.com/news/ford-uaw-negotiators-reach-labor-231622588.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.991, "neg": 0.04, "neu": 0.874, "pos": 0.086}}, {"date": "2023-10-25T23:16:22+00:00", "title": "Ford, UAW reach tentative deal to end strike including record pay raise", "content": "By Joseph White and David Shepardson\n\n(Reuters) -The United Auto Workers (UAW) union reached a tentative labor deal on Wednesday with Ford Motor, the first of Detroit's Big Three car manufacturers to negotiate a settlement to strikes joined by 45,000 workers since mid-September.\n\nThe proposed accord, which UAW's leadership must still approve, provides a 25% wage hike over the 4-1/2-year contract, starting with an initial increase of 11%.\n\nThe Ford deal, which could help create a template for settlements of parallel UAW strikes against General Motors and Chrysler parent Stellantis, would amount to total pay hikes of more than 33% when compounding and cost-of-living mechanisms are factored in, the UAW said.\n\n\"We told Ford to pony up and they did,\" Fain said in a video post on Facebook, adding that the strike at Ford \"has delivered\".\n\nIn addition to the general wage hike, Fain said the lowest-paid temporary workers would see raises of more than 150% over the contract term and employees would reach top pay after three years. The union also won the right to strike over future plant closures, he said.\n\nThe UAW also succeeded in eliminating lower-pay tiers for workers in certain parts operations at Ford - an issue Fain highlighted from the start of the bargaining process, wearing T-shirts with the slogan \"End Tiers.\"\n\nThe Ford contract would reverse concessions the union agreed to in a series of contracts since 2007, when GM and the former Chrysler were skidding toward bankruptcy, and Ford was mortgaging assets to stay afloat.\n\n\"We know it breaks records,\" Fain said in a video address Wednesday night. \"We know it will change lives. But what happens next is up to you all.\"\n\nThe Detroit automakers have argued that the UAW's demands will significantly raise costs and hobble their electric vehicle ambitions, putting them at a disadvantage when compared to EV leader Tesla and foreign brands such as Toyota Motor, which are non-unionized.\n\nStory continues\n\nThe UAW was preparing to strike at a key Ford facility in Dearborn this week if it had not reached agreement after striking at additional GM and Stellantis facilities this week.\n\nBut in an unexpected move that adds pressure on GM and Stellantis, the UAW told Ford workers now on strike to return to their jobs during the ratification process. That means production of Ford Super Duty pickups, Ford Bronco and Explorer SUVs and Ranger trucks could restart this week.\n\nFord, confirmed the news. \"We are pleased to have reached a tentative agreement on a new labor contract with the UAW covering our U.S. operations,\" Ford CEO and President Jim Farley said in a statement. Ford shares rose 2% in after-hours trade.\n\nIn statements, GM and Stellantis said Wednesday they are working to secure agreements as soon as possible.\n\n\"This lays the groundwork for the next two contracts and they should fall in line fairly quickly because all three were within a narrow gap of each other,\" Sam Fiorani, vice president of global vehicle forecasting at AutoForecast Solutions.\n\nThe UAW ratcheted up pressure on the automakers by striking at each company's most profitable plant - GM's Arlington, Texas assembly plant, Ford's Kentucky heavy-duty pickup factory and Stellantis' Ram pickup plant in Sterling Heights, Michigan.\n\nThe total economic loss from the auto workers' strike has reached $9.3 billon, the Anderson Economic Group said earlier this week.\n\n\"I think this will be a positive for the stocks,\" said portfolio manager Tim Piechowski at ACR Alpine Capital Research, which has $250 million in investment in GM. Detroit Three shares currently reflect a scenario worse than the terms of the tentative agreement, he said.\n\nBARGAINING TABLE\n\nThe UAW's campaign for a record contract converged with union efforts in Hollywood and at delivery giant UPS to win big pay increases. It also became the focus of attention by U.S. President Joe Biden and Republican rivals who see Michigan and other auto states as pivotal to their 2024 campaign strategies.\n\nBiden joined Fain on a picket line last month, and praised the tentative agreement in a statement Wednesday night as a \"testament to the power of employers and employees coming together to work out their differences at the bargaining table.\"\n\nAbsent from Fain and Browning's summary of the contract terms Wednesday was mention of future pay and unionization at new joint-venture electric vehicle battery factories the Detroit Three are building with Asian partners.\n\nBecause they are owned by separate corporate entities, the automakers did not have to include those factories in this round of bargaining. Fain had pushed for assurances that battery plant wages would be comparable to wages at assembly plants, and expressed concern that UAW jobs at Detroit Three combustion powertrain plants would be lost over time to non-union battery operations.\n\nNonetheless, Harley Shaiken, labor professor at the University of California, Berkeley, saw the deal as one with far-reaching implications. \"This is a set of negotiations, historically, where gains made in Detroit would be viewed and adapted by many other industries across the economy,\" he said.\n\nFormer GM shareholder Jeffrey Scharf of Act Two Investors said the bottom line for union chief Fain depended on his ability to expand the union.\n\n\"If they can use this as a lever to organize Tesla and companies like that, he's brilliant. If they fail to organize the other companies and the differential causes jobs to go out of Detroit and to the other companies, then he's a failure,\" Scharf said.\n\n(Reporting by Mrinmay Dey and Shivani Jayesh Tanna in Bengaluru; Writing by Peter Henderson and Sayantani Ghosh; Additional reporting by Abhirup Roy; Editing by Cynthia Osterman and Christopher Cushing)", "link": "https://finance.yahoo.com/news/ford-uaw-negotiators-reach-labor-231622814.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.992, "neg": 0.042, "neu": 0.87, "pos": 0.087}}, {"date": "2023-10-25T22:58:00+00:00", "title": "UAW, Ford Expected to Announce New Tentative Labor Deal", "content": "The United Auto Workers union is expected to announce a new tentative labor contract with the automaker, according to people with knowledge of the talks.\n\nContinue reading", "link": "https://finance.yahoo.com/m/7fd8876b-7b43-3322-adc3-cb6b6c755c77/uaw%2C-ford-expected-to.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.422, "neg": 0, "neu": 0.899, "pos": 0.101}}, {"date": "2023-10-25T21:24:48+00:00", "title": "Amazon and Ford earnings, U.S. GDP: What to Watch", "content": "Yahoo Finance Live anchor Josh Lipton previews the top industry headlines for Thursday, October 26, including Amazon (AMZN) and Ford (F) earnings among many others, as well as the latest reading of the U.S. Gross Domestic Product.\n\nFor more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live.", "link": "https://finance.yahoo.com/video/amazon-ford-earnings-u-gdp-212448753.html", "symbols": ["6MK.F", "6MK.XETRA", "AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "BBEA.F", "C9F.F", "CMCS34.SA", "CMCSA.MX", "CMCSA.US", "CMG.MX", "CMG.US", "CTP2.F", "DP5.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F"], "tags": [], "sentiment": {"polarity": 0.128, "neg": 0.05, "neu": 0.859, "pos": 0.091}}, {"date": "2023-10-25T21:11:00+00:00", "title": "The UAW Strike Is 40 Days Old, Matching 2019. Blame Inflation and Tesla.", "content": "This is a strike of a different nature. A look at why, and how the industry got here, makes it clear that a quick resolution isn't likely.\n\nContinue reading", "link": "https://finance.yahoo.com/m/144fc4ab-232a-322e-b96c-761c80defec3/the-uaw-strike-is-40-days.html", "symbols": ["8GM.F", "8TI.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "STLA.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0.273, "neg": 0.055, "neu": 0.849, "pos": 0.096}}, {"date": "2023-10-25T20:54:00+00:00", "title": "Ford, UAW Near Tentative Labor Deal to Potentially End Six-Week Strike at the Automaker", "content": "The two sides have moved closer on key bargaining issues in recent days, though there is still a possibility talks could stall.\n\nContinue reading", "link": "https://finance.yahoo.com/m/7fd8876b-7b43-3322-adc3-cb6b6c755c77/ford%2C-uaw-near-tentative.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.202, "neg": 0.076, "neu": 0.924, "pos": 0}}, {"date": "2023-10-25T19:28:03+00:00", "title": "UPDATE 2-Ford Canada plant could halt output next week due to US auto strike -union official", "content": "(Adds Ford comment in paragraph 4)\n\nOct 25 (Reuters) -\n\nProduction at a Ford Motor Company engine plant in Canada could halt by next Wednesday if there are no changes to a United Auto Workers strike in Kentucky, a Canadian union representative told Reuters.\n\nThe Ford Windsor Annex Engine Plant, with nearly 900 workers, makes engines mostly for Ford's Super Duty trucks at the plant in Louisville, Kentucky, John D'Agnolo, the union's auto council chair said on Wednesday.\n\nWindsor is south of Detroit.\n\nFord is operating normally and monitoring the situation, the company said in a statement. \"In the event production is impacted, our Windsor team members will be the first to know.\"\n\nThe UAW's strategy of targeted strikes has hit multiple U.S. plants and has throttled billions in revenue for the Detroit Three automakers. It also has rippled out, causing some auto parts makers and the plant in neighboring Canada to start feeling the heat.\n\n\"It's a waiting game,\" D'Agnolo said. \"I'm hoping the UAW can get an agreement that their members will be happy with.\" (Reporting by Allison Lampert; Editing by Richard Chang)", "link": "https://finance.yahoo.com/news/1-ford-canada-plant-could-192803456.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.914, "neg": 0.032, "neu": 0.876, "pos": 0.092}}, {"date": "2023-10-25T18:50:04+00:00", "title": "Dow futures slip, Meta falls 2.8% after earnings", "content": "Investing.com - US stock futures were trading lower during Wednesday's evening deals, as major US indices continued to sell off throughout the regular session amid a slew of corporate earnings results.\n\nBy 6:30 pm ET (10:30 pm GMT) Dow Jones Futures lost 0.1%, S&P 500 Futures dipped 0.4% and Nasdaq 100 Futures fell 0.8%.\n\nStay ahead of the curve this earnings season with InvestingPro!\n\nIn extended deals, Meta Platforms (NASDAQ:META) lost 2.8% after the company reported Q3 EPS of $4.39 versus $3.64 expected. Revenues were reported at $34.15 billion versus $33.57 billion expected. Meta Platforms also forecasted Q4 2023 revenue in the range of $36.5-40 billion versus $36.64 billion expected.\n\nIBM (NYSE:IBM) gained 1.6%, reporting Q3 EPS of $2.20 versus $2.13 expected, with revenue coming in at $14.75 billion versus $14.75 billion expected.\n\nAlign Technology (NASDAQ:ALGN) shed 23%, reporting Q3 EPS of $2.14 versus $2.27 expected, while revenues for came in at $960.2 million versus $998.68 million expected.\n\nAhead in Thursday's trade, investors will be closely monitoring core durable goods orders, preliminary GDP and PCE prices, jobless claims, pending home sales and a speech from the Fed's Waller.\n\nAmong earnings, companies including Amazon.com Inc (NASDAQ:AMZN), International Business Machines (NYSE:IBM), Intel Corporation (NASDAQ:INTC), Merck & Company Inc (NYSE:MRK) and Ford Motor Company (NYSE:F) are scheduled to report quarterly results.\n\nDuring Wednesday's regular session, the Dow Jones Industrial Average lost 105.5 points or 0.3% to 33,035.9, the S&P 500 dipped 60.9 points or 1.4% to 4,186.8 and the NASDAQ Composite dipped 318.7 points or 2.4% to 12,821.2.\n\nOn the bond markets, United States 10-Year rates were steady at 4.961%.\n\nRelated Articles\n\nDow futures slip, Meta falls 2.8% after earnings\n\nComments on Morgan Stanley naming Ted Pick as CEO\n\nUAW, Ford reach tentative labor agreement for 4-1/2 year deal", "link": "https://finance.yahoo.com/news/dow-futures-slip-meta-falls-185004682.html", "symbols": ["AFW.F", "ALGN.US", "AMZN.US", "DJI.INDX", "F.US", "IBM.F", "IBM.LSE", "IBM.MX", "IBM.US", "IBM.XETRA", "INTC.US", "IXIC.INDX", "META.US", "MRK.US"], "tags": [], "sentiment": {"polarity": 0.224, "neg": 0.03, "neu": 0.937, "pos": 0.033}}, {"date": "2023-10-25T18:29:35+00:00", "title": "UAW Moves Closer to Deal With Ford: AP", "content": "The UAW appears to be moving closer to a tentative contract agreement with Ford, the Associated Press reports, citing two unidentified people with knowledge of the talks. Bloomberg's Keith Naughton has more. Follow Bloomberg for business news & analysis, up-to-the-minute market data, features, profiles and more: http://www.bloomberg.com Connect with us on... Twitter: https://twitter.com/business Facebook: https://www.facebook.com/bloombergbusiness/ Instagram: https://www.instagram.com/quicktake/?hl=en", "link": "https://finance.yahoo.com/video/uaw-moves-closer-deal-ford-182935599.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.494, "neg": 0, "neu": 0.944, "pos": 0.056}}, {"date": "2023-10-25T18:23:51+00:00", "title": "Ford's Canada plant could halt output next Wednesday due to UAW autos strike: union official", "content": "Oct 25 (Reuters) - Production at a Ford Motor Company engine plant in Canada could halt by next Wednesday if there are no changes to a U.S. strike by the United Auto Workers, a Canadian union representative told Reuters.\n\nThe Ford Windsor Annex Engine Plant, which has close to 900 workers, produces engines mostly for Ford's Super Duty trucks at a plant in Kentucky that is on strike, John D'Agnolo, the union’s auto council chair said on Wednesday.\n\nFord was not immediately available for comment.\n\n(Reporting By Allison Lampert)", "link": "https://finance.yahoo.com/news/fords-canada-plant-could-halt-182351573.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.542, "neg": 0.057, "neu": 0.869, "pos": 0.074}}, {"date": "2023-10-25T17:23:08+00:00", "title": "UAW appears to be moving toward a potential deal with Ford that could end strike", "content": "DETROIT (AP) — The United Auto Workers union appears to be edging closer to a tentative contract agreement with Ford that would be critical to ending the union's 6-week-old strikes against the three major Detroit automakers, two people with knowledge of the talks said Wednesday.\n\nThe people said the union made a counter-offer to Ford that proposes a 25% general wage increase over the life of a new four-year contract and said that negotiations on Tuesday extended well into Wednesday morning. Previously Ford, Stellantis and General Motors had all offered 23% pay increases.\n\nA Ford deal would include cost-of-living pay increases that could lift the total pay raises above 30%, said the people, who asked not to be identified because they are not authorized to speak publicly about the talks. In addition, workers would still receive annual profit-sharing checks.\n\nIt's still possible that the negotiations, despite the meaningful progress being made, could unravel. But if the UAW can reach a tentative agreement with Ford, it would be used as a model to seek similar contract settlements with GM and Stellantis. Typically, during past auto strikes, a UAW deal with one automaker has led the other companies to match it with their own settlements.\n\nOne of the people said there also was progress in the union’s talks with GM. But it was unclear whether any of the automakers had accepted the UAW’s counter-offer of 25% pay increases over four years.\n\nThe progress in the negotiations came after the union this week walked out at three factories that produce highly profitable pickup trucks and SUVs, adding them to the list of plants already on strike in a strategy to intensify pressure on the companies.\n\nOn Tuesday, about 5,000 workers at GM’s assembly plant in Arlington, Texas, walked out, halting production of truck-based SUVs that are huge profit makers for the company. A day earlier, the UAW’s president, Shawn Fain, had added 6,800 employees at Stellantis’ Ram pickup plant in Sterling Heights, Michigan.\n\nStory continues\n\nTwo weeks ago the union struck Ford’s largest and most profitable factory, the Kentucky Truck Plant in Louisville, where 8,700 workers make heavy-duty F-Series pickups and two large SUVs.\n\nIn all, about 46,000 workers have walked out at factories owned by the three companies in a series of targeted strikes that began Sept. 15. About 32% of the union’s 146,000 members at the automakers are now on strike. The automakers have been laying off workers at other plants as parts shortages have cascaded through their manufacturing systems.\n\nNeither the companies nor the union would comment on the talks Wednesday. The union’s counter-offer of a 25% wage increase over four years was reported earlier by Bloomberg News and the trade publication Automotive News.\n\nMarick Masters, a business professor at Wayne State University in Detroit who studies labor issues, said it was not surprising that the union would be close to an agreement at this point in the talks.\n\n“I think that Shawn Fain struck these plants at this particular time over the past week because he thought they would be near a deal and this would be the extra nudge to get something cemented,” Masters said. “When you look at the movement and the concessions, they’re getting smaller but moving closer to what the union wanted.”\n\nWhen contract talks began in July, the union sought 40% pay raises over four years as well as the restoration of cost-of-living raises. The union had given up the cost-of-living increases in 2009 to help the companies survive the aftermath of the Great Recession.\n\nThe UAW also wants traditional defined-benefit pension plans restored for workers who were hired after 2007, an end to varying tiers of wages for UAW workers, pension increases for retirees and other benefits.\n\nOne key issue is whether to extend the national UAW contract to 11 U.S. electric vehicle battery factories. This would essentially ensure that workers there would be represented by the union.\n\nAll but one of these plants are joint ventures with Korean battery makers. GM has agreed to this, but the other companies have balked, saying their joint venture partners must also agree.\n\nGM CEO Mary Barra said Tuesday that the offer to bring the battery plants into the master union agreement was still open but that they would have to meet what she called “benchmark economics and also operating flexibility.”\n\nHaving union representation at the battery factories is a vital issue for the union because these plants will house many of the jobs of the future as the industry transitions away from gasoline vehicles. Workers who now make engines and transmissions at all three companies will need places to work as their plants are phased out.\n\nProgress in the contract talks follows statements from Ford executives in the past two weeks that their offers, which exceeded those of their competitors, are at the limit of how much the company is willing to pay to settle the strikes.\n\nAll three companies have said they don’t want to absorb labor costs that are so high that they would force price increases and make their vehicles more expensive than those made by nonunion companies such as Tesla and Toyota.\n\nFain has argued that the companies are making billions in profits and can afford to pay the workers more.", "link": "https://finance.yahoo.com/news/uaw-appears-moving-toward-potential-172308593.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.99, "neg": 0.043, "neu": 0.878, "pos": 0.079}}, {"date": "2023-10-25T16:00:00+00:00", "title": "GM’s Chevy Blazer EV Is a Winner, but No Victory Lap Until the Strike Is Over", "content": "MotorTrend named the all-electric Chevy Blazer the SUV of the year. GM needed a hit electric vehicle.\n\nContinue reading", "link": "https://finance.yahoo.com/m/eb938065-7b1a-309a-ba60-f6bb6e2ba011/gm%E2%80%99s-chevy-blazer-ev-is-a.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-10-25T14:05:00+00:00", "title": "Auto Stocks' Q3 Earnings Lineup for Oct 26: F, HOG &amp; More", "content": "The third-quarter earnings season for the Auto-Tires-Trucks sector began on Oct 18. So far, four S&P 500 sector components — Tesla, Genuine Parts, PACCAR and General Motors — have reported quarterly numbers. While Genuine Parts, PACCAR and General Motors managed to pull off an earnings beat, Tesla’s 10 consecutive quarter-long beat streak snapped as it reported lower-than-expected earnings for the third quarter of 2023.\n\nPer the latest Earnings Trend report dated Oct 18, the auto sector’s earnings for the third quarter of 2023 are expected to decline 12.2% on a year-over-year basis. Revenues are estimated to rise 5.8% year over year.\n\nFord F, Harley-Davidson HOG, LKQ Corp LKQ, Oshkosh Corp OSK and Lear Corp LEA are some of the auto stocks lined up to report tomorrow. Before checking the key projections for these stocks, let's take a look at the general factors that are likely to shape the companies’ upcoming results.\n\nThings to Note\n\nPer Automotive News, U.S. light vehicle sales in the third quarter of 2023 topped 3.8 million units, up 17% year over year, thanks to improving retail inventories and strong fleet shipments. The seasonally adjusted annualized sales rate for September 2023 was 15.2-15.5 million vehicles, up from 13.7 million vehicles a year earlier, per GlobalData.\n\nAt the beginning of September, U.S. inventories had 2.2 million vehicles, representing an increase of approximately 813,000 cars and light trucks compared to September 2022, according to Cox Automotive. This marked a 60% increase from the year-ago levels and the highest new-vehicle inventory since early 2021.\n\nThe generous incentives offered by automakers are expected to have played a crucial role in boosting retail deliveries in the third quarter of 2023, offsetting the impact of high interest rates. However, discounts might have impacted margins. Also, commodity costs, forex woes, tough labor market and logistical challenges are likely to have played spoilsport. Moreover, high operating expenses, including R&D to develop technologically advanced products to adapt to the changing dynamics of the auto industry, are expected to have dented earnings.\n\nStory continues\n\nKey Releases on Oct 26\n\nFord: This legacy automaker surpassed earnings estimates in the last reported quarter on higher-than-expected automotive revenues. Over the trailing four quarters, Ford topped earnings estimates on two occasions for as many misses, with the average surprise being 20.1%. This is depicted in the graph below:\n\nFord Motor Company Price and EPS Surprise Ford Motor Company Price and EPS Surprise\n\nFord Motor Company price-eps-surprise | Ford Motor Company Quote\n\nOur proprietary model clearly indicates that a company needs to have the right combination of two key ingredients — a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) — to increase the odds of an earnings beat. You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nOur proven model predicts an earnings beat for Ford this earnings season. This is because it has an Earnings ESP of +14.57% and a Zacks Rank #3. You can uncover the best stocks to buy or sell before they’re reported with our Earnings ESP Filter.\n\nThe Zacks Consensus Estimate for the company’s third-quarter earnings is pegged at 40 cents per share. F is set to report quarterly results after the closing bell.\n\nFord saw its U.S. sales increase 7.7% year over year to 500,504 units. Sales of hybrid vehicles, ICE and EVs in the United States came in at 34,861, 444,681 and 20,962 units, up 41.4%, 5.4% and 14.8%, respectively, on a yearly basis. Our estimate for global wholesale shipments of Ford Blue, Ford Model e and Ford Pro segments is pegged at 750,000, 43,000 and 382,000 units, implying a year-over-year uptick of 1.2%, 73.8% and 19%, respectively.\n\nOur forecast for third-quarter Ford Blue and Ford Pro adjusted EBIT implies an uptick of 6.2% and a whopping 370.1% on a year-over-year basis. However, we expect the Model e segment to incur an operating loss of $1.43 billion amid high costs.\n\nHarley-Davidson: This iconic motorcycle manufacturer missed earnings estimates in the last reported quarter on lower-than-anticipated revenues from the Motorcycles & Related Products. HOG surpassed the Zacks Consensus Estimate for earnings in three of the trailing four quarters and missed in the other, with the average surprise being 221.7%. This is depicted in the graph below:\n\nHarley-Davidson, Inc. Price and EPS Surprise Harley-Davidson, Inc. Price and EPS Surprise\n\nHarley-Davidson, Inc. price-eps-surprise | Harley-Davidson, Inc. Quote\n\nOur model predicts an earnings beat for Harley-Davidson this time around as it carries a Zacks Rank #3 and has an Earnings ESP of +1.68%. The Zacks Consensus Estimate for third-quarter earnings is pegged at $1.39 a share. HOG will unveil results before market open.\n\nHarley-Davidson is likely to have benefited from the Hardwire strategic plan, which aims at growth through refreshed product offerings. Our estimate for HOG’s revenues from the Motorcycles and Related Products segment — which constitutes the bulk of the firm’s overall revenues — is pegged at $1,362 million for the September-ended quarter, suggesting an increase from $1,205.2 million recorded in the second quarter of 2023. Our forecast for revenues from Financial Services is pegged at $202 million, suggesting a fall from $240 million generated in the second quarter of 2023.\n\nWe project operating profit from the HDMC segment to come in at around $220 million, suggesting an increase from $194.3 million generated in the last reported quarter. Our model estimate for operating profit from the HDFS segment is $60 million, compared with $59 million recorded in the second quarter of 2023.\n\nLKQ: This automotive replacement parts provider posted an earnings beat in the last reported quarter due to better-than-expected revenues from Wholesale North American and European segments. LKQ surpassed the Zacks Consensus Estimate for earnings in three of the trailing four quarters and missed once, with the average surprise being 1.53%. This is depicted in the graph below:\n\nLKQ Corporation Price and EPS Surprise LKQ Corporation Price and EPS Surprise\n\nLKQ Corporation price-eps-surprise | LKQ Corporation Quote\n\nOur model does not conclusively predict an earnings beat for LKQ this time around, as it carries a Zacks Rank #3 and an Earnings ESP of 0.00%. The Zacks Consensus Estimate for third-quarter earnings is pegged at 95 cents a share. LKQ will unveil results before market open.\n\nIn 2023, the average age of a new vehicle in the United States rose to 12.5 years, up from 12.2 years in 2022. Ageing vehicles are likely to have boosted demand for LKQ’s products. However, LKQ is witnessing supply chain disruptions, which might have resulted in product scarcity and freight delays. Problems related to freight costs and container capacity constraints are expected to have played spoilsport in the third quarter.\n\nOur estimate for quarterly revenues from parts and services in Europe is pegged at $1,533.8 million, suggesting a rise from $1,376 million recorded in the prior-year quarter. We expect third-quarter revenues from parts and services in the North America unit to be $1,255 million, indicating a rise from $1,026 million recorded in the prior-year period. However, we expect quarterly revenues from parts and services in the Specialty segment to be $402.7 million, implying a decline from $452 million reported in the prior-year quarter.\n\nOshkosh: The automotive equipment provider posted an earnings beat in the last reported quarter on high operating margins in the Access and Vocational segments. OSK surpassed the Zacks Consensus Estimate for earnings in two of the trailing four quarters for as many misses, with the average surprise being 27.45%. This is depicted in the graph below:\n\nOshkosh Corporation Price and EPS Surprise Oshkosh Corporation Price and EPS Surprise\n\nOshkosh Corporation price-eps-surprise | Oshkosh Corporation Quote\n\nOur model predicts an earnings beat for OSK this earnings season, as it has a Zacks Rank #3 and an Earnings ESP of +8.24%. The Zacks Consensus Estimate for third-quarter earnings is pegged at $2.18 a share. Oshkosh will unveil results before the opening bell.\n\nStrategic acquisitions like Pratt Miller, CartSeeker Technology, JBT's AeroTech business and Hinowa coupled with investment in Robotics are likely to boost the to-be-reported quarter’s results. Frequent business wins and a comprehensive offering of innovative new products are expected to aid Oshkosh’s upcoming results.\n\nFor third-quarter 2023, we estimate Access Equipment revenues — which form more than 50% of the total revenues — to be around $1,273.4 million, implying an uptick of 22.7% from the year-ago period. Our forecast for the segment’s operating profit is $182.3 million, suggesting growth of 48% on a yearly basis. Profits from Defense and Vocational segments are also estimated to rise year over year, thereby boosting OSK’s overall third-quarter earnings.\n\nLear: This manufacturer of automotive seating and electronic systems posted an earnings beat in the last reported quarter on higher-than-expected revenues and profits across both segments. LEA surpassed the Zacks Consensus Estimate of earnings in the trailing four quarters, with the average surprise being 8.07%. This is depicted in the graph below:\n\nLear Corporation Price and EPS Surprise Lear Corporation Price and EPS Surprise\n\nLear Corporation price-eps-surprise | Lear Corporation Quote\n\nAccording to our model, it seems Lear is poised to maintain its beat streak this earnings season as well. The company has a Zacks Rank #3 and an Earnings ESP of +2.63%. The Zacks Consensus Estimate for third-quarter earnings is pegged at $2.56 a share. Lear will unveil results before the opening bell.\n\nLear is riding high on acquisitions, which are set to boost its upcoming results. The buyout of M&N Plastics has increased vertical integration in Lear’s E-Systems unit. The Kongsberg acquisition has strengthened Lear’s Seating business. The acquisition of Xevo has enhanced Lear’s capabilities in software, services and data analytics. The buyout of IGB has further expanded Lear’s product offerings in the growing thermal comfort solutions market.\n\nRising consumer demand for vehicle content— requiring signal, data and power management— and increasing electrification efforts by the company bode well for the results of the to-be-reported quarter. Our estimate for quarterly revenues from the Seating segment is pegged at $4,005 million, suggesting a rise of 3% from the prior-year quarter. We expect revenues from E Systems unit for the third quarter to be $1,371 million, indicating a rise from $1,353 million recorded in the prior-year period.\n\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nHarley-Davidson, Inc. (HOG) : Free Stock Analysis Report\n\nLear Corporation (LEA) : Free Stock Analysis Report\n\nOshkosh Corporation (OSK) : Free Stock Analysis Report\n\nLKQ Corporation (LKQ) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/auto-stocks-q3-earnings-lineup-140500666.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GSPC.INDX", "HAR.F", "HAR.XETRA", "HOG.US", "LE6N.F", "LEA.US", "LKQ.US", "LKQ1.F", "OSK.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.014, "neu": 0.883, "pos": 0.104}}, {"date": "2023-10-25T13:00:22+00:00", "title": "Should You Be Worried About Ford Motor Company's (NYSE:F) 9.2% Return On Equity?", "content": "One of the best investments we can make is in our own knowledge and skill set. With that in mind, this article will work through how we can use Return On Equity (ROE) to better understand a business. We'll use ROE to examine Ford Motor Company (NYSE:F), by way of a worked example.\n\nReturn on Equity or ROE is a test of how effectively a company is growing its value and managing investors’ money. In other words, it is a profitability ratio which measures the rate of return on the capital provided by the company's shareholders.\n\nCheck out our latest analysis for Ford Motor\n\nHow Do You Calculate Return On Equity?\n\nReturn on equity can be calculated by using the formula:\n\nReturn on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity\n\nSo, based on the above formula, the ROE for Ford Motor is:\n\n9.2% = US$4.0b ÷ US$44b (Based on the trailing twelve months to June 2023).\n\nThe 'return' refers to a company's earnings over the last year. So, this means that for every $1 of its shareholder's investments, the company generates a profit of $0.09.\n\nDoes Ford Motor Have A Good ROE?\n\nOne simple way to determine if a company has a good return on equity is to compare it to the average for its industry. The limitation of this approach is that some companies are quite different from others, even within the same industry classification. As is clear from the image below, Ford Motor has a lower ROE than the average (15%) in the Auto industry. roe\n\nThat's not what we like to see. However, a low ROE is not always bad. If the company's debt levels are moderate to low, then there's still a chance that returns can be improved via the use of financial leverage. A company with high debt levels and low ROE is a combination we like to avoid given the risk involved.  Our risks dashboard should have the 3 risks we have identified for Ford Motor.\n\nHow Does Debt Impact ROE?\n\nVirtually all companies need money to invest in the business, to grow profits. That cash can come from issuing shares, retained earnings, or debt. In the first two cases, the ROE will capture this use of capital to grow. In the latter case, the debt required for growth will boost returns, but will not impact the shareholders' equity. Thus the use of debt can improve ROE, albeit along with extra risk in the case of stormy weather, metaphorically speaking.\n\nStory continues\n\nCombining Ford Motor's Debt And Its 9.2% Return On Equity\n\nIt appears that Ford Motor makes extensive use of debt to improve its returns, because it has an alarmingly high debt to equity ratio of 3.28. Most investors would need a low share price to be interested in a company with low ROE and high debt to equity.\n\nConclusion\n\nReturn on equity is a useful indicator of the ability of a business to generate profits and return them to shareholders. Companies that can achieve high returns on equity without too much debt are generally of good quality. All else being equal, a higher ROE is better.\n\nBut ROE is just one piece of a bigger puzzle, since high quality businesses often trade on high multiples of earnings. It is important to consider other factors, such as future profit growth -- and how much investment is required going forward. So I think it may be worth checking this freereport on analyst forecasts for the company.\n\nOf course, you might find a fantastic investment by looking elsewhere. So take a peek at this  free list of interesting companies.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.", "link": "https://finance.yahoo.com/news/worried-ford-motor-companys-nyse-130022843.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.989, "neg": 0.073, "neu": 0.807, "pos": 0.12}}, {"date": "2023-10-25T12:34:00+00:00", "title": "Is a Surprise Coming for Ford (F) This Earnings Season?", "content": "Investors are always looking for stocks that are poised to beat at earnings season and Ford Motor Company F may be one such company. The firm has earnings coming up pretty soon, and events are shaping up quite nicely for their report.\r\n\r\nThat is because Ford is seeing favorable earnings estimate revision activity as of late, which is generally a precursor to an earnings beat. After all, analysts raising estimates right before earnings — with the most up-to-date information possible — is a pretty good indicator of some favorable trends underneath the surface for F in this report.\r\n\r\nIn fact, the Most Accurate Estimate for the current quarter is currently at 46 cents per share for F, compared to a broader Zacks Consensus Estimate of 40 cents per share. This suggests that analysts have very recently bumped up their estimates for F, giving the stock a Zacks Earnings ESP of +14.57% heading into earnings season.\n\nFord Motor Company Price and EPS Surprise Ford Motor Company Price and EPS Surprise\n\nFord Motor Company price-eps-surprise | Ford Motor Company Quote\n\nWhy is this Important?\n\nA positive reading for the Zacks Earnings ESP has proven to be very powerful in producing both positive surprises, and outperforming the market. Our recent 10-year backtest shows that stocks that have a positive Earnings ESP and a Zacks Rank #3 (Hold) or better show a positive surprise nearly 70% of the time, and have returned over 28% on average in annual returns (see more Top Earnings ESP stocks here).\r\n\r\nGiven that F has a Zacks Rank #3 and an ESP in positive territory, investors might want to consider this stock ahead of earnings. You can see the complete list of today’s Zacks #1 Rank (Strong Buy) stocks here.\r\n\r\nClearly, recent earnings estimate revisions suggest that good things are ahead for Ford, and that a beat might be in the cards for the upcoming report.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nStory continues\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/surprise-coming-ford-f-earnings-123400519.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.997, "neg": 0, "neu": 0.813, "pos": 0.187}}, {"date": "2023-10-25T06:40:59+00:00", "title": "10 Fastest Growing Auto Stocks to Buy", "content": "In this article, we discuss the 10 fastest-growing auto stocks to buy. To skip the latest news and detailed analysis around the auto industry, go directly to the 5 Fastest Growing Auto Stocks to Buy.\n\nOver the last few years, the automotive industry has gone through significant changes, such as the increasing demand of electric vehicles (EVs) and the increased spending on autonomous vehicle research and deployment. However, these days, the latest strike by the United Auto Workers (UAW) is the hottest topic in the auto industry. The union is targeting Ford Motor Company (NYSE:F), General Motors Company (NYSE:GM), and Stellantis N.V. (NYSE:STLA) and its primary demand is a 40% wage hike with a 20% immediate increase. According to Wells Fargo analysts, the increase in demanded salaries and wages would “add an estimated $700 million to $1.2 billion in costs to each company over the four-year life of the contract.”\n\nThe vice president of the union’s GM department said on October 20 that both parties are moving toward a tentative agreement that could possibly end the 5-week strike. It has been reported that General Motors Company (NYSE:GM) is offering a 20% raise over the next four years while Ford Motor Company (NYSE:F) offered 23%. The companies are eager to put things back to normal. General Motors Company (NYSE:GM)’s management said:\n\n\"It is time for us to finish this process, get our team members back to work and get on with the business of making GM the company that will win and provide great jobs in the U.S. for our people for decades to come.\"\n\nEven though UAW President, Shawn Fain, believes that there is “more to be won,” the union has not announced any further strikes yet. It is quite evident that these strikes are going to significantly affect the upcoming earnings reports of auto companies. However, Richard Hilgert, a Senior Equity Analyst for the automotive sector at Morningstar’s research arm, says that the auto manufacturers can still evade massive losses if the strikes don’t prolong.\n\nStory continues\n\nLatest in the Auto Industry\n\nAlthough the electrification of vehicles and autonomous vehicle technologies aren’t that new, their demand and sales have certainly surged remarkably in the last few years. According to our previous report, the autonomous vehicle industry is expected to increase at a compound annual growth rate (CAGR) of over 40% between 2021 and 2030. Some major companies that have introduced self-driving cars include Amazon.com, Inc. (NASDAQ:AMZN), Alphabet Inc. (NASDAQ:GOOGL), and NVIDIA Corporation (NASDAQ:NVDA). Moreover, Honda Motor Co., Ltd. (NYSE:HMC) and General Motors Company (NYSE:GM), in a joint venture with GM’s subsidiary, Cruise, are planning to start a self-driving taxi service in Japan in 2026.\n\nCompared to autonomous vehicles, EV adoption has been notably faster and EV stocks have been some of the fastest-growing vehicles stocks in 2023. In 2022, the number of alternative energy vehicles sold crossed 10 million, showing a 54% year-over-year (YoY) increase. In 2023, the International Energy Agency (IEA) believes that this number could reach 14 million.\n\nThe companies that are currently dominating the EV market include Tesla Inc (NASDAQ:TSLA) and BYD Company Limited (OTC:BYDDY). Nevertheless, automotive giants such as General Motors Company (NYSE:GM), Toyota Motor Corporation (NYSE:TM), and Stellantis N.V. (NYSE:STLA) have also started to invest heavily in the sector. In fact, Stellantis N.V. (NYSE:STLA) has already captured a noteworthy market share of the industry and is one of the top ten EV manufacturers in the world.\n\nDespite the recent events that put a bearish light on the automotive industry, it still is poised for growth in the future. Analysts believe that the total vehicle sales will surpass 69 million units in 2023, and reach around 74 million in 2024. For the current year, some of the fastest-growing automotive stocks include Modine Manufacturing Company (NYSE:MOD), Carvana Co. (NYSE:CVNA), and Li Auto Inc. (NASDAQ:LI). Fastest Growing Auto Stocks to Buy\n\nA wide view of a large auto dealership, its showroom packed with different types of cars. Editorial photo for a financial news article. 8k. --ar 16:9\n\nOur Methodology\n\nFor this article, we made a list of companies whose main source of revenue was related to the auto industry, including auto parts and used car sales. After that, we chose the fastest-growing auto stocks according to the 1-year growth in their stock price. We only chose the stocks that are either traded on NYSE or NASDAQ. We also skipped the stocks with a market cap below $2 billion or a stock price of under $5 as of October 20, due to the high volatility of small-cap and penny stocks.\n\nWe listed the companies according in an ascending order of their stock price growth percentage as of October 20.\n\n10 Fastest Growing Auto Stocks to Buy\n\n10. Toyota Motor Corporation (NYSE:TM)\n\n1-year stock price growth as of October 20: 28.75%\n\nToyota Motor Corporation (NYSE:TM) is one of the biggest automotive manufacturers in the world and achieved this status in 2008. The company manufactures cars, trucks, hybrids, minivans, and more and they are sold in 170 countries and territories.\n\nIn Q2, hedge funds were substantially more bullish on the company stock as 13 hedge funds owned Toyota Motor Corporation (NYSE:TM)’s stock, compared to 7 in the previous quarter.\n\nThe Japanese automaker experienced a good month in September in the U.S. sales-wise as the total vehicle sales saw a 13.9% YoY increase at 203,904 units sold while Q3 sales figures showed a 12.2% YoY growth with 590,296 units sold.\n\nTo catch up with its rivals, Toyota Motor Corporation (NYSE:TM) announced a deal with Idemitsu Kosan (OTCPK:IDKOY) on October 12 for the production of solid-state batteries to bring about innovation for the future of electric vehicles. The automotive giant expects massive-scale production of solid-state batteries to start around 2027 or 2028.\n\nToyota Motor Corporation (NYSE:TM) is one of the fastest-growing auto stocks to buy along with Modine Manufacturing Company (NYSE:MOD), Carvana Co. (NYSE:CVNA), and Li Auto Inc. (NASDAQ:LI).\n\n9. PACCAR Inc (NASDAQ:PCAR)\n\n1-year stock price growth as of October 20: 32.97%\n\nPACCAR Inc (NASDAQ:PCAR) is a Washington-based multinational automotive company that is famous for designing and manufacturing trucks. The company also operates a parts division called PACCAR Parts, and a financial services division called PACCAR Financial and produces and distributes industrial winches under the names of Braden, Carco, and Gearmatic. Meanwhile, it sells its vehicles under the brand names, Kenworth, Peterbilt, and DAF. With a 1-year stock price growth of 32.97%, PACCAR Inc (NASDAQ:PCAR) takes the 9th spot on our list of fastest-growing auto stocks.\n\nIn Q2, 37 out of 910 elite hedge funds tracked by Insider Monkey were bullish on PACCAR Inc (NASDAQ:PCAR) with a total stake worth $951 million. Among them, Ken Griffin’s Citadel Investment Group increased its holding in the company by 13% and owned nearly 3.825 million company shares worth $319.95 million, making it the biggest stakeholder in the company.\n\nOn October 16, JP Morgan analyst Tami Zakaria maintained an Overweight rating on PACCAR Inc (NASDAQ:PCAR)’s stock and raised its price target to $105 from $97.\n\nMadison Investments mentioned PACCAR Inc (NASDAQ:PCAR) in its second quarter 2023 investor letter. Here is what it said:\n\n“In the second quarter, the top five contributors to performance were Alphabet, Copart, Alcon, Parker-Hannifin, and PACCAR Inc (NASDAQ:PCAR). At truck manufacturer PACCAR, operating margins remain strong, supported by new truck models, improved manufacturing efficiency, and a growing aftermarket parts division.”\n\n8. Stellantis N.V. (NYSE:STLA)\n\n1-year stock price growth as of October 20: 40.79%\n\nStellantis N.V. (NYSE:STLA) is a well-known car manufacturer that came into being as a result of a merger between the Italian-American giant, Fiat Chrysler Automobiles (FCA) and the French PSA Group. One of the fastest-growing automotive stocks, Stellantis N.V. (NYSE:STLA) sells automobiles under various brands, including but not limited to, Alfa Romeo, Citroën, Dodge, Fiat, Jeep, Chrysler, and Vauxhall. It distributes accessories, parts, and related services through its brand, Mopar while its Spoticar brand is responsible for selling used cars.\n\nIn Q2, Stellantis N.V. (NYSE:STLA) expanded its portfolio by making multiple massive investments. On October 5, the company announced that it made a $90 million investment in Argentina Lithium & Energy Corp. (OTCQB:PNXLF), acquiring a nearly 20% stake. On October 11, the company made an investment in McEwen Copper Inc., a subsidiary of McEwen Mining Inc. (NYSE:MUX), of 42 billion Argentinian pesos (1 ARS = $0.0029) and this was in addition to its ARS 30 billion investment that it made in February 2023. Lastly, on October 19, it was reported that Stellantis N.V. (NYSE:STLA) purchased 12.3 million shares of Archer Aviation (NYSE:ACHR) for $5.68 per share and now owns a total of 31.04 million shares of the company.\n\nStellantis N.V. (NYSE:STLA) was mentioned in Miller Value Partners’ second-quarter 2023 investor letter. Here is what it said:\n\n“We initiated a starter position in Stellantis N.V. (NYSE:STLA), which makes Jeep, Dodge and Fiat cars. The company has a nearly 8% dividend yield with enough net cash (cash minus debt) on the balance sheet to cover the dividend for almost five years. The company trades at 1.7x operating profits, which means the market is already expecting a likely drop in cash flow. Still, the shares appear to be worth meaningfully more than where they trade, and management is heavily aligned with stockholders with a 14% stake. They share our view that the valuation is compelling, as the company plans on repurchasing ~3% of shares outstanding this year.”\n\n7. Honda Motor Co., Ltd. (NYSE:HMC)\n\n1-year stock price growth as of October 20: 47.28%\n\nHonda Motor Co., Ltd. (NYSE:HMC) is a Tokyo-based automotive corporation that is famous for producing motorcycles and automobiles while also selling power products. It is one of the fastest-growing car stocks and has a foothold in North America, Europe, the Middle East, Africa, and Asia.\n\nEarlier in 2023, Honda Motor Co., Ltd. (NYSE:HMC) announced its plan to go full electric by 2040 and has been taking steps to fulfill that goal. The sales of the company’s new EV models are set to be in 2024 in the U.S. and Japan. On September 28, it announced that it will be collaborating with EVgo Inc. (NASDAQ:EVGO) to provide various perks to eligible Honda and Acura EV drivers like access to EVgo’s 900 public fast charging locations, charging credit, and more. Furthering its efforts to achieve its goal, on October 12, Honda Motor Co., Ltd. (NYSE:HMC) announced a partnership with Mitsubishi UFJ Financial Group, Inc. (NYSE:MUFG) to monitor and improve energy management by optimizing the usage of Honda Motor Co., Ltd. (NYSE:HMC)’s mini-EV model battery.\n\nHonda Motor Co., Ltd. (NYSE:HMC) did exceptionally well in the U.S. as it sold more than 115,000 units in September and 339,143 vehicles in Q3, marking a growth of 45.5% YoY and 52.7%, respectively.\n\nClearBridge Investments mentioned Honda Motor Co., Ltd. (NYSE:HMC) in its fourth quarter 2022 investor letter. Here is what it said:\n\n“We elected to exit Honda Motor Co., Ltd. (NYSE:HMC), a manufacturer of cars, motorcycles, general-purpose engines, and a range of other power products in the consumer discretionary sector. The company has struggled to make progress in improving its recent mediocre sales trends while its current plan for transitioning to electric vehicles and motors is less compelling than its more transparent peers. Given the risk of the Japanese yen strengthening as yet another headwind to the company’s intermediate performance, we elected to close the position in favor of other opportunities.”\n\n6. Allison Transmission Holdings, Inc. (NYSE:ALSN)\n\n1-year stock price growth as of October 20: 48.48%\n\nAllison Transmission Holdings, Inc. (NYSE:ALSN) is an Indiana-based company that manufactures automatic transmissions and hybrid propulsion systems. The company’s primary clients are vehicle manufacturers but its products are used across several sectors, including construction and military. Most recently, Allison Transmission Holdings, Inc. (NYSE:ALSN) announced that it will provide propulsion solutions for the Hanwha Defense System’s infantry fighting vehicle, Redback. The Redback was selected for Australia’s latest armored vehicle project.\n\nIn the second quarter, 33 out of 910 elite hedge funds tracked by Insider Monkey held a stake in Allison Transmission Holdings, Inc. (NYSE:ALSN), up from 26 in the first quarter. AQR Capital Management was the company’s most prominent hedge fund holder in Q2 with over 3.3 million shares worth nearly $188.499 million.\n\nModine Manufacturing Company (NYSE:MOD), Carvana Co. (NYSE:CVNA), and Li Auto Inc. (NASDAQ:LI) are some of the fastest-growing auto stocks to buy along with Allison Transmission Holdings, Inc. (NYSE:ALSN).\n\nClick to continue reading and see the 5 Fastest Growing Auto Stocks to Buy.\n\nSuggested articles:\n\n20 Most Geographically Diverse Countries In The World 11 Best Low-Risk Dividend Stocks To Invest In Top 20 Most Fit Cities in the US\n\nDisclosure. None. 10 Fastest Growing Auto Stocks to Buy is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/10-fastest-growing-auto-stocks-064059010.html", "symbols": ["1A7.F", "8GM.F", "8TI.F", "ACHR.US", "ALSN.US", "AMZN.US", "CV0.F", "CVNA.US", "EVGO.US", "F.US", "GM.MX", "GM.US", "GMCO34.SA", "GOOGL.US", "HDMA.F", "HMC.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.015, "neu": 0.893, "pos": 0.092}}]