[{"date": "2023-06-06T19:47:26+00:00", "title": "Bozeman has a proving curve at C.H. Robinson", "content": "Dave Bozeman faces a big challenge (Photo: Ford)\n\nThe selection of David Bozeman as the new CEO of C.H. Robinson Worldwide Inc. came as a surprise to most people. It may have come as a surprise to some on the company’s 11-person board as well. Typically, a news release announcing such a move will specify if the board’s decision was unanimous. That didn’t happen here.\n\nGoing into last week, the consensus was that former UPS Inc. (NYSE: UPS) COO Jim Barber, who sits on Robinson’s (NASDAQ: CHRW) board, was the odds-on favorite for the job. That a decision had not been made led some to believe that Barber’s IT chops weren’t what the Robinson board was looking for.\n\nBozeman, who starts June 26, lacks C-level experience, a factor that concerned Ken Hoexter, an analyst at Bank of America Securities. For a “company in transition” like Robinson, which has struggled in recent quarters, especially at its freight forwarding unit, a “longer learning curve of a C-level position could be an overhang on turnaround timing,” Hoexter wrote prior to the announcement.\n\nAnother question will be whether Bozeman has the skill sets such as in freight forwarding, ocean freight and third-party logistics required for such a demanding job. Without any C-level experience, Bozeman has never had to identify and execute strategies to turn around a company. He does have significant supply chain experience, however.\n\nBozeman joins Robinson from Ford Motor Co., (NYSE: F) where he spent less than a year as vice president of its customer service division. He also spent five years as vice president of transportation services at Amazon.com Inc., (NASDAQ: AMZN) where he built the e-commerce giant’s middle-mile delivery network, as well as lengthy stints at Caterpillar Inc. (NYSE: CAT) and Harley-Davidson Co. (NYSE: HOG).\n\nHe is also an outsider, a fact that may have weighed in his favor.\n\nBascome Majors, an analyst at Susquehanna International Group, was a more sanguine observer. “Today, Dave lacks name recognition with most transport investors,” which might have explained the steep (6.4%) dive that shares took on Monday, he wrote. “That said, we think only a clear ‘slash and burn’ hire would have driven a short-term pop, and Mr. Bozeman’s resume doesn’t fit that narrative (on paper at least).\n\n“Longer-term, his skill set of managing global teams at customer-focused organizations, including at Amazon’s complex transportation & supply chain operation, could help Dave earn the trust of CHRW’s employees and investors, like another former Ford executive (Joe Hinrichs) is doing today at CSX (NYSE: CSX).”\n\nJason H Seidl, analyst at Cowen & Co., said in a Tuesday note that Bozeman’s tenure at Amazon was the key reason he got the job. “We believe his time spent at the home delivery giant could potentially serve CHRW’s digital brokerage platform well,” he wrote.\n\nBrittain Ladd, a longtime logistics executive, was cautiously optimistic about the move. “I’m amazed at how many people have reached out to me to question the selection of David. A lot of people don’t understand that a VP of transportation at Amazon has a tremendous amount of responsibility, certainly more responsibility than the average VP of transportation. David is credited with driving a lot of changes at Amazon and he was highly respected.\n\n“David can be successful in the role as long as he surrounds himself with the best executives he can hire from Amazon, DB Schenker, DSV and certainly Amazon. David has to own the role of CEO. I believe he will have no choice but to terminate board members [and] to bring in board members who want the company to grow and take risks,” Ladd said.\n\nThe outspoken Ladd said Robinson under Bozeman “should absolutely go after an acquisition of DSV or at a minimum, acquire Uber Freight.”\n\nIn addition, Bozeman should contact Capgemini Invent, Deloitte or the Boston Consulting Group and have them conduct an independent review of Robinson’s operations and technology; determine future technology needs and optimal organizational structure; identify acquisition opportunities and which parts of the business to divest if any; and design the optimal go-forward strategy for the company, Ladd said.\n\n“If Bozeman doesn’t do this, he will be in a situation where C.H. Robinson executives will do their best to protect their pet projects and fiefdoms. Bozeman needs an independent assessment of the company and a strategy that he can drive using a team he can trust,” he said.\n\nThe post Bozeman has a proving curve at C.H. Robinson appeared first on FreightWaves.", "link": "https://finance.yahoo.com/news/bozeman-proving-curve-c-h-194726325.html", "symbols": ["AMZ.F", "AMZ.XETRA", "AMZN.MX", "AMZN.US", "AMZO34.SA", "CAT.US", "CH1A.F", "CHRW.US", "CSX.US", "F.US", "HOG.US", "UPS.US"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.006, "neu": 0.899, "pos": 0.095}}, {"date": "2023-06-06T19:01:24+00:00", "title": "7 Cheap Lithium Stocks to Buy for Massive Upside", "content": "With the world going green, we need as much lithium as possible. Unfortunately, there may not be enough of it to go around, creating opportunities for cheap lithium stocks. In fact, that’s what Stellantis CEO Carlos Tavares just said: “We know that we need lithium. We know that we are not producing as much as we need. We have right now 1.3 billion cars (that are) internal combustion engines powered on the planet. We need to replace that with clean mobility. That will need a lot of lithium. Not only the lithium may not be enough, but the concentration of the mining of lithium may create other geopolitical issues,” he said, as quoted by The Detroit News.\n\nIt’s why automakers like Ford (NYSE:F), Tesla (NASDAQ:TSLA), and General Motors (NYSE:GM) are racing to put together lithium deals to secure supply. That’s because even they know supply may not meet surging demand, especially when the world wants to put millions of electric vehicles on the roads.\n\nThat being said, here are seven cheap lithium stocks to consider now.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nCheap Lithium Stocks: Albemarle (ALB) Albemarle (ALB) logo on a mobile phone screen\n\nSource: IgorGolovniov/Shutterstock.com\n\nThe last time I spoke about the industry’s 800 lb. gorilla Albemarle (NYSE:ALB), it traded at $180 on May 5. It would test $220 shortly after. Now, at $195.54, I strongly believe the stock could see another strong rebound on a tight lithium supply story. Better, as we wait for ALB to recover, we can collect its current 0.82% yield.\n\nHelping, the ALB stock was just upgraded to a buy rating at UBS, with a price target of $225. According to UBS, the pullback creates a good entry point. Analysts at Baird also upgraded the ALB stock to a buy rating from hold, with a price target of $288 from $222. That’s because lithium demand isn’t showing any clear signs of slowing down.\n\nEven better, Albemarle just announced a definitive agreement with Ford to deliver battery-grade lithium, which could lead to the development of about three million Ford EV batteries. Granted, Albemarle did lower its outlook for revenue and profitability this year on the heels of softer lithium prices, but even that’s showing signs of improvement. In fact, the company still expects to post respectable growth for the year, as demand for lithium – especially for electric vehicles– remains strong.\n\nLivent Corp. (LTHM) Livent Corporation logo on a phone screen. LTHM stock.\n\nSource: Ralf Liebhold / Shutterstock\n\nI last weighed in on Livent Corp. (NYSE:LTHM) on May 5. At the time, the lithium stock traded at just $22.75. It would run to $25.86 shortly after and head south with the market. However, don’t write it off just yet. It could bounce back here after finding strong support for around $23.46.\n\nBetter, the company is producing solid numbers. In fact, it just posted an EPS of 60 cents on $235.5 million in sales. The Street was only looking for 39 cents in earnings on sales of $230.2 million. Even better, LTHM raised its full-year guidance. It now expects its EBITDA to fall between $530 million and $600 million. That’s well above prior EBITDA guidance for $510 million to $530 million.\n\nAnalysts love the LTHM stock, too. KeyBanc, for example, just upgraded the stock to a buy rating from hold, with a $30 price target. Part of the reason for that is news lithium inventories in China– at the battery cell / EV OEM level — are starting to decline, as noted by Barron’s.\n\nEven better, Livent and Allkem Ltd. will combine in an all-stock $10.6 billion deal by year-end. Under the deal, Livent shareholders will receive 2.406 shares in the combined firm for each share.\n\nLithium Americas (LAC) smartphone with logo of Canadian company Lithium Americas Corp on screen\n\nSource: Wirestock Creators / Shutterstock.com\n\nAnother top lithium stock to own is Lithium Americas (NYSE:LAC). I also highlighted LAC on May 5, as it traded at $19.50 before it ran to about $23 a share. Now back to $20.05, it’s also starting to pivot higher. Eventually, LAC could see higher highs. All thanks to its Thacker Pass lithium project, where construction just started.\n\nBetter, the company just received a $650 million investment from General Motors to accelerate the project’s development. Lithium Americas is expected to make its first delivery in the second half of 2026, at which point the profits should roll in.\n\nEven better, Lithium Americas will soon split in two, which includes its North American and Argentinian business units. Lithium Argentina, for example, will focus on the company’s 44.8% interest in Caucharí-Olaroz, its 100%-owned Pastos Grandes project, and its interest in the Sal de la Puna. Meanwhile, Lithium Americas will focus on its Thacker Pass lithium project in Humboldt County, Nevada.\n\nAmplify Lithium & Battery Technology ETF (BATT) rows of lithium ion batteries\n\nSource: Lightboxx/ShutterStock.com\n\nThe Amplify Lithium & Battery Technology ETF (NYSEARCA:BATT) was another hot lithium opportunity mentioned on May 5. At the time, BATT traded at $12.25 and ran to $12.63. Now at $12.20, it’s at support dating back to March. I’d like to see BATT eventually test $13 a share.\n\nWith an expense ratio of 0.59%, the BATT ETF provides exposure to global companies deriving material revenue from developing, producing, and using lithium battery technology.\n\nGlobal X Lithium & Battery Tech ETF (LIT) numerous blue-colored batteries lithium stocks\n\nSource: Shutterstock\n\nOr, look at the Global X Lithium & Battery Tech ETF (NYSEARCA:LIT), which traded at $60 on May 5. While it would test $64, it has since pulled back to support at $61.30. From here, I’d like to see it retest $64 again.\n\nWith an expense ratio of 0.75%, the LIT ETF invests in the complete lithium cycle. Everything from mining and refining the metal through battery production. Some of its top holdings include Albemarle, TDK Corp. (OTCMKTS:TTDKY), BYD Co. (OTCMKTS:BYDDF), Tesla, Livent Corp., Piedmont Lithium (NASDAQ:PLL), and Standard Lithium (NYSEMKT:SLI).\n\nAmerican Lithium (AMLI)\n\nSource: Shutterstock\n\nAmerican Lithium Corp. (NASDAQ:AMLI) is another hot opportunity in the lithium space. Remember, with global leaders phasing out combustion engine cars for electric vehicles, we’re running short on key metals like lithium. Accordingly, prices are only set to soar with supply-demand issues likely to continue. Even better, the company just received the first of three permits from Peruvian authorities for drilling near Quelcaya, with drilling expected to start immediately.\n\nEven better, according to Simon Clarke, CEO of American Lithium, “This is a very significant development for the Company which validates recent supportive comments from the new government in Peru and enables us to target the discovery of new lithium mineralization on some of the best previously identified targets on the Macusani Plateau.”\n\nSociedad Quimica y Minera (SQM) Sociedad Quimica y Minera logo displayed on a mobile phone with the company's web page on it. SQM stock\n\nSource: madamF / Shutterstock.com\n\nOr, take a look at Sociedad Quimica y Minera (NYSE:SQM). After running from about $61 to $75, it dropped to $66.17, where it started to pivot higher. From here, I’d like to see SQM again test $75. Even better, as we wait for SQM to recover, we can collect its yield of 16.89% at the moment.\n\nSQM also just announced a long-term strategic agreement with Ford to secure the supply of high-quality lithium products for the production of electric vehicles. Plus, as noted by InvestorPlace contributor Muslim Farooque, “SQM’s financial performance has been nothing short of spectacular, with revenues rocketing from 386% over the past decade to an astounding $10.7 billion last year. This meteoric rise is because of robust growth in lithium sales.”\n\nPlus, with lithium demand very likely to increase, Chilean companies like SQM are in the hotspot. After all, the region has the world’s biggest proven lithium reserves, second to Australia.\n\nOn the date of publication, Ian Cooper did not have (either directly or indirectly) any positions in the securities mentioned. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nIan Cooper, a contributor to InvestorPlace.com, has been analyzing stocks and options for web-based advisories since 1999.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live Did Elon Musk Just Trigger a New Netscape Moment? The $1 Investment You MUST Take Advantage of Right Now The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 7 Cheap Lithium Stocks to Buy for Massive Upside appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/7-cheap-lithium-stocks-buy-190124713.html", "symbols": ["8LV.F", "ALB.US", "AMC.F", "AMLI.US", "F.US", "GM.US", "LAC.TO", "LAC.US", "LTHM.US", "PLL.US", "QYM.F", "SQM.US", "TSLA.US", "WUC1.F"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.006, "neu": 0.846, "pos": 0.148}}, {"date": "2023-06-06T18:54:00+00:00", "title": "Ford is recalling 125,000 hybrid SUVs and pickup trucks after finding a risk of engines catching fire", "content": "This is the second recall in the past month for the major American automaker.\n\nFord Motor Co. is recalling 125,322 SUVs and pickup trucks in the US, after the discovery that leaked engine fluids and fuel vapor could cause fires, according to a filing with the National Highway Traffic Safety Administration (NHTSA). The recall includes three models of the Escape SUV, the Maverick pickup, and the Lincoln Corsair luxury SUV.\n\nAll three are hybrid versions with similarly constructed engines featuring an electric motor, so the vehicle could keep running even if leaked fluids stop its engine from functioning. This elevates the risk of the engine catching fire while the car is in use, according to Ford’s filing.\n\nRead more\n\nA look back at BTS as it became the world's top-selling act Your anxiety brings 4 distinct superpowers Americans may have seen the last of big rent hikes\n\nThe recall applies to Escapes from 2020–23, Mavericks from 2022–23, and Corsairs from 2021–23.\n\nFord recalled these same models last July, after identifying a similar problem with their engines. The new recall comes after three vehicles that had received last year’s recall fix caught fire. The company said it is still developing a new recall fix.\n\nFord shares didn’t appear to be impacted by the filing, with the stock price up 2% at 2 pm Eastern time on June 6.\n\nFord has issued a high number of recalls in the past year\n\nThis recall comes just days after Ford was forced to recall 142,000 Lincoln MKC SUVs in the US, following reports of under-the-hood fires starting when the car wasn’t in use. Models from 2015–19 were affected and will be fixed with a new fuse connected to the battery’s power circuit. The NHTSA advised owners of these cars to park outside and away from structures.\n\nIn fact, Ford led all US automakers with the most recall alerts in 2022, notifying customers of an urgent safety repair 67 times. All told, 8,636,265 Ford owners got a recall notice last year, according to research by Kelley Blue Book.\n\nRelated stories:\n\nFord doesn’t think its EV business will be profitable for at least another year\n\nFord became the first US carmaker to take up Tesla’s offer to use its supercharging network\n\nFord’s EV unit lost $722 million last quarter, but it’s still cutting prices to compete with Tesla\n\nMore from Quartz\n\nThe world’s biggest banknote printer said the demand for cash hit a two-decade low Every fifth car sold worldwide this year will be electric\n\nSign up for Quartz's Newsletter. For the latest news, Facebook, Twitter and Instagram.\n\nClick here to read the full article.", "link": "https://finance.yahoo.com/news/ford-recalling-125-000-hybrid-185400636.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.825, "neg": 0.055, "neu": 0.917, "pos": 0.028}}, {"date": "2023-06-06T17:56:20+00:00", "title": "AM Radio Fights Back After Getting the Boot From Tesla and Other EVs", "content": "(Bloomberg) -- Automakers moving into an electric future are locked in a battle with broadcasters concerned about the potential loss of an aged and fading technology: AM radio.\n\nMost Read from Bloomberg\n\nPGA Tour Bows to Saudi Rival in Shock Combination With LIV Golf Ukraine Dam Blast Blamed on Russia Tips War Into New Phase SEC’s Coinbase Lawsuit Heralds Deepening US Crypto Crackdown Apple Headset Looks Sleek in Person But Battery Pack Stands Out Russia’s Dam-Busting Is Another War Crime\n\nMajor carmakers, including Tesla Inc. and BMW AG, are omitting AM tuners from electric vehicles, citing electromagnetic interference with the frequencies used by the century-old broadcasting service. AM radio is particularly susceptible to disruption because it uses frequencies like those emitted by EV systems, which can overwhelm the radio signal and make it unintelligible. FM stations operate over different wavelengths. Shielding radio reception gear can be costly and complex, especially when vehicle users can access AM signals via digital platforms.\n\nBroadcasters say AM radio deserves protection because it’s a linchpin of the US emergency information system, and remains important on a day-to-day basis for millions of listeners including rural, religious and foreign-language audiences.\n\n“When the power goes out and cell networks are down, the car radio is often the only way for people to get information, sometimes for days at a time,” Jerry Chapman, president of Woof Boom Radio, which operates three AM stations in Indiana and Ohio, said in testimony for a US House hearing on Tuesday.\n\nMore than four dozen House members have signed onto the AM Radio for Every Vehicle Act, a bill that would require all new cars and trucks to receive AM broadcast signals.\n\n“Removing AM radio receivers from vehicles means individuals may miss out on critical lifesaving updates,” said Representative Bob Latta, the Ohio Republican who chairs the communications panel that held the hearing. “We must ensure that no community’s left behind, no voice is silenced and no emergency response is compromised.”\n\nOvertones of the US partisan divide have crept into the discussion, with some zeroing in on talk radio, where conservative hosts such as Sean Hannity thrive on AM channels.\n\n“AM radio is worth keeping in our cars,” Senator Ted Cruz, a Texas Republican, tweeted last week. “Millions of Americans listen to talk radio. It’s central to our democracy and freedom of expression.”\n\nMichael Harrison, publisher of Talkers magazine, which covers the talk radio industry, said he doubted carmakers had any intention to quiet conservative voices on talk radio. But he lamented the rift in what he called a “long, symbiotic relationship.”\n\n“Radio has exalted the automobile as being mythical, and gorgeous,” Harrison said in an interview. “It’s almost a betrayal on the part of these car manufacturers to say, we’re getting rid of AM radio.’”\n\nCarmakers, their dashboards replete with FM radio, internet and satellite-radio links, can cite evidence that users prefer those media, which were unforeseen when AM commenced commercial broadcasting in 1920.\n\nAM radio was once the dominant form of audio entertainment. Until 1978, more than half of all radio listening hours were spent on the AM dial, the Federal Communications Commission said in 2015.\n\nBut by late 2022, only about 15% of people 12 and older listened to AM radio during an average week — less than half the 34% who did in 2000, according to Nielsen data provided to Bloomberg. The AM radio audience is older and whiter than FM radio’s, according to Nielsen.\n\nBroadcasters say a Nielsen survey for fall 2022 showed 82 million Americans listen to AM radio monthly.\n\nCarmakers omitting broadcast AM tuners from electric vehicles include Volvo Group, Volkswagen AG and Mazda Motor Corp., according to Senator Ed Markey, a Massachusetts Democrat who objects to excluding AM radio from cars.\n\nFord Motor Co. was originally on that list too, dropping AM radio from the F-150 Lightning pickup truck and the Mustang, saying AM listeners accounted for less than 5% of radio usage in its vehicles. But the company changed course last month and Chief Executive Officer Jim Farley said all 2024 Ford and Lincoln vehicles will include AM broadcast radio.\n\nFarley said the reversal came “after speaking with policy leaders about the importance of AM broadcast radio as a part of the emergency alert system.” He didn’t say what might happen after 2024.\n\nThe AM Radio for Every Vehicle Act would direct regulators at the National Highway Traffic Safety Administration to require automakers to maintain AM broadcast radio in new vehicles at no additional charge, bill sponsors said in a news release.\n\nBackers of the bill include the National Association of Broadcasters, which said that a 77-station emergency alert system with direct connections to US officials includes more than 60 AM stations.\n\n“Take away these stations and you’re really undoing the ability of every American to get emergency alerts,” broadcasters’ association President Curtis LeGeyt said in an interview. He said such a problem is “small right now” but added, “what does public safety look like as new vehicles proliferate?”\n\nGary Shapiro, chief executive officer of the Consumer Technology Association that includes carmakers as members, scoffed at the public-safety rationale. The collapse of alternative warning systems including mobile phones, FM radio and satellite radio is “possible but extraordinarily unlikely,” Shapiro said.\n\nElectric vehicles are a growing portion of the US market, and accounted for about 7% of new vehicle sales in the first quarter, according to Cox Automotive.\n\nA mandate requiring AM broadcast reception is “just one more thing hindering the introduction of electric cars,” Shapiro said in an interview.\n\nMost Read from Bloomberg Businessweek\n\nA $1.5 Trillion Backstop for Homebuyers Props Up Banks Instead Giorgia Meloni Seeks to Cement Power by Remaking Corporate Italy China’s BYD Is Racing Toward the Top of the Global EV Market Google’s Top Lawyer Preps for Fights Over AI and Tech ‘Censorship’ Moving Saharan Sunshine to Europe via Undersea Cables\n\n©2023 Bloomberg L.P.", "link": "https://finance.yahoo.com/news/am-radio-fights-back-getting-175620858.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.895, "neg": 0.056, "neu": 0.907, "pos": 0.037}}, {"date": "2023-06-06T15:08:40+00:00", "title": "Ford recalls 125,000 popular Maverick pickups and SUVs over fire risk", "content": "Ford’s (F) quality and reliability issues have popped up again, this time with a big recall of some of its most popular products.\n\nFord is recalling over 125,000 Ford Maverick pickups (2022-2023) and Ford Escape (2020-2023) and Lincoln Corsair (2021-2023) SUVs that are equipped with automaker’s 2.5L hybrid or plug-in hybrid engines over a risk of fire, the National Highway Traffic Safety Administration (NHTSA) reported on its website.\n\n“In the event of an engine failure, engine oil and fuel vapor may be released into the engine compartment and accumulate near ignition sources such as hot engine or exhaust components, possibly resulting in an engine compartment fire,” NHTSA said Monday.\n\nWith these two latest recalls, Ford now leads the industry with 27 separate product recalls this year, affecting more than 3.1 million vehicles, according to NHTSA’s website. Ford's new Maverick FX4 at the Chicago Auto Show earlier this year. (Photo by Scott Olson/Getty Images)\n\nFord says in NHTSA’s recall report that less than 1% of the vehicles produced with this engine may be defective. In the event of failure, the report states that the engine will “produce loud noises (example: metal-to-metal clank) audible to the vehicle’s occupants” and will also result in a reduction in engine torque, and may result in an engine fire.\n\nFord is advising owners to safely park and shut off the engine as promptly as possible upon hearing unexpected engine noises, experiencing loss of power, or if smoke emanates from the engine bay.\n\nNHTSA’s report says a fix is being developed and will be available in Q3 of this year — and owners will be notified by Ford if they are affected by the recall.\n\nFord's recall woes Ford F-150 Lightning during the 2022 New York International Auto Show. (Photo by: NDZ/STAR MAX/IPx)\n\nFord’s recall of 125,000 pickups and SUVs follows last week’s recall of approximately 142,000 Lincoln MKC SUVs, also due to fire risks. In the Lincoln MKC’s case, a battery monitor sensor may short-circuit and overheat, causing a fire in the engine bay. Lincoln MKC owners are advised to park outside and away from structures until a recall repair is completed.\n\nFord’s reliability issues have been a thorn in the side of Ford and CEO Jim Farley, who is seeking to transform the company for an electric age. A high-profile recall of its Lightning EV pickup put a damper on sales earlier this year, and Farley has said overall quality issues will take years to root out.\n\n\"Ford has been the number one in recalls in the US for the last two years,\" Farley said in February of this year. \"Clearly that's not acceptable.\"\n\n—\n\nPras Subramanian is a reporter for Yahoo Finance. You can follow him on Twitter and on Instagram.\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/ford-recalls-125000-popular-maverick-pickups-and-suvs-over-fire-risk-150840097.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": -0.953, "neg": 0.067, "neu": 0.908, "pos": 0.025}}, {"date": "2023-06-06T14:56:00+00:00", "title": "Can US Auto Sales Ride the Recovery Wave in the Rest of 2023?", "content": "The U.S. auto industry is witnessing robust recovery as it overcomes the pandemic-related challenges and capitalizes on favorable market trends. May proved to be another promising month for the U.S. automotive industry, marking the 10th consecutive monthly increase in sales, according to LMC Automotive. Deliveries of light vehicles totaled 722,000 for the seven automakers reporting monthly figures, witnessing a notable 22% rise, per Automotive News. Per Motor Intelligence, the seasonally adjusted annualized sales rate (SAAR) for May 2023 was 15.1 million vehicles, up from 12.73 million vehicles in May 2022. The recovery in inventories and the introduction of attractive incentives played a pivotal role in driving the surge.\n\nIn this article, we will examine these factors in more detail, highlight the sales figures of different automakers and discuss the outlook for the industry.\n\nImproving Inventory Levels Supporting Pent-Up Demand\n\nOne of the key drivers of U.S. auto sales growth in May was the significant improvement in inventory levels compared to a year ago, when the industry faced severe supply chain disruptions due to the COVID-19 pandemic. According to estimates from J.D. Power and LMC Automotive, retail inventory was approximately 1.3 million vehicles at the start of June, reflecting a 48% increase from a year earlier. Shoppers now have a plethora of vehicle options to choose from after limited product availability last year.\n\nCharlie Chesbrough, Cox Automotive's senior economist, said in a statement, \"Vehicle shoppers now have a much better chance of finding something that fits their needs. Pent-up demand, held back by limited product availability last year, is now being fulfilled as inventory levels improve around the country.\"\n\nThe Honda brand had a substantial inventory of 34,000 vehicles, showcasing a significant increase from the 12,000 units recorded in the prior year. Similarly, Acura witnessed a notable surge in its stock, with approximately 21,000 vehicles on hand, compared with 4,000 units reported at the beginning of June 2022.\n\nToyota ended May with a total inventory of 153,742 Toyota and Lexus models. Among these, 27,255 units were available at dealerships, while the remaining vehicles were either in ports or in transit.Ford reported a total inventory of 383,000 vehicles, which encompassed a range of models, including medium and heavy-duty trucks.\n\nIrresistible Discount Offers Fueling Sales\n\nAnother factor that boosted U.S. auto sales in May was the increase in incentives offered by some automakers and dealers to stimulate demand and entice potential buyers. According to TrueCar, the average incentive amount reached $1,931 last month, representing a 13% increase from April and a substantial 64% increase from May 2022. Automakers like General Motors GM, Ford F, Volkswagen VWAGY, Stellantis STLA and others offered sweeter incentives to buoy sales.\n\nVolkswagen witnessed a remarkable surge in incentives, which skyrocketed fourfold to a staggering $2,048 per vehicle, as reported by Motor Intelligence. Meanwhile, Jeep claimed the throne for the highest incentives, now standing at an impressive $3,428 per vehicle, nearly triple its offering from the same period last year. Other automakers like Ford, Hyundai, Buick, and Honda also experienced a significant leap in their incentive outlays.\n\nChevrolet strategically captured the attention of qualified buyers working through GM Financial by offering an alluring 1.9% financing deal on carefully selected crossovers and SUVs. Adding to the appeal, buyers were also granted a generous respite from payments for an extended period of 90 days. In a similar vein, select Stellantis dealers went the extra mile, providing customers with an unprecedented opportunity to save a remarkable sum of up to $12,000 on the iconic Jeep Grand Wagoneer.\n\nThese incentives not only provided financial benefits but also created a sense of urgency and encouraged buyers to take advantage of the deals while they last.\n\nRundown of Sales Figures of Auto Biggies\n\nFord’s U.S. sales volumes rose 10.7% in May. The Ford brand saw an increase of 12%, whereas Lincoln witnessed a decline of 14.4%. Ford brand sales have been on a consistent upward trajectory for the past six months, while Lincoln's volume has faced a decline for three consecutive months. Ford currently sports a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nHonda witnessed a significant surge in sales, with a total of 119,445 units sold, reflecting a remarkable 58.2% increase compared to the previous year. Both the Honda and Acura brands experienced impressive year-over-year growth, with sales rising 53.2% and 112.2%, respectively. Moreover, Honda's electric vehicles achieved a milestone by setting a new monthly record with more than 32,000 deliveries in May. This marked American Honda's third consecutive monthly increase after a challenging period of decline caused by severe inventory shortages as a result of tight microchip supplies and shipping difficulties.\n\nPer Automotive News, Toyota experienced a 6.4% year-over-year increase in US sales in May, reaching a total of 187,205 vehicles. The namesake brand witnessed a 3.7% rise, while Lexus saw a substantial surge of 25% in sales. Notably, light trucks played a significant role in boosting the Toyota brand, with an impressive 11% gain, which offset the 8.9% decline observed in car sales.\n\nPer Automotive News, sales of Hyundai were up 18.4% year over year. Sales of Kia grew 23.4% year over year for the month. Sales of Subaru increased 28.2%, while that of Mazda jumped 117.2%.\n\nWill the Industry Face Turbulence in 2H23?\n\nThe automotive industry has made impressive strides in its recovery but the road ahead is not without obstacles. As we approach the second half of 2023, rising interest rates and looming economic headwinds cast a shadow of uncertainty over the industry's sales momentum.\n\nIndustry experts at Cox Automotive anticipate a slowdown in the sales trajectory, cautioning that challenges lie ahead. However, it's not all doom and gloom. The silver lining comes in the form of continued higher incentives and a surge in fleet volume, which are expected to provide much-needed support to overall sales figures.\n\nS&P Global Mobility paints a cautious picture, suggesting that the current trend in volumes is likely to persist in the coming months. While there might not be any dramatic deviations, concerns about affordability loom on the horizon. These affordability issues could potentially put the brakes on further growth, presenting a critical challenge for the industry.\n\nEconomic headwinds are gathering strength, and their impact could introduce some volatility in sales in the second half of the year. Quoting Jeff Schuster, executive vice president and automotive group head at GlobalData, \"While we are still concerned that the recovery could lose momentum as pent-up demand is satisfied, there is growing optimism that the U.S. market will continue to outperform expectations through the summer months.\"\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nGeneral Motors Company (GM) : Free Stock Analysis Report\n\nVolkswagen AG Unsponsored ADR (VWAGY) : Free Stock Analysis Report\n\nStellantis N.V. (STLA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/us-auto-sales-ride-recovery-145600871.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "HDMA.F", "HMC.US", "HNDAF.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.037, "neu": 0.791, "pos": 0.173}}, {"date": "2023-06-06T14:49:00+00:00", "title": "2 Hot Domestic Auto Stocks to Harness the Industry's Tailwinds", "content": "Domestic automakers are enjoying robust recovery and growth as they overcome pandemic-related challenges and capitalize on favorable market trends. With improving inventory, incentives, and the surging popularity of EVs, the Zacks Domestic Auto Industry is well-positioned for a prosperous future. In this article, we delve into the key drivers that are propelling the U.S. auto industry to new heights and why you should not miss out on two top-ranked domestic auto stocks namely —Ford F and General Motors GM — that are riding the wave of industry strength.\n\nAbout the Industry\n\nThe Zacks Domestic Auto industry includes companies that are engaged in designing, manufacturing and retailing vehicles across the globe. These include passenger cars, crossover vehicles, sport utility vehicles, trucks, vans, motorcycles and electric vehicles. The industry — which is highly consumer cyclic and provides employment to a large number of people — is at the forefront of innovation, courtesy of its nature and the transformation that it is going through. The widespread usage of technology and rapid digitization are resulting in a fundamental restructuring of the automotive market. Several companies in the industry have engine and transmission plants and conduct research and development, and testing of electric and autonomous vehicles.\n\nKey Investing Themes\n\nImproving Inventory Levels Supporting Pent-Up Demand: With the gradual alleviation of challenges associated with new vehicle production, inventory levels are experiencing significant improvements.According to estimates from J.D. Power and LMC Automotive, retail inventory was approximately 1.3 million vehicles at the start of June, reflecting a 48% increase from the previous year. Strong production levels are expected to translate into extended days' supply, thereby providing shoppers with a greater abundance of vehicle options as we move forward.\n\nSweeter Discount Deals Fueling Sales: The increased inventories resulted in more generous incentives being offered to potential buyers. Several manufacturers, including Ford, Hyundai and General Motors among others, have witnessed a significant surge in their incentive outlays. According to TrueCar, the average incentive amount reached $1,931 last month, representing a 13% increase from April and a substantial 64% increase from May 2022. By offering generous incentives, automakers and dealers aim to stimulate demand and entice potential buyers into making a purchase. These incentives not only provide financial benefits but also create a sense of urgency and encourage buyers to take advantage of the deals while they last.\n\nRapidly Increasing EV Popularity Acts as a Vital Catalyst: The rising adoption of green vehicles driven by climate change concerns, technological advancements, and stringent fuel-emission standards is boosting the prospects of the U.S. auto industry. Electric car demand is skyrocketing and EV sales are consistently breaking records. Last year was the biggest for zero-emission vehicles in the United States. Legacy automakers are making significant efforts to establish a strong presence in the thriving e-mobility sector. The Inflation Reduction Act is set to further fuel EV sales. With the continued momentum and expected future growth, the prospects of the U.S. auto industry in the EV market are highly promising.\n\nZacks Industry Rank Indicates Solid Prospects\n\nThe Zacks Automotive – Domestic industry is an 18-stock group within the broader Zacks Auto-Tires-Trucks sector. The industry currently carries a Zacks Industry Rank #76, which places it in the top 30% of 250 Zacks industries.\n\nThe group’s Zacks Industry Rank, which is basically the average of the Zacks Rank of all the member stocks, indicates encouraging near-term prospects. Our research shows that the top 50% of the Zacks-ranked industries outperform the bottom 50% by a factor of more than 2 to 1.\n\nThe industry’s positioning in the top 50% of the Zacks-ranked industries is a result of a positive earnings outlook for the constituent companies in aggregate. Looking at the aggregate earnings estimate revisions, it appears that analysts are gaining confidence in this group’s earnings growth potential.\n\nBefore we present you two top-ranked stocks from the industry, let's take a look at the industry’s stock market performance and current valuation.\n\nIndustry Lags S&P 500 But Tops Sector\n\nThe Domestic Auto industry has underperformed the Zacks S&P 500 composite but its outperformed sector over the past year. The industry has lost 15.8% against the S&P 500’s growth of 4.1%. The sector has declined 18.9% over the said time frame.\n\nOne-Year Price Performance\n\nIndustry's Current Valuation\n\nSince automotive companies are debt-laden, it makes sense to value them based on the EV/EBITDA (Enterprise Value/Earnings before Interest Tax Depreciation and Amortization) ratio. On the basis of the trailing 12-month enterprise value to EBITDA (EV/EBITDA), the industry is currently trading at 14.80X compared with the S&P 500’s 12.99X and the sector’s 12.22X. Over the past five years, the industry has traded as high as 57.29X, as low as 8.78X and at a median of 15.31X, as the chart below shows.\n\nEV/EBITDA Ratio (Past Five Years)\n\n2 Best Stocks to Buy Now\n\nFord: It is one of the leading automakers in the nation. A strong vehicle mix supported by F-series trucks and SUV models, combined with a robust EV lineup, should drive Ford’s growth. The company has tremendous growth opportunity, particularly with highly coveted franchises such as the F-150, the new Maverick, the new Bronco, and, undoubtedly, the Mustang. Further, Ford’s ambitious rejig plan to split its EV business into a separate unit within the company is set to unlock significant growth opportunities. Ford’s target of producing over 2 million EVs by 2026-end (representing 49% CAGR over the span of 2023-2026) augurs well. The company’s high liquidity provides a solid foundation for investment in Ford+ priorities.\n\nFord currently sports a Zacks Rank #1 (Strong Buy) and has a Value Score of A. The Zacks Consensus Estimate for F’s 2023 sales implies year-over-year growth of 7.5%. The consensus mark for Ford’s 2023 and 2024 EPS has moved north by 4 cents and 3 cents, respectively, over the past seven days. Over the trailing four quarters, the stock surpassed estimates on two occasions for as many misses, the average surprise being 24.3%.\n\nPrice & Consensus: F\n\nGeneral Motors: One of the world’s largest automakers, General Motors held the largest share of the U.S. auto market at 16% in 2022.General Motors’ compelling portfolio with strong demand for its quality full-size pickups and SUVs bode well. The company’s hot-selling brands in America like Chevrolet Silverado, Equinox and GMC Sierra are driving the top line.  Encouragingly, this legacy U.S. automaker will have nine EV models in the North America market this year, which will buoy top-line growth.The company's Ultium platform and battery plants in Ohio, Tennessee and Lansing are set to scale up its e-mobility prowess. Its superior liquidity profile also instills confidence. General Motors’ strides in autonomous vehicle development also augur well for long-term growth.\n\nGM currently sports a Zacks Rank #1 and has a Value Score of A. The Zacks Consensus Estimate for General Motors’ 2023 sales implies year-over-year growth of 4.5%. The consensus mark for GM’s 2023 and 2024 EPS has moved north by 14 cents and 22 cents, respectively, over the past 30 days. Over the trailing four quarters, the stock surpassed estimates on three occasions and missed once, the average surprise being 15.5%.\n\nPrice & Consensus: GM\n\nYou can see the complete list of today’s Zacks #1 Rank stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nGeneral Motors Company (GM) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/2-hot-domestic-auto-stocks-144900065.html", "symbols": ["8GM.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "GSPC.INDX"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.014, "neu": 0.784, "pos": 0.202}}, {"date": "2023-06-06T14:43:37+00:00", "title": "Ford Motor names Whirlpool exec as new supply chain chief", "content": "(Reuters) - Ford Motor Co on Tuesday named Whirlpool Corp's Liz Door its chief supply chain officer, at a time when the automaker navigates through parts shortages and rising costs.\n\nThe appointment, effective June 12, comes as the company predicts a difficult 2023, blaming chip shortages and other supply chain issues and production instabilities.\n\nThe role had been held on an interim basis by CFO John Lawler since September.\n\nDoor till recently was Whirlpool's executive vice president of global strategic sourcing. She also served at General Motors Co as an executive in the global purchasing and supply chain organization.\n\n\"Door comes to Ford at a time when improving quality and reducing costs, including through the supply chain, are high priorities and vital to realizing the full potential of the Ford+ plan,\" The automaker said.\n\n(Reporting by Pratyush Thakur in Bengaluru; Editing by Shailesh Kuber)", "link": "https://finance.yahoo.com/news/ford-motor-names-whirlpool-exec-144337340.html", "symbols": ["600983.SHG", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "WHR.F", "WHR.US", "WHRL3.SA", "WHRL4.SA"], "tags": [], "sentiment": {"polarity": 0.052, "neg": 0.059, "neu": 0.887, "pos": 0.054}}, {"date": "2023-06-06T13:38:41+00:00", "title": "3 Cheap Small-Cap Stocks to Buy Before the Next Breakout", "content": "Some of the blue-chip stocks today started their journey as small-cap stocks years back. To make the most of a stock’s upside, you need to be able to identify companies that have the potential to go far. Of course, not all companies become great giants in the industry but it can be rewarding to watch them grow starting from cheap small cap stocks.\n\nThe reason: there’s a chance it could become a multi-bagger over the years. However, there is a certain amount of risk associated with cheap small-cap stocks and if you can take the risk, you enjoy a higher chance of a near-term upside. Inflation is cooling and the market is picking up the pace. If we can manage to avoid a recession, there is a chance that the market will lift several stocks.\n\nWith that in mind, let’s take a look at three cheap small-cap stocks to buy before the next breakout.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nCanadian Solar (CSIQ) A Canadian Solar (CSIQ) display booth at a convention in Bangkok, Thailand.\n\nSource: Shutter B Photo / Shutterstock.com\n\nWith the world moving towards a cleaner and greener future, solar stocks are a safe bet. The rising gas prices and the growing awareness of renewable energy have put Canadian Solar (NASDAQ:CSIQ) at the center stage. It has shown strong momentum lately and shares are up 30% year to date.\n\nCSIQ stock is trading at $39 today and is up 6% in the past month. It has shown consistent momentum over the past year and I believe the stock will continue moving upwards in the near term. The solar panel maker boosted its annual solar module capacity which makes it one of the largest solar panel producers. It has supply agreements with multiple companies, which contribute maximum to the revenue.\n\nRoth MKM has raised the stock’s price target to an average of $47.18 and has a buy rating after the company announced the pricing of its China IPO. One reason behind this is the future growth potential and the demand for solar. It can make the most of the clean energy boom and is positioned for solid long-term growth.\n\nSolid Power (SLDP) Smartphone with logo of American battery company Solid Power Inc. on screen in front of business website. Focus on center-left of phone display.\n\nSource: T. Schneider / Shutterstock.com\n\nAnother green energy stock, Solid Power (NASDAQ:SLDP) is slightly risky but has the potential if it handles the operations well. The company aims to deliver a safer battery option that has high energy density and will cost less than traditional lithium-ion batteries.\n\nWhile it is a penny stock, it is only suitable for high-risk investors who want to take a chance at the future of solid-state batteries. There is a 50/50 chance of the company making it big. Solid Power also has the backing of BMW (OTCMKTS:BMWYY) and Ford (NYSE:F) which shows that there is some potential in its product. It has licensed the cell design as well as the manufacturing process to BMW for research and development.\n\nSLDP stock is trading at $2.24 today and is down 25% in the past six months. The company has a negative margin and reported a quarterly loss of $0.11 per share. It is one of the cheap small-cap stocks with a 100% upside potential if all goes well.\n\ne.l.f. Beauty (ELF) a collection of various cosmetic products on a black table\n\nSource: Africa Studio/Shutterstock.com\n\ne.l.f. Beauty (NYSE: ELF) is one of the most promising small-cap stocks to own. The company makes affordable beauty products and is making news in the highly competitive beauty industry.\n\nIt has built a solid customer base through social media-driven marketing activities and investments in research and development. Yes, the stock is trading at a high and is not cheap but it has a long run. A lot depends on how the economy moves from here. Even if there is a recession, people may switch from high-priced beauty products to more affordable products that are offered by e.l.f Beauty. It is one of the cheap small-cap stocks with solid growth potential.\n\nIn the recent company earnings, it beat estimates in revenue and earnings. The company reported quarterly earnings of 0.42 per share and hit a revenue of $187.36 million. It has beaten revenue estimates in the last four quarters. The stock was up 9% after earnings beat and half a dozen analysts raised their price target on the stock. This is one of the undervalued small-cap stocks with the potential to double in the coming months.\n\nOn the date of publication, Vandita Jadeja did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nVandita Jadeja is a CPA and a freelance financial copywriter who loves to read and write about stocks. She believes in buying and holding for long term gains. Her knowledge of words and numbers helps her write clear stock analysis.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live Did Elon Musk Just Trigger a New Netscape Moment? The $1 Investment You MUST Take Advantage of Right Now The Rich Use This Income Secret (NOT Dividends) Far More Than Regular Investors\n\nThe post 3 Cheap Small-Cap Stocks to Buy Before the Next Breakout appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-cheap-small-cap-stocks-133841633.html", "symbols": ["0EF.F", "0EF.STU", "CSIQ.US", "ELF.US", "F.US", "L5A.F", "SLDP.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.031, "neu": 0.795, "pos": 0.175}}, {"date": "2023-06-06T13:11:18+00:00", "title": "C.H. Robinson confirms Bozeman to serve as CEO", "content": "C.H. Robinson has hired a Ford executive as its new CEO. (Photo: Ford)\n\nC.H. Robinson Worldwide Inc. has confirmed that David Bozeman, an executive of the Ford Motor Co., will be its next CEO.\n\nThe role is effective June 26, according to a news release.\n\nBozeman is currently vice president of the customer service division and enthusiast brands at Ford (NYSE: F). Before joining the automaker last August, Bozeman spent five-plus years as vice president of Amazon Transportation Services. Before that, he spent more than eight years in top positions at Caterpillar Inc. (NYSE: CAT) and more than 16 years at Harley-Davidson Motor Co. (NYSE: HOG).\n\nFreightWaves initially reported Bozeman’s appointment on Friday.\n\nIn a statement Tuesday, Jodee Kozlak, chairman of the board of directors of C.H. Robinson (NASDAQ: CHRW), said: “Dave is a seasoned executive who has a strong track record of reinventing complex operating models with industry-wide impact, proven expertise in global supply chain and logistics management through various economic cycles and extensive experience leading high performing teams and cultures to drive results. Dave is the right leader to take C.H. Robinson’s vision forward.”\n\nBozeman said, “It is an honor to be joining C.H. Robinson and to lead the next chapter of such an exceptional company. I look forward to working alongside a strong management team and with talented employees to deliver for our customers and accelerate the next phase of sustained growth and success.”\n\nKumar Galhotra, the president of Ford Blue, congratulated Bozeman and wished him “every success.”\n\n“Dave’s an exceptional leader and partner, and we appreciate his contributions to Ford,” Galhotra said.\n\nScott Anderson has been serving as C.H. Robinson’s interim CEO since January, when Bob Biesterfeld was let go from the role. Anderson will continue in his role until Bozeman joins the company and will also continue to serve as a member of C.H. Robinson’s board.\n\nThis is a developing story.\n\nThe post C.H. Robinson confirms Bozeman to serve as CEO appeared first on FreightWaves.", "link": "https://finance.yahoo.com/news/c-h-robinson-confirms-bozeman-131118096.html", "symbols": ["CAT.US", "CH1A.F", "CHRW.US", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "HOG.US"], "tags": [], "sentiment": {"polarity": 0.979, "neg": 0, "neu": 0.913, "pos": 0.087}}, {"date": "2023-06-06T13:04:00+00:00", "title": "General Motors (GM) Plans to Invest Over $1B in Flint Plants", "content": "General MotorsCompany GM sets forth its plans to invest over $1 billion in two of its Flint manufacturing sites, namely Flint Assembly and Flint Metal Center. GM is developing both sites for producing next-generation ICE heavy-duty trucks. This investment will consolidate General Motors’ industry-leading full-size truck business. The legendary auto manufacturer has not yet disclosed product details or the time of release for its future heavy-duty trucks.\r\n\r\nWith this announcement, GM’s U.S. manufacturing and parts distribution facility has committed more than $30.5 billion in investment since 2013.\r\n\r\nThis $1 billion investment will strengthen GM’s U.S. manufacturing operations, which include over 50 assembly, stamping, propulsion and component plants and parts distribution centers nationwide. It also underscores the automaker’s commitment to provide a strong portfolio of ICE vehicles to its customers in the future.\r\n\r\nWith the sales of 288k trucks in 2022, the automaker registered a 38% year-over-year increase in heavy-duty truck sales.\r\n\r\nGM will invest $788 million in Flint Assembly to prepare it to manufacture GM’s next-generation ICE heavy-duty trucks. Body shop building expansion, general assembly conveyor expansion and new tooling and equipment will be included in the updated plant. It will invest $233 million in Flint Metal Center for new stamping dies for GM’s next-generation ICE heavy-duty trucks, as well as press refurbishments and new equipment.\r\n\r\nIn 2023, General Motors has announced over $1.7 billion of investment in Flint region operations, including $579 million in Flint Engine Operations and $103.5 million in Davison Road Processing Center.\r\n\r\nGeneral Motors’ compelling electric vehicle and ICE portfolio and strong demand for its quality full-size pickups and full-size SUVs are bolstering its prospects. The firm’s target of achieving 12% CAGR in revenues through 2025 sparks optimism.\r\n\r\nOn the flip side, the company’s rising debt levels and macroeconomic headwinds like high commodity and logistic costs are weighing on its near-term prospects. Supply-chain disruptions (although gradually improving) still remain a concern.\n\nZacks Rank & Key Picks\n\nGM currently carries a Zacks Rank #1 (Strong Buy). You can see the complete list of today’s Zacks #1 Rank stocks here.\r\n\r\nSome other top-ranked players in the auto space are Ford Motor F, Mercedes-Benz Group AG MBGAF and Wabash National WNC, all of which carry the same rank as GM.\r\n\r\nFord is one of the leading automakers in the world. The Zacks Consensus Estimate for F’s 2023 sales implies year-over-year growth of 7.6%.\r\n\r\nMercedes-Benz develops, manufactures and sells passenger cars, including premium and luxury vehicles. The Zacks Consensus Estimate for MBGAF’s 2023 sales implies year-over-year growth of 6%.\r\n\r\nWabash is one of the leading manufacturers of semi-trailers in North America. The Zacks Consensus Estimate for WNC’s 2023 sales and earnings indicates year-over-year growth of 12% and 90.7%, respectively.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nGeneral Motors Company (GM) : Free Stock Analysis Report\n\nWabash National Corporation (WNC) : Free Stock Analysis Report\n\nMercedes-Benz Group AG (MBGAF) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/general-motors-gm-plans-invest-130400311.html", "symbols": ["8GM.F", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "WA9.F", "WNC.US"], "tags": [], "sentiment": {"polarity": 0.994, "neg": 0.012, "neu": 0.881, "pos": 0.107}}, {"date": "2023-06-06T13:02:00+00:00", "title": "5 Cheap PEG-Driven GARP Stocks to Grab Now", "content": "The investing track of the Oracle of Omaha over the past few decades shows a gradual shift from being a pure-play value investor to a GARP (growth at a reasonable price) investor. The logic behind this is the effectiveness of a mixed investment strategy over pure-play, value or growth approaches of investments.\n\nSeveral stocks, which have surged significantly in the recent past, show an overwhelming success of this hybrid investing strategy over pure-play value and growth investments. Here we will discuss the success of five such stocks. These include Ford Motor Company F, Toll Brothers Inc. TOL, Urban Outfitters Inc. URBN and Telefonica, S.A. TEF .\n\nA Few More Words on GARP\n\nThe GARP theory enables the strategic mingling of growth and value-investing principles, which gives us a hybrid strategy by utilizing the best features of both. What GARPers look for is whether or not the stocks are somewhat undervalued and have solid sustainable growth potential (Investopedia).\n\nGARP investing gives priority to one of the popular value metrics — the price/earnings growth (PEG) ratio. Although it is categorized under value investing, this strategy follows the principles of both growth and value investing.\n\nThe PEG ratio is defined as (Price/ Earnings)/Earnings Growth Rate.\n\nIt relates a stock’s P/E ratio with the future earnings growth rate.\n\nWhile P/E alone only gives an idea of stocks that are trading at a discount, PEG, while adding the growth element to it, helps to identify stocks that have solid future potential.\n\nA lower PEG ratio, preferably less than 1, is always better for GARP investors.\n\nSay for example, if a stock's P/E ratio is 10 and the expected long-term growth rate is 15%, the company's PEG will come down to 0.66, a ratio that indicates both undervaluation and future growth potential.\n\nHowever, the question that often arises is whether the market has an adequate number of companies that are growing earnings while trading at reasonable valuations. Going by a CFA Institute Blog by Nicolas Rabener, “on average, 38% of all stocks exhibit a PEG ratio below 1, which is more than enough for security selection.”\n\nUnfortunately, this ratio is often neglected due to investors' limitations in calculating the future earnings growth rate of a stock.\n\nThere are some drawbacks to using the PEG ratio though. It does not consider the common situation of changing growth rates, such as the forecast of the first three years at a very high growth rate followed by a sustainable but lower growth rate in the long term.\n\nHence, PEG-based investing can turn out to be even more rewarding if some other relevant parameters are also taken into consideration.\n\nHere are the screening criteria for a winning strategy:\n\nPEG Ratio less than X Industry Median\n\nP/E Ratio (using F1) less than X Industry Median (For more accurate valuation purposes)\n\nZacks Rank of 1 (Strong Buy) or 2 (Buy) (Whether good market conditions or bad, stocks with a Zacks Rank #1 or #2 have a proven history of success.)\n\nMarket Capitalization greater than $800 Million (This helps us to focus on companies that have strong liquidity.)\n\nAverage 20 Day Volume greater than 50,000: A substantial trading volume ensures that the stock is easily tradable.\n\nPercentage Change F1 Earnings Estimate Revisions (4 Weeks) greater than 5%: Upward estimate revisions add to the optimism, suggesting further bullishness.\n\nValue Score of less than or equal to B: Our research shows that stocks with a Style Score of A or B when combined with a Zacks Rank #1, 2 or 3 (Hold) offer the best upside potential.\n\nHere are four out of the 11 stocks that qualified the screening:\n\nFord: Dearborn, MI-based Ford is one of the leading automakers in the world. It manufactures, markets and services cars, trucks, sport utility vehicles, electrified vehicles, and Lincoln luxury vehicles. Ford’s vehicle lineup, supported by F-series trucks, Maverick pickup and SUV models, including Escape, Explorer, Expedition, EcoSport, and Edge, is impressive.\n\nFord is an impressive value investment pick with its Zacks Rank #1 and a Value Score of A. Apart from a discounted PEG and P/E, it also has an impressive long-term expected growth rate of 6.2%. You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nToll Brothers: Based in Horsham, PA, Toll Brothers builds single-family detached and attached home communities; master planned luxury residential resort-style golf communities; and urban low, mid, and high-rise communities, principally on the land it develops and improves.\n\nToll Brothers can also be an impressive value investment pick with its Zacks Rank #2 and a Value Score of A. Apart from a discounted PEG and P/E, the stock has an impressive long-term historical growth rate of 23.9%.\n\nUrban Outfitters: Based in Philadelphia, PA, Urban Outfitters is a lifestyle specialty retailer that offers fashion apparel and accessories, footwear, home décor and gift products. The company’s merchandise is generally sold directly to consumers through stores, catalogs, call centers and e-commerce platforms. The company has operations in the United States, Canada and Europe.\n\nUrban Outfitters has an impressive long-term expected growth rate of 18.5%. The stock currently has a Value Score of A and a Zacks Rank #1.\n\nTelefonica: Based in Madrid, Spain, Telefonica, S.A. provides mobile and fixed communication services in Europe and Latin America. In recent years, Telefonica has invested heavily in the deployment and transformation of its network to provide excellent connectivity in terms of capacity, speed, coverage and security.\n\nTelefonica has an impressive long-term expected growth rate of 20.2%. The stock currently has a Value Score of A and a Zacks Rank #2.\n\nYou can get the rest of the stocks on this list by signing up now for your 2-week free trial to the Research Wizard and start using this screen in your own trading. Further, you can also create your own strategies and test them first before taking the investment plunge.\n\nThe Research Wizard is a great place to begin. It's easy to use. Everything is in plain language. And it's very intuitive. Start your Research Wizard trial today. And the next time you read an economic report, open up the Research Wizard, plug your finds in, and see what gems come out.\n\nClick here to sign up for a free trial to the Research Wizard today.\n\nDisclosure: Officers, directors and/or employees of Zacks Investment Research may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material. An affiliated investment advisory firm may own or have sold short securities and/or hold long and/or short positions in options that are mentioned in this material.\n\nDisclosure: Performance information for Zacks’ portfolios and strategies are available at: https://www.zacks.com/performance.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nTelefonica SA (TEF) : Free Stock Analysis Report\n\nUrban Outfitters, Inc. (URBN) : Free Stock Analysis Report\n\nToll Brothers Inc. (TOL) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/5-cheap-peg-driven-garp-130200423.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TEF.MC", "TEF.US", "TEFN.MX", "TEFOF.US", "TFA.BR", "TLK.F", "TNE2.F", "TNE2.STU", "TNE5.F", "TNE5.XETRA", "TOL.US", "UOF.F", "URBN.US"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.014, "neu": 0.792, "pos": 0.194}}, {"date": "2023-06-06T12:30:37+00:00", "title": "UPDATE 2-Logistics firm C.H. Robinson names new CEO", "content": "(Adds details on Bozeman in paragraph 2&3, Ford's confirmation in paragraph 4, share move from Monday in paragraph 6)\n\nJune 6 (Reuters) - Transport and logistics firm C.H. Robinson Worldwide Inc on Tuesday named Ford's Dave Bozeman as its chief executive officer, replacing Scott Anderson, who had taken over the role on an interim basis.\n\nBozeman was most recently in charge of Ford Blue's enthusiast vehicles unit and also led the company's customer service division.\n\nBozeman had also served as vice president for Amazon.com Inc's transportation services division.\n\nFord Motor confirmed the departure and said that Bozeman will leave the company on June 16.\n\nScott Anderson will continue to be on the company's board, C.H. Robinson said.\n\nShares of the company on Monday fell 5.3% after industry publication FreightWaves reported that the freight broker's next chief executive would be Bozeman. (Reporting by Pratyush Thakur and Priyamvada C in Bengaluru; Editing by Shounak Dasgupta and Shweta Agarwal)", "link": "https://finance.yahoo.com/news/1-logistics-firm-c-h-123037420.html", "symbols": ["CH1A.F", "CHRW.US", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.691, "neg": 0.008, "neu": 0.948, "pos": 0.044}}, {"date": "2023-06-06T12:00:49+00:00", "title": "3 Most Undervalued Battery Stocks to Buy in June", "content": "With the electric-vehicle revolution rapidly continuing, investors should look for undervalued battery stocks to buy. After all, the tens of millions of EVs that will be produced in the coming years will all need batteries. Or, as the prestigious consulting firm McKinsey put it last October “As the auto market embraces electric vehicles, battery demand is soaring.”\n\nMeanwhile, it’s not easy to produce EV batteries, as it’s difficult to secure the materials needed to make the batteries. Therefore, the companies that are already managing to produce significant number of EV batteries have accomplished a meaningful feat and have a significant competitive advantage over those that are still trying to enter the sector.\n\nFurther, of course it’s worth buying the stocks of battery makers whose products are meaningfully superior to those that are already on the market.\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nHere are three of the most undervalued battery stocks to buy in June:\n\nProterra (PTRA) Chinese EV Stocks. An image of an EV charging with other icons imposed over top; a lightning bolt, full battery, cogs\n\nSource: Shutterstock\n\nProterra (NASDAQ:PTRA) has entered a unique niche within the battery sector. Specifically, the company is specializing in making batteries “for heavy-duty electric vehicles.” Given the many companies that are looking to buy more EVs in order to please consumers and/or comply with government regulations, this niche should be very lucrative over the long-term.\n\nMoreover, Proterra says that its batteries for large, commercial EVs are superior to competing products. According to the company, its batteries “have industry-leading energy density for maximum range, a flexible design to fit within a wide variety of vehicles, and a ruggedized commercial grade housing to withstand harsh environments.”\n\nBacking up Proterra’s assertions, the revenue of its Proterra Powered and Energy unit, which includes its battery business, jumped 49% last quarter versus the same period a year earlier to $35 million.\n\nProterra’s trailing price-sales ratio is a tiny 0.8, making it one of the most affordable battery stocks to buy.\n\nIn addition to batteries Proterra also sells electric buses and EV chargers. Analysts, on average, expect the company’s top line to jump to $473 million this year versus $309 million last year.\n\nSolid Power (SLDP) Smartphone with logo of American battery company Solid Power Inc. on screen in front of business website. Focus on center-left of phone display.\n\nSource: T. Schneider / Shutterstock.com\n\nSolid Power (NASDAQ:SLDP) has developed solid-state EV batteries. According to the company, its batteries contain more energy and are safer than the lithium-ion EV batteries that are widely used today. Moreover, SLDP reports that its batteries are safer and will last longer than their lithium-ion counterparts.\n\nThe company is already producing the specialized powder that will serve as the electrolyte of its solid-state batteries. In a year, SLDP plans to produce 2 to 3 metric tons of powder per month, and it intends to sell its excess powder to other battery makers and automakers.\n\nMoreover, SLDP plans to start delivering battery cells to its partners by December.\n\nSomewhat validating SLDP’s technology, one of its partners, BMW (OTCMKTS:BMWYY), is researching the battery maker’s technology and plans to build batteries based on SLDP’s system at its own plants. What’s more, BMW intends to start testing the batteries in EVs in 2023, suggesting that the batteries’ development may be nearing completion.\n\nFurther, BMW and Ford (NYSE:F) have both invested significant amounts of money in SLDP.\n\nSolid Power’s market capitalization is just $376 million, which is dozens if not hundreds of times below its long-term potential.\n\nPanasonic (PCRFY) A Panasonic (PCRFY) sign hanging in Beijing, China. generation z\n\nSource: testing/Shutterstock.com\n\nPanasonic (OTCMKTS:PCRFY) operates one EV battery factory in the U.S. in partnership with Tesla (NASDAQ:TSLA). The company is also currently building another factory and reportedly has plans to launch a third.\n\nAs a result, I believe that the conglomerate is poised to benefit from huge increases in the revenue generated by its EV batteries in the U.S. over the longer term.\n\nAlso noteworthy is that Panasonic plans to increase the energy density of its EV batteries by 25% in 2030, likely giving them an important advantage over many competing products. And of course, Panasonic’s partnership with Tesla should become more and more lucrative as the years go by.\n\nAnalysts, on average, expect the battery maker’s EPS to jump to $1.35 next year from $1.10 this year.\n\nBased on the mean 2024 EPS estimate, the shares are changing hands for just 8.2 times the company’s forward earnings.\n\nOn the date of publication, Larry Ramer did not hold (either directly or indirectly) any positions in the securities mentioned in this article. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nLarry Ramer has conducted research and written articles on U.S. stocks for 15 years. He has been employed by The Fly and Israel’s largest business newspaper, Globes. Larry began writing columns for InvestorPlace in 2015. Among his highly successful, contrarian picks have been PLUG, XOM and solar stocks. You can reach him on Stocktwits at @larryramer.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live Wall Street Titan: Here’s My #1 Stock for 2023 The $1 Investment You MUST Take Advantage of Right Now It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 3 Most Undervalued Battery Stocks to Buy in June appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-most-undervalued-battery-stocks-120049227.html", "symbols": ["BAMXF.US", "BMW.F", "BMW.XETRA", "BMW3.F", "BMW3.XETRA", "BMWB.F", "BMWYY.US", "BYMOF.US", "F.US", "MAT1.F", "MATA.F", "PCRFF.US", "PCRFY.US", "PTRA.US", "SLDP.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.996, "neg": 0.01, "neu": 0.894, "pos": 0.096}}, {"date": "2023-06-06T11:01:08+00:00", "title": "With A 6.2% Return On Equity, Is Ford Motor Company (NYSE:F) A Quality Stock?", "content": "One of the best investments we can make is in our own knowledge and skill set. With that in mind, this article will work through how we can use Return On Equity (ROE) to better understand a business. To keep the lesson grounded in practicality, we'll use ROE to better understand Ford Motor Company (NYSE:F).\n\nReturn on Equity or ROE is a test of how effectively a company is growing its value and managing investors’ money. Simply put, it is used to assess the profitability of a company in relation to its equity capital.\n\nView our latest analysis for Ford Motor\n\nHow Do You Calculate Return On Equity?\n\nReturn on equity can be calculated by using the formula:\n\nReturn on Equity = Net Profit (from continuing operations) ÷ Shareholders' Equity\n\nSo, based on the above formula, the ROE for Ford Motor is:\n\n6.2% = US$2.6b ÷ US$42b (Based on the trailing twelve months to March 2023).\n\nThe 'return' is the amount earned after tax over the last twelve months. That means that for every $1 worth of shareholders' equity, the company generated $0.06 in profit.\n\nDoes Ford Motor Have A Good ROE?\n\nArguably the easiest way to assess company's ROE is to compare it with the average in its industry. However, this method is only useful as a rough check, because companies do differ quite a bit within the same industry classification. As shown in the graphic below, Ford Motor has a lower ROE than the average (23%) in the Auto industry classification. roe\n\nThat's not what we like to see. Although, we think that a lower ROE could still mean that a company has the opportunity to better its returns with the use of leverage, provided its existing debt levels are low. A company with high debt levels and low ROE is a combination we like to avoid given the risk involved. You can see the 4 risks we have identified for Ford Motor by visiting our risks dashboard for free  on our platform here.\n\nThe Importance Of Debt To Return On Equity\n\nVirtually all companies need money to invest in the business, to grow profits. That cash can come from retained earnings, issuing new shares (equity), or debt. In the case of the first and second options, the ROE will reflect this use of cash, for growth. In the latter case, the debt used for growth will improve returns, but won't affect the total equity. That will make the ROE look better than if no debt was used.\n\nFord Motor's Debt And Its 6.2% ROE\n\nIt appears that Ford Motor makes extensive use of debt to improve its returns, because it has an alarmingly high debt to equity ratio of 3.30. The combination of a rather low ROE and high debt to equity is a negative, in our book.\n\nConclusion\n\nReturn on equity is one way we can compare its business quality of different companies. In our books, the highest quality companies have high return on equity, despite low debt. If two companies have the same ROE, then I would generally prefer the one with less debt.\n\nHaving said that, while ROE is a useful indicator of business quality, you'll have to look at a whole range of factors to determine the right price to buy a stock. It is important to consider other factors, such as future profit growth -- and how much investment is required going forward. So I think it may be worth checking this freereport on analyst forecasts for the company.\n\nOf course Ford Motor may not be the best stock to buy. So you may wish to see this free collection of other companies that have high ROE and low debt.\n\nHave feedback on this article? Concerned about the content?Get in touch with us directly. Alternatively, email editorial-team (at) simplywallst.com.\r\n\r\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nJoin A Paid User Research Session\r\nYou’ll receive a US$30 Amazon Gift card for 1 hour of your time while helping us build better investing tools for the individual investors like yourself. Sign up here", "link": "https://finance.yahoo.com/news/6-2-return-equity-ford-110108022.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.97, "neg": 0.084, "neu": 0.8, "pos": 0.116}}, {"date": "2023-06-06T10:04:09+00:00", "title": "Analysis-Ford's EV charging tie-up with Tesla ripples through industry", "content": "By Abhirup Roy, Hyunjoo Jin and Isla Binnie\n\nSAN FRANCISCO (Reuters) - Ford Motor Co's decision to allow customers to use Tesla's electric-vehicle charging network has sent ripples through the industry, raising questions about a national U.S. charging standard as well as the fate of charging startups that are struggling.\n\nThe deal, announced last month, would open more than 12,000 Tesla Superchargers to drivers of Ford vehicles in North America starting in 2024.\n\nThe tie-up puts pressure on other companies and the administration of U.S. President Joe Biden to fall in line or spend more to up their games, according to industry executives, investors, bankers and consultants.\n\n\"Tesla's head start in the space and Ford's buy-in ... will require companies who have invested in other technologies to pivot, which will be an expensive proposition,\" said Paul Baiocchi, chief ETF strategist at SS&C ALPS Advisors.\n\nSS&C has invested in such charging companies as ChargePoint Holdings Inc, EVgo Inc and Blink Charging Co.\n\nThe Ford deal was a boost to Tesla's more widespread, reliable North American Charging Standard (NACS) and dented the value of smaller players offering the rival Combined Charging System (CCS). Tesla CEO Elon Musk hopes the deal with Ford, the No. 2 seller of EVs in the U.S., will help make Tesla's technology the North American standard.\n\nNow those players face pressure to upgrade their networks to work with Tesla's at a time when many lag in customer service and lack the funds to make such a commitment.\n\nThe Biden administration did not respond to requests for comment, but Transportation Secretary Pete Buttigieg told CNBC after the Ford-Tesla deal that the administration was \"not going to pick winners and losers in terms of what standard prevails.\" He added the industry will eventually converge on one system but that adapters would allow cross usage.\n\nCharIn, a global association to promote CCS, said deals like the Tesla-Ford one \"create uncertainty in the industry and lead to investment obstacles.\"\n\nThe U.S. government previously set aside $7.5 billion in federal funds to push companies to adopt CCS as part of Biden's plan to tackle climate change by converting 50% of all new U.S. vehicle sales to EVs by 2030.\n\nHolding back EVs has been a weak CCS charging infrastructure that many complain is inefficient or sometimes inoperable, leading prospective buyers to fear becoming stranded on the road with nowhere to charge.\n\nBut installing and maintaining a charging network is capital-intensive and, with EVs representing only 6% of new car sales in the U.S. last year, making money in charging is difficult, industry officials said. Most automakers have not created their own charging networks.\n\nACCELERATE CHANGE\n\nThat financial pressure may only intensify if more companies adopt Tesla as the industry charging standard, pushing more deals like Shell's $169 million buyout of Volta earlier this year or BP's late 2021 acquisition of AMPLY Power.\n\n\"There was already some consolidation happening in the space and now I think that will only accelerate,\" Lazard banker Mohit Kohli said.\n\nThe Biden administration's push has so far supported the CCS connector favored by such carmakers as Volkswagen AG, General Motors Co and BMW. Tesla adopted that standard in Europe under pressure from regulators there, and is gradually opening a portion of its U.S. network to vehicles using CCS to potentially qualify for subsidies.\n\nComplaints about other charging companies' software bugs or broken charging hardware only opens the door to greater access for Tesla's standard, however, industry officials said.\n\nUnder its new deal, Ford will distribute Tesla adapters to customers and starting in 2025 will equip future EVs with NACS. It was not clear whether those adapters will be available to other automakers' customers.\n\nSome companies are already making plans to adopt Tesla's technology, but a lack of a national standard could cause more headaches, industry officials said.\n\n\"We are now probably locked in to having two separate charging standards co-existing for the foreseeable future,\" Consumer Reports senior policy analyst Chris Harto said.\n\nFreeWire CEO Arcady Sosinov said his company plans to offer NACS connectors at its fast chargers by mid-2024, while Aptera Motors CEO Chris Anthony said the U.S. government should invest in the Tesla network if it becomes the predominant standard.\n\n\"Because of this announcement ... there's going to continue to be a standards war for a decade or more,\" Sosinov said.\n\n(Reporting by Abhirup Roy and Hyunjoo Jin in San Francisco; Additional reporting by David Shepardson and Jarrett Renshaw in Washington; Editing by Ben Klayman and Matthew Lewis)", "link": "https://finance.yahoo.com/news/analysis-fords-ev-charging-tie-100409708.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA"], "tags": [], "sentiment": {"polarity": -0.933, "neg": 0.071, "neu": 0.872, "pos": 0.056}}, {"date": "2023-06-06T09:33:51+00:00", "title": "UPDATE 1-Ford recalls over 125,000 SUVs, trucks over fire risk - NHTSA", "content": "(Adds details on recall in paragraphs 2 to 4, background in paragraph 5)\n\nJune 6 (Reuters) - Ford Motor Co is recalling more than 125,000 sport utility vehicles and trucks in the United States due to the risk of an engine compartment fire, the National Highway Traffic Safety Administration (NHTSA) website showed on Tuesday.\n\nThe recall, which expands on a similar recall from a year earlier, covers some Escape and Lincoln Corsair SUVs and its Maverick compact pickup trucks manufactured between 2020 and 2023 equipped with 2.5L Hybrid/Plug-In Hybrid motors.\n\n\"In the event of an engine failure, engine oil and fuel vapor may be released into the engine compartment and accumulate near ignition sources such as hot engine or exhaust components, possibly resulting in an engine compartment fire,\" the NHTSA said.\n\nThe agency advised owners to park and shut off the engine if they hear unexpected engine noises, notice a reduction in vehicle power, or see smoke.\n\nThe U.S. automaker last week said it was recalling 142,000 Lincoln MKC SUVs in the country while it investigates the cause of under-hood fires in the model. (Reporting by Mrinmay Dey and Nathan Gomes in Bengaluru, Editing by Louise Heavens and Shailesh Kuber)", "link": "https://finance.yahoo.com/news/1-ford-recalls-over-125-093351197.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.103, "neg": 0.048, "neu": 0.896, "pos": 0.055}}, {"date": "2023-06-06T08:37:52+00:00", "title": "Ford recalls over 125,000 SUVs, trucks over fire risk - NHTSA", "content": "(Reuters) - Ford Motor Co is recalling more than 125,000 sport utility vehicles and trucks in the United States due to the risk of an engine compartment fire, the National Highway Traffic Safety Administration (NHTSA) website showed on Tuesday.\n\nThe recall, which expands on a similar recall from a year earlier, covers some Escape and Lincoln Corsair SUVs and its Maverick compact pickup trucks manufactured between 2020 and 2023 equipped with 2.5L Hybrid/Plug-In Hybrid motors.\n\n\"In the event of an engine failure, engine oil and fuel vapor may be released into the engine compartment and accumulate near ignition sources such as hot engine or exhaust components, possibly resulting in an engine compartment fire,\" the NHTSA said.\n\nThe agency advised owners to park and shut off the engine if they hear unexpected engine noises, notice a reduction in vehicle power, or see smoke.\n\nThe U.S. automaker last week said it was recalling 142,000 Lincoln MKC SUVs in the country while it investigates the cause of under-hood fires in the model.\n\n(Reporting by Mrinmay Dey and Nathan Gomes in Bengaluru, Editing by Louise Heavens and Shailesh Kuber)", "link": "https://ca.finance.yahoo.com/news/ford-recalls-more-125-000-083752821.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.103, "neg": 0.052, "neu": 0.889, "pos": 0.059}}, {"date": "2023-06-06T05:28:40+00:00", "title": "4 big analyst picks: Ford upgraded to Buy, Uber initiated with Outperform rating", "content": "Here is your Pro Recap of the biggest analyst picks you may have missed since yesterday: upgrades at Ford, Comerica, and Valley National Bancorp, and initiation at Uber.\n\nInvestingPro subscribers got this news first. Never miss another market-moving headline.\n\nFord upgraded at Citi on positive survey results\n\nCiti upgraded Ford Motor (NYSE:F) to Buy from Neutral and raised its price target to $16.00 from $12.80 following the results of its 2023 Vehicle Density survey, which pointed to “a surprisingly strong density outlook, suggesting that recent auto demand resilience reflects a genuine increase in wallet share.”\n\nAccording to the firm, the upgrade reflects an improved risk/reward proposition due to (1) a more positive outlook on U.S. auto demand, (2) Ford's recent CMD and re-segmentation, which increase the likelihood that Ford Pro will drive improved sentiment and possibly SoP treatment, (3) potential improvements in sentiment towards electric vehicles as Ford’s Model-e unit executes towards H2 margin targets, and (4) the recognition of major opportunities in the Sw/AI-defined car sector.\n\nUber initiated at Outperform\n\nWedbush initiated coverage on Uber Technologies (NYSE:UBER) with an Outperform rating and a price target of $46.00, as InvestingPro reported in real time.\n\nLast month, the company reported its Q1 results, with EPS of ($0.08) and revenue of $8.8 billion coming in above the consensus estimates.\n\n2 more upgrades\n\nOdeon Capital upgraded Comerica (NYSE:CMA) to Buy from Hold with a price target of $47.24 as the valuation of the stock has fallen to a level that makes it attractive.\n\nAccording to the firm, Comerica ticks off every potential negative facing the banking industry, however, despite these negatives it is unlikely to fail, the real value of its assets is more reasonably stated on its balance sheet than for most other banks, it is liquid, and its cash flow is such that it is likely to maintain its dividend.\n\nJPMorgan upgraded Valley National Bancorp (NASDAQ:VLY) to Overweight from Neutral with a price target of $10.00.\n\nAccording to the firm, the fears about Valley National’s commercial real estate exposure are overblown, as its portfolio is very granular and focused on banking its local markets, which entails smaller office properties in suburban markets rather than big city centers (like Manhattan).\n\nAmid an endless firehose of market headlines, jump on the most important ones to fatten your profits: Always be the first to know with InvestingPro.\n\nStart your free 7-day trial now.\n\nRelated Articles\n\n4 big analyst picks: Ford upgraded to Buy, Uber initiated with Outperform rating\n\nMobileye slips after Intel announces plans to sell $1.5 billion stake\n\nWorld stocks tread water as traders eye Fed pause prospects", "link": "https://finance.yahoo.com/news/4-big-analyst-picks-ford-052840281.html", "symbols": ["CMA.US", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "U1BE34.SA", "UBER.US", "UT8.F", "UT8.STU", "VLY.US", "VLYPO.US", "VLYPP.US", "VNB.F"], "tags": [], "sentiment": {"polarity": 0.98, "neg": 0.043, "neu": 0.85, "pos": 0.107}}, {"date": "2023-06-05T20:25:06+00:00", "title": "Apple's WWCD, oil production cuts, Ford upgrade: Trending tickers", "content": "Apple's big headset announcement, Saudi Arabia's production cut, and Ford shares get an upgrade. Yahoo Finance live breaks down the trending tickers of the day.", "link": "https://finance.yahoo.com/video/apples-wwcd-oil-production-cuts-202506159.html", "symbols": ["AAPL.MX", "AAPL.US", "AAPL34.SA", "APC.F", "APC.XETRA", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.026, "neg": 0.077, "neu": 0.842, "pos": 0.081}}, {"date": "2023-06-05T20:00:00+00:00", "title": "John Lawler to Discuss Great Potential, Progress Against Ford+ Plan During ‘Chat’ at Deutsche Bank 2023 Global Automotive Conference", "content": "DEARBORN, Mich., June 05, 2023--(BUSINESS WIRE)--Ford CFO John Lawler will reiterate high expectations for and provide an update on execution against the company’s Ford+ plan for growth and value creation, during a fireside chat with auto analyst Emmanuel Rosner at the Deutsche Bank 2023 Global Automotive Conference. The conference will take place on Thursday, June 15, at 9:40 a.m. ET.\n\nLawler will explain how Ford+ is reimagining and reshaping the future of the automotive industry, centered on the needs of and value for distinct customer groups.\n\nAt Ford’s Capital Markets Day last month, Lawler and other company leaders described the journey to transform a 120-year-old, purpose-driven company into an industry pacesetter in innovative digital platforms and software embedded across electric, gas and hybrid vehicles.\n\nA link to join the session with Lawler will be available prior to the event at shareholder.ford.com.\n\nAbout Ford Motor Company\n\nFord Motor Company (NYSE: F) is a global company based in Dearborn, Michigan, committed to helping build a better world, where every person is free to move and pursue their dreams. The company’s Ford+ plan for growth and value creation combines existing strengths, new capabilities, and always-on relationships with customers to enrich experiences for customers and deepen their loyalty. Ford develops and delivers innovative, must-have Ford trucks, sport utility vehicles, commercial vans and cars and Lincoln luxury vehicles, along with connected services. The company does that through three customer-centered business segments: Ford Blue, engineering iconic gas-powered and hybrid vehicles; Ford Model e, inventing breakthrough EVs along with embedded software that defines always-on digital experiences for all customers; and Ford Pro, helping commercial customers transform and expand their businesses with vehicles and services tailored to their needs. Additionally, Ford is pursuing mobility solutions through Ford Next, and provides financial services through Ford Motor Credit Company. Ford employs about 174,000 people worldwide. More information about the company and its products and services is available at corporate.ford.com.\n\nFor news releases, related materials and high-resolution photos and video, visit www.media.ford.com.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20230605005773/en/\n\nContacts\n\nMedia:\r\nT.R. Reid\r\n1.313.319.6683\r\ntreid22@ford.com \r\n\r\nEquity Investment Community:\r\nLynn Antipas Tyson\r\n914.485.1150\r\nltyson4@ford.com \r\n\r\nFixed Income Investment Community:\r\nJessica Vila-Goulding\r\n1.313.248.3896\r\njvila5@ford.com \r\n\r\nShareholder Inquiries:\r\n1.800.555.5259 or\r\n1.313.845.8540\r\nfordir@ford.com", "link": "https://finance.yahoo.com/news/john-lawler-discuss-great-potential-200000652.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA"], "tags": [], "sentiment": {"polarity": 0.993, "neg": 0, "neu": 0.865, "pos": 0.135}}, {"date": "2023-06-05T16:04:37+00:00", "title": "The Saga Of Bringing Electric Pickups To Roads Has Collaboration Written All Over It", "content": "2023 has been deemed as the year of the electric pickup. This particular vehicle is considered as the backbone of the automotive industry, especially in the U.S. But, as electrification transforms the entire industry, electrifying pickups can seem even more daunting for automakers compared to producing EVs. Besides the scary costs that come with EVs and make it harder for automakers to keep their finances in check, pickup makers are also in for other manufacturing and production challenges. For this reason, there’s still no automaker that produces electric pickups at a scale. But the contenders are the EV king himself, Tesla. Inc (NASDAQ: TSLA), legacy automakers such as Ford Motor (NYSE: F) and General Motors (NYSE: GM), as well as EV startups like Rivian Automotive Inc (NASDAQ: RIVN). However, there are also players from the automotive parts field that can play a big part in the electric pickup race, such as Worksport Ltd (NASDAQ: WKSP).\n\nRivian Has Set The Benchmark\n\nThe EV startup currently has three models on the roads: a delivery van (the EDV), pickup truck (the R1T), and SUV (the R1S). Despite the usual startup and manufacturing pains, Rivian came close to meeting its 2022 production target of 25,000 units as its annual output amounted to 24,337 units. It aims to double its output this year and it affirmed its guidance during the latest earnings report. Even if it loosens its ties with Amazon regarding exclusive delivery truck orders, it still counts on the tech titan as its investor for support.\n\nTesla’s About To Throw Its Hat In The Electric Pickup Ring\n\nAlthough even the cash-abundant Tesla struggled more than it anticipated on this front. After several delays, its eagerly anticipated Cybertruck is finally coming by the end of the year with the initial production goal being 2021. But even if Tesla rolls it off the production line this year, mass production won’t happen before 2024. When it comes to Tesla, Musk’s quarterly investor calls are the place where one learns about the company’s plans. The world still does not know much about the truck besides the fact it does not resemble any truck that exists on the market. Meanwhile, GM’s subsidiary, GMC is already selling the Hummer EV. While also pushing in the midsize pickup truck department, GM has also announced the Chevrolet Silverado EV and a GMC Sierra EV, both of which could possibly hit production before Tesla’s Cybertruck.\n\nFord Is Trying To Regain Its Pickup Supremacy In The EV Universe\n\nFord has paused the production of its electric pickup, F-150 Lightning for almost a month this spring due to a battery issue. Its peer, Lordstown Motor Corporation (NASDAQ: RIDE) also halted production of its electric pickup Endurance back in February due to quality issues. So, regardless of the experience and the company’s history, making electric pickups is no picnic for anyone. For this reason, Ford joined forces with Tesla to create its EV ecosystem. Ford’s future vehicles will benefit directly from Tesla’s supercharging infrastructure without needing an adapter. After this surprising move, Ford CEO Jim Farley predicts an acceleration of cooperation across the industry. If Farley’s right, Tesla is on the way to change the charging norm of the industry.\n\nOn Wednesday, Farley stated that the challenging cost of EVs will remain higher compared to their ICE counterparts until the end of the decade. Simply put, it will take second and third generation models to come to life to achieve the know-how. As of 2030, Farley expects costs savings from smaller batteries and the fact that vehicles will require fewer parts.\n\nWorksport Can Help Those That Didn’t Even Stand A Chance Enter The Pickup Race\n\nThis renown tonneau cover manufacturer possibly has two game-changing products on its hands. The solar powered tonneau cover Terravis and the remote power storage COR promise to revolutionize truck beds. Hyundai has gained the right to use this potentially groundbreaking technology in its Santa Cruz SUV.\n\nWorksport’s U.S. factory in New York already has the equipment installed, first materials have been received and skilled staff has been trained. This week, it officially launched the SC4 PRO soft folding tonneau cover, and like all of its products, it is available on Amazon and Walmart. With its patented solar-powered accessories, Worksport will be able to help pickup makers in easing the challenges of the manufacturing battle.\n\nAll in all, bringing electric pickups to life turned out to be a daunting task even for the most powerful players. It is a competitive and challenging battle that is far from over, and therefore, cooperation in many forms and across the industry seems the inevitable and only way forward. It seems that pickups are the biggest EV challenge and Ford is the first legacy automaker to acknowledge that only team effort can bring this electric future to life.\n\nDISCLAIMER: This content is for informational purposes only. It is not intended as investing advice.\n\nDon't miss real-time alerts on your stocks - join Benzinga Pro for free! Try the tool that will help you invest smarter, faster, and better.\n\nThis article The Saga Of Bringing Electric Pickups To Roads Has Collaboration Written All Over It originally appeared on Benzinga.com\n\n.\n\n© 2023 Benzinga.com. Benzinga does not provide investment advice. All rights reserved.", "link": "https://finance.yahoo.com/news/saga-bringing-electric-pickups-roads-160437538.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.US", "RIDE.US", "RIVN.US", "TL0.F", "TL0.XETRA", "TSLA.MX", "TSLA.US", "TSLA34.SA", "WKSP.US"], "tags": [], "sentiment": {"polarity": 0.988, "neg": 0.02, "neu": 0.908, "pos": 0.072}}, {"date": "2023-06-05T14:26:00+00:00", "title": "Group 1 (GPI) Strengthens Portfolio With Beck &amp; Masten Kia Buyout", "content": "Group 1 Automotive, Inc. GPI recently made headlines with its latest acquisition of Beck & Masten Kia, a dealership located in the Houston metropolitan area. This strategic move expands Group 1's presence in the Houston market, bringing its total brands and dealerships in the area to 15 and 18, respectively. With expected annual revenues of $85 million, this acquisition contributes to Group 1's impressive year-to-date total acquired revenues of $1 billion.\n\nPresident and CEO of Group 1, Daryl Kenningham, expressed enthusiasm about the acquisition, highlighting the potential of the Kia brand in Houston. Kia America achieved record-breaking first-quarter sales, and Houston is the second fastest-growing major metropolitan area in the United States. Kenningham believes that this combination presents an excellent opportunity for Group 1 to capitalize on the thriving automotive market.\n\nShares of GPI have rallied more than 25% over the past year, outperforming the industry’s growth of 5%.\n\nWhat’s Driving GPI Stock?\n\nThe company's consistent acquisitions of dealerships and franchises demonstrate its commitment to expanding and optimizing its portfolio. Moreover, Group 1's previous acquisitions have already proven fruitful. The acquisition of Prime Automotive in the Northeastern United States and the Robinsons Group in the UK have diversified the company's footprint and are expected to contribute to its top-line growth. Since 2021, Group 1 has completed transactions representing $3.6 billion in acquired revenues.\n\nGroup 1's diversified product mix and multiple streams of income contribute to its appealing profile. The company generates revenues from various businesses, including used and new vehicle retail, finance, insurance, as well as automotive repair and maintenance. This diversified portfolio positions Group 1 well for both top and bottom-line growth. Group 1's omnichannel efforts to boost sales are another reason for investors to consider holding onto the stock. The company's digital initiatives, such as the online customer scheduling appointment system and the AcceleRide platform for online retailing, have significantly improved customer experience and productivity. Notably, units sold through AcceleRide experienced an impressive 117% year-over-year growth in the last reported quarter.\n\nThe company's investor-friendly moves also instill optimism among shareholders. Group 1 raised its 2023 annual dividend rate by 20%, demonstrating its commitment to rewarding shareholders. Additionally, the company has repurchased $35 million worth of shares, reflecting management's efficiency in capital allocation. Group 1's return on equity (ROE) of 31% compares favorably to the auto sector's 11.6%, further highlighting its commitment to maximizing shareholder value.\n\nA Few Concerns\n\nHowever, it is essential to consider potential headwinds surrounding the stock. The company's tight inventory, particularly for import and luxury brands, may result in lost revenues. With around 27% of Group 1's U.S. business relying on Toyota and Lexus, which face tight supply at only five days' worth, inventory constraints pose a challenge. Furthermore, the auto retail industry is susceptible to macroeconomic headwinds. Declining used vehicle prices and expected margin declines in the new vehicle segment could also limit Group 1's near-term prospects.\n\nBottom Line\n\nWhile challenges such as tight inventory, macroeconomic headwinds, and competition exist, closely monitoring GPI's ability to navigate these issues will be crucial. Overall, with its strategic acquisitions, resilient business model, and commitment to shareholder value, retaining GPI in an investment portfolio can offer the potential for long-term growth and returns.\n\nGroup 1 currently carries a Zacks Rank #3 (Hold).\n\nKey Picks From the Auto Space\n\nA few better-ranked players in the auto space include Ford F, Stellantis STLA and BMW AG BAMXF.\n\nFord is one of the leading automakers in the world. Its robust BEV lineup — with Mustang Mach-E, E-Transit and F-150 Lightning — is set to drive top-line growth. The company currently sports a Zacks Rank #1 (Strong Buy) and has a Value Score of A.\n\nThe Zacks Consensus Estimate for F’s 2023 sales implies year-over-year growth of 7.5%. The consensus mark for 2023 and 2024 EPS has moved north by 4 cents and 3 cents, respectively, over the past seven days.\n\nStellantis, an Italian-American carmaker, is one of the notable names in the auto space. Stellantis’ Dare Forward 2030 strategy bodes well. The core objective of Dare Forward 2030 is to achieve 100% of total passenger car sales in Europe and 50% of light-duty truck and passenger car sales in the United States as battery electric vehicles by the end of the decade.\n\nThe Zacks Consensus Estimate for STLA’s 2023 sales implies year-over-year growth of 13.4%. The consensus mark for 2023 and 2024 EPS has moved north by 27 cents and 49 cents, respectively, over the past 60 days. The stock sports a Zacks Rank #1 and has a Value Score of A.\n\nBMWis a Germany-based auto titan that designs, manufactures, and distributes luxury vehicles and motorcycles.BMW AG is taking great strides in electrification and expects EVs to account for 50% of its global sales by 2030. For 2023, the company plans to increase its BEV share to 15%.\n\nThe Zacks Consensus Estimate for BAMXF’s 2023 sales implies year-over-year growth of 9%. The consensus mark for 2023 and 2024 EPS has moved north by 6 cents and 81 cents, respectively, over the past 30 days. The stock sports a Zacks Rank #1 and has a Value Score of A.\n\nYou can see the complete list of today’s Zacks #1 Rank stocks here\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nGroup 1 Automotive, Inc. (GPI) : Free Stock Analysis Report\n\nBayerische Motoren Werke AG (BAMXF) : Free Stock Analysis Report\n\nStellantis N.V. (STLA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/group-1-gpi-strengthens-portfolio-142600282.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GAV.F", "GPI.US"], "tags": [], "sentiment": {"polarity": 0.999, "neg": 0.015, "neu": 0.833, "pos": 0.152}}, {"date": "2023-06-05T14:22:00+00:00", "title": "General Motors' (GM) Resilient EV Supply Chain to Drive Success", "content": "General Motors GM and POSCO Future M have announced a significant increase in their investment to expand the production capacity at their chemical battery materials facility in Canada. The collaboration aims to support GM's ambitious goal of manufacturing 1 million electric vehicles (EVs) in North America by 2025. The companies' combined investment in the plant is expected to exceed $1 billion, with new facilities scheduled to start operating in 2025. This expansion will enable local on-site processing of critical minerals used in EV batteries, enhancing the sustainability and security of GM's EV supply chain.\n\nThe increased investment in Ultium cathode active material (CAM) joint venture signifies a crucial step toward building a more secure and sustainable supply chain to meet GM's growing EV production needs. The joint venture will expand the capacity of the Ultium CAM plant and establish a precursor facility for the on-site processing of critical minerals. These investments will foster higher levels of vertical integration, ensuring greater control and efficiency throughout the battery supply chain, from cell production to raw material recovery.\n\nCollaboration Supports GM's EV Push & Job Creation\n\nGM's partnerships, investments, and strategic supply agreements in the EV sector have been instrumental in creating numerous job opportunities across North America, including Canada, the United States, and free trade agreement countries.\n\nThe collaboration between GM and POSCO Future M will have several positive implications for the automotive industry and the transition to sustainable transportation. The increased production capacity will support the manufacturing of approximately 360,000 Chevrolet, Cadillac, GMC, Buick, and BrightDrop vehicles annually in the 2025-2030 timeframe in North America. By expanding the availability of EVs, major automakers are taking significant steps toward achieving cost parity with internal combustion engines and accelerating the adoption of clean and green transportation.\n\nThe collaboration will not only bolster GM's EV production capabilities but also generate employment opportunities. The investments made by GM and POSCO Future M will contribute to job creation across the North American region, stimulating economic growth and supporting local communities. The establishment of additional facilities for the on-site processing of critical minerals will also reduce reliance on imports, further enhancing the resilience of the EV supply chain.\n\nBy working together, GM and POSCO Future M are taking bold steps toward a cleaner and more sustainable future in the automotive industry.\n\nGM’s Bid to Revamp EV Chain\n\nAs EVs take center stage in the automotive industry, General Motors has embarked on a strategic journey to fortify its EV supply chain. By securing raw materials, boosting cell manufacturing, and enhancing EV components production, GM aims to insulate itself against potential supply disruptions and accelerate its transition to electric mobility.\n\nBelow we highlight several partnerships and alliances that General Motors has entered into over the past couple of years, illustrating the company's commitment and forward-thinking strategy in the rapidly evolving EV landscape.\n\nGM embarked on its mission in July 2021, with a significant investment in Controlled Thermal Resources, targeting California-sourced lithium extraction. To ensure a steady supply of U.S.-sourced rare earth materials, the automaker formed an alliance with MP Materials in December 2021. The same month, GM announced a production initiative with POSCO Future M in Canada to produce CAM.\n\nContinuing this trend, GM secured a sustainable cobalt supply in April 2022 with Glencore, followed by a six-year agreement for battery-grade lithium with Livent in July 2022. In the same month, it inked a major supply agreement with LG Chem, promising GM over 950,000 tons of CAM, enough for approximately 5 million EVs. Additionally, GM established contracts with Queensland Pacific Metals and Vale for a long-term supply of nickel and cobalt, further reinforcing its supply chain.\n\nJanuary 2023 marked a significant milestone with a $650 million equity investment in Lithium Americas, leading to the development of the Thacker Pass lithium mine in Nevada.\n\nBeyond raw materials, GM has shown great commitment to cell manufacturing and R&D. The establishment of Ultium Cells LLC, a joint venture with LGES, and an alliance with Samsung SDI for a new U.S. battery cell plant demonstrates GM's vision. The Wallace Battery Cell Innovation Center in Warren, MI, further propels the automaker’s endeavor for innovative, longer-range, and affordable EV batteries.\n\nGM's investment extends to EV components, with significant investments announced in Toledo, OH, for the production of drive units. A binding agreement with Vacuumschmelze ensures North America magnet production, and a new initiative to build EV motors at St. Catharines, Ontario, was declared in February 2023.\n\nIn conclusion, GM's strategic efforts reflect a firm commitment to establishing a secure and resilient EV supply chain, thus demonstrating an ambitious vision to lead the global shift toward electric mobility.\n\nZacks Rank & Other Key Picks\n\nGeneral Motors currently sports a Zacks Rank #1 (Strong Buy). A few other top-ranked players in the auto space include Ford F, Stellantis STLA and BMW AG BAMXF.\n\nFord, General Motors’ crosstown rival, is one of the leading automakers in the world. Ford's robust BEV lineup — with Mustang Mach-E, E-Transit and F-150 Lightning — is set to drive top-line growth. The company currently sports a Zacks Rank #1 and has a Value Score of A.\n\nThe Zacks Consensus Estimate for F’s 2023 sales implies year-over-year growth of 7.5%. The consensus mark for 2023 and 2024 EPS has moved north by 4 cents and 3 cents, respectively, over the past seven days.\n\nStellantis, an Italian-American carmaker, is one of the notable names in the auto space. Stellantis’ Dare Forward 2030 strategy bodes well. The core objective of Dare Forward 2030 is to achieve 100% of total passenger car sales in Europe and 50% of light-duty truck and passenger car sales in the United States as battery electric vehicles by the end of the decade.\n\nThe Zacks Consensus Estimate for STLA’s 2023 sales implies year-over-year growth of 13.4%. The consensus mark for 2023 and 2024 EPS has moved north by 27 cents and 49 cents, respectively, over the past 60 days. The stock sports a Zacks Rank #1 and has a Value Score of A.\n\nBMW is a Germany-based auto titan that designs, manufactures, and distributes luxury vehicles and motorcycles.BMW AG is taking great strides in electrification and expects EVs to account for 50% of its global sales by 2030. For 2023, the company plans to increase BEV share to 15%.\n\nThe Zacks Consensus Estimate for BAMXF’s 2023 sales implies year-over-year growth of 9%. The consensus mark for 2023 EPS has moved north by 6 cents and 81 cents, respectively, over the past 30 days. The stock sports a Zacks Rank #1 and a Value Score of A.\n\nYou can see the complete list of today’s Zacks #1 Rank stocks here.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nGeneral Motors Company (GM) : Free Stock Analysis Report\n\nBayerische Motoren Werke AG (BAMXF) : Free Stock Analysis Report\n\nStellantis N.V. (STLA) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/general-motors-gm-resilient-ev-142200069.html", "symbols": ["005490.KO", "8GM.F", "BAMXF.US", "BMW.F", "BMW.XETRA", "BMW3.F", "BMW3.XETRA", "BMWB.F", "BMWM5N.MX", "BMWYY.US", "BYMOF.US", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "GM.MX", "GM.US", "GMCO34.SA", "PKX.F"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.007, "neu": 0.818, "pos": 0.174}}, {"date": "2023-06-05T12:40:00+00:00", "title": "The Zacks Analyst Blog Highlights BNP Paribas, Ford Motor and KBC Group", "content": "For Immediate Release\n\nChicago, IL – June 5, 2023 – Zacks.com announces the list of stocks featured in the Analyst Blog. Every day the Zacks Equity Research analysts discuss the latest news and events impacting stocks and the financial markets. Stocks recently featured in the blog include: BNP Paribas SA BNPQY, Ford Motor Company F and KBC Group NV KBCSY.\n\nHere are highlights from Friday’s Analyst Blog:\n\n5 Reasons to Add BNPQY, F and KBCSY to Your Portfolio\n\nStock selection can be a tricky business in the best of times. Not only do you need to find stocks with good growth potential, but you also need to see that the potential in your selections exceeds that in other stocks out there. Otherwise you end up missing out on opportunities. Since we are always balancing inflation, the economy and our personal situation anyway, missing opportunities is obviously an undesired outcome.\n\nIf you’re somebody who hasn’t done a lot of investing in the past, there are a few simple rules.\n\nNumber one, start small. Use cash that you can afford to lose. And go for safe stocks. What these might be, we’ll get to in a minute.\n\nPoint number two, even if the stock looks safe from a quick appraisal, learn more about the company. How does it generate revenue? Where? Does it manufacture its own products? Does it incorporate third-party components in its products? What could be the factors affecting revenue generation? Does it offer a service? What is the market demand for its product or service? Is it a growing market?\n\nThere could be so many questions to ask and answer. Therefore, do take the time to try and really understand the company. If you understand the company, you have a better idea of how economic factors may affect it.\n\nNumber three, talk to somebody who’s been doing this for a while. You could pick up tips and tricks. If you’re consulting an investment advisor, chances are they’ll have a tailored strategy for you. One such strategy is outlined below. If you’re feeling risk-averse, as its probably advisable to be when you’re starting out, this strategy could work for you very well:\n\nGo Large: Large-cap stocks are typically those that have a market capitalization of more than $10 billion. They tend to be safer because they’ve been in business longer. They’re likely to have experienced management and a proven business model. They’re also more likely to have relationships with suppliers and customers. All these factors help to make the business relatively stable in times of economic concern or when the business cycle turns down. The downside of investing in these stocks is that they usually have slower growth rates. So you may have to be more patient with them.\n\nPrefer Income: If you are to hold a stock for a considerable period of time and not get unnerved at all the market gyrations, it will help to see some income. Additionally, stocks that pay dividends add a layer of stability to share prices because dividends increase the total return. If you’re not in need of cash, you may even use the dividend to increase your holdings. One downside to this is: in an inflationary market, the value of fixed dividends will deteriorate. But most companies also increase the dividend periodically, which may offset this to some extent.\n\nLook Forward: The way to understand the future prospects of a company is not only by studying its past performance, but also consulting the experts, or broker analysts. Analysts typically prepare models projecting past performance into the future. Thus, they’re able to estimate earnings for the immediately following quarters and years, as well as for the long term.\n\nThe best part of investing in large-cap stocks is that there are usually a significant number of analysts following them, which provides us with average estimates, such as the Zacks Consensus Estimate. If you’re planning to hold a stock for the long term, it may help to check the long-term growth estimates provided by analysts.\n\nChoose Attractive Industries: At any given time, the industry to which a company belongs has some bearing on its performance. There are almost always some factors that affect the entire industry. For example, a chip shortage last year impacted volumes of the entire auto industry, Similarly, rising oil prices were an important factor driving results at oil & gas companies.\n\nTherefore, if you choose industries with good long-term potential (such as EVs, AI, etc), this will increase your chances of success. Zacks makes this easier through its Industry Rank system, which is a way to rank industries that have been previously classified by Zacks. The number of Zacks-classified industries is around 250 and historical data shows that the top 50% outperform the bottom 50% by a factor of 2 to 1. Of course, the higher the rank, the greater the chances of outperformance.\n\nOther Tools from Zacks: At Zacks, we also have a system of ranking stocks based on the chances of their near-term performance. The Zacks Rank for stocks (#1 Strong Buy, #2 Buy, #3 Hold, #4 Sell and #5 Strong Sell) also captures recent estimate revisions. Zacks also has a Style Score System, which grades stocks based on their Value, Growth or Momentum potential.  Rank 1 and Value Score A or B.\n\nBNPQY, F and KBCSY satisfy all the criteria as good stocks to buy and hold now. So, let’s take a look at some details:\n\nBNP Paribas SA\n\nBNP is a well-known brand providing banking and financial products and services in Europe, the Middle East, Africa, the Americas and the Asia Pacific. It operates in the Banks – Foreign industry, which is in the top 40% of Zacks-classified industries.\n\nThe Zacks Rank #1 stock with Value Score B is expected to grow 17.4% in the long term. It pays a dividend that yields 6.20% (very substantial).\n\nFord Motor Company\n\nFord develops, delivers and services a range of Ford trucks, commercial cars and vans, sport utility vehicles, and Lincoln luxury vehicles worldwide. It belongs to the Automotive – Domestic industry (top 29).\n\nThe Zacks Rank #1 stock has a Value Score A. It is expected to grow 6.2% in the long term. Its dividend yields 5.00%.\n\nKBC Group NV\n\nKBC provides integrated bank-insurance services primarily for retail, private banking, small and medium sized enterprises, and mid-cap clients. This is another player from the Banks – Foreign industry.\n\nThe Zacks Rank #1 stock with a Value Score of B is expected to grow 11.7% in the long term. Its dividend yields 6.69%.\n\nWhy Haven’t You Looked at Zacks' Top Stocks?\n\nSince 2000, our top stock-picking strategies have blown away the S&P's +6.2 average gain per year. Amazingly, they soared with average gains of +46.4%, +49.5% and +55.2% per year. Today you can access their live picks without cost or obligation.\n\nSee Stocks Free >>\n\nMedia Contact\n\nZacks Investment Research\n\n800-767-3771 ext. 9339\n\nsupport@zacks.com\n\nhttps://www.zacks.com\n\nPast performance is no guarantee of future results. Inherent in any investment is the potential for loss. This material is being provided for informational purposes only and nothing herein constitutes investment, legal, accounting or tax advice, or a recommendation to buy, sell or hold a security. No recommendation or advice is being given as to whether any investment is suitable for a particular investor. It should not be assumed that any investments in securities, companies, sectors or markets identified and described were or will be profitable. All information is current as of the date of herein and is subject to change without notice. Any views or opinions expressed may not reflect those of the firm as a whole. Zacks Investment Research does not engage in investment banking, market making or asset management activities of any securities. These returns are from hypothetical portfolios consisting of stocks with Zacks Rank = 1 that were rebalanced monthly with zero transaction costs. These are not the returns of actual portfolios of stocks. The S&P 500 is an unmanaged index. Visit https://www.zacks.com/performance for information about the performance numbers displayed in this press release.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nFord Motor Company (F) : Free Stock Analysis Report\n\nBNP Paribas SA (BNPQY) : Free Stock Analysis Report\n\nKBC Group SA (KBCSY) : Free Stock Analysis Report\n\nTo read this article on Zacks.com click here.\n\nZacks Investment Research", "link": "https://finance.yahoo.com/news/zacks-analyst-blog-highlights-bnp-124000124.html", "symbols": ["F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "KBC.BR", "KBCSF.US", "KBCSY.US", "KDB.F"], "tags": [], "sentiment": {"polarity": 1, "neg": 0.022, "neu": 0.836, "pos": 0.143}}, {"date": "2023-06-05T11:00:12+00:00", "title": "3 Stocks Under $20 to Buy (and Never Sell)", "content": "Retail investors typically only have a small amount of capital to start investing with. Accordingly, seeing all these popular large-cap stocks trading well over $100 per share can seem daunting. Nevertheless, there are plenty of stocks under $20 to consider investing in, that may provide similar upside to the more expensive names.\n\nMany companies that trade at or below the $20 per share mark still trade in large volume, have decent dividend yields, and even better long-term potential. Below are a few stocks that reach those criteria. These are companies I think investors should consider holding in their portfolio for the long-term.\n\nMPW Medical Properties Trust $8.25 F Ford $12.39 AAL American Airlines $14.87\n\nInvestorPlace - Stock Market News, Stock Advice & Trading Tips\n\nMedical Properties Trust (MPW) a wooden house shape holds 3 bags of cash representing reits to buy\n\nSource: Shutterstock\n\nMedical Properties Trust (NYSE:MPW) is a real estate investment trust (REIT) that was founded in 2003 in Birmingham, Alabama. The company develops and acquires real estate assets, with a focus on medical facilities. The REIT holds over 400 properties globally in its portfolio, with the entire REIT currently valued around $5 billion. The company’s portfolio is comprised of acute care hospitals, behavioral health clinics, and rehabilitation centers.\n\nIn April, Medical Properties Trust reported first quarter earnings, which showed a disappointing year-over-year revenue decline of 15%. Additionally, the company acquired no new property for the first quarter. However, the REIT’s management team did predict acquisitions in Europe for the second quarter.\n\nOver the past year, rising interest rates have hit the real estate market hard. And Medical Properties Trust is no different. As a result, they have seen recent revenue and share price decline. But, a large footprint of medical facilities and projected acquisitions, and a potential rebound in the real estate market, make it a stock to keep an eye on. Alongside first-quarter earnings, the REIT announced a quarterly dividend of $0.29 per share.\n\nFord (F) Ford Go Electric Automobile Exhibition At Genoa, Italy. F stock\n\nSource: TY Lim / Shutterstock.com\n\nFord (NYSE:F) is perhaps one of the best-known auto manufacturers worldwide. The company produces a wide range of vehicles, but is most known for its line of pickup trucks and, more notably, its new electric truck, the Ford F-150 Lightning. They also own the brand Lincoln, their luxury line of vehicles, and offer auto financing and parts servicing.\n\nThe company reported its first quarter earnings in early-May. Net income came in at $1.6 billion, supported by impressive revenue growth of 20% on a year-over-year basis.\n\nFord has been heavily involved in the EV market as of late, releasing key models such as the Ford Lightning F-150, Mustang Mach-E, electric transit vans, and the electric Explorer crossover, which was announced in March. Additionally, Ford’s stock price saw a 10% jump last week following the news of their partnership with Tesla (NASDAQ:TSLA). This partnership will allow Ford customers to have access to Tesla’s supercharger infrastructure starting in spring 2024.\n\nWith a decent grasp on the EV market, relative stability, and a quarterly dividend of $0.15 per share, Ford is a stock to hold onto.\n\nAmerican Airlines (AAL) American Airlines plane on ramp in Chicago Airport. American Airlines is amongst the airlines cancelling flights\n\nSource: GagliardiPhotography / Shutterstock.com\n\nAmerican Airlines (NASDAQ:AAL), Headquartered in Fort Worth, Texas, is an international air carrier offering cargo and passenger transportation services. In 2015 the stock was added to the S&P 500 Index.\n\nIn April, the company released its first quarter earnings, posting a total revenue increase of 37% and earnings per share growth of 2 cents on a year-over-year basis. The airline industry has seen continued deemed for travel following the years of the pandemic. Thus, it shouldn’t be a surprise that American Airlines has seen increased strength in its long-haul flight segment. The company saw nearly half a million record flights in the first quarter. This led to a strong forecast of earnings per share in Q2 to come in between $1.20 and $1.40 per share.\n\nThe airline industry is performing very well due to the strong travel demand, with growth in international and domestic air travel expected to continue. American Airlines is a key company in the airline industry, and is my top pick for investors looking for cheap stocks in the airline space.\n\nOn the date of publication, Noah Bolton held a long position in F stock. The opinions expressed in this article are those of the writer, subject to the InvestorPlace.com Publishing Guidelines.\n\nNoah has about a year of freelance writing experience. He’s worked with Investopedia dealing with\r\n topics such as the stock market and financial news.\n\nMore From InvestorPlace\n\nBuy This $5 Stock BEFORE This Apple Project Goes Live Wall Street Titan: Here’s My #1 Stock for 2023 The $1 Investment You MUST Take Advantage of Right Now It doesn’t matter if you have $500 or $5 million. Do this now.\n\nThe post 3 Stocks Under $20 to Buy (and Never Sell) appeared first on InvestorPlace.", "link": "https://finance.yahoo.com/news/3-stocks-under-20-buy-110012484.html", "symbols": ["A1G.F", "AAL.US", "AALL34.SA", "F.US", "M3P.F", "MPW.US", "TSLA.US"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.012, "neu": 0.87, "pos": 0.118}}, {"date": "2023-06-04T11:11:34+00:00", "title": "10 Hot Penny Stocks To Buy", "content": "In this article we take a look at some of the hot penny stocks that are gaining value. To see more such stocks click 5 Hot Penny Stocks To Buy.\n\nInvesting in small-cap and micro-cap companies comes with a lot of volatility, surprises and risks. When broader markets are in turmoil, like they are ever since the inflation crisis started to hammer the global markets and the Federal Reserve started to raise rates, investing in small companies and penny stocks becomes even more risky as investors flock to stable, large-cap plays. But when markets begin to rebound small companies tend to perform better. For example, after the latest jobs report showed that the US labor market remains hot, the Russell 2000 index of small-cap stocks jumped 3.2%, surpassing the S&P 500 gains of 1.5%. This is because when indicators point to robustness of the US economy, investors flock to small-cap stocks which are often focused on the domestic US market.\n\nSmall-cap stocks have been showing an upbeat trend since earlier this year when markets rebounded on hopes that the Federal Reserve will start hitting brakes on its interest rate hikes. According to a report from the WSJ, data from Refinitiv Lipper showed that investors poured a whopping $4.2 billion in U.S. mutual and exchange-traded funds that buy small-cap stocks in 2023 through February 22. Data also showed that investors pulled $17.4 billion from large-cap funds in the same period. Small-cap stocks were the second most-attractive investment option of investors this year after international stocks, which attracted $16 billion in the same period.\n\nCompare this outperformance to the bloodbath seen in small-cap stocks last year and you start to understand the investor appetite for risky stocks amid resilient economic growth. Small-cap stocks significantly underperformed the S&P 500 in 2022 as funds investing in small-cap plays saw outflows of a whopping $28.5 billion, according the WSJ. The Journal quoted Rayna Lesser Hannaway, a portfolio manager at Polen Capital, who said that the market has been anticipating a recession for quite some time now and she “hopes” that companies’ management teams are taking smart decisions today to weather economic storms of tomorrow.\n\nHannaway co-manages the The Polen US Small Company Growth fund, which is up about 10% year to date as of June 3.\n\nAnother reason why investors are preferring small-cap stocks is their attractive valuations. The WSJ report quoted Jim Masturzo, chief investment officer of multiasset strategies at Research Affiliates, who said that his firm is expecting the Russell 2000 index to return about 5% a year over the next 10 years. This would be more than double the 1.9% return he expects to see from the S&P 500.\n\nWhile small-cap stocks are gaining attention this year, when it comes to penny stocks, the rules of the game change since penny stock investing comes with a lot of risks and a peculiar stigma attached to invest.\n\nDoes Investing in Penny Stocks Make Sense?\n\nAn interesting study titled The Cross-section of Expected Returns on Penny Stocks - Are Low-hanging Fruits Not-so Sweet? which analyzes the Indian penny stock space mentions the allure of penny stocks and the risks attached in the following words:\n\n“Another important attribute of penny stocks is that they carry huge potential for profits for those investors who are high risk-seekers as these stocks carry high risk mainly because of information asymmetry, low liquidity, and uncertainty related to the fundamentals of such companies. The asymmetric information leads to under- valuation of penny stocks. This essentially enables aggressive investors to find the right kind of penny stocks and presents huge profit potential. While the penny stocks are highly risky and carry high potential for returns, they are cheaply available hence can be invested in easily by even small retail investors who might not have deep pockets. It is, therefore, penny stocks seem a tempting investment choice for small retail investors. However, due to high risk attribute, if wrongly traded, penny stocks might prove detrimental for small retail investors.”\n\nWhile penny stocks seem risky, it’s important to note that many successful companies today were once trading as penny stocks. The market is always offering opportunities and there are always companies that trade for price tags under $5 or $10. For example, some stable companies that are trading under $10 today include BlackBerry Ltd (NYSE:BB), Plug Power Inc (NASDAQ:PLUG) and Sirius XM Holdings Inc (NASDAQ:SIRI).\n\nFord Motor Co (NYSE:F), one of the biggest car companies in the world, was trading at around $2 back in 1983. Back in 2008, Apple’s stock price was around $3.2. Today the company’s market cap stands at $2.8 trillion.\n\nWisdom from Billionaire Howard Marks\n\nIn 2011, billionaire Howard Marks, in a memo to his clients, talked about his meeting with Charlie Munger where they discussed Marks’ book The Most Important Thing. Marks in the memo talks about some key themes which show the importance of setting your expectations right before investing. Marks recalled how Charlie Munger said during the meeting that anyone who thinks the investing world is easy was wrong.\n\n“It’s not supposed to be easy. Anyone who finds it easy is stupid.”\n\nMarks then goes on to elaborate what it takes to win in the stock investing world and how to make contrarian bets that actually pay off. For that he uses two levels of thinking: first-level thinking and second-level thinking. Here’s how Marks explains these systems:\n\nFor example, when I lived in Los Angeles, a stockbroker often spoke on the radio station I listened to while driving to work. His advice was simple: “If there’s a company whose product you like, buy the stock.” That’s first-level thinking. How seductively easy. But also how error-prone, in that it ignores the possibility that a company with a good product can have a bad business; the good product can become obsolete; or the stock can be priced too high to be a good investment. On the other hand, second-level thinkers double-think (and triple-think) every angle of every situation. A good example can be seen in the hypothetical newspaper contest John Maynard Keynes wrote about in 1936. Readers would be shown 100 photos and asked to choose the six prettiest girls, with prizes going to the readers who chose the girls readers voted for most often. Naive entrants would try to win by picking the prettiest girls. But note that the contest would reward the readers who chose not the prettiest girls, but the most popular. Thus the road to winning would lie not in figuring out which were the prettiest, but in predicting which girls the average entrant would consider prettiest. Clearly, to do so, the winner would have to be a second-level thinker. (The first-level thinker wouldn’t even recognize the difference.)\n\nMethodology\n\nFor this article we scanned Insider Monkey’s database of 943 hedge funds and picked 10 penny stocks (stocks priced under $5) that have posted strong gains in the past thirty days through June 1 and have the highest number of hedge fund investors.\n\n10. Alto Ingredients (NASDAQ:ALTO)\n\nNumber of Hedge Fund Investors: 13\n\nIllinois-based Alto Ingredients makes specialty alcohol and essential ingredients. The Alto Ingredients stock (NASDAQ:ALTO) has gained about 62% over the past one month through June 1. The company recently posted its Q1 results. While GAAP EPS in the period totaled -$0.18 and missed estimates by $0.05, revenue jumped 1.9% on a YoY basis to reach $313.89 million, beating estimates by $16.28 million.\n\n9. Rigetti Computing Inc (NASDAQ:RGTI)\n\nNumber of Hedge Fund Investors: 13\n\nRigetti Computing Inc (NASDAQ:RGTI) makes quantum ICs used in quantum computers. Over the past one month, Rigetti Computing stock (NASDAQ:RGTI) has gained a whopping 154% in value. The company recently posted its first-quarter results. GAAP EPS in the quarter came in at -$0.19, beating estimates by $0.02. Revenue in the quarter jumped about 4.8% year over year to $2.2 million, surpassing estimates by $1.88 million.\n\nRGTI, like BlackBerry Ltd (NYSE:BB), Plug Power Inc (NASDAQ:PLUG) and Sirius XM Holdings Inc (NASDAQ:SIRI), is a popular under-$10 stock that hedge funds like.\n\n8. Leap Therapeutics Inc (NASDAQ:LPTX)\n\nNumber of Hedge Fund Investors: 14\n\nLeap Therapeutics Inc (NASDAQ:LPTX) is focused on the development of cancer treatments. The Leap Therapeutics stock (NASDAQ:LPTX) has gained about 71% over the past one month. Julian Baker and Felix Baker’s Baker Bros. Advisors was one of the 14 hedge funds that reported owning stakes in the company as of the end of the March quarter. The fund owns a $2.5 million stake in the company. GAAP EPS of the company in the first quarter came in at -$0.32, missing estimates by $0.23.\n\n7. Autolus (NASDAQ:AUTL)\n\nNumber of Hedge Fund Investors: 15\n\nClinical stage biopharmaceutical company Autolus (NASDAQ:AUTL) is working on treatments for several diseases, including Acute Lymphoblastic Leukemia. Autolus stock (NASDAQ:AUTL) is up 52% over the past one month. In the first quarter, the company’s GAAP EPS came in at -$0.23, beating estimates by $0.04. Cash and cash equivalents and restricted cash as of the end of March totaled $343.4 million, compared to cash of $382.8 million at December 31, 2022. Of the 943 hedge funds tracked by Insider Monkey, 15 funds had stakes in the company as of the end of the first quarter.\n\n6. Compass Inc. (NYSE:COMP)\n\nNumber of Hedge Fund Investors: 16\n\nInternet-based real estate brokerage company Compass Inc. ranks sixth in our list of the hot penny stocks to buy. Compass stock (NYSE:COMP) has gained about 43% over the past one month. Earlier in May, the company posted its Q1 results. GAAP EPS in the quarter came in at -$0.33, beating estimates by $0.02. Revenue in the period fell about 31.5% year over year to $957.2 million, still beating estimates by $49.79 million. For the second quarter, the company expects its revenue to come in the range of $1.45 billion to $1.6 billion, while the consensus estimate for this figure was $1.50 billion. Richard Mashaal’s Rima Senvest Management was the most significant shareholder of the company as of the end of the first quarter, with a $43 million stake. In addition to BlackBerry Ltd (NYSE:BB), Plug Power Inc (NASDAQ:PLUG) and Sirius XM Holdings Inc (NASDAQ:SIRI), COMP is a notable stock trading under $10 that is popular among hedge funds.\n\nClick to continue reading and see 5 Hot Penny Stocks To Buy. Suggested articles:\n\n10 Best Diversified Bank Stocks to Buy Now 10 Best Fast Food Stocks to Invest In 15 Most Tax-Friendly Countries in Europe\n\nDisclosure: None. 10 Hot Penny Stocks To Buy is originally published on Insider Monkey.", "link": "https://finance.yahoo.com/news/10-hot-penny-stocks-buy-111134173.html", "symbols": ["5MC1.F", "6A3A.F", "ALTO.US", "AUTL.US", "BB.TO", "BB.US", "COMP.US", "F.US", "IXIC.INDX", "LPTX.US", "PLUG.US", "PLUN.F", "PLUN.XETRA", "RDO.F", "RGTI.US", "RI1.F"], "tags": [], "sentiment": {"polarity": 0.998, "neg": 0.038, "neu": 0.865, "pos": 0.097}}]