[{"date": "2023-07-17T23:28:00+00:00", "title": "Why Telecom Stocks Missed Monday's Market Rally", "content": "Stock markets continued to gain ground on Monday, with the Nasdaq Composite (NASDAQINDEX: ^IXIC) again leading the way higher. Legacy issues from old-style landlines could cause massive problems for companies like Verizon Communications (NYSE: VZ) and AT&T (NYSE: T).", "link": "https://finance.yahoo.com/m/fa103280-fccf-3828-885f-1ae484dab500/why-telecom-stocks-missed.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.494, "neg": 0.061, "neu": 0.807, "pos": 0.132}}, {"date": "2023-07-17T21:32:42+00:00", "title": "Why Verizon's Stock Plunged 7.5% Today", "content": "Shares of U.S. telecom giant Verizon (NYSE: VZ) fell 7.5% in trading on Monday after a series of articles in The Wall Street Journal highlighted the lead in cable sheathing that telecom companies used decades ago. The report highlighted lead in cables used primarily by AT&T (NYSE: T) but also brought Verizon into the equation. AT&T has more legacy assets that reach people's homes, while Verizon's business has been more focused on wireless assets for more than two decades.", "link": "https://finance.yahoo.com/m/8e1a2eca-0084-3a02-b8a6-78c1f4a686f1/why-verizon%27s-stock-plunged.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.843, "neg": 0, "neu": 0.868, "pos": 0.132}}, {"date": "2023-07-17T20:27:56+00:00", "title": "S&amp;P 500: First Solar Soars As Solar Stocks Shine; Telecom Giants, Tesla Rival Tumble", "content": "First Solar and other solar stocks were big S&P 500 winners Monday. Verizon, AT&T and other telecoms sold off while Tesla rival Ford fell on price cuts.", "link": "https://finance.yahoo.com/m/39b68457-31de-346f-91e8-fcea9a1b87ae/s%26p-500%3A-first-solar-soars-as.html", "symbols": ["BAC.F", "BAC.XETRA", "E0P.F", "ENPH.US", "F.MX", "F.US", "F3A.F", "F3A.XETRA", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "FSLR.MX", "FSLR.US", "GSPC.INDX", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TL0.F", "TL0.XETRA"], "tags": [], "sentiment": {"polarity": 0.226, "neg": 0.073, "neu": 0.825, "pos": 0.102}}, {"date": "2023-07-17T20:07:35+00:00", "title": "AT&amp;T Stock Books Lowest Close Since 1993 as Telecom Shares Slide", "content": "Shares of AT&T dropped nearly 7% on Monday, continuing a recent decline following a [Wall Street Journal investigation](https://www.wsj.com/articles/environmental-groups-ask-epa-to-shield-public-from-abandoned-lead-cables-f65f2fc7) into toxic lead cables left behind by telecom companies.", "link": "https://finance.yahoo.com/m/6a7489a9-b432-327e-8213-b87b320c015e/at%26t-stock-books-lowest-close.html", "symbols": ["BAC.F", "BAC.XETRA", "LUMN.US", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TBB.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.916, "pos": 0.084}}, {"date": "2023-07-17T19:31:56+00:00", "title": "AT&amp;T, Verizon stocks plunge as concerns mount over lead cables", "content": "AT&T (T) and Verizon (VZ) shares have tanked since a Wall Street Journal report revealed the telecom giants historical use of lead-covered cables is contaminating many parts of the country. The threat of potential legal action, and how the lead issues will be resolved has prompted multiple Wall Street firms to downgrade the stocks.\n\n\"The industry’s historical use of lead sheathed cabling is likely to remain an overhang for the stocks and valuation for at least a few months and potentially longer until the market can better measure the financial risk (if anything material) for each firm,\" Citi analyst Michael Rollins wrote in a note on Monday.\n\nCiti's warning comes after JPMorgan downgraded AT&T from Overweight to Neutral and cut its price target to $17 from $22 on Friday, citing beliefs that AT&T has the most exposure to the lead issue. Meanwhile, Goldman Sachs highlighted the issue as a \"new risk factor for wireline telecom.\"\n\nAT&T shares have now fallen more than 10% over the last five days and are now nearing a 30-year low. Verizon stock has fallen more than 10% over the past five days as well.\n\n\"Prior to this reporting, we do not believe the market was aware of this issue and our checks with regulatory experts indicate that this issue was not on regulators’ radars either,\" Goldman Sachs analyst Brett Feldman wrote on Monday. \"We view this as a potential new risk factor for wireline telecom operators with legacy network assets and are therefore not surprised that the market reaction has been material.\"\n\nFeldman admits in his note \"investors have many questions, and we have few answers,\" a sentiment currently being expressed other Wall Street analysts as well.\n\n\"We see the potential liability as an unquantifiable, long-term overhang for the stock, which adds to the risk premium,\" JPMorgan managing director Philip Cusick wrote in a note on Friday.\n\nShares of both Verizon and AT&T had already been under pressure over the past year amid slowing growth in the wireless businessand rumors of Amazon joining the wireless market.\n\nVerizon is set to report earnings and have executives speak on an earnings call on July 25 while AT&T is scheduled to provide results and a business update on July 26.\n\nJosh Schafer is a reporter for Yahoo Finance.\n\nClick here for the latest economic news and economic indicators to help you in your investing decisions\n\nRead the latest financial and business news from Yahoo Finance", "link": "https://finance.yahoo.com/news/att-verizon-stocks-plunge-as-concerns-mount-over-lead-cables-193156681.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TBB.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": -0.521, "neg": 0.073, "neu": 0.863, "pos": 0.065}}, {"date": "2023-07-17T18:15:00+00:00", "title": "Verizon continues to upgrade Daytona's best network", "content": "DAYTONA, Fla., July  17, 2023  (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Daytona, FL. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Daytona include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\nEngineers have deployed 5G Ultra Wideband service using C-band spectrum designed for fast speeds, high capacity and wide coverage. With the recent deployments and upgrades, more people in Daytona now have access to 5G service from Verizon. Most notably, Verizon’s 5G Ultra Wideband service has recently expanded to areas near Daytona International Speedway, Tanger Outlets, the SeaBreeze Historic District, the mainland area, the Ortona Park area, South Peninsula Historic District and the Amazon Delivery Station near I-95.These deployments used Verizon’s  recently acquired C-band spectrum, designed to provide wide coverage for 5G service. Throughout Daytona, Verizon engineers are using 100 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Daytona will be able to take advantage of even more spectrum as it becomes available for 5G Ultra Wideband. That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust servicesLastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Daytona. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links. Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network. Verizon has increased the capacity on the fiber connections in many cell sites in the Daytona area so they can carry 10 times the amount of data.\n\n“Our network engineers work tirelessly to ensure we can provide the most reliable connections across Daytona. We will continue to unlock the power of 5G for our customers with better connectivity for their phones, homes and businesses, as part of our ongoing commitment to this community,” said Eric Lia, Vice President of Network Engineering and Operations for Verizon.\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place,smartphones with infinite opportunities to use data in a highly mobile environment,home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, andcomplex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nServices from the network customers rely on\n\nFor customers in Daytona, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants super fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with AutoPay and a select 5G mobile plan – all without extra fees, equipment charges, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals for the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Daytona area will also be able to experience the benefits of these network enhancements. To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nDaytona area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service. To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Save $25/mo. when combined with an existing 5G Do More, 5G Play More, 5G Get More or One Unlimited for iPhone plan. With Auto Pay and paper-free billing req’d. Add’l $10/mo. w/o Auto Pay. Subject to credit approval.\n\nMEDIA CONTACT:\r\nKaren Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://www.globenewswire.com/news-release/2023/07/17/2705940/0/en/Verizon-continues-to-upgrade-Daytona-s-best-network.html", "symbols": ["VZ.US"], "tags": ["NYSE:VZ", "PRODUCT / SERVICES ANNOUNCEMENT", "VERIZON SOURCING LLC"], "sentiment": {"polarity": 0.995, "neg": 0.01, "neu": 0.91, "pos": 0.081}}, {"date": "2023-07-17T18:15:00+00:00", "title": "Verizon continues to upgrade Daytona's best network", "content": "Verizon Sourcing LLC\n\nWider deployment of 5G service, increased capacity on fiber and more bandwidth are among recent upgrades on Verizon’s network\n\nDAYTONA, Fla., July 17, 2023 (GLOBE NEWSWIRE) -- Verizon has recently made major upgrades to the network serving customers in Daytona, FL. These upgrades are part of a multi-year redesign of its network architecture to stay ahead of exponential data usage increases, upgrade the technology in the network, and to pave the way for personalized customer experiences. Network upgrades in Daytona include deploying new cell sites to extend coverage and capacity in local communities. They also include adding more capacity on fiber optic cables to move more data through the network and adding bandwidth to the cellular network to accommodate new services like wireless internet service for homes and businesses. Specifics on the upgrades include:\n\nEngineers have deployed 5G Ultra Wideband service using C-band spectrum designed for fast speeds, high capacity and wide coverage. With the recent deployments and upgrades, more people in Daytona now have access to 5G service from Verizon. Most notably, Verizon’s 5G Ultra Wideband service has recently expanded to areas near Daytona International Speedway, Tanger Outlets, the SeaBreeze Historic District, the mainland area, the Ortona Park area, South Peninsula Historic District and the Amazon Delivery Station near I-95. These deployments used Verizon’s  recently acquired C-band spectrum, designed to provide wide coverage for 5G service. Throughout Daytona, Verizon engineers are using 100 MHz of C-band spectrum to deliver 5G service to customers. By the end of the year, customers in Daytona will be able to take advantage of even more spectrum as it becomes available for 5G Ultra Wideband. That additional bandwidth will turbo charge the service, offering significantly higher speeds, much greater capacity to accommodate more customers and more robust services Lastly, the addition of 5G service and the many additional wireless solutions allow far more data to travel on the wireless network in Daytona. That exponential increase in data carried into and out of the cell sites serving the community requires upgraded fiber optic cable links. Fiber optic cables are used to move data between cell sites and connect those sites to the rest of the network. Verizon has increased the capacity on the fiber connections in many cell sites in the Daytona area so they can carry 10 times the amount of data.\n\n“Our network engineers work tirelessly to ensure we can provide the most reliable connections across Daytona. We will continue to unlock the power of 5G for our customers with better connectivity for their phones, homes and businesses, as part of our ongoing commitment to this community,” said Eric Lia, Vice President of Network Engineering and Operations for Verizon.\n\nWith these and other technology advancements on Verizon’s network, customers are able to use more data in more ways. This multi-service network powers\n\nInternet-of-Things (IoT) devices that do very little networking and stay in place, smartphones with infinite opportunities to use data in a highly mobile environment, home and business internet which provides connectivity via the wireless network for homes, offices and retail environments, and complex solutions like Augmented Reality or enterprise real-time video and data analysis that require massive computing capabilities.\n\nAs 5G technology advances and is even more widely adopted by consumers the variety of solutions that will use Verizon’s network will continue to evolve as well.\n\nServices from the network customers rely on\n\nFor customers in Daytona, the additional coverage and capacity means more customers now have access not only to reliable, fast mobile service, but also Verizon Home Internet service, a different kind of home internet with no data caps. It’s ideal for anyone who wants super fast connectivity to stream, game or even work remotely. Verizon Home Internet is reliable and fast enough to power home connected devices: smart TVs, tablets, phones, gaming consoles and more. Plans start at just $25 per month with AutoPay and a select 5G mobile plan – all without extra fees, equipment charges, annual contracts or data caps.** Go to verizon.com/home for availability. Visit verizon.com/deals for the latest 5G phones and accessories.\n\nAdditionally, through Verizon Frontline, the advanced network and technology developed over three decades of partnership with first responders to meet their unique and evolving needs, public safety agencies in the Daytona area will also be able to experience the benefits of these network enhancements. To learn more about Verizon Frontline, visit verizon.com/frontline.\n\nDaytona area businesses have access to 5G Business Internet from Verizon. 5G Business Internet is ultra-fast wireless business internet powered by 5G Ultra Wideband. This wireless alternative to cable internet is for businesses of all sizes and includes self-setup or professional installation options, multiple pricing and service options, unlimited data, and a 10-year price guarantee (price guarantee excludes taxes and fees) for 5G Business Internet service. To learn more about Verizon 5G Business Internet, visit verizon.com/5gbusinessinternet and plug in an address to see what service is available.\n\n**Verizon Home Internet includes 5G Home Internet and LTE Home Internet services, which are available in select areas. Save $25/mo. when combined with an existing 5G Do More, 5G Play More, 5G Get More or One Unlimited for iPhone plan. With Auto Pay and paper-free billing req’d. Add’l $10/mo. w/o Auto Pay. Subject to credit approval.\n\nMEDIA CONTACT:\r\nKaren Schulz\r\n864.561.1527\r\nKaren.schulz@verizonwireless.com", "link": "https://finance.yahoo.com/news/verizon-continues-upgrade-daytonas-best-181500983.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.995, "neg": 0.009, "neu": 0.911, "pos": 0.08}}, {"date": "2023-07-17T17:22:51+00:00", "title": "AT&amp;T shares hit three-decade low as lead cables risks weigh", "content": "(Uploads appropriate chart and to tweak headline, no changes to text)\n\nBy Chibuike Oguh\n\nNEW YORK (Reuters) -Shares of AT&T Inc fell more than 5% to hit their lowest level in thirty years on Monday, after analysts downgraded the stock following a news report that the telecommunications giant left toxic lead cables buried across the United States.\n\nA Wall Street Journal report on July 9 named AT&T and Verizon among several telecom giants that abandoned a sprawling network of underground toxic lead cables, with a huge number of them possibly contaminating neighboring soil and drinking water sources.\n\nAnalysts at Citigroup and JPMorgan both lowered their recommendations on AT&T shares in recent days. The stock has lost a quarter of its value so far this year, having dropped 12% since the Wall Street Journal report. The shares hit a low of $13.68 in Monday's session, the lowest since March 1993.\n\nAT&T faces unquantifiable financial risks that would create a \"long term overhang\" for the stock since the company probably has a significant exposure to the toxic lead cables with its network reaching about 40% of homes in the U.S., Citi analysts, led by Michael Rollins, said in an investor note.\n\nRollins cut his rating on AT&T's stock to \"neutral\" from \"buy\" and slashed his price target to $16 from $22.\n\nJPMorgan analysts led by Philip Cusick on Friday downgraded their rating on AT&T to \"neutral\" from \"overweight,\" citing worries over the repeated downward revisions for the company's key wireless and fiber growth businesses, the high interest rate environment, and new uncertainty over lead-sheathed cables.\n\n\"We have discussed the copper lead sheathing situation with many industry contacts and have been unable to find a reasonable way to calculate any potential liability, but believe that AT&T will have the largest exposure given its massive LEC [local exchange carrier] business as well as owning the original AT&T long haul network,\" JPMorgan wrote.\n\nAT&T's forward price-to-earnings ratio of 5.95 is less than the industry median of 8.78, according to Eikon data.\n\nShares of Verizon were also down on Monday, falling 5.5% to $32.14, a nearly 13-year low. Verizon's stock has lost more than 10% since the Wall Street Journal report.\n\nMorningstar analyst Michael Hodel said Friday that while \"this situation warrants watching, we don’t expect the telecom industry will bear substantial legal liability.\"\n\n(Reporting by Chibuike Oguh in New York; Editing by Lance Tupper and Deepa Babington)", "link": "https://finance.yahoo.com/news/t-shares-hit-three-decade-172251402.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.459, "neg": 0.069, "neu": 0.856, "pos": 0.076}}, {"date": "2023-07-17T16:23:00+00:00", "title": "Why We're Moving on From This Portfolio Name", "content": "When we downgraded Action Alerts PLUS holding Verizon to a Three rating, we acknowledged the rationale as the shares were being challenged by the better-than-expected prospects for the economy as well as the boost in interest rates that sapped demand for its high dividend yield. Recognizing the prospects that the shares could be dead money, our preferred plan was to work our way out of the shares at higher prices to limit losses on the portfolio. While this doesn't pose an operating risk to Verizon, as we discussed on today's Rundown, it does represent an unknown that could likely be resolved in a damages suit.", "link": "https://finance.yahoo.com/m/0f764c4c-fa9e-3d5c-bd04-4eb7158814d5/why-we%27re-moving-on-from-this.html", "symbols": ["BAC.F", "BAC.XETRA", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.557, "neg": 0.121, "neu": 0.713, "pos": 0.166}}, {"date": "2023-07-17T16:22:06+00:00", "title": "Stock market today: Dow rises as banks, tech shine, but telecoms stifle gains", "content": "Investing.com -- The Dow closed higher Monday, led by tech and financials as investors looked ahead to more quarterly results from Wall Street banks and other major corporations later this week, though broader market gains were kept in check by a stumble in telecoms.\n\nThe Dow Jones Industrial Average rose 0.2%, or 76 points, the Nasdaq was up 0.9%, and the S&P 500 rose 0.3%.\n\nFinancials rally ahead of earnings from Bank of America, Morgan Stanley and Goldman Sachs\n\nFinancials rallied more than 1% as investors anticipate further signs of the strength in banks ahead of quarterly results from Bank of America (NYSE:BAC) and Morgan Stanley (NYSE:MS) due Tuesday and Goldman Sachs (NYSE:GS) due Wednesday.\n\nSentiment on major banks was boosted last week following better-than-expected quarterly results from JPMorgan Chase & Co (NYSE:JPM) and Wells Fargo (NYSE:WFC), though Citi was the odd one after its earnings fell short of analyst expectations.\n\nUBS, however, warned against extrapolating the better-than-expected results to other banks, and expects “tougher results from regional banks.”\n\nPNC Financial Services Group Inc (NYSE:PNC) and Western Alliance Bancorporation (NYSE:WAL), which are down sharply year-to-date, are slated to report earnings on Friday.\n\nApple, chips lead tech higher\n\nA rise in Apple Inc (NASDAQ:AAPL) and semiconductor stocks including NVIDIA Corporation (NASDAQ:NVDA) pushed the broader tech sector more than 1% higher as AI-driven optimism ahead of tech earnings persists.\n\n“We believe overall the tech sector will be up another 12%-15% in the second half of this year led by software and the chip sector with Big Tech remaining the \"torch bearer\" for this tech rally continuing to heat up,” Wedbush said in a note.\n\nMicrosoft Corporation (NASDAQ:MSFT), meanwhile, traded just above the flatline even as its pending $69 billion acquisition of Activision Blizzard Inc (NASDAQ:ATVI) inched closer after the Federal Trade Commission lost its appeal to pause the deal.\n\nTesla gets Cybertruck production underway; Ford falters on price cut\n\nTesla (NASDAQ:TSLA) was up more than 3% after starting production of its Cybertruck in Texas, with the EV maker expected to ship around 2,000 units this year, Deutsche Bank estimated.\n\nThe gains come just ahead of Tesla’s quarterly results due Wednesday, in which margins are likely to dominate attention following recent price cuts.\n\n“The big focus on this print will be Auto GM (ex credits) to gauge the impact of the price cuts and what this means for margins going forward,” Wedbush said in a note.\n\nFord Motor (NYSE:F), meanwhile, fell more than 5% after cutting prices of its F-150 Lightning by up to $10,000 amid increased competition from Rivian Automotive Inc (NASDAQ:RIVN) and Tesla’s Cybertruck.\n\nParamount stumbles as latest 'Mission: Impossible' blockbuster falls short at box office; AT&T Gets Downgrade Call\n\nParamount Global's (NASDAQ:PARA) \"Mission: Impossible” movie underperformed expectations at the box office, sending the entertainment company’s share more than 3% lower.\n\nThe latest installment in the Mission Impossible franchise racked in $56.2 million domestically over the weekend, below expectations of at least $60 million or more, which would have marked a new franchise record.\n\nTelecoms giant AT&T (NYSE:T) fell 6% after Citi downgraded the stock to Neutral from Buy on concerns that the firm and others face significant costs removing legacy copper cables - used for telephony and other related-purposes - that reportedly may pose a risk environment. AT&T, which some estimate may face costs of up to $59 million, was also downgraded to neutral from overweight by JPMorgan.\n\nAs the network of cables covered in toxic lead degrades, it \"is ending up in places where Americans live, work and play,\" the Wall Street Journal reported Sunday, citing tests of samples from nearly 130 underwater-cable sites, conducted by several independent laboratories. Verizon (NYSE:VZ), Frontier Communications (NASDAQ:FYBR) and Lumen Technologies (NYSE:LUMN), which were all also mentioned in the report, were down heavily.\n\nRelated Articles\n\nStock market today: Dow rises as banks, tech shine, but telecoms stifle gains\n\nUS FTC eyes options after Microsoft/Activision loss, source says\n\nUS probes United flight that lost evacuation slide before landing in Chicago", "link": "https://finance.yahoo.com/news/stock-market-today-dow-rises-162206513.html", "symbols": ["AAPL.US", "ATVI.US", "BAC.US", "DJI.INDX", "F.MX", "F.US", "FDMO34.SA", "FMC1.F", "FMC1.XETRA", "FYBR.US", "GS.US", "JPM.US", "LUMN.US", "MS.US", "MSFT.US", "NVDA.US", "PARA.US", "PNC.US", "RIVN.US"], "tags": [], "sentiment": {"polarity": 0.558, "neg": 0.037, "neu": 0.924, "pos": 0.039}}, {"date": "2023-07-17T15:45:01+00:00", "title": "AT&amp;T Stock on Track for Lowest Close Since 1993 as Telecom Shares Slide", "content": "Shares of AT&T dropped about 5% on Monday, continuing a recent decline following a [Wall Street Journal investigation](https://www.wsj.com/articles/environmental-groups-ask-epa-to-shield-public-from-abandoned-lead-cables-f65f2fc7) into toxic lead cables left behind by telecom companies.", "link": "https://finance.yahoo.com/m/6a7489a9-b432-327e-8213-b87b320c015e/at%26t-stock-on-track-for.html", "symbols": ["BAC.F", "BAC.XETRA", "LUMN.US", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TBB.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0.296, "neg": 0, "neu": 0.916, "pos": 0.084}}, {"date": "2023-07-17T13:29:22+00:00", "title": "Lead-Sheathing Issue Could Put Telecom Stocks In The Doghouse For Decades", "content": "Possible exposure to lead-sheathed cables installed in phone networks will continue to pressure telecom stocks such as T stock and VZ stock.", "link": "https://finance.yahoo.com/m/c50e13b4-a8ab-3f46-9fae-e31b661c9ba5/lead-sheathing-issue-could.html", "symbols": ["BAC.F", "BAC.XETRA", "LUMN.US", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": -0.296, "neg": 0.099, "neu": 0.901, "pos": 0}}, {"date": "2023-07-17T10:00:00+00:00", "title": "Sell AT&amp;T and Verizon: Follow Warren Buffett's Approach With T-Mobile Instead", "content": "Buffett outlined how income-focused investors should approach Berkshire. The same tactic should be used with T-Mobile.", "link": "https://finance.yahoo.com/m/f67c8ab3-fec2-3d89-af54-21f56142df1f/sell-at%26t-and-verizon%3A-follow.html", "symbols": ["BAC.F", "BAC.XETRA", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "TM5.F", "TMUS.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}, {"date": "2023-07-17T09:50:00+00:00", "title": "Every Ultra-High-Yield Dividend Stock Warren Buffett Owns, Ranked From Best to Worst", "content": "Buffett might not need additional income, but he's getting plenty of it from these dividend stocks.", "link": "https://finance.yahoo.com/m/0d668b5c-1a27-39b0-999c-6ee3f97c2802/every-ultra-high-yield.html", "symbols": ["2KD.F", "ARCC.US", "BAC.F", "BAC.XETRA", "KMI.US", "SOBA.F", "SOBA.XETRA", "T.MX", "T.US", "VERZ34.SA", "VZ.MX", "VZ.US"], "tags": [], "sentiment": {"polarity": 0, "neg": 0, "neu": 1, "pos": 0}}]